{
  "title": "Creativity House - Situational Questions in Professional Project Management",
  "time": 230,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "A project team received training on the technology involved with a project deliverable. In nine months of working on the project, several team members have been replaced. Productivity has slowed because new team members are not familiar with the technology and the project schedule is at risk of delay. What should the project manager do?",
      "choices": [
        {
          "text": "Meet with the entire team and ask existing members to train the new team members.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Negotiate an increase in budget with the project sponsor for additional training for the new team members.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Issue a change request for new team members already trained in the relevant technology.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Facilitate a workshop with a subject matter expert to familiarize team members with the technology.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The day before construction is scheduled to begin, the project manager learns that the structure blueprint was not accepted by the customer. What should the project manager do first to ensure that the project timeline is met?",
      "choices": [
        {
          "text": "Meet with the customer as soon as possible to discuss changes to the blueprint.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Begin construction as scheduled while simultaneously reviewing the blueprint with the customer.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Discuss the process of deliverable component acceptance with the customer.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the stakeholder engagement plan and stakeholder expectations.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that the project team will miss a milestone because team member A has not completed the task requirements needed by team member B. When meeting with team member A, what should the project manager do?",
      "choices": [
        {
          "text": "Direct team member A to turn over the responsibilities for completing the task requirements to team member B.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Identify any obstacles to meeting the task requirements and determine if team member A needs help completing them.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask team member A to work directly with team member B to complete the requirements in order to meet the milestone.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask team member A to recommend a replacement who can complete the task requirements.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A technology project has members of a project team from multiple countries. The stakeholders have stated that this arrangement will keep the project within budget. However, the project manager believes that the stakeholders have not accounted for issues that might arise that could affect the success of the project.nnWhat should the project manager do to record this concern?",
      "choices": [
        {
          "text": "Document the risks in the risk register.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Revise the stakeholder engagement plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Capture the information in the issues log.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the resource management plan.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two stakeholders inform the project manager that the status of a critical project phase was not communicated to them. Although the project phase is in these stakeholders' area of interest, the stakeholders have only recently been identified.What should the project manager do first?",
      "choices": [
        {
          "text": "Review the communications management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Perform a stakeholder analysis and update the stakeholder register.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Identify new ways to send project status reports to all stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule a status meeting and invite the two new stakeholders.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project in the execution phase is on track and within budget. A key stakeholder requests a change in communication frequency. They want to discontinue receiving weekly status reports and instead be notified only if an issue arises that requires their attention.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Review the stakeholder engagement plan to ascertain the stakeholder's involvement.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the other stakeholders if they would also like less frequent notifications.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Revise the communications management plan to reflect the stakeholder's request.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Meet with the stakeholder to discuss the amount and type of information that should be communicated.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project with an aggressive timeline that requires fast time to market because a competitor is working on a similar product. The project team cannot meet the go live date, and there are no other internal resources that can assist with the project.nnHow should the project manager mitigate this risk?",
      "choices": [
        {
          "text": "Look for external resources who can assist in meeting the required go live date.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask the team to remove the obstacles preventing them from meeting the go live date.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the project sponsor to set a new go live date based on available resources.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the team to focus only on the critical features and meet the go live date.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is formally closing a project that has been completed. Why should the project manager document final project activities?",
      "choices": [
        {
          "text": "To record case studies and customer references",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To log final project performance metrics and quality analysis",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To provide lessons learned and archive historical information",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "To allow the customer to submit invoices and get a receipt of final payment",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two key stakeholders, who are also members of the change control board (CCB), complain they were not aware of an extension to the project schedule. The project manager knows that the extension was necessary to add value to the project.nnWhat should the project manager have done to avoid this issue?",
      "choices": [
        {
          "text": "Submitted a change request to the entire CCB without discussing it first with the stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Run a what-if analysis to determine the impact of the change.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Asked the project sponsor if there was any float in the project schedule.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Consulted the stakeholders before following the established change process.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an iteration review, the definition of done (DoD) was not met.nnWhat is an appropriate way for the project manager to proceed?",
      "choices": [
        {
          "text": "Ask the project sponsor to update the project charter and reassign the authorities and responsibilities.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Request that the project team develop new features to replace the features that were rejected.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Determine the root cause with the team in the retrospective meeting and suggest plan to address the deficiencies.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Send a new change request to the change control board (CCB) for approval, adding budget to the baseline.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A sponsor proposes a project scope change that is popular with the project team and key stakeholders. What should the project manager do?",
      "choices": [
        {
          "text": "Follow the change management process.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Notify stakeholders of the change.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the project requirements.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Modify the work breakdown structure (WBS).",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An external provider is late with the delivery of a finished item. As a measure of goodwill, and to maintain the project's schedule, the provider offers to bear the cost of renting a temporary system.nnSince no schedule slippage will occur, what should the project manager do next?",
      "choices": [
        {
          "text": "Account for this additional resource in the work breakdown structure (WBS).",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Take no further actions because there is no schedule slippage.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Conduct the Perform Integrated Change Control process.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Update the project documents.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager resumes a project in its execution phase. During a project status meeting, a team member reports an issue shared by a stakeholder.nnWhat should the new project manager do first?",
      "choices": [
        {
          "text": "Review the issue log.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Immediately address the issue.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the stakeholder engagement plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the risk management plan.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A vendor submits a high-level project schedule for a three-year project, including a detailed design-phase schedule. What does this describe?",
      "choices": [
        {
          "text": "Rolling wave planning",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Decomposition",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Expert judgment",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Templates",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "To handle a change in requirements, a project team needs to be motivated and flexible to reprioritize tasks. What leadership style would help the team to perform well in changing and uncertain conditions?",
      "choices": [
        {
          "text": "A collaborative approach will boost motivation, learning, growth, and innovation around a project vision.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "A directive approach will boost team confidence by ensuring that team members only work on the tasks suited to their qualifications.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "A collaborative approach will ensure that project procedures are well-documented and complete enough to cover all situations.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "A directive approach will prepare the team for frequent changes by adapting the project vision to new directions.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After success in a particulary challenging project phase, a project manager reassigned a high-performing team member to a more strategic task. \tThis is an example of what?",
      "choices": [
        {
          "text": "Recognition",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Risk acceptance",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Mentorship",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Scope change",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project where requirements are fixed and the workflow is planned for the full development lifecycle. Additionally, the customer involvement is at specific milestones and testing happens post-build.nnWhich methodology should a project manager use for this project?",
      "choices": [
        {
          "text": "Agile",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Hybrid",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Predictive",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Continuous Improvement",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager has identified all internal and external stakeholders in a project. The project manager now has to determine the best stakeholder engagement approach.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Conduct a stakeholder analysis.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Create a SWOT analysis.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop a multicriteria decision analysis.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Design a fishbone diagram.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recently joined an organization that is implementing a portfolio of strategic initiatives aimed at enhancing profitability. The project manager reviews a past project's business case with the project sponsor to ensure that the project was aligned with the organization's goals and to learn from its successes and failures.nnWhich of the following project outcomes would be considered most successful in the context of this organization's strategic initiatives?",
      "choices": [
        {
          "text": "The project was delivered under budget by 25%, and the overall duration was 20% longer than initially scheduled.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project was delivered on budget, and the project management office (PMO) approved the project closure.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project was delivered early, entered the market before the competition, and exceeded the budget by 10%.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project was delivered on schedule, within budget, and yielded a 5% increase in projected product sales.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, the project manager realizes that a team member is not completing tasks in accordance with the project management plan. What is the first action the project manager should take?",
      "choices": [
        {
          "text": "Build a matrix team to review the relationships on all project teams.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask all the team members to focus more on the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Reassign the uncompleted tasks to another team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Engage the team member to determine the reasons for poor performance.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier of a critical component for a construction project notifies the project manager that the component will be significantly late. Because this risk had been identified during project planning, the cost baseline contains an adequate contingency reserve.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Identify a supplier that can provide the component within the amount of the reserve.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Order the component from another supplier and submit a change request to the change control board (CCB).",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the risk response plan and the statement of work for the next steps and a penalty clause for late delivery.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the project schedule and the lessons learned repository.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the execution phase, and product testing is almost complete. A team member proposes that the testing can be fast-tracked by removing some of the tests. The team member believes this will help to finish the job earlier and give the project more float.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Request more information from the team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Reject the team member's proposal.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Discuss this proposal with the project team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the quality manager to consider the proposal.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following represents levels of risk attitude?",
      "choices": [
        {
          "text": "Conservative, moderate, and liberal",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Risk-averse, risk-neutral, risk-tolerant, risk-seeking",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Risk-mitigating, risk-avoiding, risk-transferring, risk-accepting",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "High, medium, and low",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Positive, negative, and indifferent",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager completed plans for a project and submitted all documents for approval but did not allocate time for delays in obtaining approvals. In addition to selecting a risk owner to address this potential risk, what should the project manager have done?",
      "choices": [
        {
          "text": "Asked the risk owner to escalate with approvers so that approvals are obtained as soon as possible.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Adjusted the project plans by lowering work completion estimates so that the work can be completed on time despite the delay.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Developed specific actions to implement the agreed-upon risk response strategy, including primary and backup strategies.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Used a real options analysis to perform an economic analysis of alternative risk response strategies.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is conducting risk identification based on high-level scope and expert judgement.nnWhat information in the project charter could support risk identification?",
      "choices": [
        {
          "text": "Summary of project roles and responsibilities",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Detailed requirements and scope",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project communication matrices",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stakeholder interest",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learned that the project deliverables will not meet the quality requirements unless a change is made to a component. After issuing a formal change request, the project manager emailed details of the change to all stakeholders. Most stakeholders received the information promptly and are fully aware of the change. However, the project manager finds out that some stakeholders did not receive the email or did not read it.nnWhat could the project manager have done to prevent this?",
      "choices": [
        {
          "text": "Reviewed the communications management plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Developed a detailed work performance report.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Met with the project sponsor to discuss communication.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Questioned the stakeholders about technological literacy.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project sponsor is risk averse and is therefore concerned about negative impacts on the project. To help with this concern, the project team identifies four project risks and then evaluates both the probability of occurrence and the impact of the risk if it occurs. The team uses a 1-5 scale, 1 being the lowest and 5 being the highest.nnn\tn\t\tn\t\t\tRiskn\t\t\tProbabilityn\t\t\tImpactn\t\tn\tn\tn\t\tn\t\t\tAn\t\t\t3n\t\t\t3n\t\tn\t\tn\t\t\tBn\t\t\t5n\t\t\t1n\t\tn\t\tn\t\t\tCn\t\t\t2n\t\t\t4n\t\tn\t\tn\t\t\tDn\t\t\t4n\t\t\t4n\t\tn\tnnnBased on the table, in what order should the project manager rank these risks (high to low) for risk management purposes?",
      "choices": [
        {
          "text": "B, A, D, C",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "B, C, A, D",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "D, A, C, B",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "C, D, A, B",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been made aware of a recent weather event that could potentially impact the project. Forecasters are unable to predict the path or strength of the event. Any delays would extend the project's finish date and cause cost overruns.n\tWhat should the project manager do first?",
      "choices": [
        {
          "text": "Notify the stakeholders and revise the budget.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Take preventive action based on new information.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Check the risk register for more risk information.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Record information about the event in the issue log.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that in-house resources are insufficient to produce a critical component of a deliverable. This poses a significant threat. The quality of the component is integral to the project, and the in-house resources cannot guarantee high-quality output. In response to this threat, the project manager decides to outsource the production of the component by contracting a third-party vendor.n\tWhich threat response strategy did the project manager use?",
      "choices": [
        {
          "text": "Accept",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Mitigate",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Enhance",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Escalate",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A technology project for a multinational bank is in the testing stage. The project manager learns that a security breach has exposed the personal data of thousands of end users. The project sponsor suspends work while the cause is investigated. The threat of a security breach was identified during the risk management planning process, and the impact is significant.n\tWhat should the project manager do?",
      "choices": [
        {
          "text": "Refer to the stakeholder engagement plan to determine the risk owner.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Perform a decision tree analysis to calculate the optimal path to resolution.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with the project sponsor to negotiate a new requirements management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the issue log and review the risk response strategy outlined in the risk register.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An electronic company plans to launch a new line of smart home devices. The devices will require a wide variety of skills to produce. However, the company's current production team does not have all of the necessary skills. What is the most comprehensive way for the project manager to identify and address the potential risks of delivering the new product?",
      "choices": [
        {
          "text": "Revise the project scope",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review quality control requirements",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assess high-level risks",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Analyze the competitor's production process",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager is assigned to replace a project manager who has resigned. During the initial assessment of project documentation, the new project manager discovers that the risk register has not been updated for several weeks. The project manager's next step be to consult the risk management plan. Why?",
      "choices": [
        {
          "text": "To determine how often risks have emerged in the past.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To understand how the previous manager prioritized risks.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "To learn how often the risk register must be updated.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To ascertain the level of uncertainty acceptable for the project",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the first team meeting, the project manager uses the risks noted in the project charter as a starting point for developing the risk register. After identifying the risks, what should the project team do next?",
      "choices": [
        {
          "text": "Calculate the management reserve.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop contingent response strategies.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Populate a probability and impact matrix.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Perform identification and categorization activity.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is reviewing work performance data in preparation for the close project process. The data reveals that one of the deliverables was not accepted. The estimated work required to complete acceptance of the deliverable will delay the project completion date by two months.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Allocate the contingency reserve to procure resources needed for completion.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the schedule and perform the work.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Issue a change request for review by the change control board (CCB).",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Update the watch list in the risk register.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A major project deliverable is completed. What should the project manager and team do to confirm that specifications have been met?",
      "choices": [
        {
          "text": "Check the organizational process assets.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Validate the quality audit reports.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Verify the scope.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Perform quality control.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The client agreed to the standards that would be used to assess final deliverables prior to hand-off, but is now asking for improvements because the deliverables do not meet the standards. Which document should the project manager consult to resolve this issue?",
      "choices": [
        {
          "text": "Scope management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Quality management plan",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Requirements documentation",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project charter",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project deliverable does not meet the functional requirements necessary to meet stakeholder needs. As a result, the customer refuses to accept the deliverable.nnHow would defining the quality metrics have helped the project manager avoid this situation?",
      "choices": [
        {
          "text": "The test management plan would have evaluated the deliverable according to quality metrics before final acceptance.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Quality metrics specified in the work breakdown structure (WBS) would have identified compliance specifications.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Quality metrics would have described the attributes of the deliverable and how to measure them.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Quality metrics in the requirements plan would have allowed for a new procurement process in case of component failure.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After sponsor approval of a project, the project manager invites the sponsor, selected team members, and other stakeholders to a meeting. The major purpose of the meeting is to define how formal acceptance of the completed project deliverables will be obtained.nnWhat document will be developed as the final output of this meeting?",
      "choices": [
        {
          "text": "Change log.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stakeholder register.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Scope management plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Requirements management plan.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has been closed and customer care needs to measure customer satisfaction with the deliverables.nnWhat should be done next?",
      "choices": [
        {
          "text": "Negotiate additional contract with customer for similar service.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule meeting with stakeholders and customer to discuss lessons learned.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Evaluate project deliverables and review customer feedback documents.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Audit project success by reviewing closing documentation for each project phase.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer is concerned that the current project deliverable will not fulfill stated project requirements. What could be done to alleviate customer concerns?",
      "choices": [
        {
          "text": "Schedule a meeting to remind the customer of requirements previously communicated to the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Document the customer's concern as a risk in the risk register and plan accordingly.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Manage the concern at the review of each deliverable with the customer.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask a product owner to review the acceptance criteria previously discussed with the customer.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with stakeholders to identify the steps that must be completed as part of a task. The project manager needs to be able to verify that team members have completed all the steps required when performing a frequently performed task.nnWhat should the project manager use?",
      "choices": [
        {
          "text": "Flowchart",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Checklist",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Histogram",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Facilitation",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has not been performing user acceptance tests on a deliverable because the product has been working as expected in other projects. However, after implementation, the product is not operational.nnWhat should the project manager do to identify the source of the problem?",
      "choices": [
        {
          "text": "Review the quality metrics document.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop a scatter diagram.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Conduct a root cause analysis.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Perform an audit.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A manufacturing company receives customer complaints that a product is defective. A project sponsor has said that these complaints might be outliers.nnWhat should the project manager use to investigate the cause and quantity of defects in this product?",
      "choices": [
        {
          "text": "Flowcharts",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Affinity diagram",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Control chart",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Histogram",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company needs to compare customer satisfaction results with organizations that are industry leaders in customer care. What should the project manager use to measure performance?",
      "choices": [
        {
          "text": "Benchmarking",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Mind mapping",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Interviews",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Affinity diagrams",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is conducting product testing and has identified several quality issues. The project manager wants to identify and address the root cause.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Analyze the results of an affinity diagram.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Analyze the results of a histogram.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Analyze the results of a fishbone diagram.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Analyze the results of a matrix diagram.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "You are the project manager on a project delivered by a Scrum team. The project sponsors are not familiar with the Scrum framework and were invited to attend the first release retrospective. They ask you to describe the scope of this event.nnWhich of the following are the goals of the retrospective event? (Choose 3)",
      "choices": [
        {
          "text": "Identify what is working well and define actions to reinforce them.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Identify what is not working and define actions to rectify them.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Identify top improvement areas and define actions to implement them.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Identify unfinished deliverables and define actions to complete them.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to close out a project and does not have time to update the lessons learned register.nnWhat could be a consequence of this failure to act?",
      "choices": [
        {
          "text": "Work performance data would be incomplete and unavailable for analysis.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Opportunities to prevent similar problems in future projects could be missed.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "The project management plan could be inaccurate and misleading.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Key stakeholders would refuse to engage in future projects.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Project completion will be delayed because an essential component will not be delivered on time. What should the project manager do?",
      "choices": [
        {
          "text": "Consult with stakeholders and revise the project schedule to reflect the delay.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the scope management plan to understand how acceptance of project deliverables could still be obtained.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Check the procurement contract for penalties that can be imposed on the supplier of the component.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Evaluate the impact of the delay before deciding what actions are necessary.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to close a project phase. What step should project manager take?",
      "choices": [
        {
          "text": "Ensure deliverables have full buy-in according to decision process established for phase.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Compare project deliverables with project charter and request customer sign off.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review high-level strategic and operational assumptions and constraints with stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review project management plan to ensure phase objectives have been met.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project was cancelled during its initiation phase due to lack of adequate resources. What should the project manager do?",
      "choices": [
        {
          "text": "Inform all team members according to guidelines in the communications management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Refer to the company's project closure guidelines.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Perform a risk analysis to determine the impact of terminating the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Reassign all resources and reallocate budget.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project stakeholder is identified who has interest in, but little authority or influence on, the project. How should the project manager handle this stakeholder?",
      "choices": [
        {
          "text": "Provide information to the stakeholder as needed.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Work closely with the stakeholder to proactively address their concerns.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Keep track of the stakeholder and respond to their needs.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Include the stakeholder on standard updates and keep them satisfied.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recognizes the need to improve team dynamics and knowledge sharing during a megaproject.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Conduct knowledge-sharing sessions where experienced team members present their expertise.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assign junior team members tasks that push their skill level and offer minimal support.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Implement a formal mentoring program with structured goals and regular meetings.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Facilitate open team discussions to identify and address individual challenges and concerns.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager compiling a list of project stakeholders discovers an interested stakeholder with little to no authority. How should they manage this stakeholder?",
      "choices": [
        {
          "text": "Keep satisfied.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Manage closely.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Monitor.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Keep informed.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project stakeholder has been missing scheduled facilitation workshops and has delegated assigned tasks to another member of the stakeholder community. What should the project manager do to engage this stakeholder?",
      "choices": [
        {
          "text": "Review with the stakeholder the roles and responsibilities of everyone involved as specified in the project charter.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Explain to the stakeholder the differences among the tasks assigned to each project team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the program manager to brief this stakeholder and to require the stakeholder's attendance at all relevant meetings.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Pair the stakeholder with a more experienced team member who can act as a mentor.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While executing a project that is nearly behind schedule, a project manager must commission a new piece of equipment. Two local parties who will be impacted by this commission ask that the project be stopped immediately because they were not given an opportunity to provide project approval.nnHow would implementing a stakeholder engagement plan have helped the project manager avoid this situation?",
      "choices": [
        {
          "text": "By using the conflict management techniques described in the plan, the project manager could have gotten approval from the local parties.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Including the local parties in the plan would have ensured their sign-off and approval of the project charter.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By understanding the local parties' expectations, the project manager could have used appropriate negotiating techniques to engage them.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By identifying the local parties as stakeholders, they would have been included in relevant communications.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder refuses to sign off on a product because it does not meet the expectations outlined in the project scope. What should the project manager have done to avoid this situation?",
      "choices": [
        {
          "text": "Solicited stakeholder feedback throughout the life cycle of the project.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Conducted risk assessments based on the stakeholder's expectations.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Implemented conflict management techniques during sign-off.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Involved the key stakeholder during the testing phase.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project schedule requires that two teams work simultaneously on separate parts of a complex project. The two parts of the project are dependent on each other. The project manager needs to ensure there are no conflicts when the outputs from the two teams are combined.nnWhat should the project manager do to manage any potential conflicts first?",
      "choices": [
        {
          "text": "Set up weekly meetings between the teams to monitor each other's work.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Prioritize conflict resolution for the part of the project that is on the critical path.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the lessons learned register to anticipate potential conflicts and plan their resolution.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Engage project stakeholders to ensure their support through any conflicts as they arise.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is developing a project charter, but a key stakeholder is failing to provide information about the expected project benefits. Why should the project manager meet with the project sponsor about this issue?",
      "choices": [
        {
          "text": "The project sponsor is the key person responsible for managing both tacit and explicit project knowledge.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project sponsor is the party who can address internal political and strategic issues that can affect project quality.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "The project sponsor can request that the change control board (CCB) make a change in the stakeholder community.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Disciplinary actions regarding stakeholders are managed by the project sponsor.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An intern is replacing a critical resource midway through a sprint. To help the intern get up to speed, the project manager assigns a senior engineer in the team as the intern's mentor. Two months later, the project goes into critical status, delaying the release milestone by a month.nnWhat should the project manager have done to avoid this scenario?",
      "choices": [
        {
          "text": "Convinced the critical resource to remain on the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Requested an experienced resource as a replacement.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Negotiated additional time to complete the project.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Allocated additional time for mentoring.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager joins a project during the delivery of a critical milestone. This project has multiple stakeholders, and each has a different level of interest. The project manager needs to determine how much detail to provide to the stakeholders about the delivery.nnWhich document should the project manager refer to?",
      "choices": [
        {
          "text": "Communications management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stakeholder register",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stakeholder engagement plan",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Project management plan",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project review, the construction manager reports that the concrete production rate has changed over the last three months. They would like to have an idea of what to expect in the next three months.nnWhat analysis should be conducted?",
      "choices": [
        {
          "text": "Earned value analysis",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Critical path analysis",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Trend analysis",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Cost-benefit analysis",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After a review meeting, a scrum master repeats the importance of quality, focusing especially on the Cost of Change. Which of the following is the scrum master not referring to?",
      "choices": [
        {
          "text": "Shorten the defect cycle time.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Fix escaped defects.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Support more features.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Reduce the technical debt.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies that the work started by the project team is inconsistent with industry regulations.nnWhat should the project manager update?",
      "choices": [
        {
          "text": "Organizational process assets",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work performance data",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Issue log",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Project management plan",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project which has many risks identified in the risk register. The current sprint deals with a critical aspect of the project. During the iteration, an identified risk occurs which ceases project development. The project manager logs the risk occurrence.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Raise the frequency of communications and leverage stakeholders to assist in resolving issues.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Assign responsibility for the communication management plan to a senior team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Invite the stakeholders to the next retrospective meeting and inform them of the issue.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Delay development of the critical aspect to the next sprint and work on items currently in the backlog.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key project team member is leaving the organization at the halfway point of the project. What should the project manager do first?",
      "choices": [
        {
          "text": "Meet with remaining team members to reassign workloads.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work with the functional manager to find a replacement.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Evaluate the impact of the loss of the team member on the project.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Reassess the resource roles and team composition.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During an agile retrospective session, several team members mentioned that they were confused about the iteration's progress. What should the project manager do to avoid this confusion?",
      "choices": [
        {
          "text": "Coach the team to review the iteration board.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Prepare a daily project status report and share it with the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the team to refer to the iteration backlog report.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Address the issue at the next retrospective session.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a new software development project and has met with the customer to discuss their requirements. The customer has provided the project manager with a list of requirements, but did not differentiate the technical requirements from the customer requirements.nnWhich of the following requirements should the project manager classify as a customer requirement?",
      "choices": [
        {
          "text": "The software should be able to process 1000 transactions per second.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The software should use a secure database encryption algorithm.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The software should be able to run on a variety of operating systems.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The software should be easy to use and navigate.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During acceptance testing of a deliverable, some senior stakeholders complain that a feature essential to their department was not included. What should the project manager have done to prevent this?",
      "choices": [
        {
          "text": "Consulted lessons learned from similar projects to adapt processes",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Prepared a change management plan and logged changes during project implementation",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Analyzed the project charter and developed a scope management plan",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Prepared a prototype and conducted a product demo with stakeholders",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager has been assigned to a project during its execution stage. During a review of the work breakdown structure (WBS), the project manager discovers that some deliverables were overlooked. The project manager needs to ensure that no work is left out of the project scope and no extra work is performed.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Add the work to the WBS and recalculate the project metrics.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask the stakeholders if these deliverables need to be added to the WBS.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Roll up the lower-level deliverables into higher-level work already accounted for in the WBS.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Initiate a Change Control Request with the project management office (PMO).",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project sponsor questions whether some detailed capabilities in the product design match the scope according to the project charter. What should the project manager use to manage this?",
      "choices": [
        {
          "text": "Expert judgment",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Requirements traceability matrix",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Prototype",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Context diagram",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is using an agile delivery approach for a project. The team members and business stakeholders are unfamiliar with formal requirements prioritization methods and are inexperienced with agile delivery approaches. The project manager wants to ensure that the critical business requirements will be planned and delivered.nnWhat prioritization technique should the project manager use?",
      "choices": [
        {
          "text": "Get the opinion of all team members and business stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Use a mathematical model defined by the team members and stakeholders.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Collect the needs of the team members and business stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Reach a common understanding with the team members and stakeholders.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A functional manager has been making changes to a project outside of the established management plan. The functional manager recently went straight to the project sponsor to request another change.nnWhat should that project manager do?",
      "choices": [
        {
          "text": "Determine if the change control board (CCB) needs to review the changes.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Tell the functional manager that all changes must go through the change control process.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Modify the project management plan to allow flexibility in the change control procedures.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with the project sponsor to discuss details about the requested changes.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The change control board (CCB) has evaluated and approved several change requests in a timely manner in the last several weeks. However, implementation of the changes is taking more time than anticipated.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Revise the change control system to allow only critical changes to be raised.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Acquire additional resources to ensure the project milestones are met.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Perform a detailed risk analysis to determine the impact of the time required to implement the changes on the success of the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Monitor implementation of the changes to ensure that change management procedures are being followed.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager for a complex project discovers that a certain team member has missed several targets. What should the project manager do?",
      "choices": [
        {
          "text": "Determine if the team member has been assigned to a concurrent project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Impose a penalty for each day the team member misses a target.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the team member's functional manager to address the issue.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Discuss the issue with the team member and offer any needed assistance.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager working on an agile project discovers that the allocated budget and resources are insufficient to cover the estimated total cost. The PMO recommended the development of requirements prioritization model.nnWhat should the project manager take into consideration in the model?",
      "choices": [
        {
          "text": "Cost, associated risk, and company culture.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Associated risk and company culture.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Cost and associated risk.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Associated cost impediments.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a hybrid project. The team performance has been suffering and multiple team members have identified one of the stakeholders as a constant obstacle. They say that the stakeholder regularly asks team members for status updates and tries to implement project changes directly through the project team.nnHow can the project manager improve project performance?",
      "choices": [
        {
          "text": "Identify the stakeholder as a risk in the risk register and work with the team on a mitigation strategy.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Have the team direct all project requests from the stakeholder to the project manager.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work with the project management office (PMO) to remove the stakeholder from the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with the project sponsor to address and remove impediments and obstacles for the team.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team is working on a project using a hybrid approach, and they are facing a lot of obstacles and blockers from some stakeholders. What should the project manager do to improve project performance?",
      "choices": [
        {
          "text": "Add blockers to the issue log and risk management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask stakeholders to communicate with the project manager and not directly with the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Empower the team members to remove obstacles and blockers.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Address and remove obstacles and blockers for the team.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager has been assigned to a global project team. In the next few days, the project team must create a resource breakdown structure (RBS) for the project. However, the resource management plan states that the RBS should be created and reviewed only at the beginning of the project.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Update the resource management plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Update the project management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the resource breakdown structure.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the work breakdown structure.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project team is defining certifications, technical competencies, and soft competencies for people, machinery, advance visualization software, workstations for physicians, and other supplies for a complex project that must be implemented in 5 months.nnIf the project team uses a resource breakdown structure (RBS), how will it help to organize and visualize the resources? (Choose three).",
      "choices": [
        {
          "text": "By hierarchy",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By source",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By category",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By type",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By last name",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is delayed due to resource availability, which puts the project budget at risk. Which document should the project manager use to review and update resources?",
      "choices": [
        {
          "text": "Requirements Traceability Matrix",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work Breakdown Structure",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Resource Breakdown Structure",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Responsibility Assignment Matrix",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies conflicts among local and virtual team members' understanding of the deliverables. How can the project manager resolve these conflicts?",
      "choices": [
        {
          "text": "Ask the project sponsor to meet with the team",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By collaborating with team members to address the conflicts",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Host a mediation session that brings a degree of satisfaction to all team members",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By emphasizing areas of agreement rather than areas of difference",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is slightly ahead of schedule. However, the project manager was informed that a critical deliverable will not be available on time.nnIf the project manager is able to crash the deliverable that is behind what would the impact be?",
      "choices": [
        {
          "text": "Project warranty issues would result.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project costs and risks would decrease.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project costs and risks would increase.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Rework would need to be performed.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has an approved project baseline schedule of 180 days and the baseline budget is US$250,000. After 21 days, the project has spent US$60,000 and earned value is US$75,000.nnWhat is the cost performance index (CPI) for this project?",
      "choices": [
        {
          "text": "0.8",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "0.75",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "1.25",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "1.02",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that a functional manager is assigning a two-week task in another project to a team member. Loss of this resource for two weeks will jeopardize the project schedule.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Review the resource management plan to determine how to negotiate with the functional manager.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Submit a change request to the change control board (CCB) to obtain a replacement resource from another department.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with the project sponsor to discuss the priority levels of the two projects.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assign another team member to perform the work of the team member who will be missing for two weeks.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What should a project manager consult to get resources assigned to a project?",
      "choices": [
        {
          "text": "Expert judgment",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "RACI matrix",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Resource management plan",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Resource requirements",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a business transformation project at a company facing significant financial challenges due to a declining market share. The project manager's stakeholders are skeptical of the need for change and are reluctant to invest in the project. What should the project manager do to demonstrate the urgency and benefits of the change?",
      "choices": [
        {
          "text": "Create a detailed communication plan outlining project goals, milestones, and benefits.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Delegate tasks and provide necessary resources to team members for success.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Hold regular stakeholder meetings to keep them updated and address their questions.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop a business case quantifying project benefits and aligning with company goals.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is developing a breakthrough product in a highly competitive and rapidly evolving market. The project manager acknowledges that, due to the significantly competitive environment, the definition of done (DoD) is likely to shift. What should the project manager do to ensure the project's successful delivery of value?",
      "choices": [
        {
          "text": "Implement robust project tracking and reporting procedures.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Expand the project timeline and budget to address potential risks.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Allocate additional resources to expedite product development.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Restrict project scope and focus on meeting project deadlines.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder requests new features to be added to a product during the project implementation phase. The stakeholder insists that the new features will add value to the product.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Meet with the project sponsor to discuss the benefits of the new features.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the stakeholder engagement plan to determine the key stakeholder's level of involvement.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assess and review how the changes will impact the project budget and schedule.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Implement the change and document the outcome in the lessons learned repository.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is a part of a large business transformation project. The project's main goal is to increase production and create capacity to bring new products to the market. The project manager notices during a lunch break that employees are discussing the changes introduced by the project and are afraid that they will result in staff layoffs, even though it is not true.nnWhich groups should the project manager contact to address this concern and ensure that the project meets its goal? (Choose 3).",
      "choices": [
        {
          "text": "The human resources (HR) department to ask for support to resolve the issue",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The change manager to revise the communications management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The employees' functional managers to include the issue in their performance reviews",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The employees' functional managers to ask for support in explaining the change",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The sponsor to ask for executive support and reinforcement",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the implementation phase of a project, the project manager receives news that a team lead will be leaving the organization. The project sponsor has been made aware and has suggested a replacement. What is the first action the project manager should take in response to this change?",
      "choices": [
        {
          "text": "Determine the competence levels of the suggested new resource.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the project baselines to assess the impact of the change.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Document the change according to the change management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Edit the communications management plan to reflect the change.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the development of a project management plan, the project team inadvertently omitted an essential component required for a product. The team quickly developed a workaround, but during a quality compliance review, the project management office (PMO) determined that the workaround was not effective.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Design a revised prototype of the workaround with a new modification to resolve the issue.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the requirements traceability matrix to determine the business value of the missing component.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Follow the formal integrated change control process to submit a change request to the change control board (CCB).",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Perform a qualitative risk analysis to assess the impact of designing a \nreplacement for the workaround.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A software development project is in the testing phase. New government regulation requires that additional documentation be delivered under the contract.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Terminate the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Submit a change request.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Update the schedule forecast.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the project budget.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer representative asks the project manager for a new product feature. Which document should the project manager consult?",
      "choices": [
        {
          "text": "Scope management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Change management plan",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "RACI matrix",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Requirements traceability matrix",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a large business transformation project that involves the entire organization. The project manager is working on the communications management plan.nnWhich two elements should the project manager consider while planning communications? (Choose 2).",
      "choices": [
        {
          "text": "Key messages",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Objectives and values",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Collecting feedback",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Multiple communication channels",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Best communication channel",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the project planning phase, the stakeholders neglected to document an essential system feature. The client realizes the oversight during an initial review of the deliverables.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Review the procurement management plan to determine if the missed feature can be added to the final deliverables.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Determine what effect overlooking the feature will cause and submit a change request to the change control board (CCB).",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask the project sponsor to authorize a price discount for the client.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work with the customer to agree on a new price to compensate for the omission.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After reviewing the project management plan with key stakeholders, the project manager was told that an 18-month release plan was unacceptable and the product should launch in six months.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Analyze the impact of the shortened timeline on the project scope, budget, and resources.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Renegotiate the project scope with the stakeholders to reduce the amount of work to be done.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Hire additional resources to help complete the project on time.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Work with the stakeholders to agree on a new release date that is more realistic.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project involving seven partners is falling behind schedule. The steering committee decides that all conflict resolution attempts must be sped up and requests that the project manager remove the requirement for all parties to make concessions.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Eliminate the withdraw/avoid technique.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Eliminate the smooth/accommodate technique.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Eliminate the force/direct technique.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Eliminate the compromise/reconcile technique.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex software project. Two team members must team up and work together on a critical module of the project. Before long, the two team members begin to argue and these arguments are impeding progress. How should the project manager resolve this conflict?",
      "choices": [
        {
          "text": "Ignore the conflict and hope that they can work it out on their own.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assign them to work separately on different tasks to avoid further conflicts.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule a team meeting to discuss the issues openly and find a resolution.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Reassign one of them to a different project to eliminate the conflict entirely.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a meeting with project stakeholders, two stakeholders have a disagreement regarding how a software component is being developed. The disagreement escalates as the stakeholders raise their voices.nnWhat should the project manager do in this situation?",
      "choices": [
        {
          "text": "Adjourn the meeting and meet with the other stakeholders on how to proceed.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Identify what is causing the conflict, attempt to de-escalate the situation, and focus on finding a common solution.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Take detailed notes of both stakeholders' positions and ask the remaining stakeholders to vote on the best option.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Inform the sponsor about the conflict and ask them to find a solution.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is acting as a scrum master in a hybrid project and is dealing with a conflict between team members. What strategy should be used to handle this conflict?",
      "choices": [
        {
          "text": "Place conflicts on a shared conflict list and ensure it is visible.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Sort conflicts into two groups: positive and negative.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review conflicts during the daily standup.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organize conflicts into two categories: structural and interpersonal.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that the project team is involved in an ongoing conflict with an overseas supplier team. The conflict is beginning to impact the performance of the project team.n\tAfter reviewing the team charter, what should the project manager do next?",
      "choices": [
        {
          "text": "Meet with the manager of the supplier team in person to find a resolution.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organize a virtual meeting with the supplier team to address and resolve the conflict.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Send a copy of the procurement agreement to the manager of the supplier team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Send an email to the manager of the supplier team explaining the issue and asking for a response.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the initial planning phase of a complex development project, a project team has identified several stakeholders, including the project sponsor, end-users, regulatory authorities, and the development team. What should the project manager do to ensure that they have a thorough understanding of the various degrees of influence these stakeholders have on project requirements?",
      "choices": [
        {
          "text": "Conduct one-on-one interviews with each stakeholder to gather their input and preferences.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Send a questionnaire to stakeholders to gather their feedback on project requirements.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Hold a stakeholder workshop to discuss and prioritize project requirements collectively.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Review historical project documents to identify stakeholder influence patterns.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager's last IT transformation project was canceled due to a misalignment of a business process with the accounting department. A similar project will begin soon, and a process alignment activity will be planned to identify potential scope changes.nnWhat should the project manager do to ensure a collaborative and incremental approach to the process alignment work is utilized?",
      "choices": [
        {
          "text": "Identify an external expert team to research and apply best practices in adapting businesses to IT transformation.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Plan for an early, two-week activity where impacted units work together to finalize adaptations to the business processes.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Plan for iterations early in the project to allow cross-functional stakeholders to agree on steps to adapt the business processes.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Plan for iterations late in the project to allow cross-functional stakeholders to adapt the processes according to delivered work.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "When a project manager finishes the Identify Stakeholders process, which of the following is the main output?",
      "choices": [
        {
          "text": "A registry with the name, area of interest, and level of positive or negative influence that each stakeholder will have on the project, among others",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "A document with change requests for the product, project management plan, or project documents",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "A stakeholder engagement plan that identifies the strategies and actions required to promote productive involvement of stakeholders in decision making and execution",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project documents updates, such as the assumption log, issue log, and risk register",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product owner has been attending daily standups but seems focused only on the budget and costs of each iteration. When addressing these inquiries, the project manager explains the rationale of the spend and the impact on the product development. The product owner does not seem interested in the rationale, only in the amount spent.nnWhat should the project manager do in this scenario?",
      "choices": [
        {
          "text": "Adjust the daily standups to first address the budget, then discuss the project status once the product owner leaves the meeting.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Modify the communications management plan to send daily budget status updates to the product owner.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with the product owner to educate them on the value delivered by the project, not just the cost of development.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Breakout the budget to reflect daily spend and provide this to the product owner to address their concerns.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A marketing team has identified the target audience for their company's new website. This audience is varied and geographically disperse, but the marketing team wants to compile a statistical analysis quickly.nnWhat tool or technique should the project manager use to gather this information?",
      "choices": [
        {
          "text": "Focus groups",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Questionnaire",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Interview",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Benchmarking",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Stakeholders in a multinational project are experiencing cross-cultural misunderstandings. A seemingly small cultural misinterpretation during the planning phase resulted in the failure to approve the project management plan. What should the project manager have done to avoid this situation?",
      "choices": [
        {
          "text": "Reviewed the lessons learned register to understand previous cultural mistakes made by the organization.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Researched common cultural mistakes made when dealing with stakeholders from the countries involved with the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Monitored direct and indirect communication during initial interactions to minimize the chance of a misunderstanding.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Held a workshop with the stakeholders before the initial meeting to develop a common communication language.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "How does a project manager increase the likelihood of a project being a success?",
      "choices": [
        {
          "text": "Over-estimating resource competencies needed for project delivery.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Get stakeholders buy-in from the start.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Constantly changing the membership of the governance team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Create a large budget contingency.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the middle of a three-year-long project, the company committee overseeing the project becomes uncertain about whether the final outcome will meet their expectations and provide the anticipated value. As the project manager, what proactive step can you take to address the committee's concerns and ensure that the project delivers the expected value?",
      "choices": [
        {
          "text": "Extend the project timeline to allow for more thorough testing.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop a prototype to present to the committee.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Increase the project budget to accommodate potential changes.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the project schedule with detailed milestones.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team meeting is focused on examining if the business value and vision for a project are being delivered by all parties. During the meeting, it was discovered that a few team members were unaware of the project's vision and business value.n\tWhat should the project manager do to ensure everyone is aware of the vision and business value the project is expected to bring moving forward?",
      "choices": [
        {
          "text": "Schedule regular meetings between the team and senior management to remind them what the vision and business value are.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Tell the team members to refer to the company vision statement and other high-level strategy documents for clarity.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Hold the team accountable as they have had ample time to become aware of the project vision and business value.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Engage with the team regularly regarding the business case and ensure that all doubts are addressed properly and cleared.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A development project's earned value is US$640,000, and the planned value is US$800,000. What should the project manager do to control this variance?",
      "choices": [
        {
          "text": "Calculate the earned value and change the project baseline to reflect the latest project status.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Reallocate US$160,000 to project tasks that are behind schedule.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Use project performance measurement and decide on corrective actions.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Release US$160,000 to the supplier to fast-track the project so that it is completed on time and within budget.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has identified a misalignment with the strategic and business objectives in the project charter and recognizes the need for realignment.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Review with the project team and make corrections in the project charter.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review with the stakeholders and make corrections in the project charter.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Escalate to the project sponsor so they can provide support and final approval.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Submit a formal change request to correct and update the project charter.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager just started managing agile projects. The project manager realizes that due to the lack of a clear definition of project objectives and definition of done (DoD), their colleague's projects have had many difficulties. Sponsors keep asking for more features and the project is yet to be completed.nnWhat should the project manager do to avoid these issues?",
      "choices": [
        {
          "text": "Arrange meetings to ensure every task to complete the project is included in the project management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Convince the project sponsor to incorporate quality experts so the product can be tested and accepted as completed.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Convince the product owner to approach the team and define project objectives.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule meetings with key stakeholders to build the agile project charter and set clear expectations for the project.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company contracts a software vendor to implement and customize a new software application and assigns a project manager to initiate and lead the project. Which of the following inputs to the project charter describes the key deliverables?",
      "choices": [
        {
          "text": "Business case",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Agreements",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project scope statement",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Project schedule",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After completing the project charter, the project manager sends it to the project stakeholders. What should the project manager do before starting the project planning process?",
      "choices": [
        {
          "text": "Conduct the project's kick-off meeting.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop the risk register.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Create the work breakdown structure (WBS).",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Obtain project charter approval.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager is developing a resource management plan but is unfamiliar with skill sets required by the project. How would engaging SMEs help the project manager create a resource management plan?",
      "choices": [
        {
          "text": "By showing the project manager how to determine organizational process assets.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By helping the project manager to understand authority relationships specified in project organization chart.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "By enabling the project manager to determine the required skill sets to meet project objectives.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "By enabling the project manager to manage virtual teams of skilled personnel.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During one of the final incremental deliveries of a project, the end user informed the project leader that they are not satisfied with the outcome and asked to remove a team member which is causing an unfavorable outcome.nnWhat should the project leader do?",
      "choices": [
        {
          "text": "Acknowledge the fact, and promise the end user the issue will be resolved.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Inform the end user that this is a key member, and promise the issue will be resolved.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Remove the team member as requested to not delay the acceptance.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Discuss the issue during the regular stakeholder feedback meeting and take action to resolve the issue.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "For a hybrid project, when should feedback be provided?",
      "choices": [
        {
          "text": "The timing for feedback depends on the performance measurement plan set by the project lead at the start of the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project manager is responsible for communicating feedback during internal meetings.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "With each delivery, the project leader is supposed to receive feedback from the stakeholders and share it with the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "For the effective performance of the team, feedback is provided on a regular and continuous basis.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Working in a continuous delivery environment, a project leader notices that one of the key team members is experiencing low morale, affecting the project delivery and causing a serious delay in the project schedule. While discussing the issue with the team member, the project leader discovers the team member's attitude is because of uncertainty in relation to the performance review set of criteria.nnWhat should the project leader have done to avoid this situation?",
      "choices": [
        {
          "text": "Explain the ground rules of the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Inform the team about incentives and rewards.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Share feedback and performance results.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Define the team-building strategies.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A marketing team is developing ideas in order to revamp an existing product. The marketing executive reaches out to the project manager to make sure that necessary measures are in place for a successful launch.nnWhat should the project manager focus on?",
      "choices": [
        {
          "text": "Ensuring that the scope management plan is in place to cover all related objectives.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ensuring that the team is also focused on the overall change management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Planning for regular project updates to cover the status of critical deliverables.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Determining and aligning performance indicators that will help in assessing successful delivery.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a functional organization, a product analyst is assigned to a short-duration application development effort. The analyst expresses concerns about the task and asks the project manager to provide the support of a peer with expertise in this domain.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Recognize the analyst's concerns and reassign the task to another team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Enroll the analyst in a capacity-building program, and keep this analyst assigned to the task.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the analyst to use skills to develop the tool, then move development to another team member.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Make sure the analyst has regular pairing meetings with the other team member throughout task execution.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A recently assigned project manager is working on detailing out all requirements and estimating each task required to complete the implementation of a healthcare system across three countries. The project manager needs this information to create the project schedule.nnWhat approach is the project manager using?",
      "choices": [
        {
          "text": "Agile",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Traditional",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Steel Thread",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Rolling Wave",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key supplier has become unavailable and the project manager has found a replacement that will meet project approval. Bringing the new supplier onboard will add 10 days to the project timeline. However, a key stakeholder does not want to extend the schedule. The new supplier must be used to move to the execution phase.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Meet with the stakeholder to explain that using the new supplier will increase the timeline but will meet the overall project goals.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Let the stakeholder know that the current schedule will require updates, and continue with periodic reviews to discuss the updates.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Inform the stakeholder that there will be a 10-day delay in the schedule to onboard the new supplier, but critical path tasks will be fast tracked.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Communicate to the stakeholder that using the new supplier will require a restart at the beginning of the next planning phase.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is uncertain about the duration of a new phase and consults three groups of subject matter experts (SMEs). The first group advises that the phase can be complete in 20 days. The second group identifies some risks that could extend the duration up to 35 days. The third group proposes a new approach that can shorten the time to 11 days.nnWhat is the estimated duration for the new phase?",
      "choices": [
        {
          "text": "19 days",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "21 days",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "23 days",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "25 days",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "There are three main work packages in a new product development project. Work package A must be delivered one week before work package C starts, and work package C will start at the same time that work package B begins.nnWhat is the relationship between work packages A and B?",
      "choices": [
        {
          "text": "Finish-to-start (FS)",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Finish-to-finish (FF)",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Start-to-start (SS)",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Start-to-finish (SF)",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project management organization has a project that leverages waterfall for the requirements gathering phase and agile for development and testing phases. Not everyone on the project team is familiar with both approaches and the project encounters delays due to project team uncertainty.nnWhat should have been done to prevent this scenario?",
      "choices": [
        {
          "text": "Train the project team on the benefits of hybrid project management.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Have the project team members familiar waterfall be responsible for the requirements gathering phase and those familiar with agile handle development and testing phases.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule daily standup meetings to keep the team informed of progress and address issues as they occur.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Request that the PMO leverage either waterfall or agile for the full project as the team cannot be trained in time for the project to succeed.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is in the halfway point of an agile project comprised of 100 user stories broken down into five iterations. Each user story is worth US$50. The actual expenditure is US$2,000 and 50 user stories have been delivered.nnWhich statement is true?",
      "choices": [
        {
          "text": "The project is over budget and behind schedule.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project is under budget and on schedule.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "The project is on budget and on schedule.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "The project is under budget and ahead of schedule.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is using a predictive approach for the development of a particular component as defined in the scope management plan. Due to regularly changing regulatory requirements, the development team has requested to utilize agile approaches.nnWhat should the project manager do about the development team's request?",
      "choices": [
        {
          "text": "Escalate the request for additional financial resources.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Analyze the requirements that will need to be addressed under the requested method.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Forward the request to the project management office (PMO) to amend the organizational process assets.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the project sponsor to obtain approval for implementation of the new approach.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In order to identify and assess the hindering and enabling factors that may affect project delivery as a result of the organization's specific environment, a project manager undertakes an environmental scan.nnWhich of the following combinations represents some of the factors that will be considered in this scan?",
      "choices": [
        {
          "text": "Laws and regulations, market trends, and new technology.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Published research, articles, and journals.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Seminars, exhibitions, and upcoming conferences.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "New technology, seminars, and webinars.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the design process for a multinational construction project, the project manager conducted a cost-benefit analysis based on current foreign exchange rates. The risk of changes to the exchange rate had been recorded in the risk register. During the project implementation phase, the exchange rate has fallen to such a degree the project manager believes the project might not be successful.nnWhat should the project manager do as a proactive action?",
      "choices": [
        {
          "text": "Update the risk management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Submit a budget increase change request.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Conduct a new cost-benefit analysis.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A stakeholder for a hybrid project expresses frustration at the number of iteration review meetings that they are expected to attend.nnWhat should the project manager do in this situation?",
      "choices": [
        {
          "text": "Educate the stakeholder on hybrid methodologies and how regular reviews both increase product value and reduce additional work.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Discuss the stakeholder's preferred level of engagement and adjust the stakeholder engagement plan accordingly.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Set up a meeting with all stakeholders to identify which meetings individual stakeholders should attend and update the stakeholder engagement plan accordingly.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Note this in the risk register and work with the sponsor to identify appropriate mitigation and response.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager wants to recruit another team member to replace an architect who recently resigned. What document should be consulted for this change?",
      "choices": [
        {
          "text": "Stakeholder register",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Responsibility assignment matrix (RAM)",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organizational process assets (OPA)",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Following project approval, a project team is assigned and the project management plan is created.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Hold a kickoff meeting with the project team and stakeholders.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Develop a detailed project schedule.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Initiate procurement processes for required resources.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Conduct individual performance reviews.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A newly formed project team features members from several countries and continents, with significant age differences and a variety of social circles. How should the project manager address this challenge?",
      "choices": [
        {
          "text": "Help the team discover how their different perspectives can expand their skill sets and strengthen team productivity.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Appoint a delegate for each ethnic/social group to contribute to inclusive decision making.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Require all team members to attend a virtual class on diversity and inclusion.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Plan to intervene authoritatively if confrontations occur between incompatible team members.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the early stages of a project, two key stakeholders have different opinions about a project's goals. Why should the project manager negotiate an agreement between the two stakeholders?",
      "choices": [
        {
          "text": "To understand the stakeholders' ability to influence the project's direction",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To obtain approval of the project charter",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "To engage the stakeholders in the conflict resolution",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To allow the stakeholders to discuss their opinions at the kick-off meeting",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project to design and develop new equipment is in the planning stage. The project team has little experience with the new features and functions of this equipment and has subsequently received training.nnHow can the project manager maximize the effectiveness of the team's training activities for this project?",
      "choices": [
        {
          "text": "Invite a subject matter expert (SME) to show the team how the features and functions are used.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Include peer-to-peer mentoring of the new features and functions in the project training plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Schedule a proof of concept presentation of the features and functions during the training activities.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assign a functional manager to work with the team to make sure they understand the equipment's features and functions.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the company cafeteria, a project manager overhears an unengaged stakeholder mocking the style of language used in the project manager's status report.nnWhat should the project manager do?",
      "choices": [
        {
          "text": "Meet with the stakeholder privately to find out how to make communication more engaging.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask the company's public relations officer for tips on how to make written communications more captivating.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stop sending the status reports to the stakeholder and use only direct email to communicate with them.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the project social contract to prohibit disrespectful communications when referring to project members.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A sales manager is overpromising deliverables beyond the contractual scope. In order to resolve the disagreement, the project manager wishes to find someone with a higher ranking in the sales department who is favorable to the project.nnWhat project data should the project manager consult?",
      "choices": [
        {
          "text": "Stakeholder power/interest grid",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Communications management plan",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Resource breakdown structure",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organizational process assets",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which leadership behavior is least likely to boost motivation in an Agile project team?",
      "choices": [
        {
          "text": "Instruct the team to immediately use a new productivity tool.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ask the team to vote if a new work method should be adopted.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Assign individual team members to the tasks in the backlog.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask for a volunteer to run a customer satisfaction survey.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What is an example of directive leadership as opposed to collaborative leadership?",
      "choices": [
        {
          "text": "Act as an authoritative single source of information for the team.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Accept and learn from mistakes in the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Trust team members to take initiatives.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Encourage the team to share ideas for improvement.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After preparing the project management plan, a project manager schedules a meeting with key stakeholders to finalize the planning phase. The project manager is now preparing for the executing phase.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Define the project and create the project charter.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Put the project plan into action.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ensure all deliverables are completed.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Address risks to make sure the project is on track.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is overseeing the development and launch of a new product. In order to comply with the Project Management Office (PMO)'s guidelines, the project manager is required to ensure a Benefits Realization Plan outlining the business value to be delivered is created. The project manager is currently documenting the Roles and Responsibilities for this task in the form of a RACI chart.nnWho will be accountable for ensuring the project brings value to the organization?",
      "choices": [
        {
          "text": "Project sponsor",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Project manager",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Solution architect",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Steering committee",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After going through a project earned value exception report, a project manager notices that two tasks are flagged both with a Cost Performance Index (CPI) of 0.5. Which is the correct deduction the project manager should make from this report?",
      "choices": [
        {
          "text": "Each task has spent twice the budgeted amount it should have at this point",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Each task has spent half the amount (budget) it should have at this point",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Each task has spent half the budgeted amount it should have at this point",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Each task has spent a quarter the amount (budget) it should have at this point",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project meeting, a project manager is made aware that team members find it very difficult to verify completed deliverables for compliance as no reference documents exist with the information on specifications and the related customer needs. The team decides to document clear acceptance criteria to address this.nnWhich document can be used to identify and relate the specific customer needs in this instance?",
      "choices": [
        {
          "text": "Business case",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Project charter",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Requirement traceability matrix",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Responsibility assignment matrix",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a complex project with diverse stakeholders and a strict regulatory environment. The project team is struggling to consistently achieve compliance with project processes, leading to delays and rework.nnWhat should the project manager do to effectively motivate the team to comply with project processes?",
      "choices": [
        {
          "text": "Offer individual performance-based bonuses for exceeding compliance targets.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Implement a system of frequent audits and compliance checks.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Develop and communicate a compelling vision and rationale for the overall project goals.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Facilitate team workshops to collaboratively identify and address compliance challenges.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team just completed a major milestone and is now on track to deliver the project ahead of the due date. The project manager is pleased and would like to use rewards to keep team cohesion and productivity on the rise.nnWhich of the following types of rewards will improve team cohesion and productivity for the remainder of the project?",
      "choices": [
        {
          "text": "Provide a team reward to all involved in the project in order to sustain productivity and cohesion",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Provide rewards to all team leaders only so that they can keep driving their respective teams in a cohesive and productive manner",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Provide individual rewards to the most productive team members in order to sustain productivity and team cohesion",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Provide individual rewards to the struggling team members only in order to encourage them and increase productivity and team cohesion",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team member assigned to a new project will be required to report on all project tasks progress to the project manager while his current line manager will be responsible for his career growth and development.nnWhich of the following describes the project organization structure?",
      "choices": [
        {
          "text": "Matrix",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Projectised",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Functional",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Cross-functional",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team is working on a new product development project. The product owner has requested a new change to accommodate recent technology requirements as a result of changes in the market environment.nnWhich of the following should the project manager do next?",
      "choices": [
        {
          "text": "Go ahead and implement the change immediately",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Log a change request document and set up a change control board",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ensure the change request has been added to the product backlog",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Reject the change as it may cost more money and delay the project",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with an agile team on project delivery. While planning, what should the team focus on to ensure the project objectives are met?",
      "choices": [
        {
          "text": "Organize workshops with business stakeholders and the project team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Verify that the product owner signs off on all user stories.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Verify that each user story has a definition of done (DoD).",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Arrange for a deliverable evaluation as the final quality assurance (QA) checkpoint.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex project, involving multiple stakeholders with diverse priorities, requires long and challenging negotiations to finalize the project agreement. The project manager must facilitate setting the right priorities for these crucial negotiations.nnWhat should the project manager do first?",
      "choices": [
        {
          "text": "Develop a detailed risk register.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organize a brainstorming session with all stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Define clear project success criteria.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Conduct individual interviews with key stakeholders.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with multiple stakeholders and competing priorities. What should the project manager do with respect to the stakeholders to achieve a better project result?",
      "choices": [
        {
          "text": "Identify and seek stakeholder consensus on project objectives and deliverables.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Preserve the relationships and rapport with the stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet the personal interests of the stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Encourage the stakeholders to accept the proposed viewpoint.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with multiple stakeholders and competing priorities. During a meeting with the stakeholders, the project manager conducted a brainstorming session to facilitate reaching consensus.nnWhat did the project manager do to reach a state of general consensus?",
      "choices": [
        {
          "text": "Focused on preserving relationships and rapport with stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Focused on finding a solution to meet the needs of stakeholders.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Focused on meeting the personal interests of stakeholders.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Focused on pushing stakeholders to accept the proposed view.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project that requires expertise in negotiation skills. What should the project manager do to persuade the stakeholders to accept the proposed viewpoint?",
      "choices": [
        {
          "text": "Discuss the business case for the project.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Establish the schedule and contingency measures.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Understand the reasons for potential disagreement.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Assess the risk of unsuccessful negotiation.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is writing the lessons learned at the end of the sprint. They explicitly declare their willingness to improve their expertise using the retrospective approach.nnBased upon the agile manifesto, what should the team focus on?",
      "choices": [
        {
          "text": "Competing",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Debating",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Defending",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Conversing",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is helping their organization transition from using predictive methods to agile methods. The leadership team complains to the project manager that less work is being done after the agile approaches were implemented.nnHow should the project manager respond to the leadership team?",
      "choices": [
        {
          "text": "Ask all team leads to explain why less work has been done since the agile implementation began.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Explain a decrease in productivity is expected in the beginning as teams try to understand and adjust to agile approaches.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Enforce 2-week sprints across the organization so all teams deliver at the same agile cadence.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stop implementing agile if the organization is not making any improvements and people are becoming frustrated.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. The project sponsor asks the project manager whether agile supports entering a fixed-price contract with the customer instead of a time-and-materials contract. The customer needs a fixed-price contract to support their concrete business goals.nnWhat should the project manager's response to the sponsor be?",
      "choices": [
        {
          "text": "Inform the customer that agile does not support fixed-price contracts, as it favors customer collaboration over contract negotiation.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Inform the customer that agile supports only time-and-materials contracts, as scope is not fixed in agile.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Agree with the customer to move forward with fixed-price contract, as there is no such restriction in agile.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Influence the customer to use a time-and-materials contract, as the cost overrun of this contract lies with the customer.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager leaves an ongoing project and is replaced by a new project manager. What should the new project manager do first to help ensure the success of the project?",
      "choices": [
        {
          "text": "Become familiar with the project goals as specified in the project charter.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Consult the issues log and lessons learned register kept by the former project manager.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Modify the project schedule and budget to include knowledge transfer activities.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Meet with key stakeholders and update the communications strategy as necessary.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that a new law will go into effect that will regulate the type of products the company can manufacture. The company is planning to launch a new product in the next few weeks that would not comply with the new regulations. The project manager meets with the sponsor and stakeholders to discuss the changes.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Update the project charter to reflect the results of the meeting.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Plan to launch the product on time without modification but update the risk management plan.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Plan to modify the product to meet the new regulations before the law goes into effect.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Advise the sponsor and stakeholders to cancel the launch until the product can be modified to meet the new regulations.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to compare the effectiveness of corrective actions taken during the current project to actions taken in a similar project in order to generate ideas for improvement. What should the project manager use?",
      "choices": [
        {
          "text": "Process analysis",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Expert judgment",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Benchmarking",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Quality audits",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. An experienced architect on the team mentions that it is important to create a detailed solution design document upfront based on the complexity of the project. One of the team members says that it is against the agile principles to spend time in upfront documentation. How should the project manager handle this situation?",
      "choices": [
        {
          "text": "Provide agile training to the architect and work with the project team to perform conflict resolution.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Allow the architect to create the solution design documentation upfront as required for the project.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Agree with the team member and ask the architect to create the design in iterations over a period of time.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Seek guidance from the project sponsor since agile does not support comprehensive documentation.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project where a vendor is engaged. The project team has a dependency on the vendor to complete some work first. However, the vendor is constantly failing to complete their work on time.nnHow should the project manager mitigate this risk?",
      "choices": [
        {
          "text": "Create an integrated project schedule with the vendor and keep regular checkpoints with the vendor.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Get approval from the project sponsor to add a contingency buffer to the project, and inform the vendor about it.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Remove this vendor immediately, and start the request for proposal (RFP) process for new vendor selection.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the vendor to add new resources, and approve overtime for existing resources to deliver their work on time.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project where a vendor is engaged in a fixed price contract. Even though the project requirements and timelines have been clearly defined and shared with the vendor, the project sponsor is worried about cost overrun.nnHow should the project manager respond to the sponsor?",
      "choices": [
        {
          "text": "Inform the project sponsor that the risk of cost overrun is transferred to the vendor.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Discuss this issue in the next team meeting and ask team members for feedback.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Ask the project sponsor to provide contingency funding to mitigate the risk.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Issue a request for proposal (RFP) to identify potential vendors if the issue materializes.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to contract with a provider for a large government project. Project guidelines mandate that all potential providers have the same understanding of the procurement process.nnWhat should the project manager hold to ensure compliance with the guidelines of the project?",
      "choices": [
        {
          "text": "Direct negotiations with providers of similar past projects",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Bidder conference",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Individual meetings with each potential provider",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Procurement team video conference",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The production of a key component in a construction project is outsourced to a third-party vendor. The vendor informs the project manager that due to component shortages, the product will arrive in variable quantities and during a longer delivery schedule.nnWhat should the project manager do to address this issue?",
      "choices": [
        {
          "text": "Meet with the project sponsor to discuss penalties that can be imposed because of the changes.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Adjust the project phases to match the delivery schedule of this critical component.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Review the third-party vendor's terms of delivery as specified in the vendor contract.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Review the procurement plan for contract cancellation procedures while researching alternate suppliers.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier has been awarded a firm fixed price (FFP) contract to provide various materials for a construction project. The supplier has received all necessary documents relating to material standards and specifications. By contract, the supplier must deliver all materials to the construction site on a specific date.nnWhen the materials arrive at the site on time, why should the project manager inform the inspections group?",
      "choices": [
        {
          "text": "To inform the team member responsible for the materials to pick them up",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To provide the finance department with documentation needed to pay the supplier's invoice",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To advise the procurement department that the contract has been fulfilled",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "To ensure that the materials comply with the contract standards and specifications",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What may cause leaders to ignore the Shared Leadership Potential in their teams? (Choose 2)",
      "choices": [
        {
          "text": "Over-confidence in their own role",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Providing autonomy and control",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Fear of becoming dispensable",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Trusting the team",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following reduces complexity on any project?",
      "choices": [
        {
          "text": "Team members are represented by diverse time zones",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Team members come from multiple global offices",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Team members have a variety of cultural backgrounds",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Team members use an agreed upon process to get the work done",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading an environmental project and realizes that they missed an influential foreign stakeholder. After the project manager contacted the stakeholder, the stakeholder requested a copy of the project documents in their local language.nnWhat should the project manager do next?",
      "choices": [
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Tell the stakeholder that the documents are available only in the performing organization's language.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Update the stakeholder register.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Ignore the request and continue working.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with resources from multiple countries. What should the project manager develop to ensure the resources have access to the information they need?",
      "choices": [
        {
          "text": "Organizational process asset (OPA) addressing organizational culture and structure.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Organizational project management (OPM) framework.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Communications management plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Horizontal hierarchical focus.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager for an agile project finds that the project team is having communication issues, resulting in delays during the sprints.nnWhat should the project manager do first to resolve the issue?",
      "choices": [
        {
          "text": "Update the communication management plan.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Share the burndown chart with the team.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Set up daily standup meetings.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Address this issue during the retrospective meeting.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is consolidating project documentation such as videos, pictures, audio, to ensure the team is sharing out project experiences. Where should this information be placed?",
      "choices": [
        {
          "text": "Lessons learned register.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Knowledge sharing register.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Risk register.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Issue log.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a project in a competitive market. The product must constantly be adapted based on changing market conditions and consumer expectations. The project team continuously develops and shares explicit knowledge, but the project manager would like to include tacit knowledge as well.nnWhat approach should the team take to gather tacit knowledge?",
      "choices": [
        {
          "text": "A real-time transfer of knowledge in the form of a manual.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Arrange coaching sessions with an external data company.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Continuously review product requirements and performance.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Create a platform for consumers to share their experiences.",
          "correct": true,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is not considered during project/phase closure?",
      "choices": [
        {
          "text": "Team celebration ideas",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Critical Success Factors",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Fast-tracking",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Knowledge transfer",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is performed in project/phase closure?",
      "choices": [
        {
          "text": "Schedule and conduct a project kickoff meeting.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule and conduct a lessons learned meeting.",
          "correct": true,
          "explanation": ""
        },
        {
          "text": "Schedule and conduct a change control meeting.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Schedule and conduct a project status meeting.",
          "correct": false,
          "explanation": ""
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is not part of the Validate Release in Transition phase?",
      "choices": [
        {
          "text": "Production deployment testing.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Active stakeholder participation.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Stakeholder satisfaction survey.",
          "correct": false,
          "explanation": ""
        },
        {
          "text": "Log the deployment.",
          "correct": true,
          "explanation": ""
        }
      ]
    }
  ]
}
