{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "During the testing phase of a project, a team member finds that some requirements were not met. If the project now adds work to meet the requirements, it may cause a large time and cost overrun.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Escalate the issue to top management.",
          "correct": true
        },
        {
          "text": "Perform an impact analysis.",
          "correct": false
        },
        {
          "text": "Call for a stakeholder meeting.",
          "correct": false
        },
        {
          "text": "Update the risk register.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A gas pipeline construction project was planned for completion in 36 months. After 24 months, the project was suspended by the local government authorities, citing a breach of social impact procedures.\nWhat should the project manager have done to avoid this?",
      "explanation": "",
      "choices": [
        {
          "text": "Developed a contingency plan in case of suspension by the local government.",
          "correct": true
        },
        {
          "text": "Reviewed local regulations and procedures and planned for them accordingly.",
          "correct": false
        },
        {
          "text": "Requested additional resources to expedite the construction after the suspension.",
          "correct": false
        },
        {
          "text": "Established a regular communication channel with the local government.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The opening of a new overseas office faces potential delays as the required permit has not yet been issued by the local government. The project team met to evaluate the appropriate course of action as outlined in the risk register. After a thorough assessment, the team decided to postpone the opening to another date.\nWhich document should the project manager use to update the project management plan?",
      "explanation": "",
      "choices": [
        {
          "text": "Risk management plan",
          "correct": true
        },
        {
          "text": "Risk report",
          "correct": false
        },
        {
          "text": "Risk register",
          "correct": false
        },
        {
          "text": "Lessons learned register",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A multi-year project is underway when a key resource announces that they are retiring. The project manager is concerned about the impact on the project and has identified that several critical tasks will be affecte\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Require the remaining team members to work additional hours to  the impacted tasks.",
          "correct": true
        },
        {
          "text": "Advise the stakeholders that the resource's tasks will not be d on time.",
          "correct": false
        },
        {
          "text": "Collaborate with the resource manager to identify and train an appropriate replacement.",
          "correct": false
        },
        {
          "text": "Encourage the retiring team member to postpone retirement to avoid disrupting the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team consistently delivers features on time but recently identified a significant architecture gap leading to rework.\nWhich agile practice should the project manager use to address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Increment planning",
          "correct": true
        },
        {
          "text": "Team retrospective",
          "correct": false
        },
        {
          "text": "Demonstration to stakeholders",
          "correct": false
        },
        {
          "text": "Daily standup",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A senior stakeholder was invited to a sprint review meeting and asked a project team member to describe the final product that the project will deliver. The team member was unable to respond and deferred the question to a more senior member of the team.\nWhat should have been done differently in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "The team member should have advised the stakeholder to ask the scrum master.",
          "correct": true
        },
        {
          "text": "The team member should have advised the stakeholder to ask the product owner.",
          "correct": false
        },
        {
          "text": "The stakeholder should have held their questions until the next sprint review meeting.",
          "correct": false
        },
        {
          "text": "The stakeholder should have directed their questions to the project manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA company is working on a hybrid project in which the deliverables have quality issues at the end of one of the sprints. Which action should the project manager take?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the definition of done (DoD).",
          "correct": true
        },
        {
          "text": "Look for a clear set of working agreements.",
          "correct": false
        },
        {
          "text": "Apply value stream mapping.",
          "correct": false
        },
        {
          "text": "Use a plan-driven approach.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned a complex project with significant legal, regulatory, and contractual requirements. However, these requirements have not yet been defined or finalize Concerns exist regarding a delay in completing these requirements.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Focus on the project deliverables instead as it is not the project manager's responsibility to fulfill these requirements.",
          "correct": true
        },
        {
          "text": "Contact the product owner and highlight the project risks related to the delay in fulfilling these requirements on time.",
          "correct": false
        },
        {
          "text": "Meet with the product owner and the legal department to review the project status and the progress in defining these requirements.",
          "correct": false
        },
        {
          "text": "Delay the finalization of the legal, regulatory, and contractual requirements until the end of the project, and before the go-live date.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project for a successful startup. The startup has shown exponential growth with multiple benefits to the team members, including flexible work hours and a work-from-home policy. During the last retrospective, one of the team members noted that the team velocity improved when the team was physically gathered in the project room.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Gather feedback and analyze the impact of physical location on team velocity.",
          "correct": true
        },
        {
          "text": "Refine the backlog to improve team velocity and maintain current policies.",
          "correct": false
        },
        {
          "text": "Share the idea with senior management and suggest updating company policies.",
          "correct": false
        },
        {
          "text": "Update the resource management plan and team charter to promote colocation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is estimated to have a total of 250 story points. The team planned 40 story points for each iteration and delivered 40, 0, 20, and 5 story points in the first four iterations.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Reassign undelivered tasks to team members to  during the next iteration.",
          "correct": true
        },
        {
          "text": "Work with team members to adjust the planned story points for the next iterations.",
          "correct": false
        },
        {
          "text": "Remove the features that cannot be delivered from the product backlog and update the customer.",
          "correct": false
        },
        {
          "text": "Negotiate with the customer for an extension of the deliverables due to holiday schedules.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, a customer asks to replace a piece of planned hardware with one that has more features and a lower price.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Evaluate the new features to ensure they align with the customer's business needs.",
          "correct": true
        },
        {
          "text": "Incorporate the hardware immediately as it will reduce the overall project cost.",
          "correct": false
        },
        {
          "text": "Meet with the team to plan the implementation of the new hardware as requeste",
          "correct": false
        },
        {
          "text": "Seek approval from the procurement manager and develop a prototype.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager calls a meeting to identify risks for a complicated project. Several subject matter experts are invited to this meeting along with the project team.\nWhy has the project manager invited the subject matter experts?",
      "explanation": "",
      "choices": [
        {
          "text": "Subject matter experts have specialized expertise and can help identify and address high-risk issues.",
          "correct": true
        },
        {
          "text": "Identifying risks in a meeting with subject matter experts makes getting better project resources easier.",
          "correct": false
        },
        {
          "text": "Risks will be easier to accept if the subject matter experts who attended the meeting work together.",
          "correct": false
        },
        {
          "text": "The project manager can leverage subject matter experts' resources to follow up on the identified risks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager is managing several interconnected projects. Some of these projects rely on specific deliverables from other projects. To avoid bottlenecks and facilitate project success, the project manager must assess the consolidated project plans for dependencies.\nWhat is the most appropriate action for the project manager to take in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Identify and document all inter-project dependencies.",
          "correct": true
        },
        {
          "text": "Adjust project timelines to remove dependencies.",
          "correct": false
        },
        {
          "text": "Eliminate all potential inter-project dependencies.",
          "correct": false
        },
        {
          "text": "Ensure that all projects can proceed independently.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the planning phase and requires tremendous time and effort for data collection and analysis. The project sponsor asks the project manager to skip a planned focus group discussion and brainstorming sessions in an effort to accelerate the process.\nWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Report the issue to the project steering committee.",
          "correct": true
        },
        {
          "text": "Acknowledge the project sponsor's request and skip the sessions.",
          "correct": false
        },
        {
          "text": "Tell the project sponsor that skipping the sessions will jeopardize the project.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to understand the reasons for the time constraints.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A midsize project has the objective of developing an innovative product with changing requirements. Several team members are unavailable for two weeks per month during the duration of the project. The project manager realizes that the cost of quality increases substantially during those periods. However, the team velocity is stable.\nWhat should the project manager do to address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Add resources to the team.",
          "correct": true
        },
        {
          "text": "Expand the testing effort.",
          "correct": false
        },
        {
          "text": "Provide cross-training.",
          "correct": false
        },
        {
          "text": "Increase the sprint duration.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is involved in a project where requirements are constantly evolving.\nWhat should the project manager do to achieve success?",
      "explanation": "",
      "choices": [
        {
          "text": "Provide regular updates and request deliverable-based approvals from the product owner.",
          "correct": true
        },
        {
          "text": "Work with the team to ensure they are on track and delivering on schedule.",
          "correct": false
        },
        {
          "text": "Maintain a comfortable working atmosphere to improve team cohesion.",
          "correct": false
        },
        {
          "text": "Ensure documentation and processes are filed appropriately and update the product owner.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on an agile project with a cross-functional team. The project manager is informed that some team members typically raise additional requirements that are not in the approved scope.\nWhat should the project manager do to address this expected behavior?",
      "explanation": "",
      "choices": [
        {
          "text": "Coach the team to manage scope using the appropriate framework.",
          "correct": true
        },
        {
          "text": "Escalate to the sponsor and request replacement team members.",
          "correct": false
        },
        {
          "text": "Conduct daily standup meetings with the team and stakeholders.",
          "correct": false
        },
        {
          "text": "Explain that requirements cannot be changed without approval.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two project managers are working on resourcing their respective projects. Both project managers identified the same subject matter expert (SME) as being beneficial to their project. Project A is using a predictive approach and Project B is using an agile approach.\nTo which project should the SME be allocated?",
      "explanation": "",
      "choices": [
        {
          "text": "The SME should be assigned to Project A because project planning was based on the support of the SME.",
          "correct": true
        },
        {
          "text": "The SME should be assigned to Project B because success in an agile project is determined by technical excellence.",
          "correct": false
        },
        {
          "text": "The SME should be assigned to the project with the less experienced project manager to improve the likelihood of success.",
          "correct": false
        },
        {
          "text": "The SME should be assigned to Project B because agile approaches prioritize flexibility and adaptability.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager realizes that the team needs training on a specific technology that is required in the project. What should the project manager do to mitigate this risk?",
      "explanation": "",
      "choices": [
        {
          "text": "Assess the team's knowledge of the technology and look for recommended training options.",
          "correct": true
        },
        {
          "text": "Contract with an expert provider to do the piece of work that uses that specific technology.",
          "correct": false
        },
        {
          "text": "Create an item in the risk log and notify the sponsor.",
          "correct": false
        },
        {
          "text": "Fix any training gaps as they arise during the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nAt the end of a large project, the stakeholders realize that the achieved benefits are not the same as the expected benefits. Which item, if poorly defined at the start of the project, could have led to this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Requirements documentation",
          "correct": true
        },
        {
          "text": "Project scope",
          "correct": false
        },
        {
          "text": "Business case",
          "correct": false
        },
        {
          "text": "Benefits metrics",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nDuring the daily standup meeting, one of the team members informs the team that a user story that was initially part of the sprint planning has become invalid due to a recently announced policy change. What should the project manager do in response to this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Close the user story related to the policy change and explain that it is no longer vali",
          "correct": true
        },
        {
          "text": "Remove the user story from the current sprint and schedule it for the next sprint.",
          "correct": false
        },
        {
          "text": "Notify the stakeholders that user stories committed for a sprint cannot be modifie",
          "correct": false
        },
        {
          "text": "Remove the user story from the sprint and ask the team to expedite the completion of the current sprint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company initiated a project to build a new hydropower plant. Analysis was performed to determine regulatory, safety, and security compliance requirements. After the analysis, it was apparent that some elements necessary to achieve compliance may be difficult and expensive to implement. Stakeholders are concerned about the added cost and complexity and have differing opinions on the importance of compliance and its potential implications.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the stakeholders and emphasize the importance of compliance and the costs of non-compliance.",
          "correct": true
        },
        {
          "text": "Review the stakeholder register and determine which stakeholders have the highest authority and influence.",
          "correct": false
        },
        {
          "text": "Escalate the compliance concerns and the disparity between stakeholder opinions to the project sponsor.",
          "correct": false
        },
        {
          "text": "Identify compliance requirements that can be excluded in order to align with stakeholder expectations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team using a hybrid approach is producing both predictive and incremental deliverables simultaneously. The communications management plan states that written communications are preferred over other types. Problems arise daily regarding the incremental tasks; however, the email backlog is becoming increasingly and unnecessarily complex.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Adopt face-to-face conversations during sprints.",
          "correct": true
        },
        {
          "text": "Adopt judicial communications during sprints.",
          "correct": false
        },
        {
          "text": "Adopt disruptive communications during sprints.",
          "correct": false
        },
        {
          "text": "Adopt formal conversations during sprints.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is underway with team members from two different countries and there are complaints from both sides. The team members from Country A believe that team members from Country B are too slow to respond and often have scheduled days off. The team members from Country B believe in a good work/life balance and think more consideration is needed before making decisions.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Reevaluate the team charter with team members.",
          "correct": true
        },
        {
          "text": "Revisit the communications management plan.",
          "correct": false
        },
        {
          "text": "Remind team members to consider cultural differences.",
          "correct": false
        },
        {
          "text": "Investigate the root cause of misunderstandings.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nDuring sign-off for a strategic project that resulted in additional costs, a project manager was unable to justify the additional expense in relation to the business value realized with the successful implementation. What should the project manager have done to avoid this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Presented an evaluation of the potential benefits identified in the initial business case as enough to justify additional expense costs.",
          "correct": true
        },
        {
          "text": "Measured and tracked the project benefits identified in the business case throughout the project life cycle.",
          "correct": false
        },
        {
          "text": "Performed a reassessment of the current state of the organization after project implementation to show the benefits realize",
          "correct": false
        },
        {
          "text": "Shared nonfinancial or intangible benefits such as customer satisfaction and good reputation as indicators for showing the value realize",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the end of the first phase of a stadium expansion project, the project manager realizes they will be running behind schedule for the next project phase. The delay is due to new safety requirements that must be adhered to. Stakeholders are frustrated that they were not aware of the potential safety requirement changes.\nWhat should you have done to avoid this situation and ensure that stakeholders are aware of potential disruptions?",
      "explanation": "",
      "choices": [
        {
          "text": "Increase the project's contingency reserve to accommodate unforeseen safety-related issues.",
          "correct": true
        },
        {
          "text": "Hold regular communication meetings with the site supervisor to stay updated on safety requirements.",
          "correct": false
        },
        {
          "text": "Implement a proactive risk assessment process during project initiation to identify potential safety-related delays.",
          "correct": false
        },
        {
          "text": "Request additional resources and personnel to address safety concerns as they arise.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Company A is moving from a predictive approach to an agile one. After the second incremental release of project X, the product owner expresses disappointment with the prototype results and wants to escalate the project to upper management and request a new team. Because of this, the team members start blaming each other and the new agile approach for the product owner's perception of the project.\nHow should the project manager resolve the team's differences?",
      "explanation": "",
      "choices": [
        {
          "text": "Follow the conflict resolution process documented in the project charter.",
          "correct": true
        },
        {
          "text": "Use retrospective sessions to allow the team to determine the cause of the dispute.",
          "correct": false
        },
        {
          "text": "Revisit the project vision with the team to ensure that the project goal is understoo",
          "correct": false
        },
        {
          "text": "Review the definition of done (DoD) with the product owner and determine the cause of the gap.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in a key phase of execution and everyone is dedicated to achieving success. A functional manager suddenly takes away one of the key team members to respond to an emergency without communicating with the project manager.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the resource calendar to find another team member.",
          "correct": true
        },
        {
          "text": "Report the situation to the project sponsor and executive management.",
          "correct": false
        },
        {
          "text": "Communicate with the functional manager and request the return of the key member.",
          "correct": false
        },
        {
          "text": "Review the impact to the project and schedule a meeting with the functional manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While attending a governance meeting with upper management, a project manager is verbally informed about an impending external audit of selected projects. The audit will enable the organization to maintain its quality certification.\nWhat should the project manager do first to prepare for the audit?",
      "explanation": "",
      "choices": [
        {
          "text": "Update all relevant project documentation with the current status of the project.",
          "correct": true
        },
        {
          "text": "Put the project on hold to ensure full compliance with the auditing process.",
          "correct": false
        },
        {
          "text": "Contact the auditors to understand the scope and requirements of the audit.",
          "correct": false
        },
        {
          "text": "Meet with the team and inform them of the scope and requirements of the audit.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While planning a global solution delivery in a multinational organization, the project manager and team drafted all work items and defined the priorities and methodologies for implementation. During one of the daily meetings, a team member expresses concern about the compliance of the technology being used and proposes an alternative that is more aligned with the data privacy policies of the country.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the architecture owner to assess the team member's proposal and evaluate the compliance concerns.",
          "correct": true
        },
        {
          "text": "Assess the validity of the concern and evaluate the compliance of the current and newly proposed technology.",
          "correct": false
        },
        {
          "text": "Meet with the customer and ask if they would be comfortable implementing the newly proposed technology.",
          "correct": false
        },
        {
          "text": "Get support from the information technology (IT) department regarding the feasibility of the new technology.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While planning a global solution delivery in a multinational organization, the project manager and team drafted all work items and defined the priorities and methodologies for implementation. During one of the daily meetings, a team member expresses concern about the compliance of the technology being used and proposes an alternative that is more aligned with the data privacy policies of the country.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the architecture owner to assess the team member's proposal and evaluate the compliance concerns.",
          "correct": true
        },
        {
          "text": "Assess the validity of the concern and evaluate the compliance of the current and newly proposed technology.",
          "correct": false
        },
        {
          "text": "Meet with the customer and ask if they would be comfortable implementing the newly proposed technology.",
          "correct": false
        },
        {
          "text": "Get support from the information technology (IT) department regarding the feasibility of the new technology.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nThe project manager of a large team notices team members are not interacting together, which is impacting project performance and the quality of the project outcome. What should the project manager do to help grow team dynamics?",
      "explanation": "",
      "choices": [
        {
          "text": "Conduct face-to-face group meetings to understand what the issues are.",
          "correct": true
        },
        {
          "text": "Notify the project team members' supervisors about the lack of cooperation.",
          "correct": false
        },
        {
          "text": "Add the lack of team communication as a risk in the risk register and monitor the situation.",
          "correct": false
        },
        {
          "text": "Refer to the lessons learned to understand how other projects handled similar issues.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nWhile validating deliverables, a project manager realizes that one of the project team members used an older version of the scope definition document, causing substantial errors. What should the project manager do to manage this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Discuss the latest deliverables during the next meeting.",
          "correct": true
        },
        {
          "text": "Update the project document register.",
          "correct": false
        },
        {
          "text": "Perform a change control process.",
          "correct": false
        },
        {
          "text": "Share the updated scope definition document with the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a mobile application development project. The project manager realizes that an agile approach is better suited for the project, but most of the team is not experienced in agile approaches.\nWhat should the project manager do next if the organization is open to using an agile approach?",
      "explanation": "",
      "choices": [
        {
          "text": "Request that the project be reassigned to a project team with agile experience.",
          "correct": true
        },
        {
          "text": "Ask to replace the team members who have never used agile approaches.",
          "correct": false
        },
        {
          "text": "Arrange training on agile principles and mindset for the existing project team.",
          "correct": false
        },
        {
          "text": "Use a predictive approach since the project team is already familiar with that approach.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At an agile project meeting, a team member gives an update on the status of their important task. A new team member interrupts them when they hear their task mentioned and gives a status update before the first team member has finished their update.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Privately talk to the two team members after the meeting.",
          "correct": true
        },
        {
          "text": "Tell the new team member that they are acting unprofessionally.",
          "correct": false
        },
        {
          "text": "Pause to discuss appropriate meeting protocol with the team.",
          "correct": false
        },
        {
          "text": "Ask the new team member to wait until their teammate finishes.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager working in a matrix organization is managing a project that is scheduled to be d in one month. At today's project meeting, the project manager was informed that errors encountered in the software code are steadily increasing. During discussions with the development team lead, the project manager is told that this is normal when trying to stay on schedule. The development team is pressing to move on so a deadline is not missed, but the project manager is concerne\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the work breakdown structure (WBS) and extend the durations in the project schedule to allow more development time.",
          "correct": true
        },
        {
          "text": "Direct the team to continue development to avoid missing the deadline, noting that the risk has been mitigate",
          "correct": false
        },
        {
          "text": "Examine the quality metrics to determine if the project is complying with the documented quality requirements.",
          "correct": false
        },
        {
          "text": "Submit a change request through the change control process to extend the deadline, allowing more time for development.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is currently behind schedule when a new team member, known for their high performance, is assigned to the team. While assessing the new team member, the project manager realizes that the individual lacks training for the specific project but has the skills and relevant experience to join the team.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Ensure that the team member receives training before joining the team.",
          "correct": true
        },
        {
          "text": "Assign the new team member to critical activities under close monitoring while they receive training.",
          "correct": false
        },
        {
          "text": "Assign the new team member to noncritical activities without close monitoring while training is provide",
          "correct": false
        },
        {
          "text": "Decline the addition of the new team member to the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assembling a team with a mix of new and experienced team members. The project manager finds out that there are issues with team cohesion. The experienced team members believe new team members lack the technical skills required to perform the necessary work and expect that they will have to compensate for their inexperience.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Offer bonuses or other incentives to experienced team members to mentor the new team members.",
          "correct": true
        },
        {
          "text": "Analyze the skills of all team members, identify gaps, and develop plans to address them.",
          "correct": false
        },
        {
          "text": "Reassign new team members to projects that better align with their skills and experience.",
          "correct": false
        },
        {
          "text": "Explain that professional project team members are expected to resolve issues without intervention.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team working on a high-priority, change-driven project has repeatedly missed release deadlines. The project manager identifies that this is due to the fact that an experienced team member is assigned to multiple projects and has limited bandwidth.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Report the issue to the project sponsor.",
          "correct": true
        },
        {
          "text": "Adjust the schedule and issue a change request.",
          "correct": false
        },
        {
          "text": "Discuss this issue with the project team immediately.",
          "correct": false
        },
        {
          "text": "Evaluate the workload of the experienced team member.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager communicates with a key stakeholder via phone calls only, as indicated in the communication management plan. Three weeks into the execution of a project, the project manager begins receiving an increasing amount of redundant ad-hoc communication requests from that stakeholder.\nHow should the project manager address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Continue with phone call communication as it has been effective so far.",
          "correct": true
        },
        {
          "text": "Meet with the stakeholder to discuss their communication needs and expectations.",
          "correct": false
        },
        {
          "text": "Send an email to the stakeholder requesting a change in communication approach.",
          "correct": false
        },
        {
          "text": "Assign a team member to act as a liaison between the project manager and the stakeholder.",
          "correct": false
        }
      ]
    }
  ]
}
