{
  "title": "Creativity House",
  "description": "Situational Questions in Professional Project Management",
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "Question\nA pilot project is ready to close and the project team wants to capture the challenges that were overcome and the opportunities for future work. Where will they document this information?",
      "explanation": "",
      "choices": [
        {
          "text": "Organizational process assets updates",
          "correct": true
        },
        {
          "text": "Work performance report",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Lessons learned register",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex technology project is in the execution phase. New technologies are added to the backlog based on customer requirements, which will involve significant changes to the deliverable.\nWhat should the project manager do to satisfy the customer?",
      "explanation": "",
      "choices": [
        {
          "text": "Replan the sprints and releases to meet every expectation of the customer.",
          "correct": true
        },
        {
          "text": "Manage customer expectations based on the organization's business needs.",
          "correct": false
        },
        {
          "text": "Accept the new requirements, and schedule meetings to plan a new release schedule.",
          "correct": false
        },
        {
          "text": "Push the project team to increase flexibility and accept the new challenge.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nQuality management is a vital aspect of any project. Which of the following quality control aspects is a component of a high functioning measurement system?",
      "explanation": "",
      "choices": [
        {
          "text": "Accuracy",
          "correct": true
        },
        {
          "text": "Non-precision",
          "correct": false
        },
        {
          "text": "Non-repeatability",
          "correct": false
        },
        {
          "text": "Duration",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nDuring project execution, a team member made a mistake resulting in a -week delay to the project schedule. What should the project manager do with regard to this error and delay?",
      "explanation": "",
      "choices": [
        {
          "text": "Discuss the issue with the team, look for solutions, and offer to help and support the team.",
          "correct": true
        },
        {
          "text": "Make sure the impact of this mistake is understood by the team member who made the mistake.",
          "correct": false
        },
        {
          "text": "Escalate the issue to senior management to make sure a similar mistake won't happen again.",
          "correct": false
        },
        {
          "text": "Find a solution, communicate it to the team, and reinforce that it should be implemented now.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A virtual project team is composed of members from various countries with cultural differences. The project manager is concerned that cultural differences may lead to miscommunication and conflict.\nWhat should the project manager do to effectively mitigate against potential conflicts?",
      "explanation": "",
      "choices": [
        {
          "text": "Collaboratively define and communicate the project-specific ground rules.",
          "correct": true
        },
        {
          "text": "Require that all communications within the project team are in written form.",
          "correct": false
        },
        {
          "text": "Appoint the senior member of one country's team to act as arbitrator if a conflict arises.",
          "correct": false
        },
        {
          "text": "Make all conflict resolution decisions and then inform the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder's input is essential to a project's success. However, the stakeholder is always late on critical project decisions.\nWhat can the project manager do to re-engage this stakeholder?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the stakeholder to understand the reason for the delay.",
          "correct": true
        },
        {
          "text": "Remove the stakeholder from the project.",
          "correct": false
        },
        {
          "text": "Brief the steering committee on the stakeholder's delays.",
          "correct": false
        },
        {
          "text": "Add the stakeholder's delay to the issue log.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The team informed the project leader that they are not sure of the stakeholder needs, despite the multiple collection requirements efforts and engagement in status meetings.\nHow should the project manager approach this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Require the team to work with the stakeholders to analyze their detailed requirements and sign off on the specification",
          "correct": true
        },
        {
          "text": "Discuss with the team the option of canceling the project since the risk is too great to continue",
          "correct": false
        },
        {
          "text": "Ask the team to write a collection of user stories to capture the needs, prioritize and manage the stories",
          "correct": false
        },
        {
          "text": "Document what the team believes the stakeholders need, show it to stakeholders, and ask for their feedback to share with the team",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nDuring a daily meeting, the project team raised an impediment that one of the business subject matter experts is frequently changing the definition of done, and expressed their fear that this is a sign of distrust. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Remind the team to focus on their work, and commit to speak with the SME",
          "correct": true
        },
        {
          "text": "Remind the product owner to support the team and speak with the SME",
          "correct": false
        },
        {
          "text": "Remind the SME to keep the definition of done that was initially agreed",
          "correct": false
        },
        {
          "text": "Remind the team that continuous feedback is important for success",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager is managing a project whose sponsor has asked why some of the components of the project were developed in-house. Where can this information be found?",
      "explanation": "",
      "choices": [
        {
          "text": "In the Procurement Management Plan, under build vs. buy decisions",
          "correct": true
        },
        {
          "text": "In the Project Charter, under the assumptions and constraints section",
          "correct": false
        },
        {
          "text": "In the Technical Architecture Document, under solution boundaries",
          "correct": false
        },
        {
          "text": "In the Solution Architecture Document, under project purpose and justification",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager notices that the project is behind schedule because materials delivery was delaye The procurement team informs the project manager that new government-imposed rules for the procurement of these materials caused this delay.\nIn what plan should these new rules be documented?",
      "explanation": "",
      "choices": [
        {
          "text": "Procurement management",
          "correct": true
        },
        {
          "text": "Communications management",
          "correct": false
        },
        {
          "text": "Stakeholder engagement",
          "correct": false
        },
        {
          "text": "Schedule management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex project has multiple participants. The project manager agrees with the team that they need to better understand the perspective of all project participants for the optimal success of the project.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the stakeholder analysis.",
          "correct": true
        },
        {
          "text": "Create a communication plan.",
          "correct": false
        },
        {
          "text": "Conduct a SWOT analysis.",
          "correct": false
        },
        {
          "text": "Perform a risk analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA business environment has become unstable because a stakeholder has altered the project deliverables and outcomes in the middle of the execution phase. Taking the stakeholder into consideration, how should the project manager ensure the project benefits are delivered?",
      "explanation": "",
      "choices": [
        {
          "text": "Ensure the project team agrees to the project management plan and provide the stakeholder with constant updates.",
          "correct": true
        },
        {
          "text": "Combine both agile and predictive approaches and manage changes to the overall scope with minimal deviations.",
          "correct": false
        },
        {
          "text": "Ensure the project's deliverables and objectives are tailored to the initial requirements.",
          "correct": false
        },
        {
          "text": "Engage the stakeholder based on level of impact and ensure their requirements are captured adequately according to change management process.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Reward Systems\nThe first version delivered to the quality control team has poor performance, and the testers are complaining that they cannot complete all the test cases as planne Which is a tool to help to monitor performance?",
      "explanation": "",
      "choices": [
        {
          "text": "Run Chart",
          "correct": true
        },
        {
          "text": "Data Flow Diagram",
          "correct": false
        },
        {
          "text": "Flow Chart",
          "correct": false
        },
        {
          "text": "Non-Control Chart",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a wastewater treatment project for a factory. During project execution, the government unexpectedly releases new environmental protection standards that are stricter than the previous standards.\nTo ensure compliance with these updated regulations, what should the project manager's initial course of action be?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the project team to assess the implications of the new government regulations on the project requirements.",
          "correct": true
        },
        {
          "text": "Review the project's risk register to determine if this change was previously documented as a potential risk to the project.",
          "correct": false
        },
        {
          "text": "Draft a formal change request detailing the adjustments and submit it to the change control board (CCB) for evaluation.",
          "correct": false
        },
        {
          "text": "Initiate discussions with the government agency to negotiate a revised timeline for adopting the new environmental standards.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a retrospective meeting, team members show disengagement, stating that they are repeating the same ideas over and over.\nHow can the project manager best handle this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the team members to pay more attention to the session even if they think they know what is coming.",
          "correct": true
        },
        {
          "text": "Ask the team members to give their feedback, even if it is the same as other team members, to stress their points.",
          "correct": false
        },
        {
          "text": "Encourage the team members to provide better feedback as they know the questions already.",
          "correct": false
        },
        {
          "text": "Encourage the team to provide ideas for process improvement and support changes based on the feedback receive",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has begun to develop a new software application that will be used by the company's sales team. The project is expected to take six months to complete and has a budget of $00,000. The project manager has identified software development tools, hardware, and training to be procure\nWhat is the most important thing for the project manager to do while developing the procurement plan?",
      "explanation": "",
      "choices": [
        {
          "text": "Ensure that all resources will be procured within budget.",
          "correct": true
        },
        {
          "text": "Ensure that the project is on schedule with no delays.",
          "correct": false
        },
        {
          "text": "Ensure that all procured resources are of great quality.",
          "correct": false
        },
        {
          "text": "Ensure that all resources will be procured on schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A majority portion of a local company was recently sold to an international company. The new parent company is mandating the use of health, safety, and environmental (HSE) regulations for all projects in the local company.\nWhat should the project managers do to remain compliant?",
      "explanation": "",
      "choices": [
        {
          "text": "Wait for the functional department responsible for HSE regulations to communicate the process change.",
          "correct": true
        },
        {
          "text": "Ask the functional department responsible for HSE regulations to assign a new team member.",
          "correct": false
        },
        {
          "text": "Speak with the project sponsor to get clarification about the new HSE regulations.",
          "correct": false
        },
        {
          "text": "Meet with the HSE team to understand the impact of the new regulations on the projects.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager is helping their organization transition from utilizing predictive methods to agile methods. One team member asks when high-level requirements definition and solution design activities should be done in an agile methodology.\nHow should the project manager respond?",
      "explanation": "",
      "choices": [
        {
          "text": "In agile, these activities must start as soon as the project team is assembled, preferably in sprint one.",
          "correct": true
        },
        {
          "text": "In agile, the team should plan to perform some of these activities as part of sprint zero before starting development.",
          "correct": false
        },
        {
          "text": "In agile, the team should avoid waste, so these activities must be done as part of development.",
          "correct": false
        },
        {
          "text": "In agile, the team follows the last responsible moment strategy and should defer those activities as much as possible.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a project to implement an asset health management system. The executive business sponsor has indicated that the system is expected to improve the quality of operations and extend the life span of the assets.\nWhat should the project manager do in order to demonstrate the business value once the system is in production?",
      "explanation": "",
      "choices": [
        {
          "text": "Establish critical success criteria, potential cost savings, and ongoing performance metrics for the project.",
          "correct": true
        },
        {
          "text": "Write test cases to align with the business values and ensure that acceptance criteria are clear during user acceptance testing (UAT).",
          "correct": false
        },
        {
          "text": "Verify that all requirements and acceptance criteria are in alignment with the business value and expectations.",
          "correct": false
        },
        {
          "text": "Validate the return on investment (ROI), review the current asset performance, and use it as a benchmark for future measurements.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile project is in its last iteration. During the daily standup, the team realizes that they will not be able to complete all the activities that were planned for the sprint. The team members create a contingency plan.\nWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Discuss the contingency plan with the product owner.",
          "correct": true
        },
        {
          "text": "Discuss the contingency plan with stakeholders.",
          "correct": false
        },
        {
          "text": "Discuss the contingency plan with the project sponsor.",
          "correct": false
        },
        {
          "text": "Execute the contingency plan immediately.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team in the middle of an incremental delivery project decided they need the help of a subject matter expert (SME) who is working in a different department. The project team asked the SME to join their team and assist in a specific task and they informed the project leader about this action.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the project budget and assess the impact and feasibility of adding an additional resource",
          "correct": true
        },
        {
          "text": "Talk with the project sponsor and get approval, explaining that this resource is important and crucial",
          "correct": false
        },
        {
          "text": "Talk to the functional manager of this needed resource and check their availability and bandwidth",
          "correct": false
        },
        {
          "text": "Facilitate the coordination of resources with the needed resources based on the teams working agreement",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager is finishing a project and the sponsor is requesting insights on benefits realization. How can the project manager calculate project outcomes value?",
      "explanation": "",
      "choices": [
        {
          "text": "Evaluate qualitative and quantitative project benefits.",
          "correct": true
        },
        {
          "text": "Price tangible benefits and divide them by expenses.",
          "correct": false
        },
        {
          "text": "Conduct a retrospective financial assessment.",
          "correct": false
        },
        {
          "text": "Assess outcomes and compare them to the budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a retrospective meeting, the project team confirmed that all deliverables were completed according to the specifications provided in the product backlog. However, the number of errors found during testing increased dramatically.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with quality assurance specialists to clarify the issue and seek resolutions.",
          "correct": true
        },
        {
          "text": "Review the risk management plan to determine the mitigation strategy.",
          "correct": false
        },
        {
          "text": "Perform a Monte Carlo analysis to identify possible scenarios and actions.",
          "correct": false
        },
        {
          "text": "Register the risk in the risk register and monitor it during the next iteration.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading an agile project. The product owner complains that the project team is constantly completing fewer story points than the Scrum team working on another project.\nWhat should the project manager do to address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the team to address this issue as part of the retrospective to improve their velocity in the next sprint.",
          "correct": true
        },
        {
          "text": "Tell the product owner that it is incorrect to compare velocity across teams because story points are specific to each team.",
          "correct": false
        },
        {
          "text": "Get approval from the product owner to add a contingency buffer to the sprint, and change the duration to increase velocity.",
          "correct": false
        },
        {
          "text": "Take full responsibility for the team’s low performance as compared to the other team and apologize.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an agile environment, a project leader should always consider a time for open and free discussions between team members on how the team can increase their performance.\nWhy is this practice important for the team?",
      "explanation": "",
      "choices": [
        {
          "text": "Teams should take actions to continuously increase productivity",
          "correct": true
        },
        {
          "text": "Teams should continuously experiment new ways of doing things",
          "correct": false
        },
        {
          "text": "Teams should continuously seek to improve their processes",
          "correct": false
        },
        {
          "text": "Teams should continuously push their members to work harder",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An educational institution raises a complaint after placing an order for a software module from a company using agile practices. The complaint claims that billing for payment of a partial delivery violates the Agile Manifesto if the customer was not involved in progress meetings.\nThe customer's claim is supported by which of the Four Values of the Agile Manifesto?",
      "explanation": "",
      "choices": [
        {
          "text": "Processes maintaining a constant pace indefinitely",
          "correct": true
        },
        {
          "text": "Software delivery frequently and in short periods",
          "correct": false
        },
        {
          "text": "Customer collaboration over contract negotiation",
          "correct": false
        },
        {
          "text": "Working software as a primary measure of progress",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An operational support project is running smoothly, but a customer consistently complains about a lack of visibility into the quality of the support work.\nHow should the project manager address this customer concern?",
      "explanation": "",
      "choices": [
        {
          "text": "Prepare relevant reports, send them to the customer daily, and publish them in a shared folder for future review.",
          "correct": true
        },
        {
          "text": "Request the customer to appoint a manager from their area to review day-to-day activities and agreements reached during all discussions.",
          "correct": false
        },
        {
          "text": "Plan a recurring governance meeting with the customer to present progress and publish data in a shared folder for future review.",
          "correct": false
        },
        {
          "text": "Inform the customer that every day after the most important discussions occur, one team member will oversee updating them.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nAfter an annual staff review, discussing project management and soft skills knowledge, the company made a decision to train all staff members to face new challenges. The method to train all staff members will be on a website where all content, exams,  templates, and other organizational assets are available.\nWhat method is being used for training purposes?",
      "explanation": "",
      "choices": [
        {
          "text": "Pull",
          "correct": true
        },
        {
          "text": "Push",
          "correct": false
        },
        {
          "text": "Interactive",
          "correct": false
        },
        {
          "text": "Interpersonal",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, a project manager learns that a team member's functional manager wants to remove them from a project because they believe they should not execute a certain task due to conflicting priorities.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the responsibility assignment matrix (RAM).",
          "correct": true
        },
        {
          "text": "Check the work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Check the organizational chart.",
          "correct": false
        },
        {
          "text": "Check the resource management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member approaches the project manager immediately after the end of the project meeting about his need for help to complete a late-due-date task.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Ignore the team member's request, and ask for double the efforts to complete the task",
          "correct": true
        },
        {
          "text": "Discuss the issue during the daily meeting, and decide the course of action with the team",
          "correct": false
        },
        {
          "text": "Ask the team member to step out from the task and re-allocate the task to someone else",
          "correct": false
        },
        {
          "text": "Ask a junior team member to help in the completion of the task on the due date",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the middle of a project incremental delivery, due to a change in the technology, a team member informed the project leader that due to a lack of knowledge in the technology the delivery will be delayed and suggests outsourcing services.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Inform the end user of the delay of the specific delivery due to the new technology",
          "correct": true
        },
        {
          "text": "Search for an outsourcing service with the experience needed",
          "correct": false
        },
        {
          "text": "Inform the sponsor of the delay and ask for their support and approval",
          "correct": false
        },
        {
          "text": "Discuss the impact of the new technology with the team and decide action jointly",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with many stakeholders that have conflicting priorities. Senior management asked the project manager to avoid \"noise\" because this is a highly political project. The project manager opted to use expert opinion from well known industry profiles.\nWhat did the project manager do to satisfy senior management's request?",
      "explanation": "",
      "choices": [
        {
          "text": "Responded in a friendly manner to senior management",
          "correct": true
        },
        {
          "text": "Appeared to be consistent in the use of words and actions",
          "correct": false
        },
        {
          "text": "Cooperated with senior management to achieve mutual goals",
          "correct": false
        },
        {
          "text": "Took action based on the senior management's power to act",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. A new team member, who has never worked in an agile team, joins the project. The new member asks the project manager to explain why an agile approach is use\nWhat should the project manager's response be?",
      "explanation": "",
      "choices": [
        {
          "text": "To eliminate the risk and increase the predictability and visibility",
          "correct": true
        },
        {
          "text": "To deliver value faster and change the scope based on feedback",
          "correct": false
        },
        {
          "text": "To reduce the costs and increase the quality of the end deliverables",
          "correct": false
        },
        {
          "text": "To eliminate the need for documentation by delivering working products",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "7\nA group of stakeholders at a financial institution are conducting a project closure review. Some of the stakeholders are concerned that the project deliverables do not satisfy the established closure criteri What is the first thing that the project manager should do to address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Assure the stakeholders that the project deliverables satisfy all established closure criteri",
          "correct": true
        },
        {
          "text": "Propose that the closure criteria be amended by removing the criteria that have not been met.",
          "correct": false
        },
        {
          "text": "Take corrective measures by adapting the closure criteria and extending the project timeline.",
          "correct": false
        },
        {
          "text": "Perform a thorough analysis to determine why the closure criteria have not been satisfie",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An experienced project manager is managing a multi-million dollar agile project. The project manager communicates the ground rules to the team, but after 12 iterations, the project manager starts noticing that some team members are not following the ground rules.\nWhat should the project manager do first to ensure team adherence to the ground rules?",
      "explanation": "",
      "choices": [
        {
          "text": "Contact human resources to request a written warning letter be sent to team members not following the ground rules.",
          "correct": true
        },
        {
          "text": "Ask the functional manager to replace team members not following the ground rules.",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the project team to reinforce the ground rules.",
          "correct": false
        },
        {
          "text": "Notify the project sponsor about this behavior and ask the sponsor to take disciplinary action.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project vendor has informed a project manager that an outsourced project deliverable will be available 6 months later than the agreed project schedule. The vendor stated that they are focusing on other project deliverables with priority dependencies, and this particular deliverable had no stated dependencies.\nWhat should the project manager do to avoid schedule delays in future?",
      "explanation": "",
      "choices": [
        {
          "text": "Monitor the dependencies and respond to challenges.",
          "correct": true
        },
        {
          "text": "Ensure that all new dependencies are finish to start",
          "correct": false
        },
        {
          "text": "Specify any dependencies if they exist.",
          "correct": false
        },
        {
          "text": "Conduct a meeting to inform the customer.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is facing a delay in a project due to a decision made by the functional manager to provide onsite support for another project without consulting other parties impacted by this decision.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the impact of the delay on schedule and cost.",
          "correct": true
        },
        {
          "text": "Share the work schedule with the functional manager.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders to agree on a communications management plan.",
          "correct": false
        },
        {
          "text": "Inform the customer about the delay and set a new delivery date.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An impact assessment reveals that a deliverable could be delayed by two weeks. A key resource has not been available to work on a non-critical activity due to other priorities. This could cause work overload on the other remaining resources.\nSince cost is a major constraint for this project, what should the project manager do immediately?",
      "explanation": "",
      "choices": [
        {
          "text": "Determine if the task has available float to meet the project end date.",
          "correct": true
        },
        {
          "text": "Hire a temporary resource to do the jo",
          "correct": false
        },
        {
          "text": "Consult the team and reduce the scope.",
          "correct": false
        },
        {
          "text": "Change the resource calendar to avoid major delays.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile coach is counseling a large software organization that has been using waterfall methodology and now plans to start using agile or hybrid methodology.\nWhat would be a project manager's suggestion?",
      "explanation": "",
      "choices": [
        {
          "text": "Continue using waterfall, since hybrid does not fit with the organizational structure.",
          "correct": true
        },
        {
          "text": "Start with agile and then move to hybrid, although agile takes time to implement.",
          "correct": false
        },
        {
          "text": "Start using hybrid methodologies because waterfall knowledge is transferable.",
          "correct": false
        },
        {
          "text": "Start using hybrid, the more appropriate methodology for software organizations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product team is using a prototyping approach to deliver a multiyear business initiative. The project manager notices that a few user stories are taking longer to be delivere\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the project timeline and reallocate resources.",
          "correct": true
        },
        {
          "text": "Conduct a retrospective with the team to identify bottlenecks.",
          "correct": false
        },
        {
          "text": "Escalate the issue to senior management for intervention.",
          "correct": false
        },
        {
          "text": "Modify the project scope to remove the delayed user stories.",
          "correct": false
        }
      ]
    }
  ]
}
