{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "A company is expanding its product manufacturing to a new country. The date the company will start operating is set and broadly communicated, but the project team is not sure if there is enough time to get all the product features implemented.\nWhat should the project manager do to ensure there is enough time to implement the critical features on the committed date?",
      "explanation": "",
      "choices": [
        {
          "text": "Add resources to the project team, as this will increase the velocity and enable the team to deliver more value.",
          "correct": true
        },
        {
          "text": "Collaborate with the project team to estimate the size of the minimum viable product (MVP) functionalities.",
          "correct": false
        },
        {
          "text": "Cut operations documentation because this can be completed after product delivery and operation starts.",
          "correct": false
        },
        {
          "text": "Escalate the concern to the executive level and request a new and feasible project due date.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company has hired a project manager to implement an adaptive project framework. The project has made some progress, but the team is frustrated because the client does not provide feedback or participate in defining acceptance criteria.\nWhat could have caused this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "The development team has no experience in managing an adaptive project.",
          "correct": true
        },
        {
          "text": "The client plans to implement the project and does not need to participate.",
          "correct": false
        },
        {
          "text": "The client does not understand the importance of their involvement.",
          "correct": false
        },
        {
          "text": "The development team has not produced a complete prototype.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nA project manager is preparing for an organization-wide software system replacement project that will have a significant impact on business operations. It is crucial to provide training to ensure that everyone within the organization can effectively use the new software system, but training resources are limited. What is the most effective action the project manager should take to ensure successful training for all organization members?",
      "explanation": "",
      "choices": [
        {
          "text": "Incorporate a detailed training and coaching component as a project deliverable.",
          "correct": true
        },
        {
          "text": "Determine the specific needs and requirements of different user functions.",
          "correct": false
        },
        {
          "text": "Recruit additional trainers to ensure adequate training coverage throughout the organization.",
          "correct": false
        },
        {
          "text": "Prioritize training efforts by identifying which features are most essential.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a project that is currently late and over budget. The project uses a predictive approach integrated with agile iterations for the most critical part of the scope. During the project assessment, the project manager notices that the team is afraid of making mistakes and is seeking individual recognition, while lacking accountability.\nHow should the project manager improve productivity?",
      "explanation": "",
      "choices": [
        {
          "text": "Develop a performance management plan for each project team member and share the performance results with the team.",
          "correct": true
        },
        {
          "text": "Enable collaboration, create common goals, and celebrate group achievements, while providing group rewards.",
          "correct": false
        },
        {
          "text": "Reinforce and communicate the next milestone, following individual performance and execution on a detailed level.",
          "correct": false
        },
        {
          "text": "Request approval to replace a few team members so the project team can understand the importance of meeting goals.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on an internal project and notes that the visions and goals of other department leaders are not clear. This creates confusion and ambiguity within the project team, and it is becoming difficult to distinguish between the wish list and scope items.\nWhich document should the project manager review to clarify this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Project Charter",
          "correct": true
        },
        {
          "text": "Communications Management Plan",
          "correct": false
        },
        {
          "text": "Risk Register",
          "correct": false
        },
        {
          "text": "Stakeholder Engagement Plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is transitioning from a predictive to an agile project management approach. The project manager has noticed that team members have valuable ideas on how to improve productivity.\nHow can the project manager leverage these ideas?",
      "explanation": "",
      "choices": [
        {
          "text": "Make use of project retrospective sessions for discussions and learning.",
          "correct": true
        },
        {
          "text": "Use iteration planning to discuss and adopt new ways of working.",
          "correct": false
        },
        {
          "text": "Develop and share guidelines for team training and mentoring.",
          "correct": false
        },
        {
          "text": "Engage with the product owner to facilitate fast-tracking of the transition.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Some of the project's materials have been ordered from overseas. The supplier notifies the project team that the materials will not reach the site on time due to a customs clearance delay that will affect the critical path.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the logistics team to arrange an expedited clearance.",
          "correct": true
        },
        {
          "text": "Revisit the risk register and implement the respective risk response.",
          "correct": false
        },
        {
          "text": "Identify the root cause of the delay and add it to the bid documents.",
          "correct": false
        },
        {
          "text": "Ensure the suppliers cover any additional costs due to the delay.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A co-located project team is facing communication and collaboration issues. Some team members have roles that require them to work different hours, some arriving early, others leaving later. At a recent weekly meeting, several team members were absent.\nWhat is the best way for the project manager to ensure the team can attend all necessary meetings?",
      "explanation": "",
      "choices": [
        {
          "text": "Encourage team members to work the same hours.",
          "correct": true
        },
        {
          "text": "Discuss the meeting with the missing team members.",
          "correct": false
        },
        {
          "text": "Create an information radiator for public display.",
          "correct": false
        },
        {
          "text": "Schedule team meetings during overlapping core hours.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Part of a project has already been delivered as planned and on schedule. However, unclear requirements for some of the remaining requirements may negatively impact the scheduled completion.\nHow should the project manager approach the issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Prioritize the most important features and clarify the vague requirements.",
          "correct": true
        },
        {
          "text": "Initiate a change request for project sponsor approval for a scope change.",
          "correct": false
        },
        {
          "text": "Record the issue and escalate it to the steering committee for a decision.",
          "correct": false
        },
        {
          "text": "Acquire additional resources to complete all of the requirements on time.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Project team members inform their project manager of a challenge they are facing. This challenge will likely impact project timelines.\nWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Determine if the team's challenges impact the critical path.",
          "correct": true
        },
        {
          "text": "Initiate a change request to extend the project timeline.",
          "correct": false
        },
        {
          "text": "Work with the team to assess the impact on the overall project.",
          "correct": false
        },
        {
          "text": "Escalate to the project sponsor for proper resolution.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a project charter and discovers that two key stakeholders are transferring to other departments and replacements have not been identified yet.\nWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Put the project on hold until the replacements are identified.",
          "correct": true
        },
        {
          "text": "Involve senior management to resolve the challenge.",
          "correct": false
        },
        {
          "text": "Obtain support from the project sponsor to continue the project.",
          "correct": false
        },
        {
          "text": "Perform an impact analysis of the possible delays.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to take over an ongoing project. During the quality review, the team discovered that 40% of the deliverables have defects and require rework, with an expected worsening trend.\nWhat should the project manager's first step be?",
      "explanation": "",
      "choices": [
        {
          "text": "Evaluate the cost of the rework.",
          "correct": true
        },
        {
          "text": "Review the quality management plan.",
          "correct": false
        },
        {
          "text": "Review the user stories.",
          "correct": false
        },
        {
          "text": "Perform a root cause analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A virtual team is midway through a sprint of a complex task and is ahead of schedule. During the daily standup, a new team member interrupts and asks everyone to describe what they worked on prior to the current sprint.\nHow should the project manager handle this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Thank the new team member for their interest and direct them to the project documentation.",
          "correct": true
        },
        {
          "text": "Explain to the new team member that the daily standup is not the best time for this discussion.",
          "correct": false
        },
        {
          "text": "Request the new team member leave the meeting for interrupting the daily standup.",
          "correct": false
        },
        {
          "text": "Ask all team members to list their completed tasks prior to the current sprint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager works in a matrix organization. Following a reorganization, several key project resources are reassigned to another project. The project no longer has the resources needed to successfully deliver the project.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Refuse to release the newly reassigned resources.",
          "correct": true
        },
        {
          "text": "Review the communications management plan.",
          "correct": false
        },
        {
          "text": "Review resource allocation and utilization plans.",
          "correct": false
        },
        {
          "text": "Review resource needs with the functional manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager oversees an agile project with an experienced project team. The project manager does not typically attend the daily stand-up meetings, but they sit in on them from time to time. After attending one particular meeting, the project manager noticed that the meeting was not productive.\nWhat should the project manager do to improve the situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Analyze the dynamics of these meetings, remove impediments, and provide feedback.",
          "correct": true
        },
        {
          "text": "Ask the team to send meeting minutes to the project manager after each daily meeting.",
          "correct": false
        },
        {
          "text": "Start attending daily meetings to promote a better collaboration effort with the team.",
          "correct": false
        },
        {
          "text": "Delegate the responsibility to the product owner to facilitate future daily review meetings.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a global project with team members in several different countries. To manage communications, the project manager plans to hold virtual meetings and on-site visits once a month.\nWhat should the project manager do next while working with this team?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the IT manager of each site to manage the technical components of the virtual meetings.",
          "correct": true
        },
        {
          "text": "Request the team members' résumés and become familiar with the teams' experiences.",
          "correct": false
        },
        {
          "text": "Propose and establish a team charter with the rules and principles to be followed.",
          "correct": false
        },
        {
          "text": "Request the budget for weekly in-person meetings with the entire team to allow for direct contact.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is facing a one-month delay, and the project manager realizes that a change request is necessary. The change control board (CCB) will review the change request at their next meeting, which is in two weeks. However, if the implementation of this change is delayed by two weeks, upcoming supply chain disruptions will cause a two-month delay to the project schedule.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Implement the change immediately to avoid the upcoming supply chain disruptions and the two-month delay.",
          "correct": true
        },
        {
          "text": "Revise the change request to incorporate the additional two-month delay due to upcoming supply chain disruptions.",
          "correct": false
        },
        {
          "text": "Meet with the sponsor and ask them to contact the CCB and request their immediate approval.",
          "correct": false
        },
        {
          "text": "Request that the CEO approve and implement the change to avoid the potential two-month delay.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "One day before starting a task, the technical lead proposed a new implementation approach that could reduce the schedule by one week. However, if the approach does not work, the task will be delayed by three days.\nWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Initiate a change request to reduce the schedule by one week.",
          "correct": true
        },
        {
          "text": "Tell the technical lead that the new approach is not feasible.",
          "correct": false
        },
        {
          "text": "Refer to the network diagram to determine the float for this task.",
          "correct": false
        },
        {
          "text": "Communicate the possible three-day delay to the sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a kick-off meeting with the project sponsor and various project members, it became clear that it was not necessary for some participants to be present. In addition, one required expert was not aware of the meeting and was not present at the meeting.\nWhat should the project manager have done to prevent this from happening?",
      "explanation": "",
      "choices": [
        {
          "text": "Established a fixed communication platform to provide updates on the project to all stakeholders.",
          "correct": true
        },
        {
          "text": "Managed stakeholder engagement by involving the stakeholders in the appropriate phases of the project.",
          "correct": false
        },
        {
          "text": "Developed the project charter including the roles and responsibilities of all the stakeholders.",
          "correct": false
        },
        {
          "text": "Created a responsibility matrix to notify stakeholders of the meetings they are required to attend.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An experienced project manager joins an ongoing project and wants to estimate the amount of time required to tackle several complex tasks. The team uses a kanban board but is open to new approaches. The project manager suggests using story points.\nWhat is the first thing the team should do before implementing this new approach?",
      "explanation": "",
      "choices": [
        {
          "text": "Calculate the story points only for new backlog items.",
          "correct": true
        },
        {
          "text": "Estimate the story points required for the entire task board.",
          "correct": false
        },
        {
          "text": "Convert all work in progress (WIP) items to story points.",
          "correct": false
        },
        {
          "text": "Measure and track story points over several sprints.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a virtual project with a global team for the first time and encounters an issue with stakeholder participation in team meetings. Some stakeholders do not participate, others complain about scheduling, and others do not acknowledge meeting invitations.\nWhat should the project manager do to address these issues and ensure smoother meetings?",
      "explanation": "",
      "choices": [
        {
          "text": "Allow the stakeholders to participate in asynchronous meetings using written communication.",
          "correct": true
        },
        {
          "text": "Inform the project sponsor of the situation and ask for support in enforcing meeting attendance.",
          "correct": false
        },
        {
          "text": "Review the organizational culture and structure to properly coordinate meetings.",
          "correct": false
        },
        {
          "text": "Reschedule meetings for different times and dates according to time zones.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nAfter a few iterations, the project manager feels that even though the team is completing the work as planned, the team is not completely comfortable with some of the agile processes followed in the project. When should the project manager talk about this and make adjustments?",
      "explanation": "",
      "choices": [
        {
          "text": "At the next daily standup meeting.",
          "correct": true
        },
        {
          "text": "At the lessons learned workshop.",
          "correct": false
        },
        {
          "text": "At the next retrospective meeting.",
          "correct": false
        },
        {
          "text": "At the next iteration planning meeting.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a retrospective meeting, some team members expressed that they strongly disagree with how the product owner and scrum master handled some issues related to the scope of the last cycle.\nWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the backlog with the product owner to ensure the scope is appropriate.",
          "correct": true
        },
        {
          "text": "Collect all available information from the team and address the problem.",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the specific team members to discuss the issue.",
          "correct": false
        },
        {
          "text": "Discuss the team's concerns with the product owner and the scrum master.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new program manager checks the status of a project. The forecast shows the project is slightly behind schedule. However, in reporting, the project manager stated that the project is on track. The program manager asks the project manager to explain the discrepancy. The project manager explains that the forecast discrepancy is due to a new estimation technique.\nWhat should the project manager have done to avoid this discrepancy?",
      "explanation": "",
      "choices": [
        {
          "text": "Asked the program manager to use the old forecasting technique",
          "correct": true
        },
        {
          "text": "Educated the program manager on the new forecasting technique",
          "correct": false
        },
        {
          "text": "Aligned the project artifacts with the new estimation technique and provided them to the program manager",
          "correct": false
        },
        {
          "text": "Ensured that the program manager has the necessary knowledge to understand estimation techniques",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nAn agile project manager is overseeing a Kanban project and wants to assess task completion roadblocks for an upcoming major milestone. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Create a performance metric using the work in progress limit.",
          "correct": true
        },
        {
          "text": "Ask a trusted team member about the issues the team is facing.",
          "correct": false
        },
        {
          "text": "Review the blocked items with the team during standup meetings.",
          "correct": false
        },
        {
          "text": "Host a stakeholder meeting to discuss task completion roadblocks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile project is in the first of six iterations. The team is located globally, so the meetings are in a virtual environment. After the fifth daily meeting, the project manager realizes that not all members are actively participating.\nWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask the team members why participation is lacking.",
          "correct": true
        },
        {
          "text": "Engage and guide the team to encourage all members to participate.",
          "correct": false
        },
        {
          "text": "Ask each team member individually to participate in future meetings.",
          "correct": false
        },
        {
          "text": "Allow the team to find their own way to fully participate.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is working on a complex technology project. A competitor introduces a product with a new feature, forcing the team to make changes to keep their product from becoming obsolete. The software that the team was using was outdated and could not accommodate the development of the new feature and must be replaced with new-to-market software. The team is excited, but they do not have experience working with the new software.\nWhat should the project manager do to address this knowledge gap?",
      "explanation": "",
      "choices": [
        {
          "text": "Train the team to use the new software.",
          "correct": true
        },
        {
          "text": "Hire new team members with software knowledge.",
          "correct": false
        },
        {
          "text": "Ignore the technological advancements.",
          "correct": false
        },
        {
          "text": "Discuss the new product features with the competitor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A developer is expressing concerns about the time spent on daily standups, updating stories, creating tasks, and reviewing dependencies between stories instead of developing code. Other team members support the comment.\nWhat should a servant leader do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Ask for suggestions on how to manage their time more effectively.",
          "correct": true
        },
        {
          "text": "Reduce the interactions among team members to increase development time.",
          "correct": false
        },
        {
          "text": "Explain the definition of an information radiator to the project team.",
          "correct": false
        },
        {
          "text": "Acknowledge the developer's frustration and emphasize the benefit of each activity.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nWhile closing a project, the client finds some defects in the deliverable. What should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the output against the acceptance criteria.",
          "correct": true
        },
        {
          "text": "Extend the project until all deliverables are accepted.",
          "correct": false
        },
        {
          "text": "Persuade the client to accept the output as is.",
          "correct": false
        },
        {
          "text": "Pay the penalty for the defective item.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to economic implications, a company announces imminent layoffs. A project is nearing delivery, and the team is worried about losing their jobs. Team morale is very low, and the project manager is experiencing increased delivery delays from the team.\nWhat should the project manager do to address team morale?",
      "explanation": "",
      "choices": [
        {
          "text": "Replace team members who are not delivering optimally to improve overall productivity.",
          "correct": true
        },
        {
          "text": "Provide regular updates on the layoff situation and discuss its impact on the team and the project.",
          "correct": false
        },
        {
          "text": "Keep all information about the layoffs confidential to avoid causing further anxiety.",
          "correct": false
        },
        {
          "text": "Meet with the project team to assure them that they will not be laid off and their jobs are safe.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Question\nRegular check-ins with the delivery team reveal low morale and a lack of efficiency. What should the project manager do to address these concerns?",
      "explanation": "",
      "choices": [
        {
          "text": "Perform a skill assessment.",
          "correct": true
        },
        {
          "text": "Conduct teambuilding exercises.",
          "correct": false
        },
        {
          "text": "Remove all project roadblocks.",
          "correct": false
        },
        {
          "text": "Conduct a satisfaction evaluation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member with sufficient experience and knowledge informs the project manager about a conflict with another team member and asks for advice and assistance. The project manager schedules a meeting to discuss the conflict with the team members involved.\nWhat should the project manager do during the meeting to resolve the conflict?",
      "explanation": "",
      "choices": [
        {
          "text": "Determine a resolution together.",
          "correct": true
        },
        {
          "text": "Mandate the solution unilaterally.",
          "correct": false
        },
        {
          "text": "Separate the team members.",
          "correct": false
        },
        {
          "text": "Identify who instigated the issue.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, a key stakeholder is replaced with a new team member who has approval authority. The new member states that the project deliverables are not aligned with the design and does not approve them. However, a few weeks later the project manager learns that the new team member had not been informed of changes during execution.\nWhat should the project manager have done to avoid this miscommunication?",
      "explanation": "",
      "choices": [
        {
          "text": "Organized a meeting with the sponsor before the execution began.",
          "correct": true
        },
        {
          "text": "Updated the stakeholder register to include the new team member.",
          "correct": false
        },
        {
          "text": "Asked the previous stakeholder to hold a meeting with the new team member before leaving.",
          "correct": false
        },
        {
          "text": "Updated the project charter during the execution phase to include all the changes.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is creating a stakeholder engagement assessment matrix to govern stakeholder management activities during project execution. The team learns that a key stakeholder is aware of the project, but is unsupportive of the outcome.\nWhat type of stakeholder is this?",
      "explanation": "",
      "choices": [
        {
          "text": "Resistant",
          "correct": true
        },
        {
          "text": "Leading",
          "correct": false
        },
        {
          "text": "Neutral",
          "correct": false
        },
        {
          "text": "Supportive",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project scope statement is approved by the project sponsor. The team members would like to modify the work breakdown structure (WBS) without changing the scope and send a request to the project manager.\nWhat should the project manager do with this request?",
      "explanation": "",
      "choices": [
        {
          "text": "Determine which changes to implement and inform the team.",
          "correct": true
        },
        {
          "text": "Refuse the request and escalate it to the project sponsor.",
          "correct": false
        },
        {
          "text": "Tell the team that they cannot modify the established WBS.",
          "correct": false
        },
        {
          "text": "Discuss it with the team and make a decision by consensus.",
          "correct": false
        }
      ]
    }
  ]
}
