{
  "title": "مركز الإبداع - الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 230,
  "pass": 85,
  "test": [
  {
    "النوع": "اختيار من متعدد",
    "النص": "تلقى فريق المشروع تدريبًا على التكنولوجيا المتعلقة بأحد مخرجات المشروع. خلال تسعة أشهر من العمل على المشروع، تم استبدال عدة أعضاء من الفريق. تباطأت الإنتاجية لأن الأعضاء الجدد غير ملمين بالتكنولوجيا، وأصبح جدول المشروع مهددًا بالتأخير. ماذا يجب أن يفعل مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "الاجتماع مع الفريق بأكمله وطلب من الأعضاء الحاليين تدريب الأعضاء الجدد.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "التفاوض مع راعي المشروع لزيادة الميزانية من أجل تدريب إضافي للأعضاء الجدد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إصدار طلب تغيير لاستقدام أعضاء جدد مدربين مسبقًا على التكنولوجيا المعنية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تسهيل ورشة عمل مع خبير متخصص لتعريف الأعضاء الجدد بالتكنولوجيا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "في اليوم السابق لبدء أعمال البناء، علم مدير المشروع أن مخطط الهيكل لم يُقبل من قبل العميل. ما الخطوة الأولى التي يجب على مدير المشروع اتخاذها لضمان الالتزام بالجدول الزمني؟",
    "الخيارات": [
      {
        "النص": "الاجتماع مع العميل في أسرع وقت ممكن لمناقشة التعديلات على المخطط.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "بدء البناء حسب الموعد مع مراجعة المخطط مع العميل في نفس الوقت.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مناقشة عملية قبول مكونات المخرجات مع العميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة تفاعل أصحاب المصلحة وتوقعاتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن الفريق سيتأخر عن تحقيق أحد المراحل لأن العضو (أ) لم يُكمل متطلبات المهمة التي يحتاجها العضو (ب). عند الاجتماع مع العضو (أ)، ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "توجيه العضو (أ) لنقل مسؤوليات إكمال المتطلبات إلى العضو (ب).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد أي عقبات تعيق استكمال المهام ومعرفة ما إذا كان العضو (أ) بحاجة إلى المساعدة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "طلب من العضو (أ) العمل مباشرة مع العضو (ب) لاستكمال المتطلبات بهدف تحقيق المرحلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من العضو (أ) اقتراح بديل يمكنه إكمال المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يضم مشروع تقني أعضاء من دول متعددة. يرى أصحاب المصلحة أن هذا التوزيع سيحافظ على بقاء المشروع ضمن الميزانية، لكن مدير المشروع يعتقد أن هناك مشاكل محتملة قد تؤثر على نجاح المشروع لم تؤخذ بالحسبان. ما الذي يجب على مدير المشروع فعله لتوثيق هذا القلق؟",
    "الخيارات": [
      {
        "النص": "توثيق المخاطر في سجل المخاطر.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطة تفاعل أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تسجيل المعلومة في سجل المشكلات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث خطة إدارة الموارد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أبلغ اثنان من أصحاب المصلحة مدير المشروع أن حالة مرحلة حرجة في المشروع لم تُبلغ إليهما. على الرغم من أن هذه المرحلة تقع ضمن مجال اهتمامهما، إلا أنه تم التعرف عليهما مؤخرًا فقط. ما الذي يجب على مدير المشروع فعله أولاً؟",
    "الخيارات": [
      {
        "النص": "مراجعة خطة إدارة الاتصالات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل لأصحاب المصلحة وتحديث سجل أصحاب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحديد طرق جديدة لإرسال تقارير حالة المشروع لجميع أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "جدولة اجتماع حالة المشروع ودعوة أصحاب المصلحة الجديدين.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "مشروع في مرحلة التنفيذ يسير وفق الخطة وضمن الميزانية. يطلب أحد أصحاب المصلحة الرئيسيين تغييرًا في وتيرة التواصل، حيث يرغب في التوقف عن تلقي تقارير الحالة الأسبوعية ويُفضل أن يتم إخطاره فقط في حال وجود مشكلة تتطلب انتباهه. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "مراجعة خطة تفاعل أصحاب المصلحة لتحديد مدى مشاركة هذا الطرف.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سؤال أصحاب المصلحة الآخرين إذا كانوا يرغبون أيضًا في تقليل عدد الإشعارات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطة إدارة الاتصالات لتعكس طلب صاحب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع صاحب المصلحة لمناقشة كمية ونوع المعلومات التي يجب التواصل بها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقود مدير المشروع مشروعًا له جدول زمني صارم ويتطلب طرحًا سريعًا في السوق لأن هناك منافسًا يعمل على منتج مشابه. لا يستطيع فريق المشروع تحقيق تاريخ التشغيل المحدد، ولا توجد موارد داخلية أخرى يمكنها المساعدة. كيف يمكن لمدير المشروع التخفيف من هذا الخطر؟",
    "الخيارات": [
      {
        "النص": "البحث عن موارد خارجية يمكنها المساعدة في تحقيق تاريخ التشغيل المطلوب.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مطالبة الفريق بإزالة العوائق التي تمنعهم من الالتزام بتاريخ التشغيل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من راعي المشروع تحديد تاريخ تشغيل جديد بناءً على الموارد المتاحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من الفريق التركيز فقط على الميزات الأساسية والالتزام بتاريخ التشغيل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقوم مدير المشروع بإغلاق مشروع تم الانتهاء منه رسميًا. لماذا يجب على مدير المشروع توثيق الأنشطة النهائية للمشروع؟",
    "الخيارات": [
      {
        "النص": "لتسجيل دراسات الحالة والمراجع الخاصة بالعميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "لتسجيل مؤشرات أداء المشروع النهائية وتحليل الجودة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "لتوثيق الدروس المستفادة وأرشفة المعلومات التاريخية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "للسماح للعميل بتقديم الفواتير واستلام إيصال الدفع النهائي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "اشتكى اثنان من أصحاب المصلحة الرئيسيين، وهما أيضًا عضوين في مجلس التحكم في التغيير (CCB)، من أنه لم يتم إبلاغهم بتمديد جدول المشروع. يعلم مدير المشروع أن التمديد كان ضروريًا لإضافة قيمة للمشروع. ما الذي كان يجب على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "الخيارات": [
      {
        "النص": "تقديم طلب تغيير إلى مجلس التحكم بالكامل دون مناقشته أولاً مع أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل ماذا لو لتحديد أثر التغيير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سؤال راعي المشروع إذا كان هناك هامش زمني (float) في الجدول الزمني للمشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التشاور مع أصحاب المصلحة قبل اتباع عملية التغيير المعتمدة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "في مراجعة لإحدى التكرارات، لم يتم استيفاء تعريف الانتهاء (DoD). ما هو الإجراء المناسب الذي يجب أن يتخذه مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "طلب من راعي المشروع تحديث ميثاق المشروع وإعادة تعيين السلطات والمسؤوليات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من فريق المشروع تطوير ميزات جديدة لتحل محل الميزات التي تم رفضها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد السبب الجذري مع الفريق في اجتماع الاستعراض الرجعي واقتراح خطة لمعالجة أوجه القصور.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إرسال طلب تغيير جديد إلى مجلس التحكم (CCB) للموافقة عليه مع إضافة ميزانية إلى الخط الأساسي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "اقترح الراعي تعديلًا في نطاق المشروع يحظى بشعبية بين فريق المشروع وأصحاب المصلحة الرئيسيين. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "اتباع عملية إدارة التغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إبلاغ أصحاب المصلحة بالتغيير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث متطلبات المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل هيكل تقسيم العمل (WBS).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تأخر مزود خارجي في تسليم عنصر مكتمل. كإجراء حسن نية وللحفاظ على جدول المشروع، عرض المزود تحمل تكلفة استئجار نظام مؤقت. وبما أنه لن يحدث أي تأخير في الجدول، ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "إدراج هذا المورد الإضافي في هيكل تقسيم العمل (WBS).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "عدم اتخاذ أي إجراء إضافي لأنه لا يوجد تأخير في الجدول.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تنفيذ عملية التحكم المتكامل في التغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحديث مستندات المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "استأنف مدير مشروع جديد مشروعًا في مرحلة التنفيذ. خلال اجتماع حالة المشروع، أبلغ أحد أعضاء الفريق عن مشكلة نقلها صاحب مصلحة. ما الذي يجب أن يفعله مدير المشروع الجديد أولاً؟",
    "الخيارات": [
      {
        "النص": "مراجعة سجل المشكلات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "معالجة المشكلة فورًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة تفاعل أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث خطة إدارة المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "قدّم بائع جدولًا زمنيًا عالي المستوى لمشروع مدته ثلاث سنوات، بما في ذلك جدول مفصل لمرحلة التصميم. ماذا يصف هذا الأسلوب؟",
    "الخيارات": [
      {
        "النص": "تخطيط الموجات المتلاحقة (Rolling wave planning).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "التفكيك (Decomposition).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الحكم الخبروي (Expert judgment).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "القوالب (Templates).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "لمعالجة تغيير في المتطلبات، يحتاج فريق المشروع إلى أن يكون محفزًا ومرنًا لإعادة ترتيب الأولويات. ما هو أسلوب القيادة الذي سيساعد الفريق على الأداء الجيد في ظروف متغيرة وغير مؤكدة؟",
    "الخيارات": [
      {
        "النص": "النهج التعاوني يعزز التحفيز والتعلم والنمو والابتكار حول رؤية المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "النهج التوجيهي يعزز ثقة الفريق من خلال التأكد من أن الأعضاء يعملون فقط في المهام التي تناسب مؤهلاتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "النهج التعاوني يضمن توثيق إجراءات المشروع بشكل كافٍ لتغطية جميع الحالات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "النهج التوجيهي يُعِد الفريق للتغييرات المتكررة من خلال تكييف رؤية المشروع مع الاتجاهات الجديدة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "بعد نجاح في مرحلة صعبة من المشروع، قام مدير المشروع بإعادة تعيين عضو فريق عالي الأداء إلى مهمة أكثر استراتيجية. ما الذي يمثل هذا المثال؟",
    "الخيارات": [
      {
        "النص": "الاعتراف.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "قبول المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الإرشاد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تغيير في النطاق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير مشروع مشروعًا تكون فيه المتطلبات ثابتة ومسار العمل مخططًا له طوال دورة التطوير الكاملة. بالإضافة إلى ذلك، يتم إشراك العميل في مراحل معينة فقط، ويتم إجراء الاختبار بعد مرحلة البناء. أي منهجية يجب أن يستخدمها مدير المشروع لهذا المشروع؟",
    "الخيارات": [
      {
        "النص": "المنهجية الرشيقة (Agile).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المنهجية الهجينة (Hybrid).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المنهجية التنبؤية (Predictive).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "التحسين المستمر (Continuous Improvement).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "حدد مدير المشروع جميع أصحاب المصلحة الداخليين والخارجيين في المشروع. ويجب عليه الآن تحديد أفضل نهج لتفاعل أصحاب المصلحة. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "الخيارات": [
      {
        "النص": "إجراء تحليل لأصحاب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إنشاء تحليل SWOT.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطوير تحليل متعدد المعايير لاتخاذ القرار.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تصميم مخطط السمكة (Fishbone Diagram).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "انضم مدير مشروع مؤخرًا إلى مؤسسة تنفذ مجموعة من المبادرات الإستراتيجية لتحسين الربحية. راجع مدير المشروع حالة العمل لمشروع سابق مع راعي المشروع للتأكد من توافقه مع أهداف المنظمة والتعلم من نجاحاته وإخفاقاته. أي من نتائج المشروع التالية تُعتبر الأكثر نجاحًا في سياق المبادرات الإستراتيجية لهذه المؤسسة؟",
    "الخيارات": [
      {
        "النص": "تم تنفيذ المشروع بميزانية أقل بنسبة 25٪، ولكن استغرق مدة أطول بنسبة 20٪ عن الخطة الأصلية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تم تنفيذ المشروع ضمن الميزانية، وتمت الموافقة على إغلاقه من قبل مكتب إدارة المشاريع (PMO).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تم تسليم المشروع مبكرًا، ودخل السوق قبل المنافسين، وتجاوز الميزانية بنسبة 10٪.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تم تنفيذ المشروع في الوقت المحدد، وضمن الميزانية، وحقق زيادة بنسبة 5٪ في المبيعات المتوقعة للمنتج.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء تنفيذ المشروع، أدرك مدير المشروع أن أحد أعضاء الفريق لا يُكمل المهام وفقًا لخطة إدارة المشروع. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "بناء فريق مصفوفي لمراجعة العلاقات في جميع فرق المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من جميع أعضاء الفريق التركيز أكثر على المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إعادة تعيين المهام غير المنجزة إلى عضو آخر في الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التحدث مع عضو الفريق لمعرفة أسباب الأداء الضعيف.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أبلغ مورد لمكوّن حيوي في مشروع بناء مدير المشروع أن التسليم سيتأخر بشكل كبير. وبما أن هذا الخطر تم تحديده أثناء التخطيط، فإن خط الأساس للتكلفة يحتوي على احتياطي كافٍ للطوارئ. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "تحديد مورد يمكنه توفير المكون ضمن قيمة الاحتياطي.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "طلب المكوّن من مورد آخر وتقديم طلب تغيير إلى مجلس التحكم في التغيير (CCB).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة الاستجابة للمخاطر وبيان العمل للخطوات التالية وبند الغرامة على التأخير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث الجدول الزمني للمشروع ومستودع الدروس المستفادة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "المشروع في مرحلة التنفيذ، واختبار المنتج أوشك على الاكتمال. اقترح أحد أعضاء الفريق تسريع الاختبار من خلال إزالة بعض الاختبارات، معتقدًا أن ذلك سيساعد في إنهاء العمل مبكرًا ويوفر وقتًا إضافيًا (float) للمشروع. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "طلب مزيد من المعلومات من عضو الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "رفض اقتراح عضو الفريق.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مناقشة الاقتراح مع فريق المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من مدير الجودة دراسة الاقتراح.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أي مما يلي يمثل مستويات المواقف من المخاطر؟",
    "الخيارات": [
      {
        "النص": "محافظ، معتدل، متحرر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يتجنب المخاطر، محايد تجاه المخاطر، متسامح مع المخاطر، يسعى للمخاطر.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "يقلل من المخاطر، يتجنبها، ينقلها، يقبلها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مرتفع، متوسط، منخفض.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إيجابي، سلبي، غير مبالٍ.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أكمل مدير المشروع خطط المشروع وقدم جميع المستندات للموافقة، لكنه لم يخصص وقتًا للتأخيرات المحتملة في الحصول على الموافقات. بالإضافة إلى تعيين مالك للمخاطر لمعالجة هذا الخطر، ما الذي كان يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "طلب من مالك الخطر التصعيد إلى أصحاب الموافقة للحصول عليها في أسرع وقت ممكن.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطط المشروع من خلال تقليل تقديرات إنجاز العمل ليتم الانتهاء منه في الوقت المحدد بالرغم من التأخير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطوير إجراءات محددة لتنفيذ استراتيجية الاستجابة للمخاطر المتفق عليها، بما في ذلك الخطط الأساسية والبديلة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "استخدام تحليل الخيارات الحقيقية لإجراء تحليل اقتصادي لاستراتيجيات استجابة بديلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يجري مدير المشروع تحديد المخاطر استنادًا إلى نطاق عالي المستوى والحكم الخبروي. ما المعلومة الموجودة في ميثاق المشروع والتي يمكن أن تساعد في تحديد المخاطر؟",
    "الخيارات": [
      {
        "النص": "ملخص أدوار ومسؤوليات المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المتطلبات التفصيلية والنطاق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مصفوفات الاتصال بالمشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "اهتمام أصحاب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن مخرجات المشروع لن تلبي متطلبات الجودة ما لم يتم إجراء تغيير في أحد المكونات. بعد تقديم طلب تغيير رسمي، أرسل مدير المشروع تفاصيل التغيير بالبريد الإلكتروني إلى جميع أصحاب المصلحة. معظمهم استلموا المعلومات ووعوا التغيير، لكن تبين لاحقًا أن بعض أصحاب المصلحة لم يتلقوا البريد الإلكتروني أو لم يقرأوه. ما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
    "الخيارات": [
      {
        "النص": "مراجعة خطة إدارة الاتصالات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعداد تقرير مفصل عن أداء العمل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع راعي المشروع لمناقشة الاتصال.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سؤال أصحاب المصلحة عن مدى إلمامهم بالتكنولوجيا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "راعي المشروع يتجنب المخاطر، وبالتالي يشعر بالقلق من الآثار السلبية على المشروع. للمساعدة، حدد فريق المشروع أربع مخاطر، ثم قام بتقييم احتمال حدوث كل منها وتأثيرها إذا حدثت، باستخدام مقياس من 1 إلى 5 (1 هو الأدنى، و5 هو الأعلى).\n\nالجدول التالي يوضح تفاصيل المخاطر:\n\nالمخاطـر | الاحتمالية | التأثير\n--------|-------------|---------\nأ        |     3       |    3\nب        |     5       |    1\nج        |     2       |    4\nد        |     4       |    4\n\nبناءً على هذا الجدول، بأي ترتيب يجب على مدير المشروع تصنيف هذه المخاطر (من الأعلى إلى الأدنى) لأغراض إدارة المخاطر؟",
    "الخيارات": [
      {
        "النص": "ب، أ، د، ج",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "ب، ج، أ، د",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "د، أ، ج، ب",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "ج، د، أ، ب",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع بحدث مناخي قد يؤثر على المشروع. المتنبئون لا يمكنهم تحديد مساره أو شدته. أي تأخير سيؤدي إلى تأخير في إنهاء المشروع وزيادة التكاليف. ما أول إجراء يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "إبلاغ أصحاب المصلحة وتحديث الميزانية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "اتخاذ إجراء وقائي بناءً على المعلومات الجديدة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة سجل المخاطر للحصول على مزيد من المعلومات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تسجيل الحدث في سجل المشكلات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن الموارد الداخلية غير كافية لإنتاج مكون حيوي لأحد المخرجات. هذا يشكل تهديدًا كبيرًا لأن جودة هذا المكون ضرورية للمشروع، ولا يمكن للموارد الداخلية ضمان جودة عالية. قرر مدير المشروع التعاقد مع مورد خارجي لإنتاج المكون. ما هي استراتيجية الاستجابة التي استخدمها؟",
    "الخيارات": [
      {
        "النص": "القبول.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التخفيف.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "التعزيز.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التصعيد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء مرحلة الاختبار في مشروع تقني لبنك عالمي، علم مدير المشروع بوجود خرق أمني أدى إلى تسريب بيانات شخصية لآلاف المستخدمين. أوقف راعي المشروع العمل حتى يتم التحقيق. تم تحديد هذا التهديد أثناء تخطيط إدارة المخاطر، وتأثيره كبير. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "الرجوع إلى خطة تفاعل أصحاب المصلحة لتحديد مالك الخطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل شجرة القرار لتحديد أفضل مسار للحل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع راعي المشروع للتفاوض على خطة جديدة لإدارة المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث سجل المشكلات ومراجعة استراتيجية الاستجابة للمخاطر في سجل المخاطر.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تخطط شركة إلكترونيات لإطلاق خط جديد من أجهزة المنزل الذكية. تتطلب الأجهزة مجموعة متنوعة من المهارات لتصنيعها، لكن فريق الإنتاج الحالي لا يمتلك كل المهارات اللازمة. ما هو أكثر أسلوب شمولًا لمدير المشروع لتحديد المخاطر المحتملة ومعالجتها؟",
    "الخيارات": [
      {
        "النص": "تعديل نطاق المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة متطلبات مراقبة الجودة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييم المخاطر على مستوى عالٍ.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحليل عملية الإنتاج لدى المنافسين.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم تعيين مدير مشروع جديد ليحل محل مدير مشروع قد استقال. أثناء التقييم الأولي لوثائق المشروع، اكتشف المدير الجديد أن سجل المخاطر لم يتم تحديثه منذ عدة أسابيع. الخطوة التالية لمدير المشروع هي الرجوع إلى خطة إدارة المخاطر. لماذا؟",
    "الخيارات": [
      {
        "النص": "لتحديد عدد مرات ظهور المخاطر في الماضي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "لفهم كيفية ترتيب المدير السابق للمخاطر حسب الأولوية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "لمعرفة عدد مرات تحديث سجل المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "لتحديد مستوى عدم اليقين المقبول للمشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "في أول اجتماع للفريق، استخدم مدير المشروع المخاطر المذكورة في ميثاق المشروع كنقطة انطلاق لتطوير سجل المخاطر. بعد تحديد المخاطر، ما الذي يجب على فريق المشروع القيام به بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "حساب الاحتياطي الإداري.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطوير استراتيجيات استجابة طارئة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إنشاء مصفوفة الاحتمالية والتأثير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إجراء نشاط تحديد وتصنيف.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقوم مدير المشروع بمراجعة بيانات أداء العمل استعدادًا لإغلاق المشروع. تكشف البيانات أن أحد المخرجات لم يتم قبوله. ويُقدّر أن العمل المطلوب لقبول المخرج سيؤدي إلى تأخير تاريخ الانتهاء بمقدار شهرين. ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "تخصيص الاحتياطي للطوارئ للحصول على الموارد المطلوبة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث الجدول الزمني وتنفيذ العمل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إصدار طلب تغيير لمراجعته من قبل مجلس التحكم في التغيير (CCB).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحديث قائمة المراقبة في سجل المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم الانتهاء من أحد المخرجات الرئيسية للمشروع. ما الذي يجب أن يفعله مدير المشروع والفريق لتأكيد أن المواصفات قد تم تحقيقها؟",
    "الخيارات": [
      {
        "النص": "التحقق من الأصول التنظيمية للعمليات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التحقق من تقارير تدقيق الجودة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التحقق من النطاق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء ضبط الجودة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "وافق العميل على المعايير التي ستُستخدم لتقييم المخرجات النهائية قبل التسليم، ولكنه الآن يطلب تحسينات لأن المخرجات لا تفي بالمعايير. ما الوثيقة التي يجب أن يرجع إليها مدير المشروع لحل هذه المشكلة؟",
    "الخيارات": [
      {
        "النص": "خطة إدارة النطاق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة الجودة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "توثيق المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "ميثاق المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أحد المخرجات لا يلبي المتطلبات الوظيفية اللازمة لتلبية احتياجات أصحاب المصلحة. نتيجة لذلك، رفض العميل قبول المخرج. كيف كان من الممكن أن تساعد تعريف مقاييس الجودة مدير المشروع على تجنب هذا الموقف؟",
    "الخيارات": [
      {
        "النص": "كانت خطة إدارة الاختبارات ستقيّم المخرج وفقًا لمقاييس الجودة قبل القبول النهائي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المقاييس المحددة في هيكل تقسيم العمل (WBS) كانت ستحدد معايير الامتثال.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مقاييس الجودة كانت ستصف خصائص المخرج وكيفية قياسها.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "المقاييس ضمن خطة المتطلبات كانت ستسمح بإجراء عملية شراء جديدة في حال فشل أحد المكونات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "بعد موافقة الراعي على المشروع، دعا مدير المشروع الراعي وأعضاء الفريق المختارين وبعض أصحاب المصلحة إلى اجتماع. الهدف الرئيسي من الاجتماع هو تحديد كيفية الحصول على القبول الرسمي للمخرجات المكتملة. ما الوثيقة التي سيتم تطويرها كنتيجة نهائية لهذا الاجتماع؟",
    "الخيارات": [
      {
        "النص": "سجل التغييرات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سجل أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة النطاق.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم إغلاق المشروع ويجب على فريق خدمة العملاء قياس رضا العملاء عن المخرجات. ما الذي يجب القيام به بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "التفاوض على عقد إضافي مع العميل لخدمة مشابهة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "جدولة اجتماع مع أصحاب المصلحة والعميل لمناقشة الدروس المستفادة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييم مخرجات المشروع ومراجعة وثائق ملاحظات العميل.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مراجعة نجاح المشروع من خلال الاطلاع على وثائق الإغلاق لكل مرحلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "العميل قلق من أن المخرج الحالي للمشروع لن يفي بالمتطلبات المحددة. ما الذي يمكن فعله لتخفيف قلق العميل؟",
    "الخيارات": [
      {
        "النص": "جدولة اجتماع لتذكير العميل بالمتطلبات التي تم إبلاغ الفريق بها سابقًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تسجيل قلق العميل كمخاطر في سجل المخاطر والتخطيط بناءً عليه.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إدارة القلق أثناء مراجعة كل مخرج مع العميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من مالك المنتج مراجعة معايير القبول التي تم مناقشتها مسبقًا مع العميل.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل مدير المشروع مع أصحاب المصلحة لتحديد الخطوات التي يجب تنفيذها كجزء من مهمة معينة. يحتاج المدير إلى التأكد من أن أعضاء الفريق قد أتموا جميع الخطوات المطلوبة عند أداء مهمة متكررة. ما الذي يجب أن يستخدمه مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "مخطط انسيابي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "قائمة تحقق (Checklist).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "الرسم البياني التكراري (Histogram).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التيسير (Facilitation).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "لم يقم فريق المشروع بإجراء اختبارات قبول المستخدم على أحد المخرجات لأن المنتج كان يعمل كما هو متوقع في مشاريع أخرى. ومع ذلك، بعد التنفيذ، لم يعمل المنتج كما ينبغي. ما الذي يجب على مدير المشروع فعله لتحديد مصدر المشكلة؟",
    "الخيارات": [
      {
        "النص": "مراجعة وثيقة مقاييس الجودة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إنشاء مخطط تبعثر (Scatter Diagram).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل السبب الجذري (Root Cause Analysis).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تنفيذ تدقيق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تلقت شركة تصنيع شكاوى من العملاء تفيد بأن المنتج معيب. وقد ذكر راعي المشروع أن هذه الشكاوى قد تكون حالات شاذة. ما الأداة التي يجب على مدير المشروع استخدامها للتحقيق في سبب وكمية العيوب؟",
    "الخيارات": [
      {
        "النص": "المخططات الانسيابية (Flowcharts).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مخطط التقارب (Affinity Diagram).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مخطط الضبط (Control Chart).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الرسم البياني التكراري (Histogram).",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تحتاج شركة إلى مقارنة نتائج رضا العملاء مع منظمات رائدة في مجال خدمة العملاء. ما الأداة التي يجب أن يستخدمها مدير المشروع لقياس الأداء؟",
    "الخيارات": [
      {
        "النص": "المقارنة المرجعية (Benchmarking).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "رسم الخرائط الذهنية (Mind Mapping).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المقابلات (Interviews).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مخططات التقارب (Affinity Diagrams).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقوم مدير المشروع باختبار المنتج وقد حدد عدة مشاكل جودة. ويريد تحديد السبب الجذري لهذه المشكلات ومعالجته. ما الذي يجب على مدير المشروع تحليله؟",
    "الخيارات": [
      {
        "النص": "تحليل مخطط التقارب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل الرسم البياني التكراري.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل مخطط السمكة (Ishikawa/Fishbone Diagram).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحليل مخطط المصفوفة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أنت مدير مشروع يتم تنفيذه من قبل فريق يستخدم إطار العمل Scrum. لا يملك الرعاة المعرفة الكافية بـ Scrum وقد تمت دعوتهم لحضور أول اجتماع مراجعة للإصدار. يسألونك عن نطاق هذا الحدث. ما أهداف هذا الاجتماع؟ (اختر 3)",
    "الخيارات": [
      {
        "النص": "تحديد ما يعمل بشكل جيد ووضع إجراءات لتعزيزه.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد ما لا يعمل ووضع إجراءات لإصلاحه.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد أهم مجالات التحسين ووضع خطة لتنفيذها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد المخرجات غير المكتملة ووضع إجراءات لاستكمالها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحتاج مدير المشروع إلى إغلاق المشروع، لكنه لا يملك الوقت لتحديث سجل الدروس المستفادة. ما العاقبة التي قد تترتب عن هذا الإهمال؟",
    "الخيارات": [
      {
        "النص": "ستكون بيانات أداء العمل غير مكتملة وغير متاحة للتحليل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "قد يتم تفويت فرص منع مشاكل مشابهة في المشاريع المستقبلية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "قد تكون خطة إدارة المشروع غير دقيقة ومضللة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سيرفض أصحاب المصلحة الرئيسيون المشاركة في مشاريع مستقبلية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "سيتم تأخير إكمال المشروع لأن مكونًا أساسيًا لن يتم تسليمه في الوقت المحدد. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "التشاور مع أصحاب المصلحة وتعديل الجدول الزمني ليعكس التأخير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة إدارة النطاق لفهم كيفية قبول المخرجات رغم التأخير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التحقق من عقد الشراء لمعرفة العقوبات الممكن فرضها على المورد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييم أثر التأخير قبل اتخاذ أي إجراء.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحتاج مدير المشروع إلى إغلاق مرحلة من المشروع. ما الخطوة التي يجب أن يتخذها؟",
    "الخيارات": [
      {
        "النص": "التأكد من وجود اتفاق تام على المخرجات وفقًا لعملية اتخاذ القرار المعتمدة للمرحلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مقارنة المخرجات مع ميثاق المشروع وطلب توقيع العميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة الافتراضات والقيود الاستراتيجية والتشغيلية رفيعة المستوى مع أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة إدارة المشروع للتأكد من تحقيق أهداف المرحلة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم إلغاء مشروع أثناء مرحلة البدء بسبب نقص الموارد. ما الذي يجب أن يفعله مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "إبلاغ جميع أعضاء الفريق وفقًا لخطة إدارة الاتصالات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الرجوع إلى إرشادات إغلاق المشاريع الخاصة بالشركة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل مخاطر لتحديد أثر إلغاء المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إعادة تعيين جميع الموارد وإعادة توزيع الميزانية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم تحديد صاحب مصلحة جديد لديه اهتمام بالمشروع، لكنه يتمتع بسلطة أو تأثير محدود. كيف يجب على مدير المشروع التعامل مع هذا الطرف؟",
    "الخيارات": [
      {
        "النص": "تزويده بالمعلومات عند الحاجة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "العمل معه عن كثب لمعالجة مخاوفه بشكل استباقي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "متابعته والاستجابة لاحتياجاته.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إشراكه في التحديثات الدورية وإبقاؤه راضيًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدرك مدير المشروع ضرورة تحسين ديناميكية الفريق ومشاركة المعرفة خلال مشروع ضخم. ما الذي يجب على مدير المشروع القيام به؟",
    "الخيارات": [
      {
        "النص": "تنظيم جلسات مشاركة معرفة يعرض فيها الأعضاء ذوو الخبرة مهاراتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تكليف الأعضاء الجدد بمهام تتجاوز مستواهم وتقديم دعم محدود.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطبيق برنامج توجيه رسمي بأهداف وهيكل اجتماعات محدد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تيسير مناقشات مفتوحة للفريق لتحديد ومعالجة التحديات الفردية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "عند إعداد قائمة أصحاب المصلحة، اكتشف مدير المشروع طرفًا مهتمًا لكنه لا يمتلك سلطة حقيقية. كيف يجب التعامل معه؟",
    "الخيارات": [
      {
        "النص": "إبقاؤه راضيًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إدارته عن كثب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراقبته.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إبقاؤه على اطلاع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يتغيب أحد أصحاب المصلحة في المشروع عن ورشات العمل المجدولة، وقد فوض المهام الموكلة إليه إلى عضو آخر من مجتمع أصحاب المصلحة. ما الذي يجب على مدير المشروع فعله لإشراك هذا الطرف؟",
    "الخيارات": [
      {
        "النص": "مراجعة أدوار ومسؤوليات جميع المشاركين مع صاحب المصلحة، كما هو محدد في ميثاق المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "شرح لصاحب المصلحة الفروق بين المهام الموكلة إلى كل عضو في الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من مدير البرنامج إبلاغ صاحب المصلحة ومطالبته بحضور الاجتماعات ذات الصلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إقران صاحب المصلحة بعضو فريق أكثر خبرة يعمل كموجه له.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء تنفيذ مشروع على وشك التأخر، يجب على مدير المشروع تشغيل معدات جديدة. يطلب طرفان محليان متأثران بإطلاق هذه المعدات وقف المشروع فورًا لأنهما لم يُمنحا الفرصة لتقديم الموافقة. كيف كان من الممكن لخطة إشراك أصحاب المصلحة أن تساعد في تجنب هذا الموقف؟",
    "الخيارات": [
      {
        "النص": "من خلال استخدام تقنيات إدارة النزاع الواردة في الخطة، كان بإمكان مدير المشروع الحصول على الموافقة من الأطراف المحلية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إدراج الأطراف المحلية في الخطة كان سيضمن توقيعهم على ميثاق المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "من خلال فهم توقعات الأطراف المحلية، كان بإمكان مدير المشروع استخدام تقنيات التفاوض المناسبة لإشراكهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "من خلال تحديد الأطراف المحلية كأصحاب مصلحة، كانوا سيُدرجون في الاتصالات ذات الصلة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "رفض صاحب مصلحة رئيسي الموافقة على المنتج لأنه لا يلبي التوقعات المحددة في نطاق المشروع. ما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "الخيارات": [
      {
        "النص": "جمع آراء أصحاب المصلحة طوال دورة حياة المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إجراء تقييمات للمخاطر بناءً على توقعات صاحب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطبيق تقنيات إدارة النزاع أثناء عملية التوقيع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إشراك صاحب المصلحة الرئيسي خلال مرحلة الاختبار.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يتطلب جدول المشروع أن يعمل فريقان في وقت واحد على أجزاء منفصلة من مشروع معقد. وتعتمد هاتان الجزئيتان على بعضهما البعض. يحتاج مدير المشروع إلى ضمان عدم حدوث تعارضات عند دمج مخرجات الفريقين. ما الإجراء الذي يجب على مدير المشروع اتخاذه أولًا لإدارة أي تعارض محتمل؟",
    "الخيارات": [
      {
        "النص": "تنظيم اجتماعات أسبوعية بين الفريقين لمراقبة أعمال بعضهما البعض.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعطاء أولوية لحل النزاعات في الجزء من المشروع الواقع على المسار الحرج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة سجل الدروس المستفادة لتوقّع التعارضات المحتملة والتخطيط لحلها.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إشراك أصحاب المصلحة لضمان دعمهم عند ظهور تعارضات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل مدير المشروع على إعداد ميثاق المشروع، لكن أحد أصحاب المصلحة الرئيسيين لا يقدم معلومات حول الفوائد المتوقعة من المشروع. لماذا يجب على مدير المشروع الاجتماع مع راعي المشروع في هذه الحالة؟",
    "الخيارات": [
      {
        "النص": "راعي المشروع هو المسؤول الرئيسي عن إدارة المعرفة الضمنية والصريحة في المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "راعي المشروع هو الشخص القادر على معالجة القضايا السياسية والاستراتيجية الداخلية التي قد تؤثر على جودة المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "راعي المشروع يمكنه طلب تغيير في مجتمع أصحاب المصلحة من خلال مجلس التحكم في التغيير (CCB).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الإجراءات التأديبية المرتبطة بأصحاب المصلحة يديرها راعي المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحل متدرب محل مورد حرج في منتصف دورة Sprint. ولمساعدة المتدرب على الاندماج، يكلّفه مدير المشروع بمهندس كبير ليعمل كموجه. بعد شهرين، يدخل المشروع في حالة حرجة، ما يؤخر إطلاق المنتج لمدة شهر. ما الذي كان يجب على مدير المشروع فعله لتجنب هذا السيناريو؟",
    "الخيارات": [
      {
        "النص": "إقناع المورد الحرج بالبقاء في المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب مورد بديل ذو خبرة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التفاوض على وقت إضافي لاستكمال المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تخصيص وقت إضافي لعملية التوجيه والإرشاد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "انضم مدير مشروع جديد إلى مشروع أثناء تسليم معلم رئيسي حرج. المشروع يحتوي على عدة أصحاب مصلحة، ولكل منهم مستوى مختلف من الاهتمام. يحتاج مدير المشروع إلى تحديد مقدار التفاصيل التي يجب تقديمها لأصحاب المصلحة بخصوص التسليم. إلى أي وثيقة يجب أن يرجع مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "خطة إدارة الاتصالات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سجل أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إشراك أصحاب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء مراجعة مشروع، أبلغ مدير البناء أن معدل إنتاج الخرسانة تغير خلال الأشهر الثلاثة الماضية. ويرغب في معرفة ما يمكن توقعه خلال الأشهر الثلاثة القادمة. ما نوع التحليل الذي يجب إجراؤه؟",
    "الخيارات": [
      {
        "النص": "تحليل القيمة المكتسبة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل المسار الحرج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل الاتجاه.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحليل التكلفة مقابل الفائدة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "بعد اجتماع مراجعة، كرر المسؤول عن Scrum أهمية الجودة، مع التركيز على تكلفة التغيير. أي مما يلي **لا** يشير إليه المسؤول؟",
    "الخيارات": [
      {
        "النص": "تقليل دورة معالجة العيوب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إصلاح العيوب التي تم اكتشافها بعد التسليم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "دعم المزيد من الميزات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تقليل الديون التقنية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "حدد مدير المشروع أن العمل الذي بدأ به الفريق غير متوافق مع اللوائح التنظيمية الخاصة بالصناعة. ما الذي يجب على مدير المشروع تحديثه؟",
    "الخيارات": [
      {
        "النص": "أصول العمليات التنظيمية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "بيانات أداء العمل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سجل القضايا.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير المشروع مشروعًا بنهج أجايل (Agile) وقد تم تحديد العديد من المخاطر في سجل المخاطر. تتعامل الدورة الحالية مع جانب حرج من المشروع. أثناء الدورة، وقع أحد المخاطر المحددة مما أوقف التطوير. قام مدير المشروع بتسجيل وقوع الخطر. ما الإجراء التالي الذي يجب اتخاذه؟",
    "الخيارات": [
      {
        "النص": "زيادة وتيرة الاتصالات والاستفادة من أصحاب المصلحة للمساعدة في حل المشكلات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تعيين أحد كبار أعضاء الفريق مسؤولًا عن خطة إدارة الاتصالات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "دعوة أصحاب المصلحة للاجتماع الرجعي التالي وإبلاغهم بالمشكلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تأجيل تطوير الجزء الحرج إلى الدورة التالية والعمل على عناصر من قائمة الأعمال المؤجلة (Backlog).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يغادر عضو رئيسي في الفريق المؤسسة في منتصف المشروع. ما الذي يجب على مدير المشروع فعله أولاً؟",
    "الخيارات": [
      {
        "النص": "الاجتماع مع أعضاء الفريق المتبقين لإعادة توزيع عبء العمل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "العمل مع المدير الوظيفي لإيجاد بديل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييم أثر خسارة هذا العضو على المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعادة تقييم أدوار الفريق وتكوينه.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "خلال جلسة مراجعة أجايل (Agile Retrospective)، أشار عدة أعضاء في الفريق إلى أنهم شعروا بالارتباك بشأن تقدم الدورة. ما الذي يجب على مدير المشروع فعله لتفادي هذا الارتباك؟",
    "الخيارات": [
      {
        "النص": "إرشاد الفريق لمراجعة لوحة الدورة (Iteration Board).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعداد تقرير حالة يومي ومشاركته مع الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مطالبة الفريق بمراجعة تقرير قائمة الدورة (Iteration Backlog).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "معالجة المشكلة في جلسة المراجعة التالية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل مدير المشروع على مشروع جديد لتطوير برمجيات وقد التقى بالعميل لمناقشة المتطلبات. قدم العميل قائمة بالمتطلبات، لكنه لم يميز بين المتطلبات التقنية ومتطلبات العميل. أي من المتطلبات التالية يُعد متطلبًا من متطلبات العميل؟",
    "الخيارات": [
      {
        "النص": "يجب أن يكون البرنامج قادرًا على معالجة 1000 معاملة في الثانية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يجب أن يستخدم البرنامج خوارزمية تشفير آمنة لقاعدة البيانات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يجب أن يعمل البرنامج على أنظمة تشغيل متعددة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يجب أن يكون البرنامج سهل الاستخدام والتنقل.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء اختبار قبول أحد المخرجات، اشتكى بعض أصحاب المصلحة الكبار من أن ميزة أساسية لقسمهم لم تُدرج. ما الذي كان يجب على مدير المشروع فعله لتفادي ذلك؟",
    "الخيارات": [
      {
        "النص": "الرجوع إلى الدروس المستفادة من مشاريع مشابهة لتكييف العمليات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إعداد خطة لإدارة التغيير وتوثيق التغييرات أثناء تنفيذ المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل ميثاق المشروع وتطوير خطة إدارة النطاق.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعداد نموذج أولي وعرض المنتج على أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم تعيين مدير مشروع جديد لمشروع في مرحلة التنفيذ. وأثناء مراجعة هيكل تقسيم العمل (WBS)، اكتشف المدير أن بعض المخرجات قد تم تجاهلها. يحتاج مدير المشروع إلى التأكد من عدم استبعاد أي عمل من نطاق المشروع وعدم تنفيذ عمل زائد. ما الخطوة التالية التي يجب اتخاذها؟",
    "الخيارات": [
      {
        "النص": "إضافة العمل إلى هيكل WBS وإعادة حساب مقاييس المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "سؤال أصحاب المصلحة عمّا إذا كان ينبغي إدراج هذه المخرجات في WBS.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "دمج المخرجات ذات المستوى الأدنى ضمن أعمال ذات مستوى أعلى موجودة بالفعل في WBS.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "بدء طلب تغيير من خلال مكتب إدارة المشروع (PMO).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثار راعي المشروع تساؤلات حول ما إذا كانت بعض القدرات المفصلة في تصميم المنتج تتطابق مع النطاق وفقًا لميثاق المشروع. ما الأداة التي يجب على مدير المشروع استخدامها لإدارة هذا؟",
    "الخيارات": [
      {
        "النص": "الحكم الخبير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مصفوفة تتبع المتطلبات (Requirements Traceability Matrix).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "النموذج الأولي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مخطط السياق (Context Diagram).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يستخدم مدير المشروع نهج التسليم المرن (Agile) في المشروع. ومع ذلك، لا يمتلك أعضاء الفريق وأصحاب المصلحة خبرة في طرق تحديد أولوية المتطلبات. ويريد مدير المشروع التأكد من أن المتطلبات الحرجة يتم تخطيطها وتسليمها. ما التقنية التي يجب أن يستخدمها مدير المشروع لتحديد الأولويات؟",
    "الخيارات": [
      {
        "النص": "أخذ آراء جميع أعضاء الفريق وأصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "استخدام نموذج رياضي يتم الاتفاق عليه من قِبل الفريق وأصحاب المصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "جمع احتياجات الفريق وأصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الوصول إلى فهم مشترك مع أعضاء الفريق وأصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "قام مدير وظيفي بإجراء تغييرات على المشروع خارج الخطة الإدارية المتفق عليها، كما تواصل مؤخرًا مباشرة مع راعي المشروع لطلب تغيير إضافي. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "تحديد ما إذا كان يجب على لجنة التحكم في التغيير (CCB) مراجعة التغييرات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إبلاغ المدير الوظيفي بأن جميع التغييرات يجب أن تمر عبر عملية التحكم بالتغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطة إدارة المشروع للسماح بالمرونة في إجراءات التحكم بالتغيير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع راعي المشروع لمناقشة تفاصيل التغييرات المطلوبة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "قامت لجنة التحكم بالتغيير (CCB) مؤخرًا بتقييم والموافقة على عدة طلبات تغيير بسرعة. ولكن تنفيذ هذه التغييرات يستغرق وقتًا أطول من المتوقع. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "تعديل نظام التحكم في التغيير للسماح فقط بالتغييرات الحرجة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الحصول على موارد إضافية لضمان الوفاء بالمواعيد النهائية للمشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل مخاطر مفصل لتحديد تأثير مدة تنفيذ التغييرات على نجاح المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراقبة تنفيذ التغييرات للتأكد من اتباع إجراءات إدارة التغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "اكتشف مدير مشروع لمشروع معقد أن أحد أعضاء الفريق لم يحقق عدة أهداف. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "التحقق مما إذا كان العضو مشاركًا في مشروع آخر في نفس الوقت.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "فرض عقوبة عن كل يوم يتأخر فيه عن تحقيق الأهداف.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من المدير الوظيفي للعضو معالجة المسألة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مناقشة المشكلة مع العضو وعرض تقديم المساعدة إذا لزم الأمر.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "اكتشف مدير مشروع يعمل على مشروع بنهج أجايل أن الميزانية والموارد المخصصة غير كافية لتغطية التكلفة الكلية المقدّرة. أوصى مكتب إدارة المشاريع (PMO) بوضع نموذج لتحديد أولوية المتطلبات. ما الذي يجب أن يأخذه مدير المشروع بعين الاعتبار في هذا النموذج؟",
    "الخيارات": [
      {
        "النص": "التكلفة، والمخاطر المرتبطة، وثقافة الشركة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المخاطر المرتبطة وثقافة الشركة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التكلفة والمخاطر المرتبطة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "معوقات التكلفة المرتبطة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل مدير مشروع على مشروع هجين. أداء الفريق متدهور وقد أشار العديد من أعضاء الفريق إلى أن أحد أصحاب المصلحة يمثل عائقًا دائمًا. حيث يطلب باستمرار تحديثات من الفريق ويحاول إدخال تغييرات على المشروع مباشرةً من خلالهم. كيف يمكن لمدير المشروع تحسين أداء المشروع؟",
    "الخيارات": [
      {
        "النص": "تحديد صاحب المصلحة كمصدر مخاطرة في سجل المخاطر والعمل مع الفريق على استراتيجية تخفيف.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مطالبة الفريق بتوجيه جميع الطلبات من صاحب المصلحة إلى مدير المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "العمل مع مكتب إدارة المشاريع (PMO) لإزالة صاحب المصلحة من المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع راعي المشروع لمعالجة وإزالة المعوقات والعوائق أمام الفريق.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل فريق على مشروع باستخدام نهج هجين، ويواجه العديد من العوائق والعقبات من بعض أصحاب المصلحة. ما الذي يجب أن يفعله مدير المشروع لتحسين أداء المشروع؟",
    "الخيارات": [
      {
        "النص": "إضافة العوائق إلى سجل القضايا وخطة إدارة المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مطالبة أصحاب المصلحة بالتواصل مع مدير المشروع فقط وعدم التواصل المباشر مع الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تمكين أعضاء الفريق من إزالة العقبات بأنفسهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "معالجة وإزالة العوائق والعقبات التي تواجه الفريق.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم تعيين مدير مشروع جديد لفريق عالمي، ويجب على الفريق خلال الأيام القادمة إعداد هيكل تقسيم الموارد (RBS) للمشروع. ومع ذلك، تنص خطة إدارة الموارد على أن RBS يجب أن يتم إنشاؤه ومراجعته فقط في بداية المشروع. ما الخطوة الأولى التي يجب على مدير المشروع اتخاذها؟",
    "الخيارات": [
      {
        "النص": "تحديث خطة إدارة الموارد.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحديث خطة إدارة المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث هيكل تقسيم الموارد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديث هيكل تقسيم العمل (WBS).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقوم فريق المشروع بتحديد الشهادات والكفاءات التقنية والناعمة للأشخاص والآلات وبرمجيات التصور المتقدمة ومحطات العمل للأطباء وغيرها من الإمدادات لمشروع معقد يجب تنفيذه خلال 5 أشهر. إذا استخدم الفريق هيكل تقسيم الموارد (RBS)، كيف سيساعد ذلك في تنظيم وتصور الموارد؟ (اختر ثلاثة)",
    "الخيارات": [
      {
        "النص": "حسب التسلسل الهرمي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "حسب المصدر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "حسب الفئة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "حسب النوع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "حسب الاسم الأخير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تأخر مشروع بسبب توفر الموارد، مما يعرض ميزانيته للخطر. ما الوثيقة التي يجب على مدير المشروع استخدامها لمراجعة وتحديث الموارد؟",
    "الخيارات": [
      {
        "النص": "مصفوفة تتبع المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "هيكل تقسيم العمل (WBS).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "هيكل تقسيم الموارد (RBS).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مصفوفة تعيين المسؤوليات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "حدد مدير المشروع وجود تعارضات بين أعضاء الفريق المحليين والافتراضيين في فهمهم للمخرجات. كيف يمكن لمدير المشروع حل هذه التعارضات؟",
    "الخيارات": [
      {
        "النص": "مطالبة راعي المشروع بالاجتماع مع الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التعاون مع أعضاء الفريق لمعالجة هذه التعارضات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "استضافة جلسة وساطة تحقق قدرًا من الرضا لجميع أعضاء الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "التركيز على نقاط الاتفاق بدلاً من نقاط الخلاف.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "المشروع متقدم قليلًا عن الجدول الزمني. ومع ذلك، تم إبلاغ مدير المشروع بأن مخرجًا حرجًا لن يكون متاحًا في الوقت المحدد. إذا تمكن مدير المشروع من تسريع العمل المتأخر، فما التأثير المتوقع؟",
    "الخيارات": [
      {
        "النص": "ستنجم مشكلات تتعلق بضمان المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "ستنخفض التكاليف والمخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "سترتفع التكاليف والمخاطر.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "سيتم تنفيذ أعمال إعادة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "لدى مشروع جدول زمني أساسي معتمد مدته 180 يومًا وميزانية أساسية قدرها 250,000 دولار أمريكي. بعد 21 يومًا، تم إنفاق 60,000 دولار وتم تحقيق قيمة مكتسبة قدرها 75,000 دولار. ما هو مؤشر الأداء التكلفي (CPI) لهذا المشروع؟",
    "الخيارات": [
      {
        "النص": "0.8",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "0.75",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "1.25",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "1.02",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن مديرًا وظيفيًا قام بتكليف عضو من الفريق بمهمة لمدة أسبوعين في مشروع آخر، مما قد يعرض الجدول الزمني للمشروع للخطر. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "مراجعة خطة إدارة الموارد لتحديد كيفية التفاوض مع المدير الوظيفي.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB) للحصول على مورد بديل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع راعي المشروع لمناقشة أولويات المشروعين.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعيين عضو آخر من الفريق للقيام بعمل العضو الغائب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "ما الوثيقة التي يجب على مدير المشروع الرجوع إليها لتخصيص الموارد لمشروع؟",
    "الخيارات": [
      {
        "النص": "الحكم الخبير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مصفوفة RACI.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة الموارد.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "متطلبات الموارد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقود مدير مشروع عملية تحول في شركة تواجه تحديات مالية كبيرة نتيجة تراجع حصتها السوقية. يبدي أصحاب المصلحة شكوكًا حيال الحاجة للتغيير ويترددون في الاستثمار بالمشروع. ما الذي يجب على مدير المشروع فعله لإظهار أهمية وفوائد التغيير؟",
    "الخيارات": [
      {
        "النص": "إنشاء خطة اتصال مفصلة تتضمن الأهداف والمعالم والفوائد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تفويض المهام وتوفير الموارد الضرورية لأعضاء الفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "عقد اجتماعات منتظمة مع أصحاب المصلحة لإطلاعهم ومعالجة تساؤلاتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تطوير دراسة جدوى تكمية فوائد المشروع وربطها بأهداف الشركة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تقوم شركة بتطوير منتج ثوري في سوق تنافسية وسريعة التطور. يدرك مدير المشروع أنه بسبب البيئة التنافسية، من المرجح أن تتغير 'تعريف الانتهاء' (DoD). ما الذي يجب أن يفعله مدير المشروع لضمان تقديم قيمة ناجحة؟",
    "الخيارات": [
      {
        "النص": "تنفيذ إجراءات قوية لتتبع وتقرير تقدم المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "توسيع الجدول الزمني والميزانية لمواجهة المخاطر المحتملة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تخصيص موارد إضافية لتسريع تطوير المنتج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييد نطاق المشروع والتركيز على الالتزام بالمواعيد النهائية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "طلب أحد أصحاب المصلحة الرئيسيين إضافة ميزات جديدة إلى المنتج أثناء تنفيذ المشروع، وأصر على أن هذه الميزات ستضيف قيمة. ما الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "الاجتماع مع راعي المشروع لمناقشة فوائد الميزات الجديدة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة خطة إشراك أصحاب المصلحة لتحديد مستوى مشاركة صاحب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقييم ومراجعة تأثير التغييرات على ميزانية المشروع وجدوله.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تنفيذ التغيير وتوثيقه في سجل الدروس المستفادة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "مدير مشروع جزء من مشروع كبير لتحول الأعمال. الهدف الرئيسي من المشروع هو زيادة الإنتاج وإنشاء قدرة لإطلاق منتجات جديدة في السوق. لاحظ مدير المشروع أثناء استراحة الغداء أن الموظفين يتحدثون عن التغييرات ويشعرون بالخوف من أن تؤدي إلى تسريحهم، رغم أن ذلك غير صحيح. ما هي الجهات التي يجب على مدير المشروع التواصل معها لمعالجة هذه المخاوف وضمان تحقيق أهداف المشروع؟ (اختر 3)",
    "الخيارات": [
      {
        "النص": "قسم الموارد البشرية (HR) لطلب الدعم في معالجة المشكلة",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مدير التغيير لتعديل خطة إدارة الاتصال",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المديرون الوظيفيون للموظفين لتضمين المشكلة في تقييم الأداء",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المديرون الوظيفيون للموظفين لطلب الدعم في شرح التغيير",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الراعي لطلب دعم تنفيذي وتعزيز التوضيح",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "في مرحلة تنفيذ المشروع، تلقى مدير المشروع خبرًا بأن قائد فريق سيغادر المنظمة. تم إعلام راعي المشروع بذلك واقترح بديلاً. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "تحديد مستوى كفاءة المورد المقترح.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة الخطط الأساسية للمشروع لتقييم تأثير التغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "توثيق التغيير وفقًا لخطة إدارة التغيير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطة إدارة الاتصالات لتعكس التغيير.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء تطوير خطة إدارة المشروع، أغفلت الفريق مكونًا أساسيًا مطلوبًا للمنتج. قام الفريق بوضع حل بديل بسرعة، ولكن خلال مراجعة التوافق مع الجودة، قرر مكتب إدارة المشاريع (PMO) أن الحل البديل غير فعال. ماذا يجب على مدير المشروع أن يفعل؟",
    "الخيارات": [
      {
        "النص": "تصميم نموذج معدل للحل البديل يتضمن تعديلًا جديدًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة مصفوفة تتبع المتطلبات لتحديد القيمة التجارية للمكون المفقود.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "اتباع عملية التحكم المتكاملة بالتغيير الرسمية وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إجراء تحليل نوعي للمخاطر لتقييم تأثير تصميم بديل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "مشروع تطوير برمجيات في مرحلة الاختبار. فرض تنظيم حكومي جديد تقديم وثائق إضافية ضمن العقد. ما الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "إنهاء المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تقديم طلب تغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تحديث التوقعات الزمنية للجدول الزمني.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة ميزانية المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "طلب ممثل العميل من مدير المشروع ميزة جديدة في المنتج. ما الوثيقة التي يجب أن يرجع إليها مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "خطة إدارة النطاق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إدارة التغيير.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مصفوفة RACI.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مصفوفة تتبع المتطلبات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقود مدير مشروع مشروعًا كبيرًا لتحول الأعمال يشمل المنظمة بالكامل. يعمل على إعداد خطة إدارة الاتصالات. ما العنصران اللذان يجب مراعاتهما عند التخطيط للاتصالات؟ (اختر 2)",
    "الخيارات": [
      {
        "النص": "الرسائل الأساسية",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الأهداف والقيم",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "جمع التغذية الراجعة",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "قنوات اتصال متعددة",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "أفضل قناة اتصال",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "أثناء مرحلة تخطيط المشروع، أهمل أصحاب المصلحة توثيق ميزة أساسية في النظام. لاحظ العميل هذا الإغفال خلال المراجعة الأولية للمخرجات. ماذا يجب على مدير المشروع أن يفعل؟",
    "الخيارات": [
      {
        "النص": "مراجعة خطة إدارة المشتريات لتحديد ما إذا كان يمكن إضافة الميزة إلى المخرجات النهائية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد تأثير الإغفال وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "طلب من راعي المشروع الموافقة على خصم سعر للعميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "العمل مع العميل للاتفاق على سعر جديد يعوض عن الإغفال.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "بعد مراجعة خطة إدارة المشروع مع أصحاب المصلحة الرئيسيين، أُبلغ مدير المشروع أن خطة الإصدار لمدة 18 شهرًا غير مقبولة ويجب إطلاق المنتج خلال ستة أشهر. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
    "الخيارات": [
      {
        "النص": "تحليل تأثير تقليص الجدول الزمني على نطاق المشروع والميزانية والموارد.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إعادة التفاوض على نطاق المشروع لتقليل العمل المطلوب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "توظيف موارد إضافية للمساعدة في إنجاز المشروع في الوقت المحدد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "العمل مع أصحاب المصلحة للاتفاق على تاريخ إصدار جديد أكثر واقعية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "مشروع يضم سبعة شركاء بدأ يتأخر عن الجدول الزمني. قررت اللجنة التوجيهية تسريع جهود حل النزاعات وطلبت من مدير المشروع إزالة شرط التنازلات من جميع الأطراف. ماذا يجب على مدير المشروع أن يفعل؟",
    "الخيارات": [
      {
        "النص": "إلغاء تقنية الانسحاب/التجنب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إلغاء تقنية التهدئة/الاستيعاب.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إلغاء تقنية الفرض/التوجيه.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إلغاء تقنية التوفيق/الحل الوسط.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعمل مدير مشروع على مشروع برمجي معقد، ويجب على عضوين من الفريق التعاون على وحدة حرجة. سرعان ما بدأ العضوان في الجدال مما أثر على التقدم. كيف يجب على مدير المشروع معالجة هذا النزاع؟",
    "الخيارات": [
      {
        "النص": "تجاهل النزاع وأمل أن يتمكنا من حله بنفسيهما.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعيين كل عضو لمهام منفصلة لتجنب المزيد من النزاعات.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "جدولة اجتماع جماعي لمناقشة المشكلة علنًا والوصول إلى حل.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "نقل أحد العضوين إلى مشروع آخر لإزالة النزاع تمامًا.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "خلال اجتماع مع أصحاب المصلحة، وقع خلاف بين اثنين منهم حول كيفية تطوير مكون برمجي، وارتفعت أصواتهم. ماذا يجب على مدير المشروع أن يفعل في هذه الحالة؟",
    "الخيارات": [
      {
        "النص": "إنهاء الاجتماع والاجتماع مع بقية أصحاب المصلحة لتحديد كيفية المتابعة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديد سبب الخلاف، محاولة تهدئة الموقف والتركيز على إيجاد حل مشترك.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تدوين مواقف الطرفين بالتفصيل وطلب تصويت من بقية أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إبلاغ الراعي بالمشكلة وطلب إيجاد حل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يؤدي مدير المشروع دور scrum master في مشروع هجين ويواجه نزاعًا بين أعضاء الفريق. ما هي الاستراتيجية الأنسب لمعالجة النزاع؟",
    "الخيارات": [
      {
        "النص": "وضع النزاعات في قائمة مرئية مشتركة للفريق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تصنيف النزاعات إلى مجموعتين: إيجابية وسلبية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراجعة النزاعات خلال اجتماع الوقوف اليومي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تنظيم النزاعات إلى فئتين: هيكلية وشخصية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن الفريق يواجه نزاعًا مستمرًا مع فريق المورد الخارجي، مما بدأ يؤثر على أداء الفريق. بعد مراجعة ميثاق الفريق، ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "الاجتماع مع مدير فريق المورد شخصيًا لإيجاد حل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تنظيم اجتماع افتراضي مع فريق المورد لمعالجة النزاع وحله.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "إرسال نسخة من اتفاقية الشراء إلى مدير فريق المورد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إرسال بريد إلكتروني يشرح المشكلة ويطلب ردًا من مدير فريق المورد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "خلال مرحلة التخطيط الأولية لمشروع تطوير معقد، حدد فريق المشروع العديد من أصحاب المصلحة، بما في ذلك راعي المشروع، والمستخدمين النهائيين، والجهات التنظيمية، وفريق التطوير. ماذا يجب أن يفعل مدير المشروع لضمان فهم شامل لمستوى تأثير هؤلاء أصحاب المصلحة على متطلبات المشروع؟",
    "الخيارات": [
      {
        "النص": "إجراء مقابلات فردية مع كل صاحب مصلحة لجمع مدخلاتهم وتفضيلاتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إرسال استبيان إلى أصحاب المصلحة لجمع ملاحظاتهم حول متطلبات المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "عقد ورشة عمل مع أصحاب المصلحة لمناقشة وتحديد أولويات متطلبات المشروع بشكل جماعي.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مراجعة وثائق المشاريع السابقة لتحديد أنماط تأثير أصحاب المصلحة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "تم إلغاء مشروع التحول الرقمي السابق بسبب عدم توافق العمليات التجارية مع قسم المحاسبة. سيتم البدء بمشروع مماثل قريبًا، وسيتم التخطيط لنشاط مواءمة العمليات لتحديد تغييرات النطاق المحتملة. ماذا يجب أن يفعل مدير المشروع لضمان اتباع نهج تعاوني وتدريجي في أعمال المواءمة؟",
    "الخيارات": [
      {
        "النص": "تحديد فريق خبراء خارجي للبحث وتطبيق أفضل الممارسات في التكيف مع التحول الرقمي.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تخطيط نشاط مبكر لمدة أسبوعين تعمل خلاله الوحدات المتأثرة معًا لتكييف العمليات التجارية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تخطيط لتكرارات مبكرة في المشروع تسمح لأصحاب المصلحة المتعددين بالاتفاق على خطوات تعديل العمليات.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تخطيط لتكرارات متأخرة في المشروع لتعديل العمليات بناءً على الأعمال المنجزة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "عند إتمام مدير المشروع لعملية تحديد أصحاب المصلحة، ما هو الناتج الرئيسي لهذه العملية؟",
    "الخيارات": [
      {
        "النص": "سجل يحتوي على الاسم، مجال الاهتمام، ومستوى التأثير الإيجابي أو السلبي لكل صاحب مصلحة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "وثيقة تحتوي على طلبات تغيير للمنتج أو خطة إدارة المشروع أو مستندات المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "خطة إشراك أصحاب المصلحة تحدد الاستراتيجيات والإجراءات المطلوبة لتعزيز مشاركتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحديثات على مستندات المشروع مثل سجل الافتراضات وسجل القضايا وسجل المخاطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحضر مالك المنتج الاجتماعات اليومية، لكنه يركز فقط على الميزانية وتكاليف كل دورة. عند معالجة استفساراته، يشرح مدير المشروع مبررات الإنفاق وتأثيرها على تطوير المنتج، لكن المالك لا يهتم إلا بالمبلغ المصروف. ما الذي يجب على مدير المشروع فعله؟",
    "الخيارات": [
      {
        "النص": "تعديل الاجتماعات اليومية للبدء بمناقشة الميزانية ثم مناقشة حالة المشروع بعد مغادرة المالك.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل خطة إدارة الاتصالات لإرسال تحديثات يومية عن الميزانية إلى مالك المنتج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع مالك المنتج لتوعيته بقيمة المشروع وليس فقط تكلفته.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تفصيل الميزانية حسب الإنفاق اليومي وتقديمها لمالك المنتج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "حدد فريق التسويق الجمهور المستهدف لموقع الشركة الجديد. هذا الجمهور متنوع وموزع جغرافيًا، ويرغب الفريق بجمع تحليل إحصائي بسرعة. ما الأداة أو التقنية التي يجب على مدير المشروع استخدامها؟",
    "الخيارات": [
      {
        "النص": "مجموعات التركيز.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "استبيان.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مقابلة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تحليل المقارنة المرجعية (Benchmarking).",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يعاني أصحاب المصلحة في مشروع متعدد الجنسيات من سوء فهم ثقافي. أدى تفسير ثقافي خاطئ بسيط في مرحلة التخطيط إلى عدم الموافقة على خطة إدارة المشروع. ماذا كان يجب على مدير المشروع أن يفعل لتفادي هذا الموقف؟",
    "الخيارات": [
      {
        "النص": "مراجعة سجل الدروس المستفادة لفهم الأخطاء الثقافية السابقة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "البحث عن الأخطاء الثقافية الشائعة عند التعامل مع أصحاب المصلحة في تلك الدول.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مراقبة التواصل المباشر وغير المباشر خلال اللقاءات الأولية لتقليل احتمال حدوث سوء الفهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "عقد ورشة عمل مع أصحاب المصلحة قبل الاجتماع الأول لتطوير لغة تواصل مشتركة.",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "كيف يمكن لمدير المشروع زيادة احتمال نجاح المشروع؟",
    "الخيارات": [
      {
        "النص": "المبالغة في تقدير كفاءة الموارد المطلوبة لتنفيذ المشروع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الحصول على دعم أصحاب المصلحة منذ البداية.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تغيير أعضاء لجنة الحوكمة بشكل مستمر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إنشاء احتياطي كبير في الميزانية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
  "النوع": "اختيار من متعدد",
  "النص": "تتعاقد شركة مع مزود برمجيات لتنفيذ وتخصيص تطبيق برمجي جديد وتعيّن مدير مشروع لبدء وقيادة المشروع. أي من المدخلات التالية إلى ميثاق المشروع تصف النتائج الرئيسية المتوقعة؟",
  "الخيارات": [
    {
      "النص": "دراسة الجدوى",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الاتفاقيات",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "بيان نطاق المشروع",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "جدول المشروع",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "بعد الانتهاء من ميثاق المشروع، يرسله مدير المشروع إلى أصحاب المصلحة. ما الذي يجب على مدير المشروع فعله قبل بدء عملية تخطيط المشروع؟",
  "الخيارات": [
    {
      "النص": "عقد اجتماع انطلاق المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تطوير سجل المخاطر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إنشاء هيكل تجزئة العمل (WBS).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الحصول على موافقة ميثاق المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "مدير مشروع جديد يقوم بتطوير خطة إدارة الموارد، لكنه غير ملم بمهارات الفريق المطلوبة لهذا المشروع. كيف يمكن أن يساعد إشراك الخبراء المتخصصين مدير المشروع في إعداد خطة إدارة الموارد؟",
  "الخيارات": [
    {
      "النص": "من خلال عرض كيفية تحديد الأصول التنظيمية للعمل.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من خلال مساعدة مدير المشروع على فهم العلاقات التنظيمية الموضحة في مخطط هيكل المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من خلال تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "من خلال تمكين مدير المشروع من إدارة الفرق الافتراضية ذات المهارات العالية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أثناء واحدة من عمليات التسليم النهائية لمشروع ما، أبلغ المستخدم النهائي قائد المشروع بعدم رضاه عن النتيجة وطلب إزالة أحد أعضاء الفريق الذي تسبب في النتيجة غير المرغوبة.nnما الذي يجب على قائد المشروع فعله؟",
  "الخيارات": [
    {
      "النص": "الاعتراف بالمشكلة، والوعد للمستخدم النهائي بأن المشكلة سيتم حلها.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ المستخدم النهائي بأن العضو هو عنصر رئيسي، والوعد بحل المشكلة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إزالة عضو الفريق حسب الطلب لتجنب تأخير القبول.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مناقشة المشكلة خلال اجتماع التغذية الراجعة الدوري لأصحاب المصلحة واتخاذ إجراء لمعالجتها.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في مشروع هجين، متى يجب تقديم التغذية الراجعة؟",
  "الخيارات": [
    {
      "النص": "يعتمد توقيت التغذية الراجعة على خطة قياس الأداء التي يحددها قائد المشروع في بداية المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مدير المشروع مسؤول عن إيصال التغذية الراجعة أثناء الاجتماعات الداخلية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مع كل تسليم، يجب على قائد المشروع الحصول على تغذية راجعة من أصحاب المصلحة ومشاركتها مع الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من أجل الأداء الفعّال للفريق، يتم تقديم التغذية الراجعة بشكل منتظم ومستمر.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أثناء بيئة تسليم مستمر، يلاحظ قائد المشروع أن أحد أعضاء الفريق الرئيسيين يعاني من تدني الروح المعنوية، مما يؤثر على تسليم المشروع ويتسبب في تأخير كبير في جدول المشروع. وعند مناقشة المشكلة مع العضو، يكتشف القائد أن السبب هو الغموض في معايير مراجعة الأداء.nnما الذي كان ينبغي على قائد المشروع فعله لتفادي هذا الموقف؟",
  "الخيارات": [
    {
      "النص": "شرح القواعد الأساسية للفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ الفريق بالحوافز والمكافآت.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مشاركة التغذية الراجعة ونتائج الأداء.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تحديد استراتيجيات بناء الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "بعد الانتهاء من ميثاق المشروع، يرسله مدير المشروع إلى أصحاب المصلحة في المشروع. ما الذي يجب على مدير المشروع فعله قبل بدء عملية تخطيط المشروع؟",
  "الخيارات": [
    {
      "النص": "عقد اجتماع انطلاق المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تطوير سجل المخاطر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إنشاء هيكل تجزئة العمل (WBS).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الحصول على موافقة ميثاق المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "مدير مشروع جديد يطور خطة إدارة الموارد، لكنه غير ملم بمجموعة المهارات المطلوبة للمشروع. كيف يمكن أن يساعد إشراك الخبراء المتخصصين (SMEs) مدير المشروع في إعداد خطة إدارة الموارد؟",
  "الخيارات": [
    {
      "النص": "من خلال عرض كيفية تحديد الأصول التنظيمية للعمل.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من خلال مساعدة مدير المشروع على فهم العلاقات السلطوية المحددة في هيكل تنظيم المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من خلال تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "من خلال تمكين مدير المشروع من إدارة الفرق الافتراضية من أصحاب المهارات العالية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "خلال واحدة من عمليات التسليم الأخيرة لمشروع ما، أبلغ المستخدم النهائي قائد المشروع بعدم رضاه عن النتيجة وطلب إزالة عضو من الفريق بسبب تأثيره السلبي. ماذا يجب أن يفعل قائد المشروع؟",
  "الخيارات": [
    {
      "النص": "الاعتراف بالمشكلة، والوعد بحلها.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ المستخدم النهائي بأن العضو هو عنصر رئيسي، والوعد بحل المشكلة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إزالة العضو كما طُلب لتجنب تأخير القبول.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مناقشة المسألة خلال اجتماع ملاحظات أصحاب المصلحة المنتظم واتخاذ إجراء لحلها.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في مشروع هجين، متى يجب تقديم التغذية الراجعة؟",
  "الخيارات": [
    {
      "النص": "يعتمد توقيت التغذية الراجعة على خطة قياس الأداء التي يحددها قائد المشروع في بداية المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مدير المشروع مسؤول عن توصيل التغذية الراجعة خلال الاجتماعات الداخلية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مع كل تسليم، من المفترض أن يتلقى قائد المشروع ملاحظات من أصحاب المصلحة ويشاركها مع الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "من أجل أداء فعّال للفريق، يتم تقديم التغذية الراجعة بانتظام وبشكل مستمر.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أثناء العمل في بيئة تسليم مستمر، يلاحظ قائد المشروع أن أحد الأعضاء الأساسيين في الفريق يعاني من انخفاض في المعنويات، مما يؤثر على تسليم المشروع ويتسبب في تأخير كبير في الجدول الزمني. وأثناء مناقشة المشكلة مع عضو الفريق، يكتشف قائد المشروع أن السبب يعود إلى عدم وضوح معايير تقييم الأداء. ماذا كان يجب على قائد المشروع أن يفعل لتفادي هذه الحالة؟",
  "الخيارات": [
    {
      "النص": "شرح القواعد الأساسية للفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ الفريق بالمكافآت والحوافز.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مشاركة التغذية الراجعة ونتائج الأداء.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تحديد استراتيجيات بناء الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل فريق التسويق على تطوير أفكار لإعادة تصميم منتج موجود. يتواصل المدير التنفيذي للتسويق مع مدير المشروع للتأكد من أن الإجراءات اللازمة متوفرة لضمان إطلاق ناجح. على ماذا يجب أن يركز مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "ضمان وجود خطة إدارة النطاق لتغطية جميع الأهداف ذات الصلة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ضمان أن الفريق يركز أيضًا على خطة إدارة التغيير الشاملة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التخطيط لتحديثات دورية للمشروع لتغطية حالة التسليمات الحرجة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحديد وتنسيق مؤشرات الأداء التي ستساعد في تقييم نجاح التسليم.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في مؤسسة وظيفية، تم تعيين محلل منتجات لمهمة تطوير تطبيق قصيرة المدة. أعرب المحلل عن قلقه وطلب من مدير المشروع دعم زميل يمتلك خبرة في هذا المجال. ماذا يجب أن يفعل مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "الاعتراف بمخاوف المحلل وإعادة تعيين المهمة لعضو آخر في الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تسجيل المحلل في برنامج لبناء القدرات والإبقاء عليه في المهمة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الطلب من المحلل استخدام مهاراته لتطوير الأداة، ثم نقل العمل إلى عضو آخر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ضمان عقد اجتماعات دورية بين المحلل والعضو الآخر طوال تنفيذ المهمة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "تم تعيين مدير مشروع جديد للعمل على مشروع نظام رعاية صحية معقد في ثلاث دول. يحتاج مدير المشروع إلى تفصيل جميع المتطلبات وتقدير كل مهمة لإعداد الجدول الزمني. ما هو النهج الذي يستخدمه مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "أجايل (Agile)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تقليدي (Traditional)",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "خيط فولاذي (Steel Thread)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "موجة متدحرجة (Rolling Wave)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أصبح أحد الموردين الأساسيين غير متاح، ووجد مدير المشروع بديلاً معتمدًا. ومع ذلك، فإن إدخال المورد الجديد سيضيف 10 أيام إلى الجدول الزمني. أحد أصحاب المصلحة لا يريد تمديد الجدول. يجب استخدام المورد الجديد للانتقال إلى مرحلة التنفيذ. ماذا يجب أن يفعل مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "الاجتماع مع صاحب المصلحة لشرح أن المورد الجديد سيزيد المدة الزمنية ولكنه سيحقق أهداف المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ صاحب المصلحة بأن الجدول الزمني الحالي سيتطلب تحديثات، والاستمرار بمراجعات دورية لمناقشة هذه التحديثات.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ صاحب المصلحة بتأخير الجدول لمدة 10 أيام، ولكن سيتم تسريع المهام على المسار الحرج.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ صاحب المصلحة أن استخدام المورد الجديد سيتطلب إعادة البدء في بداية مرحلة التخطيط التالية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يشعر مدير المشروع بعدم اليقين بشأن مدة مرحلة جديدة، فاستشار ثلاث مجموعات من الخبراء المختصين. المجموعة الأولى أوضحت أن المرحلة يمكن إنجازها في 20 يومًا. والمجموعة الثانية أشارت إلى بعض المخاطر التي قد تمدد المدة حتى 35 يومًا. أما المجموعة الثالثة فقد اقترحت نهجًا جديدًا يمكن أن يختصر المدة إلى 11 يومًا. ما هي المدة التقديرية للمرحلة الجديدة؟",
  "الخيارات": [
    {
      "النص": "19 يومًا",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "21 يومًا",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "23 يومًا",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "25 يومًا",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يوجد ثلاث حزم عمل رئيسية في مشروع تطوير منتج جديد. يجب تسليم الحزمة A قبل أسبوع من بدء الحزمة C، وستبدأ الحزمة C في نفس وقت بدء الحزمة B. ما هي العلاقة بين الحزمتين A و B؟",
  "الخيارات": [
    {
      "النص": "إنهاء إلى بدء (Finish-to-start)",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "إنهاء إلى إنهاء (Finish-to-finish)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "بدء إلى بدء (Start-to-start)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "بدء إلى إنهاء (Start-to-finish)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "تستخدم مؤسسة إدارة المشاريع نهج الشلال (Waterfall) في مرحلة جمع المتطلبات، ونهج أجايل (Agile) في مراحل التطوير والاختبار. لم يكن جميع أعضاء الفريق على دراية بكلا النهجين، مما أدى إلى تأخيرات بسبب عدم اليقين. ما الذي كان يجب فعله لتجنب هذا السيناريو؟",
  "الخيارات": [
    {
      "النص": "تدريب الفريق على فوائد إدارة المشاريع الهجينة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "توزيع الأدوار بحيث يتعامل من يعرف الشلال مع جمع المتطلبات، ومن يعرف أجايل مع التطوير والاختبار.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "جدولة اجتماعات وقوف يومية لإبقاء الفريق على اطلاع ومعالجة المشكلات فورًا.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "الطلب من مكتب إدارة المشاريع (PMO) اعتماد نهج واحد بسبب ضيق الوقت للتدريب.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في منتصف مشروع أجايل يتكون من 100 قصة مستخدم مقسمة إلى خمس تكرارات، تبلغ قيمة كل قصة مستخدم 50 دولارًا. وقد تم إنفاق 2000 دولار وتم تسليم 50 قصة مستخدم. ما العبارة الصحيحة؟",
  "الخيارات": [
    {
      "النص": "المشروع يتجاوز الميزانية ومتأخر عن الجدول.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "المشروع أقل من الميزانية وفي الوقت المحدد.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "المشروع ضمن الميزانية وفي الوقت المحدد.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "المشروع أقل من الميزانية ومسبق عن الجدول.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "تستخدم الشركة نهجًا تنبؤيًا (Predictive) لتطوير مكون محدد في خطة إدارة النطاق. وبسبب تغير اللوائح باستمرار، طلب فريق التطوير استخدام نهج أجايل. ما الذي يجب أن يفعله مدير المشروع حيال هذا الطلب؟",
  "الخيارات": [
    {
      "النص": "تصعيد الطلب للحصول على موارد مالية إضافية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحليل المتطلبات التي سيتم التعامل معها بموجب النهج المطلوب.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "إحالة الطلب إلى مكتب إدارة المشاريع (PMO) لتعديل الأصول التنظيمية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "طلب موافقة الراعي لتنفيذ النهج الجديد.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "من أجل تحديد العوامل المساعدة والمعيقة التي قد تؤثر على تسليم المشروع نتيجة للبيئة الخاصة بالمؤسسة، يقوم مدير المشروع بإجراء مسح بيئي. أي من المجموعات التالية تمثل بعض العوامل التي سيتم أخذها بعين الاعتبار في هذا المسح؟",
  "الخيارات": [
    {
      "النص": "القوانين واللوائح، اتجاهات السوق، والتكنولوجيا الجديدة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "البحوث المنشورة، والمقالات، والمجلات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الندوات، والمعارض، والمؤتمرات القادمة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التكنولوجيا الجديدة، الندوات، والويبينارات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أثناء عملية التصميم لمشروع بناء متعدد الجنسيات، أجرى مدير المشروع تحليل التكلفة والفائدة بناءً على أسعار صرف العملات الأجنبية الحالية. تم تسجيل مخاطر تغير أسعار الصرف في سجل المخاطر. خلال مرحلة تنفيذ المشروع، انخفض سعر الصرف بدرجة تجعل مدير المشروع يعتقد أن المشروع قد لا ينجح. ما الذي يجب على مدير المشروع القيام به كإجراء استباقي؟",
  "الخيارات": [
    {
      "النص": "تحديث خطة إدارة المخاطر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تصعيد المسألة إلى راعي المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تقديم طلب تغيير لزيادة الميزانية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إجراء تحليل جديد للتكلفة والفائدة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعبر أحد أصحاب المصلحة في مشروع هجين عن إحباطه من عدد اجتماعات مراجعة التكرارات التي يُتوقع حضوره لها. ماذا يجب أن يفعل مدير المشروع في هذه الحالة؟",
  "الخيارات": [
    {
      "النص": "تثقيف صاحب المصلحة حول منهجيات المشاريع الهجينة وكيف أن المراجعات المنتظمة تزيد من قيمة المنتج وتقلل من العمل الإضافي.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مناقشة مستوى المشاركة المفضل لصاحب المصلحة وتعديل خطة إشراك أصحاب المصلحة وفقًا لذلك.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إعداد اجتماع مع جميع أصحاب المصلحة لتحديد الاجتماعات التي يجب أن يحضرها كل منهم وتحديث خطة إشراك أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تسجيل ذلك في سجل المخاطر والعمل مع الراعي لتحديد الاستجابات المناسبة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يرغب مدير المشروع في تعيين عضو جديد في الفريق ليحل محل مهندس معماري استقال مؤخرًا. أي مستند يجب الرجوع إليه لهذا التغيير؟",
  "الخيارات": [
    {
      "النص": "سجل أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "خطة إدارة المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مصفوفة تعيين المسؤوليات (RAM).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الأصول التنظيمية للمؤسسة (OPA).",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "بعد الموافقة على المشروع، يتم تعيين فريق المشروع ويتم إعداد خطة إدارة المشروع. ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
  "الخيارات": [
    {
      "النص": "عقد اجتماع إطلاق المشروع (Kickoff) مع الفريق وأصحاب المصلحة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تطوير جدول زمني تفصيلي للمشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "بدء عمليات الشراء للموارد المطلوبة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إجراء مراجعات أداء فردية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يتكوّن فريق مشروع تم تشكيله حديثًا من أعضاء من عدة بلدان وقارات، مع وجود فروق كبيرة في الأعمار وتنوع في الخلفيات الاجتماعية. كيف يجب على مدير المشروع التعامل مع هذا التحدي؟",
  "الخيارات": [
    {
      "النص": "مساعدة الفريق على اكتشاف كيف يمكن لوجهات نظرهم المختلفة أن توسّع مهاراتهم وتعزز إنتاجية الفريق.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تعيين مندوب لكل مجموعة عرقية/اجتماعية للمساهمة في اتخاذ قرارات شاملة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إلزام جميع أعضاء الفريق بحضور دورة تدريبية افتراضية حول التنوع والشمول.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التخطيط للتدخل بسلطة إذا نشأت مواجهات بين أعضاء الفريق غير المتوافقين.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في المراحل المبكرة من المشروع، كان لدى اثنين من أصحاب المصلحة الرئيسيين آراء مختلفة بشأن أهداف المشروع. لماذا يجب على مدير المشروع التفاوض على اتفاق بين هذين الطرفين؟",
  "الخيارات": [
    {
      "النص": "لفهم قدرة أصحاب المصلحة على التأثير على اتجاه المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "للحصول على موافقة ميثاق المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "لإشراك أصحاب المصلحة في حل النزاع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "للسماح لأصحاب المصلحة بمناقشة آرائهم في اجتماع بدء المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "مشروع لتصميم وتطوير معدات جديدة في مرحلة التخطيط. لا يمتلك الفريق خبرة كافية بالميزات والوظائف الجديدة للمعدات، لذلك تلقوا تدريبًا عليها. كيف يمكن لمدير المشروع تعزيز فعالية أنشطة التدريب الخاصة بالفريق؟",
  "الخيارات": [
    {
      "النص": "دعوة خبير موضوع لشرح كيفية استخدام الميزات والوظائف للفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إدراج التوجيه من زميل لزميل ضمن خطة التدريب حول الميزات والوظائف الجديدة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "جدولة عرض توضيحي للميزات والوظائف كجزء من أنشطة التدريب.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تعيين مدير وظيفي للعمل مع الفريق للتأكد من فهمهم للميزات والوظائف.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "في كافيتيريا الشركة، يسمع مدير المشروع أحد أصحاب المصلحة غير المنخرطين يسخر من أسلوب اللغة المستخدم في تقرير حالة المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
  "الخيارات": [
    {
      "النص": "الاجتماع مع صاحب المصلحة على انفراد لمعرفة كيفية جعل التواصل أكثر جاذبية له.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "طلب نصائح من مسؤول العلاقات العامة حول كيفية جعل التقارير المكتوبة أكثر جذبًا.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إيقاف إرسال تقارير الحالة لهذا الشخص والاكتفاء بالتواصل عبر البريد الإلكتروني المباشر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحديث العقد الاجتماعي للمشروع لحظر التصريحات غير المحترمة بحق أعضاء المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "مدير المبيعات يبالغ في الوعود بشأن تسليمات المشروع خارج نطاق العقد. لحل الخلاف، يرغب مدير المشروع في العثور على شخص أعلى رتبة في قسم المبيعات ويدعم المشروع. ما البيانات التي يجب أن يرجع إليها مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "شبكة السلطة/الاهتمام لأصحاب المصلحة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "خطة إدارة الاتصالات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "هيكل توزيع الموارد.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الأصول التنظيمية للمؤسسة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "ما هو سلوك القيادة الأقل احتمالاً لتعزيز التحفيز في فريق مشروع Agile؟",
  "الخيارات": [
    {
      "النص": "أمر الفريق باستخدام أداة إنتاجية جديدة على الفور.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "اطلب من الفريق التصويت إذا كان ينبغي اعتماد طريقة عمل جديدة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تعيين مهام فردية لأعضاء الفريق من سجل الأعمال المتراكمة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "اطلب متطوعًا لإجراء استبيان رضا العملاء.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "ما هو مثال على القيادة التوجيهية مقابل القيادة التعاونية؟",
  "الخيارات": [
    {
      "النص": "التصرف كمصدر معلومات سلطوي وحيد للفريق.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "قبول وتعلم من أخطاء الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الثقة في أعضاء الفريق لاتخاذ المبادرات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تشجيع الفريق على مشاركة أفكار التحسين.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "بعد إعداد خطة إدارة المشروع، يحدد مدير المشروع اجتماعًا مع أصحاب المصلحة الرئيسيين لإنهاء مرحلة التخطيط. المدير يستعد الآن لمرحلة التنفيذ. ما هو الإجراء التالي الذي يجب أن يقوم به؟",
  "الخيارات": [
    {
      "النص": "تعريف المشروع وإنشاء ميثاق المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تنفيذ خطة المشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "ضمان اكتمال جميع التسليمات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "معالجة المخاطر لضمان بقاء المشروع على المسار.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يشرف مدير مشروع على تطوير وإطلاق منتج جديد. وامتثالًا لإرشادات مكتب إدارة المشاريع (PMO)، يجب على مدير المشروع التأكد من إعداد خطة تحقيق الفوائد التي توضح القيمة التجارية التي سيتم تسليمها. وهو يقوم حاليًا بتوثيق الأدوار والمسؤوليات في شكل مخطط RACI. من هو المسؤول عن ضمان تحقيق المشروع لقيمة للمنظمة؟",
  "الخيارات": [
    {
      "النص": "راعي المشروع",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مدير المشروع",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مهندس الحلول",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "لجنة التوجيه",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "بعد مراجعة تقرير استثناء القيمة المكتسبة للمشروع، لاحظ مدير المشروع أن هناك مهمتين تم الإبلاغ عنهما بأنهما تمتلكان مؤشر أداء التكلفة (CPI) قدره 0.5. ما هو الاستنتاج الصحيح الذي يجب أن يستخلصه مدير المشروع من هذا التقرير؟",
  "الخيارات": [
    {
      "النص": "كل مهمة أنفقت ضعف المبلغ المخصص لها في هذه المرحلة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "كل مهمة أنفقت نصف الميزانية التي يجب أن تنفقها في هذه المرحلة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "كل مهمة أنفقت نصف المبلغ المخصص لها في هذه المرحلة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "كل مهمة أنفقت ربع الميزانية التي كان ينبغي إنفاقها.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "خلال اجتماع للمشروع، تم إعلام مدير المشروع أن أعضاء الفريق يجدون صعوبة كبيرة في التحقق من التسليمات المكتملة من حيث المطابقة نظرًا لعدم وجود مستندات مرجعية تحتوي على معلومات المواصفات واحتياجات العميل ذات الصلة. قرر الفريق توثيق معايير قبول واضحة لمعالجة هذا الأمر. ما هو المستند الذي يمكن استخدامه لتحديد وربط احتياجات العميل المحددة في هذه الحالة؟",
  "الخيارات": [
    {
      "النص": "دراسة الجدوى (Business case)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ميثاق المشروع (Project charter)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مصفوفة تتبع المتطلبات (Requirement traceability matrix)",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مصفوفة تعيين المسؤوليات (Responsibility assignment matrix)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يقود مدير المشروع مشروعًا معقدًا مع أصحاب مصلحة متنوعين وبيئة تنظيمية صارمة. يواجه فريق المشروع صعوبة في تحقيق الالتزام باستمرار مع عمليات المشروع، مما يؤدي إلى تأخيرات وإعادة عمل. ما الذي يجب على مدير المشروع فعله لتحفيز الفريق بفعالية على الالتزام بعمليات المشروع؟",
  "الخيارات": [
    {
      "النص": "تقديم مكافآت فردية بناءً على الأداء عند تجاوز أهداف الالتزام.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تنفيذ نظام تدقيق وفحص متكرر للامتثال.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تطوير وتوصيل رؤية مقنعة وأسباب منطقية لأهداف المشروع الكلية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تنظيم ورش عمل للفريق لتحديد ومعالجة تحديات الامتثال بشكل تعاوني.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أنهى فريق المشروع مؤخرًا إنجاز مرحلة رئيسية مهمة، وهو الآن على المسار الصحيح لتسليم المشروع قبل الموعد النهائي. يرغب مدير المشروع في استخدام المكافآت للحفاظ على تماسك الفريق ورفع الإنتاجية. أي نوع من المكافآت التالية من شأنه تحسين تماسك الفريق والإنتاجية لما تبقى من المشروع؟",
  "الخيارات": [
    {
      "النص": "تقديم مكافأة جماعية لجميع المشاركين في المشروع للحفاظ على الإنتاجية والتماسك.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تقديم مكافآت لقادة الفرق فقط ليقودوا فرقهم بشكل أكثر إنتاجية وتماسكًا.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تقديم مكافآت فردية للأعضاء الأكثر إنتاجية للحفاظ على الأداء والتماسك.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تقديم مكافآت فردية فقط للأعضاء المتعثرين لتحفيزهم على تحسين الأداء والتماسك.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "تم تعيين عضو جديد في الفريق لمشروع جديد وسيتعين عليه تقديم تقارير حول تقدم جميع مهام المشروع إلى مدير المشروع، بينما سيكون مديره الوظيفي الحالي مسؤولاً عن نموه وتطوره المهني. ما هو الهيكل التنظيمي الذي يصف هذا السيناريو؟",
  "الخيارات": [
    {
      "النص": "مصفوفي (Matrix)",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مشروع بحت (Projectised)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "وظيفي (Functional)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "متقاطع الوظائف (Cross-functional)",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل فريق Agile على مشروع تطوير منتج جديد. طلب مالك المنتج تغييرًا جديدًا ليتماشى مع متطلبات التكنولوجيا الحديثة الناتجة عن تغيرات في السوق. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
  "الخيارات": [
    {
      "النص": "تنفيذ التغيير فورًا.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تسجيل طلب تغيير وإنشاء مجلس إدارة لتقييم التغيير.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ضمان إضافة طلب التغيير إلى قائمة الأعمال المتراكمة (Backlog).",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "رفض التغيير لأنه قد يزيد من التكاليف ويؤخر المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير مشروع مع فريق Agile على تسليم المشروع. أثناء التخطيط، على ماذا يجب أن يركز الفريق لضمان تحقيق أهداف المشروع؟",
  "الخيارات": [
    {
      "النص": "تنظيم ورش عمل مع أصحاب المصلحة من الأعمال وفريق المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التحقق من توقيع مالك المنتج على جميع قصص المستخدم.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التحقق من أن كل قصة مستخدم تحتوي على تعريف للانتهاء (DoD).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ترتيب تقييم التسليم كخطوة نهائية لضمان الجودة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يتطلب مشروع معقد يضم عدة أصحاب مصلحة ذوي أولويات متباينة مفاوضات طويلة وصعبة لإنهاء اتفاقية المشروع. يجب على مدير المشروع تسهيل وضع الأولويات الصحيحة لهذه المفاوضات الحاسمة. ما هو أول إجراء يجب أن يقوم به مدير المشروع؟",
  "الخيارات": [
    {
      "النص": "تطوير سجل مفصل للمخاطر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تنظيم جلسة عصف ذهني مع جميع أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحديد معايير نجاح واضحة للمشروع.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "إجراء مقابلات فردية مع أصحاب المصلحة الرئيسيين.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير المشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متضاربة. ما الذي يجب أن يفعله مدير المشروع فيما يتعلق بأصحاب المصلحة لتحقيق نتيجة أفضل للمشروع؟",
  "الخيارات": [
    {
      "النص": "تحديد والسعي إلى توافق أصحاب المصلحة حول أهداف المشروع وتسليمه.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "الحفاظ على العلاقات والتفاهم مع أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تلبية المصالح الشخصية لأصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تشجيع أصحاب المصلحة على قبول وجهة النظر المقترحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير المشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متنافسة. خلال اجتماع مع أصحاب المصلحة، أجرى مدير المشروع جلسة عصف ذهني لتسهيل الوصول إلى توافق. ما الذي فعله مدير المشروع لتحقيق حالة من التوافق العام؟",
  "الخيارات": [
    {
      "النص": "ركز على الحفاظ على العلاقات والتفاهم مع أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ركز على إيجاد حل يلبي احتياجات أصحاب المصلحة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "ركز على تلبية المصالح الشخصية لأصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "ركز على دفع أصحاب المصلحة لقبول الرؤية المقترحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير المشروع على مشروع معقد يتطلب خبرة في مهارات التفاوض. ما الذي يجب أن يفعله مدير المشروع لإقناع أصحاب المصلحة بقبول وجهة النظر المقترحة؟",
  "الخيارات": [
    {
      "النص": "مناقشة دراسة الجدوى الخاصة بالمشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحديد الجدول الزمني والتدابير الاحتياطية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "فهم أسباب عدم الاتفاق المحتملة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تقييم مخاطر فشل التفاوض.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
  {
    "النوع": "اختيار من متعدد",
    "النص": "يقوم فريق المشروع بكتابة الدروس المستفادة في نهاية السبرينت. وقد صرحوا بوضوح برغبتهم في تحسين خبراتهم باستخدام نهج الاستعراض (Retrospective). بناءً على ميثاق الأجايل، على ماذا يجب أن يركز الفريق؟",
    "الخيارات": [
      {
        "النص": "التنافس",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الجدال",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الدفاع",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الحوار",
        "التصحيح": "صحيح",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يساعد مدير مشروع منظمته على الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الأجايل. اشتكى فريق القيادة من أن الإنتاجية انخفضت منذ تنفيذ طرق الأجايل. كيف يجب أن يرد مدير المشروع على هذا القلق؟",
    "الخيارات": [
      {
        "النص": "يطلب من جميع قادة الفرق تفسير سبب انخفاض الإنتاجية منذ بدء تنفيذ الأجايل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يشرح أن انخفاض الإنتاجية أمر متوقع في البداية أثناء محاولة الفرق فهم الأجايل والتأقلم معها.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "يفرض سبرينت لمدة أسبوعين على مستوى المؤسسة بأكملها لتوحيد وتيرة التسليم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يتوقف عن تطبيق الأجايل إذا لم تُحقق تحسينات وكانت الفرق تشعر بالإحباط.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير مشروع مشروعًا باستخدام منهج أجايل. يسأل الراعي ما إذا كان من الممكن استخدام عقد بسعر ثابت بدلاً من عقد زمني ومادي مع العميل. يحتاج العميل إلى عقد بسعر ثابت لتلبية أهدافه التجارية. ما هو الرد المناسب من مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "يُبلغ العميل أن الأجايل لا تدعم العقود بسعر ثابت لأنها تفضل التعاون على التفاوض.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يُبلغ العميل أن الأجايل تدعم فقط العقود الزمنية والمادية لأن النطاق غير ثابت.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "يوافق على استخدام عقد بسعر ثابت لأن الأجايل لا تمنع ذلك.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "يؤثر على العميل لاستخدام عقد زمني ومادي لأن مخاطر التكلفة تقع على عاتق العميل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يترك مدير المشروع الحالي المشروع ويتم استبداله بمدير مشروع جديد. ما هو أول إجراء يجب على المدير الجديد اتخاذه لضمان نجاح المشروع؟",
    "الخيارات": [
      {
        "النص": "التعرف على أهداف المشروع كما هي محددة في ميثاق المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "استشارة سجل المشكلات وسجل الدروس المستفادة الذي يحتفظ به المدير السابق.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تعديل الجدول الزمني والميزانية لتضمين أنشطة نقل المعرفة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الاجتماع مع أصحاب المصلحة الرئيسيين وتحديث استراتيجية التواصل حسب الحاجة.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "علم مدير المشروع أن قانونًا جديدًا سيدخل حيز التنفيذ وسينظم نوع المنتجات التي يمكن للشركة تصنيعها. تخطط الشركة لإطلاق منتج جديد في الأسابيع القادمة لا يتوافق مع اللوائح الجديدة. اجتمع مدير المشروع مع الراعي وأصحاب المصلحة لمناقشة التغييرات. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "الخيارات": [
      {
        "النص": "تحديث ميثاق المشروع ليعكس نتائج الاجتماع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تخطيط لإطلاق المنتج في الوقت المحدد دون تعديل وتحديث خطة إدارة المخاطر فقط.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "تخطيط لتعديل المنتج للامتثال للأنظمة الجديدة قبل دخول القانون حيز التنفيذ.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "نصح الراعي وأصحاب المصلحة بإلغاء الإطلاق حتى يتم تعديل المنتج.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحتاج مدير المشروع إلى مقارنة فعالية الإجراءات التصحيحية المتخذة خلال المشروع الحالي مع الإجراءات المتخذة في مشروع مماثل من أجل توليد أفكار للتحسين. ما الأداة التي يجب أن يستخدمها مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "تحليل العمليات",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "الحكم الخبير",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "المقارنة المعيارية (Benchmarking)",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "تدقيق الجودة",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير المشروع مشروعًا باستخدام منهج أجايل. يذكر مهندس معماري ذو خبرة ضمن الفريق أنه من المهم إنشاء وثيقة تصميم حل مفصلة مسبقًا بناءً على تعقيد المشروع. أحد أعضاء الفريق يقول إن ذلك يخالف مبادئ الأجايل التي تعارض التوثيق المسبق. كيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
    "الخيارات": [
      {
        "النص": "تقديم تدريب حول الأجايل للمهندس والعمل مع الفريق على حل النزاع.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "السماح للمهندس بإنشاء وثيقة التصميم المفصلة مسبقًا حسب متطلبات المشروع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "الاتفاق مع عضو الفريق وطلب من المهندس إنشاء التصميم على مراحل بمرور الوقت.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب التوجيه من الراعي لأن الأجايل لا تدعم التوثيق الشامل.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير المشروع مشروعًا يعتمد على بائع معين. يعتمد فريق المشروع على هذا البائع لإكمال بعض الأعمال أولاً، لكن البائع يفشل باستمرار في تسليم الأعمال في الوقت المحدد. كيف يجب على مدير المشروع التخفيف من هذا الخطر؟",
    "الخيارات": [
      {
        "النص": "إنشاء جدول مشروع متكامل مع البائع وعقد نقاط تحقق منتظمة معه.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "الحصول على موافقة الراعي لإضافة احتياطي زمني وإبلاغ البائع بذلك.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "استبعاد هذا البائع فورًا وبدء عملية طلب العروض لاختيار بائع جديد.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب من البائع إضافة موارد جديدة والموافقة على العمل الإضافي للموارد الحالية.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يدير مدير المشروع مشروعًا حيث تم التعاقد مع بائع بموجب عقد بسعر ثابت. على الرغم من أن متطلبات المشروع والجدول الزمني قد تم تحديدها بوضوح ومشاركتها مع البائع، إلا أن الراعي قلق بشأن تجاوز التكاليف. كيف يجب أن يرد مدير المشروع؟",
    "الخيارات": [
      {
        "النص": "إبلاغ الراعي أن خطر تجاوز التكاليف قد تم نقله إلى البائع.",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "مناقشة هذه المسألة في الاجتماع القادم مع الفريق وطلب ملاحظاتهم.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "طلب تمويل احتياطي من الراعي لتخفيف الخطر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "إصدار طلب عروض لتحديد بائعين بديلين في حال تطور الأمر.",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
  {
    "النوع": "اختيار من متعدد",
    "النص": "يحتاج مدير المشروع إلى التعاقد مع مزود لخدمة مشروع حكومي كبير. تنص إرشادات المشروع على ضرورة حصول جميع المزودين المحتملين على نفس الفهم لعملية الشراء. ما الذي يجب أن يعقده مدير المشروع لضمان الامتثال للإرشادات؟",
    "الخيارات": [
      {
        "النص": "مفاوضات مباشرة مع مزودين لمشاريع سابقة مشابهة",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "مؤتمر للمزايدين (Bidder Conference)",
        "التصحيح": "صحيح",
        "الشرح": ""
      },
      {
        "النص": "اجتماعات فردية مع كل مزود محتمل",
        "التصحيح": "خاطئ",
        "الشرح": ""
      },
      {
        "النص": "اجتماع افتراضي مع فريق الشراء",
        "التصحيح": "خاطئ",
        "الشرح": ""
      }
    ]
  },
{
  "النوع": "اختيار من متعدد",
  "النص": "تم الاستعانة بمورد خارجي لإنتاج مكون رئيسي في مشروع بناء. أبلغ المورد مدير المشروع بأنه بسبب نقص المكونات، سيصل المنتج بكميات متغيرة وعلى جدول تسليم أطول.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه المشكلة؟",
  "الخيارات": [
    {
      "النص": "الاجتماع مع راعي المشروع لمناقشة العقوبات التي يمكن فرضها بسبب التغييرات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تعديل مراحل المشروع لتتناسب مع جدول تسليم هذا المكون الحرج.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مراجعة شروط تسليم المورد الخارجي كما هو محدد في العقد.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مراجعة خطة الشراء لإجراءات إلغاء العقد أثناء البحث عن موردين بديلين.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "تم التعاقد مع مورد لتوفير مواد مختلفة لمشروع بناء بموجب عقد بسعر ثابت. وقد استلم المورد جميع الوثائق اللازمة المتعلقة بمعايير المواد والمواصفات. وبموجب العقد، يجب على المورد تسليم جميع المواد إلى موقع البناء في تاريخ محدد.\n\nعندما تصل المواد في الوقت المحدد، لماذا يجب على مدير المشروع إبلاغ فريق الفحص؟",
  "الخيارات": [
    {
      "النص": "لإبلاغ عضو الفريق المسؤول عن المواد باستلامها.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "لتزويد قسم المالية بالمستندات اللازمة لدفع فاتورة المورد.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "لإبلاغ قسم الشراء بأن العقد قد تم تنفيذه.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "لضمان أن المواد تتوافق مع معايير ومواصفات العقد.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "ما الذي قد يدفع القادة إلى تجاهل الإمكانيات القيادية المشتركة ضمن فرقهم؟ (اختر 2)",
  "الخيارات": [
    {
      "النص": "الثقة الزائدة في دورهم الخاص",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "توفير الاستقلالية والتحكم",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الخوف من أن يصبحوا غير ضروريين",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "الثقة بالفريق",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أي من التالي يقلل من تعقيد المشروع؟",
  "الخيارات": [
    {
      "النص": "أعضاء الفريق يعملون ضمن مناطق زمنية مختلفة",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "أعضاء الفريق من مكاتب عالمية متعددة",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "أعضاء الفريق من خلفيات ثقافية متنوعة",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "أعضاء الفريق يستخدمون عملية متفق عليها لإنجاز العمل",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يقود مدير مشروع مشروعًا بيئيًا ويدرك أنه قد فاتته مشاركة أحد أصحاب المصلحة الأجانب المؤثرين. بعد التواصل مع صاحب المصلحة، طلب نسخة من مستندات المشروع بلغته المحلية.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
  "الخيارات": [
    {
      "النص": "تصعيد المشكلة إلى راعي المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إبلاغ صاحب المصلحة أن المستندات متاحة فقط بلغة المؤسسة المنفذة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تحديث سجل أصحاب المصلحة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تجاهل الطلب والاستمرار في العمل.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير المشروع على مشروع معقد يضم موارد من عدة دول. ما الذي يجب أن يقوم به مدير المشروع لضمان وصول الموارد إلى المعلومات التي يحتاجونها؟",
  "الخيارات": [
    {
      "النص": "أصل تنظيمي (OPA) يعالج ثقافة وهيكل المؤسسة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إطار عمل إدارة المشاريع المؤسسية (OPM).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "خطة إدارة الاتصالات.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "تركيز هرمي أفقي.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يكتشف مدير المشروع في مشروع مرن أن فريق المشروع يعاني من مشكلات في التواصل، مما يؤدي إلى تأخيرات أثناء السبرينتات.\n\nما هو أول إجراء يجب على مدير المشروع اتخاذه لحل المشكلة؟",
  "الخيارات": [
    {
      "النص": "تحديث خطة إدارة الاتصالات.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "مشاركة مخطط الانحدار (burndown chart) مع الفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إعداد اجتماعات الوقوف اليومية (stand-ups).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "معالجة هذه المشكلة خلال اجتماع الاستعراض الرجعي (retrospective).",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يقوم مدير المشروع بتجميع وثائق المشروع مثل مقاطع الفيديو والصور والصوتيات، لضمان مشاركة الفريق لتجارب المشروع. أين يجب وضع هذه المعلومات؟",
  "الخيارات": [
    {
      "النص": "سجل الدروس المستفادة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "سجل مشاركة المعرفة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "سجل المخاطر.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "سجل المشكلات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "يعمل مدير مشروع على مشروع في سوق تنافسي. يجب تكييف المنتج باستمرار بناءً على تغيّرات السوق وتوقعات المستهلكين. يقوم فريق المشروع بتطوير ومشاركة المعرفة الصريحة باستمرار، لكن مدير المشروع يرغب أيضًا في تضمين المعرفة الضمنية.\n\nما هو الأسلوب الذي يجب أن يتبعه الفريق لجمع المعرفة الضمنية؟",
  "الخيارات": [
    {
      "النص": "نقل المعرفة في الوقت الفعلي على شكل دليل مكتوب.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تنظيم جلسات تدريب مع شركة بيانات خارجية.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مراجعة متواصلة لمتطلبات المنتج وأدائه.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "إنشاء منصة للمستهلكين لمشاركة تجاربهم.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أي مما يلي لا يُؤخذ بعين الاعتبار خلال إغلاق المشروع أو المرحلة؟",
  "الخيارات": [
    {
      "النص": "أفكار الاحتفال بالفريق.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "عوامل النجاح الحرجة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "التنفيذ السريع (Fast-tracking).",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "نقل المعرفة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أي من التالي يتم تنفيذه في مرحلة إغلاق المشروع/المرحلة؟",
  "الخيارات": [
    {
      "النص": "جدولة وعقد اجتماع بدء المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "جدولة وعقد اجتماع للدروس المستفادة.",
      "التصحيح": "صحيح",
      "الشرح": ""
    },
    {
      "النص": "جدولة وعقد اجتماع لمراقبة التغييرات.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "جدولة وعقد اجتماع لحالة المشروع.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    }
  ]
},
{
  "النوع": "اختيار من متعدد",
  "النص": "أي من الخيارات التالية ليس جزءًا من التحقق من الإصدار في مرحلة الانتقال؟",
  "الخيارات": [
    {
      "النص": "اختبار النشر في بيئة الإنتاج.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "مشاركة فعالة من أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "استبيان رضا أصحاب المصلحة.",
      "التصحيح": "خاطئ",
      "الشرح": ""
    },
    {
      "النص": "تسجيل النشر.",
      "التصحيح": "صحيح",
      "الشرح": ""
    }
  ]
}
 ]
}
