{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "في مشروع متعدد التخصصات، يقوم مدير المشروع بتفويض بعض أنشطة إدارة المشروع لعدة أعضاء في الفريق.\n\nما الذي يجب على مدير المشروع القيام به أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير خطة إدارة الاتصالات في المشروع وتوزيعها على أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تطوير خطة إرشاد ودمجها في تقرير حالة المشروع.",
          "correct": false
        },
        {
          "text": "تطوير هيكل تقسيم تنظيمي وهيكل تقسيم العمل.",
          "correct": false
        },
        {
          "text": "تطوير مصفوفة المسؤوليات (RACI).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت مؤسسة تستخدم نهجًا تنبؤيًا التحول إلى نهج رشيق (Agile). تعتقد المؤسسة أن هذا سيسمح بتقديم قيمة أكبر للعملاء، وقررت أن تعتمد جميع المشاريع هذا النهج.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق الفوائد؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم تحقيق الفوائد أثناء الاجتماعات اليومية للفريق.",
          "correct": false
        },
        {
          "text": "مواءمة خطة إدارة الفوائد مع سجل المنتج (Product Backlog).",
          "correct": true
        },
        {
          "text": "تقييم خطة إدارة الفوائد في نهاية كل سباق (Sprint).",
          "correct": false
        },
        {
          "text": "طلب تحديثات يومية حول تحقيق الفوائد من سكرم ماستر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع بملايين الدولارات وهو قيد التنفيذ. خلال اجتماع حالة المشروع، ذكر أحد أعضاء الفريق أن هناك تأخيرات لأن أحد التنفيذيين لا يستجيب للاتصالات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء عملية لإرسال تذكيرات يومية إلى المسؤول التنفيذي.",
          "correct": false
        },
        {
          "text": "إزالة المهمة من المسار الحرج حتى لا تؤثر على الجدول الزمني.",
          "correct": false
        },
        {
          "text": "استخدام العلاقات للتواصل مع المسؤول التنفيذي والحصول على استجابة.",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى مدير المسؤول التنفيذي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في وقت مبكر من المشروع، يدرك مدير المشروع أن أحد أعضاء الفريق الرئيسيين غير مستعد لأداء المهمة الموكلة إليه.\n\nكيف يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن التدريب مدمج في خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "مراجعة متطلبات التدريب مع عضو الفريق.",
          "correct": true
        },
        {
          "text": "مراجعة كل مهمة مطلوبة مع عضو الفريق عند بدايتها.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى المدير الوظيفي للموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخطط مدير المشروع لفريق سيبدأ قريبًا العمل على نظام فرعي حرج. تم تحديد بديلين تقنيين لهذا النظام الفرعي، لكن من غير الواضح ما إذا كان أي من البديلين سيؤدي أداءً مرضيًا. سيتعرض المشروع للخطر إذا لم يكن أداء النظام الفرعي جيدًا.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "توجيه الفريق لتقييم وتحليل البدائل للنظام الفرعي.",
          "correct": true
        },
        {
          "text": "إضافة أداء النظام الفرعي إلى سجل القضايا وتعيين مالك لها.",
          "correct": false
        },
        {
          "text": "جدولة العمل لأكثر البدائل وعدًا وإضافة احتياطي إداري للبديل الآخر.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بالمخاطر الكبيرة التي يشكلها أداء النظام الفرعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواصل أحد أعضاء فريق المشروع تعديل تسليمات زميله خلال كل سباق (Sprint). وقد طلب الزميل من مدير المشروع التدخل.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحدث مع عضو الفريق لمعرفة سبب التعديلات.",
          "correct": true
        },
        {
          "text": "مناقشة أي قصور في الجودة في التسليم مع الزميل.",
          "correct": false
        },
        {
          "text": "مراجعة أداء كلا العضوين مع مديريهما الوظيفيين.",
          "correct": false
        },
        {
          "text": "التحكم في التنفيذ والتسليم لضمان عدم تغيير التسليمات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة التنفيذ وتم ضم أعضاء جدد إلى الفريق. قبل ضم الأعضاء الجدد، ما الذي يجب على مدير المشروع فعله لتقليل تأثير هذا الإجراء على أداء المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء جلسة لتحديث الاتفاق الاجتماعي الحالي حول كيفية تعاون الفريق.",
          "correct": true
        },
        {
          "text": "جدولة جلسة ليشرح الأعضاء الحاليون للأعضاء الجدد العقد الاجتماعي الحالي.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع مع جميع الأعضاء للتواصل حول الاتفاق الاجتماعي الحالي.",
          "correct": false
        },
        {
          "text": "تخطيط اجتماع مع الأعضاء الجدد لشرح القواعد المدرجة في العقد الاجتماعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتبع المشروع خطة استراتيجية تتضمن معالم رئيسية تم الاتفاق عليها مع أصحاب المصلحة. أثناء تنفيذ العمل، تظهر مهام جديدة مع تبعيات هامة تمنع التقدم حسب الخطة. الفريق غير قادر على تحديد من يجب أن يتخذ القرارات ويتصرف في هذه المهام الجديدة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام مصفوفة المسؤوليات (RACI) لتسهيل المساءلة عن المهام.",
          "correct": true
        },
        {
          "text": "استخدام مخطط Gantt لضمان تحقيق المعالم.",
          "correct": false
        },
        {
          "text": "سؤال الرعاة عن من يتحمل المسؤولية.",
          "correct": false
        },
        {
          "text": "استخدام هيكل تقسيم العمل (WBS) لضمان تغطية المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا متكاملًا يتضمن تطوير الأجهزة والبرمجيات، مع مخطط Gantt معتمد من العميل وتوقعات بمشاركة العميل. اقترح فريق تطوير البرمجيات استخدام منهجيات Agile.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم أفضل المنهجيات التي تضمن استمرار تحقيق القيمة للأعمال.",
          "correct": true
        },
        {
          "text": "تبني Sprints رشيقة لتطوير المشروع ضمن الإطار الزمني.",
          "correct": false
        },
        {
          "text": "إخبار الفريق باتباع مخطط Gantt المعتمد من العميل بدقة.",
          "correct": false
        },
        {
          "text": "تقييم أدوار العميل مع مكتب إدارة المشاريع (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مؤسسة كبيرة، يعاني مشروع من صعوبات في التواصل. يعبر أعضاء الفريق والقادة الوظيفيون عن شعورهم بأنهم يُبلغون بالمعلومات متأخرًا أو لا يتم إشراكهم في المناقشات، أو أنهم ببساطة غير مدركين لمعلومات تسليم المشروع.\n\nكيف يجب على مدير المشروع معالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان الالتزام بالعملية المتفق عليها كما هو موضح في خطة الاتصالات.",
          "correct": true
        },
        {
          "text": "إرسال تحديثات دورية عبر البريد الإلكتروني لكل مدير وظيفي حول حالة المشروع والخطوات القادمة.",
          "correct": false
        },
        {
          "text": "تنسيق اجتماع مع قادة الفريق لإيجاد حل.",
          "correct": false
        },
        {
          "text": "الرجوع إلى مصفوفة RACI لمعرفة من يحتاج لمعرفة ماذا ومتى، وضمان الالتزام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في شركة تبنت مؤخرًا ممارسات هجينة، يواجه أحد المشاريع صعوبة في الأداء كما هو متوقع. لا يتمتع مدير المشروع ولا أعضاء الفريق بخبرة سابقة في هذا النهج الجديد لإدارة المشاريع. يريد مدير المشروع التأكد من أن الانتقال إلى الممارسات الهجينة يحقق النتائج المرجوة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "القيام بدور نشط في تعيين المهام لأعضاء الفريق ومتابعة نتائجهم.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب أساسي على المنهجية الهجينة لأعضاء الفريق وضمان إجراء اجتماعات تنسيقية.",
          "correct": true
        },
        {
          "text": "إصدار تقارير أداء لجميع أعضاء الفريق ليقوموا بمراجعتها والتصرف بناءً عليها.",
          "correct": false
        },
        {
          "text": "بناء هيكل تقسيم العمل (WBS) ومصفوفة RACI لضمان وضوح المهام وتوزيع المسؤوليات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقوم بتكوين فريق مشروع. جميع أعضاء الفريق عملوا معًا في مشاريع سابقة. أحد أعضاء الفريق معروف بتحديه لمعظم الإجراءات والعمليات التنظيمية.\n\nما الذي يجب على مدير المشروع فعله أولاً لضمان انطلاقة سلسة للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الأصول التنظيمية للعمليات (OPAs) مع جميع أعضاء الفريق وتحديد القواعد الأساسية.",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع تحديد القواعد الأساسية ومشاركتها مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "طلب من راعي المشروع استبدال العضو المثير للمشاكل أو إزالته.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع مع أعضاء الفريق لمراجعة خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في الموقع (A) يعمل مع فريق محلي، بينما يتواجد المطورون في موقع بعيد، ومقيم الجودة في موقع بعيد آخر. يدرك مدير المشروع أن هذه المسافات قد تؤدي إلى صعوبة في التواصل.\n\nما الذي يمكن لمدير المشروع فعله للتخفيف من هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة عدد جلسات الوقوف اليومية (standup) في اليوم الواحد.",
          "correct": false
        },
        {
          "text": "تعيين أعضاء فريق جدد من الموقع المحلي.",
          "correct": false
        },
        {
          "text": "إنشاء نافذة fishbowl (نافذة الشفافية).",
          "correct": true
        },
        {
          "text": "تقليل الحاجة إلى التواصل من خلال تنظيم المهام الخلفية (backlog grooming).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تسليم مشروع ترقية طويل في سلسلة من المخرجات المرحلية. سيواجه المستخدمون النهائيون بعض الانقطاعات خلال كل مرحلة قبل تحقيق المخرجات.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق القيمة المقصودة في كل مرحلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "جمع التعليقات باستخدام استبيانات حول تجربة المستخدم النهائي وتحليل النتائج.",
          "correct": false
        },
        {
          "text": "مراجعة التكاليف الفعلية لضمان بقاء المشروع ضمن الميزانية.",
          "correct": false
        },
        {
          "text": "التحقق من النطاق لضمان تحقيق الجودة المطلوبة للمخرجات.",
          "correct": false
        },
        {
          "text": "تتبع التقدم نحو كل فائدة بناءً على خطة إدارة الفوائد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال جلسة فردية، أعرب عضو جديد في الفريق عن إحباطه من عدم قدرته على إتمام المهمة الموكلة إليه بنجاح، رغم بذله أقصى جهد.\n\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة مخاوف عضو الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تشجيع عضو الفريق على الاستمرار في العمل بجد على مهامه.",
          "correct": false
        },
        {
          "text": "تحديد السبب الجذري لعدم قدرة عضو الفريق على إكمال المهمة ومعالجته.",
          "correct": true
        },
        {
          "text": "الموافقة على تدريب إضافي لعضو الفريق خلال سلسلة فرص التدريب القادمة.",
          "correct": false
        },
        {
          "text": "تكييف أسلوب القيادة حسب احتياجات عضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع لمشروع هجين جديد يحاول تشكيل فريق المشروع. أفضل المرشحين لأعضاء الفريق متوزعون جغرافيًا، لذلك هناك خطر أن تؤثر هذه الوضعية على أداء المشروع. الجمع في مكان واحد سيزيد التكاليف بشكل كبير؛ وبسبب المنافسة الشديدة، تكافح الشركة ماليًا للبقاء.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان توفر الأدوات المناسبة للتعاون الافتراضي للفريق.",
          "correct": true
        },
        {
          "text": "الإصرار على جمع الفريق معًا عن طريق تقليص الميزانية في مكان آخر.",
          "correct": false
        },
        {
          "text": "طلب أموال إضافية من مالك المنتج لدعم الجمع في مكان واحد.",
          "correct": false
        },
        {
          "text": "تنظيم العمل وفقًا لمواقع أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "مشروع تحويل كبير يتطلب جهدًا مشتركًا من فرق أعمال متعددة قيد التنفيذ.\n\nما هما الإجراءان اللذان يجب على مدير المشروع اتخاذهما أولاً لاستكمال سجل أصحاب المصلحة؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "عقد ورشة عمل مع أعضاء الفريق الرئيسيين للعصف الذهني وتحديد أصحاب المصلحة المحتملين.",
          "correct": false
        },
        {
          "text": "طلب الإحالات من راعي الأعمال أو القيادة العليا.",
          "correct": false
        },
        {
          "text": "تحليل اهتمام وتأثير وتأثير أصحاب المصلحة المحتملين من كل فريق عمل.",
          "correct": false
        },
        {
          "text": "مناقشة المشروع مع أعضاء الفريق وتجميع السجل في اجتماع الفريق.",
          "correct": false
        },
        {
          "text": "الاتصال بكل صاحب مصلحة محتمل مباشرة وسؤاله إذا كان مهتمًا بالانضمام إلى المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "أحد عناصر العمل من جلسة المراجعة الأخيرة تكرر في آخر جولتين، وهو متعلق بالتحقق من الوظيفة المقدمة وصلاحيتها قبل الاستعداد للإنتاج.\n\nما هما الحلان اللذان يجب على مدير المشروع استخدامهما؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تعديل سرعة الفريق لمعالجة الاختبار الإضافي.",
          "correct": false
        },
        {
          "text": "دمج معايير اختبار الوحدة والاختبار التكاملي كجزء من عملية التحقق.",
          "correct": false
        },
        {
          "text": "تعديل منهجية التسليم إلى التطوير المعتمد على الاختبار.",
          "correct": false
        },
        {
          "text": "مراجعة اتفاقية العمل لمعايير القبول مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "إدراج عنصر في سجل المنتج لإنشاء مجموعة اختبارات تكاملية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مراجعة الجولة النهائية، صرّح مالك المنتج أن المنتج لا يقدم أي قيمة. مدير المشروع يعتقد أن المنتج يلبي جميع المواصفات المقدمة. الفريق مرتبك من تصريح مالك المنتج.\n\nماذا يجب على مدير المشروع فعله عند استخدام نهج هجين؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الفوائد الخاصة بالمشروع مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "تصعيد الأمر إلى المجلس التنفيذي حتى يقرروا الخطوات التالية.",
          "correct": false
        },
        {
          "text": "أولوية سجل المنتج واطلب من فريق التطوير تصحيح المشكلات.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج إنهاء المشروع لأنه لم يعد متماشياً مع الفوائد المتوقعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا حيث تمت ترقية صاحب مصلحة منخفض المستوى إلى منصب جديد، وأصبح الآن صاحب مصلحة عالي المستوى. ما الذي يجب على مدير المشروع تحديثه لضمان المشاركة المناسبة لهذا صاحب المصلحة في المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة الاتصالات",
          "correct": false
        },
        {
          "text": "خطة إشراك أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "خطة إدارة الموارد",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تفاعلات العميل مع فريق المشروع كانت سلبية إلى حد ما. لم يعد أعضاء الفريق يرغبون في المشاركة في المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة اجتماع مع العميل لمناقشة مخاوف الفريق.",
          "correct": false
        },
        {
          "text": "الامتثال لتوقعات ومشاعر العميل دون تردد.",
          "correct": false
        },
        {
          "text": "التفاوض مع العميل وفريق المشروع لتسوية الخلافات.",
          "correct": true
        },
        {
          "text": "إشراك جميع أعضاء الفريق في أنشطة إشراك أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على عناصر متراكمة ضمن دورة مدتها أربعة أسابيع. فجأة، أعلن عضو رئيسي في الفريق أنه سيكون غائبًا لمدة أسبوع بشكل غير متوقع، مما ترك المهام الجارية غير مكتملة. ما هو الإجراء الأنسب الذي يجب أن يتخذه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعم نقل المعرفة بين العضو الذي سيغيب وباقي أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "إضافة مورد مؤقت إلى الفريق لزيادة السرعة وإنهاء العناصر خلال هذه الدورة.",
          "correct": false
        },
        {
          "text": "إزالة بعض العناصر من الدورة الحالية بعد الحصول على موافقة مالك المنتج.",
          "correct": true
        },
        {
          "text": "زيادة مدة الدورة حتى يتمكن الفريق من إكمال جميع العناصر المخطط لها وتقديمها لمالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في منظمة تشجع على الفرق الافتراضية. تظهر تحديات جديدة بشكل دوري في هذا النوع من البيئات، ومدير المشروع في المراحل المبكرة من مشروع رشيق جديد.\n\nما الذي يجب على مدير المشروع فعله لمساعدة الفريق في التغلب على هذه التحديات؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحليل SWOT (نقاط القوة، نقاط الضعف، الفرص، التهديدات) لتحديد حالة الفريق بسرعة واتخاذ الإجراء المناسب.",
          "correct": true
        },
        {
          "text": "إيقاف جميع الأنشطة مؤقتًا وجمع الفريق في اجتماع لمناقشة التحديات الجديدة التي تم تحديدها.",
          "correct": false
        },
        {
          "text": "الانتظار حتى الاجتماع اليومي التالي لمناقشة التحديات حتى يكون الفريق على علم ومشاركة.",
          "correct": false
        },
        {
          "text": "العمل مع مالك المنتج لتحديد أفضل مسار عمل لإزالة العوائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكافح فريق مشروع رشيق في تتبع التغييرات التي يتم تطبيقها على المنتج، بسبب أن العملية المستخدمة معقدة وعرضة للأخطاء. ما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعيين المسؤولية بوضوح لشخص واحد لضمان المحاسبة في حال الفشل.",
          "correct": false
        },
        {
          "text": "استخدام الاجتماع التالي لجلسة المراجعة (الرتروسبيكتيف) لتقييم فعالية العملية وتحديد ما إذا كانت تحتاج إلى تغييرات.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة الراعي لإيقاف اتباع هذه العملية وتحمل مخاطر إلغائها.",
          "correct": false
        },
        {
          "text": "تأمين تمويل للحصول على حل برمجي يمكنه تسريع العملية وتقليل الأخطاء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع مع فريق متنوع ثقافيًا، ويكتشف وجود صراعات كبيرة داخل الفريق أثناء تنفيذ المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة اجتماع مع فريق المشروع لفهم أسباب الصراعات.",
          "correct": true
        },
        {
          "text": "نصح أعضاء الفريق بالعمل بانسجام.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إشراك الأعضاء في أنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق استشاري عن بعد من الفريق الأساسي للمشروع. هناك تدفق مستمر للمعلومات بين الفريقين، وكلا الفريقين يوافق على مستندات المشروع. أي تأخير في الموافقات سيؤدي إلى تكاليف إضافية.\n\nأي ممارسة تضمن لمدير المشروع توفر جميع المستندات وتحديثها والموافقة عليها بشكل صحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "السماح للفريقين الاستشاري والرئيسي بتطوير أنظمة تسمية وتصنيف المستندات الخاصة بهم.",
          "correct": false
        },
        {
          "text": "طلب من كل عضو في الفريقين الاحتفاظ بسجلات محدثة.",
          "correct": false
        },
        {
          "text": "تكليف الراعي بالمحافظة على السجل المركزي للمستندات والموافقة على التغييرات.",
          "correct": false
        },
        {
          "text": "الإشراف على سجل مستندات ونظام تحكم بالتغيير موحد يستخدمه الفريقان.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بالتحول من استخدام النهج التنبؤي إلى تنفيذ مشاريع هجينة (تنبؤية-رشيقة). يشعر فريق القيادة بالقلق بشأن تحقيق الفوائد ويتابع إحدى دورات المشروع عن كثب مع مدير المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث فريق القيادة بتقرير يحتوي على قيمة كمية لكل دورة.",
          "correct": false
        },
        {
          "text": "عرض القيمة التجارية لفريق القيادة والحصول على دعمهم.",
          "correct": false
        },
        {
          "text": "مواصلة تسليم دورات الحل وعرض زيادات الفوائد على فريق القيادة.",
          "correct": true
        },
        {
          "text": "انتظار فريق القيادة ليشارك تحديثات تحقيق الفوائد لكل دورة مع الإدارة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع هجين يشمل العديد من أصحاب المصلحة قيد التنفيذ. كما طلب مكتب إدارة المشاريع (PMO)، يتم تخزين تقارير حالة المشروع وغيرها من مستندات المشروع في مستودع مركزي. عند مراجعة المستندات المخزنة، اكتشف مدير المشروع أن بعض المستندات إما لم تُحدث أو مفقودة.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الوضع مع راعي المشروع لتقليل مستوى التوثيق.",
          "correct": false
        },
        {
          "text": "العمل مع قادة الفرق لتحديث تقارير المشروع المطلوبة.",
          "correct": true
        },
        {
          "text": "إيقاف جميع أنشطة المشروع حتى يتم تحديث وتحميل مستندات المشروع.",
          "correct": false
        },
        {
          "text": "جدولة جلسة نقل معرفة في المرحلة النهائية من المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع على مشروع جارٍ به أعضاء فريق افتراضيين من دول مختلفة يعملون عن بُعد في مناطق زمنية مختلفة. يلاحظ مدير المشروع أن أعضاء الفريق لا يكملون أنشطة المشروع في الوقت المحدد ولا يستطيعون تقديم المنتجات المتوقعة بسبب الاتصالات غير المنتظمة.\n\nكيف يجب على مدير المشروع حل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تزويد الفريق بقائمة التسليمات لتوجيههم.",
          "correct": false
        },
        {
          "text": "التواصل مع أعضاء الفريق لفهم التحديات التي يواجهونها.",
          "correct": true
        },
        {
          "text": "تنظيم تدريب على إدارة الوقت للفريق.",
          "correct": false
        },
        {
          "text": "اتخاذ خطوات لجمع الفريق في نفس المكتب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل مدير المشروع التسليمات وتم اجتياز معايير القبول. أي عبارة تؤكد أن فوائد المشروع قد تحققت؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمت الموافقة على التسليم وتم تأكيد القيمة.",
          "correct": true
        },
        {
          "text": "حلت التسليمة جميع المشكلات التي حددها رعاة المشروع.",
          "correct": false
        },
        {
          "text": "شهد المشروع بعض التحسينات في القدرة على اتخاذ القرارات.",
          "correct": false
        },
        {
          "text": "تم الانتهاء من المشروع حسب الجدول الزمني دون أي شكاوى من المستخدمين النهائيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينص عقد تكنولوجيا المعلومات لمشروع ما على أن جميع أعضاء الفريق يجب أن يكونوا معتمدين في أمن تكنولوجيا المعلومات. يكتشف مدير المشروع أن أحد أعضاء الفريق قدم شهادة مزورة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً للتعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة المشروع لتشمل موارد لتدريب العضو على الاعتماد.",
          "correct": false
        },
        {
          "text": "تحديث سجل المشكلات وإزالة عضو الفريق من المشروع.",
          "correct": true
        },
        {
          "text": "التأكد من أن الأعضاء الآخرين يحملون شهادات صحيحة.",
          "correct": false
        },
        {
          "text": "التحقيق في سبب عدم اكتشاف هذا الموقف في وقت سابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع رشيق، أثار أحد أعضاء الفريق مخاوف بشأن قضايا الصحة والسلامة المتعلقة بالتسليمة. كيف يجب على مدير المشروع التعامل مع قضايا الصحة والسلامة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تزويد العميل بالوثائق الكافية حول معلومات الصحة والسلامة.",
          "correct": false
        },
        {
          "text": "إرسال القضية إلى قسم الصحة والسلامة.",
          "correct": false
        },
        {
          "text": "تصميم سياسة للصحة والسلامة للمؤسسة.",
          "correct": false
        },
        {
          "text": "ضمان تضمين متطلبات الصحة والسلامة الضرورية في تعريف الإنجاز (DoD).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت ترسية مشروع مدته سنتان على شركة قبل ستة أشهر، لكن لم يبدأ بعد إجراء عمليات الشراء. ما الذي يجب على مدير المشروع فعله لتحريك المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعداد خطة إدارة المشتريات للمشروع.",
          "correct": false
        },
        {
          "text": "جمع الفرق معًا لصياغة خطة إدارة المشتريات.",
          "correct": true
        },
        {
          "text": "تتبع عمليات الشراء وفقًا لخطة إدارة المشتريات الحالية.",
          "correct": false
        },
        {
          "text": "تصعيد الوضع إلى الإدارة العليا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع على مشروع يقوم بتحويل المنظمة إلى اعتماد المبادئ الرشيقة. تعريف نطاق المشروع قيد التقدم، لكن الفريق يريد أن يكون التعريف أقل رسمية.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة النطاق وتحديد التسليمات المطلوبة وإنشاء خطط طوارئ للمخاطر المحددة.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل مع مالك المنتج وفريق المشروع لإنشاء قائمة المنتجات ومعايير القبول.",
          "correct": true
        },
        {
          "text": "إنشاء موقع تواصل لمشاركة تعريف النطاق وقائمة المنتجات مع الفريق.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق المشروع لتحديد المتطلبات الإلزامية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروع تطوير منتج رئيسي. المشروع حاليًا في منتصف السبرينت الخامس، ومن المقرر إصدار المنتج في الربع القادم. يتلقى مدير المشروع خبرًا غير متوقع بأن الشركة قد تم الاستحواذ عليها رسميًا من قبل منافس رئيسي، والذي يمتلك بالفعل منتجًا مشابهًا في محفظته.\n\nما الإجراء الفوري الذي يجب أن يتخذه مدير المشروع لمعالجة الموقف بفعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحليل مقارن للمنتجات لتحديد أوجه التشابه.",
          "correct": false
        },
        {
          "text": "التعاون مع مدير المشروع المسؤول عن منتج المنافس لمواءمة أنشطة المشروع.",
          "correct": false
        },
        {
          "text": "طلب الدعم من راعي المشروع وبدء إجراءات إدارة التغيير المناسبة.",
          "correct": true
        },
        {
          "text": "إعداد تقرير إنهاء المشروع وتوثيق الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينفذ مدير مشروع مرحلة من مشروع تكنولوجيا المعلومات في موقع عرضة لمشاكل أمنية. أبلغ عضو في الفريق يعمل عن بُعد أن الجهة التنظيمية المحلية لم تتلقَ رسوم التصريح، بينما مدير المشروع متأكد من أنه تم الدفع. يذكر العضو مدير المشروع أن اختبارًا حرجًا ضمن المسار الحرج مقرر في نفس اليوم في هذا الموقع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب إثبات الدفع من عضو الفريق من مكتب إدارة المشروع وإرسال إيصال الدفع المطبوع لاحقًا إلى الجهة التنظيمية وانتظار ردهم.",
          "correct": false
        },
        {
          "text": "طلب عقد اجتماع مع المسؤول في الجهة التنظيمية لعرض إثبات الدفع والتحقق من عواقب التأخير لضمان استمرار الاختبار كما هو مخطط.",
          "correct": true
        },
        {
          "text": "إعطاء تعليمات للعضو لمواصلة الاختبار لأن الغرامة الناتجة عن عدم الالتزام لا تؤثر كثيرًا، ولا يمكن تغيير عملية الاختبار.",
          "correct": false
        },
        {
          "text": "إعطاء تعليمات للعضو لمواصلة الاختبار لتجنب التأخير في المسار الحرج لأن الرسوم قد دُفعت بالتأكيد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أعضاء الفريق في إجازة مرضية لمدة أسبوع، وهو مكلف بمهمة تقع على المسار الحرج.\n\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختيار عضو آخر لاستلام المهمة فورًا.",
          "correct": false
        },
        {
          "text": "تقييم التأثيرات المحتملة لتأخير المشروع.",
          "correct": true
        },
        {
          "text": "الرجوع إلى خطة الاستجابة للمخاطر لمعالجة هذه المشكلة.",
          "correct": false
        },
        {
          "text": "إقناع العضو بمواصلة إتمام المهمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجتمع مدير المشروع مع مورد خارجي حاسم يوفر خدمات مخفضة. خلال الاجتماع، يشكو المورد من عدم رضاه عن العائد على الاستثمار.\n\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة وتجنب المخاطر على المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التفاوض مع المورد لتقديم المزيد من المال حتى نهاية المشروع.",
          "correct": false
        },
        {
          "text": "تذكير المورد بأن العقد ملزم قانونيًا ويجب عليه الالتزام بالشروط.",
          "correct": false
        },
        {
          "text": "البحث عن موردين آخرين يقدمون خدمات مماثلة بأسعار مخفضة.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة مع أصحاب المصلحة والتوصل إلى خطة معالجة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أي مرحلة من مشروع رشيق (Agile) يجب على مدير المشروع إشراك أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "في بداية المشروع",
          "correct": false
        },
        {
          "text": "في نهاية المشروع",
          "correct": false
        },
        {
          "text": "عندما تواجه تحديات في المشروع",
          "correct": false
        },
        {
          "text": "طوال دورة حياة المشروع",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة تستخدم نهج تسليم هجين. نطاق المشروع هو تنفيذ نظام موارد بشرية جديد. سيتم تسليم البنية التحتية بواسطة مشروع آخر، وكلا المشروعين جزء من برنامج تحويل الأعمال. يجب الانتهاء من جدول المشروع، ولكن مدير المشروع الآخر لا يمكنه تقديم تواريخ التسليم للبنية التحتية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانتظار حتى يحصل مشروع البنية التحتية على جدول زمني ثم تطوير جدول مشروع نظام الموارد البشرية.",
          "correct": false
        },
        {
          "text": "مناقشة الوضع مع مدير المشروع الآخر والاتفاق على بعض المعالم، ثم مواصلة العمل على جدول مشروع نظام الموارد البشرية.",
          "correct": false
        },
        {
          "text": "تطوير جدول زمني استنادًا إلى المعلومات المتاحة من فريق إدارة البرنامج ثم مواءمة المعالم تدريجيًا مع مشروع البنية التحتية.",
          "correct": true
        },
        {
          "text": "تطوير جدول زمني استنادًا إلى المعلومات المتوفرة وطلب من مدير المشروع الآخر مواءمة المعالم مع تواريخ تسليم مشروع الموارد البشرية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق على مشروع نشر تكنولوجيا جديدة. لم يتم تنفيذ هذا المنتج من قبل، ولا توجد بيانات تاريخية. يواجه الفريق تحديًا في تقديم الجدول الزمني والميزانية والتقديرات الحيوية للعميل.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير خطط إدارة المشروع مسبقًا مع ميزانية مفصلة.",
          "correct": false
        },
        {
          "text": "تقديم توجيهات حول تكلفة المشروع والوقت والجودة.",
          "correct": false
        },
        {
          "text": "وضع التقديرات مع الفريق وشرح الافتراضات للعميل.",
          "correct": true
        },
        {
          "text": "تشجيع الفريق على إجراء مراجعات دورية (retrospectives).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد العملاء غير راضٍ لأن مشكلة حرجة في أحد تسليمات المشروع لم تُحل من قبل الفريق الرشيق، على الرغم من أن عملية استكشاف الأخطاء كانت جارية منذ عدة أسابيع. خلال الاجتماعات اليومية، يشكو الفريق من التحدي التقني ونقص المعرفة لحل المشكلة.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لحل هذه المشكلة؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد القضية إلى مدير وظيفي لجلب خبير تقني إلى الفريق.",
          "correct": false
        },
        {
          "text": "شرح الوضع للعميل وتضمين خطة عمل.",
          "correct": false
        },
        {
          "text": "إبقاء الفريق يعمل على سجل الأعمال الحالي لإنجاز معلم الإصدار التالي.",
          "correct": false
        },
        {
          "text": "تحديث سجلات القضايا والمخاطر، بما في ذلك خطة العمل لحل المشكلة.",
          "correct": false
        },
        {
          "text": "تحديد تاريخ إصدار جديد لهذا التسليم مع مالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أصحاب المصلحة الرئيسيين غير راضٍ عن الميزات الجديدة في التكرار الحالي للمنتج. لم يكن هذا الطرف متاحًا خلال المراجعة الأخيرة ولم تتح له الفرصة لتقديم مدخلاته.\n\nما الذي كان ينبغي على مدير المشروع فعله لمنع استياء صاحب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانتظار حتى يوافق جميع أصحاب المصلحة على التغيير قبل تنفيذه.",
          "correct": false
        },
        {
          "text": "التأكد من أن معلومات المشروع المحدثة متاحة دائمًا لجميع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "الاجتماع بشكل فردي مع كل صاحب مصلحة لتجنب الخلاف.",
          "correct": false
        },
        {
          "text": "جدولة الاجتماعات فقط عندما يتمكن جميع أصحاب المصلحة من الحضور.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ مشروع لتقنية المعلومات، يكتشف اثنان من أعضاء الفريق ميزة جديدة ستغير مظهر المنتج وتجعله أكثر جاذبية من الناحية الجمالية. وبسبب حماسهما، يتوجهان إلى مدير المشروع لطلب الموافقة على إضافة هذه الميزة، التي من المحتمل أن تزيد من رضا العميل وربما تعزز فرص الشركة في الحصول على عقود إضافية من العميل.\n\nكيف يجب على مدير المشروع الرد؟",
      "explanation": "",
      "choices": [
        {
          "text": "الموافقة على الفكرة لتحقيق توقعات أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تذكير أعضاء الفريق بأنه من دون طلب تغيير معتمد، يجب التركيز على النطاق المتفق عليه.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة بقية الفريق وتنفيذ الميزة بمجرد موافقتهم.",
          "correct": false
        },
        {
          "text": "تنفيذ التغيير بأسرع وقت ممكن لتحسين فرص الإيرادات المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مدير مشروع لإدارة مشروع لشركة ناشئة تتلقى تمويلاً من مصدر أجنبي. في منتصف المشروع، يتم إبلاغ مدير المشروع بأن هناك متطلبات تنظيمية حكومية قد تؤثر على المشروع بسبب التمويل الأجنبي.\n\nما الذي يجب أن يفعله مدير المشروع بالنظر إلى أنه قد تم الحصول على جميع الموافقات اللازمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد ملكية المشروع بناءً على ميثاق المشروع المعتمد مسبقًا ومتابعة العمل.",
          "correct": false
        },
        {
          "text": "الرجوع إلى سجل المخاطر لتحديد احتمال قبول المشروع من قبل العميل وتوافقه مع المتطلبات التنظيمية.",
          "correct": false
        },
        {
          "text": "تأكيد التزام المشروع بجميع اللوائح ومتابعة جميع التداعيات القانونية.",
          "correct": true
        },
        {
          "text": "إيقاف المشروع وطلب أموال إضافية للحصول على تصاريح العمل ومواصلة المشروع دون تأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "مدير مشروع يدير مشروعًا طويل الأمد ومتأخر عن الجدول الزمني. يشعر العميل بالقلق من احتمال تأخر المشروع.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لمعالجة مخاوف العميل؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء جدول خط أساس جديد.",
          "correct": false
        },
        {
          "text": "مراجعة عملية التحكم في التغيير.",
          "correct": false
        },
        {
          "text": "إضافة المزيد من الموارد إلى المهام الموجودة في المسار الحرج.",
          "correct": false
        },
        {
          "text": "إجراء تحليل احتياطي المخاطر.",
          "correct": false
        },
        {
          "text": "تنفيذ بعض الأنشطة بشكل متزامن.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير قسم دور مالك المنتج في مشروع حكومي لتطوير البرمجيات. لكن هذا المدير غير قادر باستمرار على التفاعل مع الفريق وتقديم ملاحظات منتظمة وهامة على مخرجات المشروع.\n\nماذا يجب أن يفعل مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد تفضيلات الاتصال ومراجعة المسؤوليات.",
          "correct": true
        },
        {
          "text": "الحصول على ملاحظات بديلة من العميل.",
          "correct": false
        },
        {
          "text": "التوصية بسياسة الباب المفتوح للمشروع.",
          "correct": false
        },
        {
          "text": "اعتماد نهج تعاوني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع عملية ترقية من نظام قديم إلى إصدار جديد. في منتصف العملية، فشل النظام القديم في الترقية ولم يمكن استعادته.\n\nماذا يجب أن يفعل مدير المشروع لإدارة هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "التخلي عن النظام القديم وإخبار الفريق بتسريع العمل على المخرجات الأخرى.",
          "correct": false
        },
        {
          "text": "طلب المزيد من الوقت لاستعادة النظام القديم مع الاستمرار في المشروع.",
          "correct": false
        },
        {
          "text": "تقييم تأثيرات الفشل والتواصل بشأنها مع أصحاب المصلحة المعنيين.",
          "correct": true
        },
        {
          "text": "إخبار الفريق بالاستمرار في العمل لأنهم غير مسؤولين عن النظام القديم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "على الرغم من أن العميل يتلقى تقارير السرعة ونتائج السبرينت من مدير المشروع عبر البريد الإلكتروني، إلا أن التصعيدات إلى راعي المشروع بشأن أداء المشروع شائعة. ماذا يجب أن يفعل مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إشراك العميل في تخطيط واستعراض السبرينت للاتفاق على تواريخ الإطلاق.",
          "correct": false
        },
        {
          "text": "جدولة جلسات منتظمة مع العميل لشرح التقارير ومعالجة الملاحظات.",
          "correct": true
        },
        {
          "text": "إرسال مستند يوضح قدرة الفريق وتوزيع الأدوار إلى العميل.",
          "correct": false
        },
        {
          "text": "جعل القائد التقني يتصل بالعميل لشرح التفاصيل الفنية حول مشكلات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرر مدير المشروع أن استخدام نهج أجايل سيكون الأنسب لمشروع جديد. بعض أعضاء الفريق كانوا رافضين لاستخدام تقنيات أجايل وقرروا استخدام النهج التنبؤي لأداء عملهم.\n\nماذا كان يجب على مدير المشروع فعله في بداية المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تقييم للمهارات الخاصة بالفريق.",
          "correct": false
        },
        {
          "text": "الدفاع عن استخدام تقنيات أجايل.",
          "correct": true
        },
        {
          "text": "إشراك فقط الموارد التي كانت مرتاحة لاستخدام أجايل.",
          "correct": false
        },
        {
          "text": "توظيف مستشارين في أجايل لقيادة الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام نهج أجايل. يقترب المشروع من مراحله النهائية، ويقوم الفريق بمراجعة مخرجات المشروع. خلال هذه المراجعة، يتضح أن هناك ميزة حاسمة مفقودة من عناصر المشروع. هذه الميزة ضرورية لكي يتوافق النظام مع تنظيم حكومي جديد.\n\nكيف يجب على مدير المشروع حل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يطلب من مالك المنتج إنشاء قصة مستخدم للسبرينت التالي.",
          "correct": true
        },
        {
          "text": "يجتمع مع فريق المشروع لإعادة تقييم خارطة طريق المنتج.",
          "correct": false
        },
        {
          "text": "يُعد تقرير إنهاء المشروع ويُسجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "يواصل التسليم ويُحدث تعريف الانتهاء (DoD).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "هناك مخاوف من أن المنتج المقرر إطلاقه قد لا يلبي متطلبات المستخدم النهائي المتفق عليها.\n\nكيف يجب على مدير المشروع تجنب هذا الموقف في المستقبل؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الفوائد مع العميل.",
          "correct": false
        },
        {
          "text": "التأكد من وجود قائمة متطلبات المنتج (backlog).",
          "correct": false
        },
        {
          "text": "تقديم أمثلة على مشاريع مماثلة.",
          "correct": false
        },
        {
          "text": "عقد جلسة لمراجعة المخرج بالتفصيل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لإدارة مشروع في بلد لم تقم فيه الشركة بأعمال من قبل. في بداية المشروع، يلاحظ مدير المشروع وجود متطلبات تنظيمية معينة لا يمتلك الفريق خبرة فيها.\n\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخصيص ميزانية كافية في حال تطلب الأمر تلبية هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "استشارة خبير موضوع حول كيفية تجنب هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "الاستعانة بخبير موضوع للتحقق مما إذا كانت المتطلبات تنطبق على المشروع.",
          "correct": true
        },
        {
          "text": "تصعيد المخاوف بشأن المتطلبات إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "أبلغ عضو في فريق داخل منظمة هجينة مدير المشروع بطريقة جديدة لتنفيذ نشاط ما تستغرق وقتًا أقل. لم يستخدم مدير المشروع هذه الطريقة من قبل، لكن عضو الفريق الموثوق يشرح أن لديه خبرة سابقة تؤكد فعالية هذه الطريقة.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "إشراك المدير الوظيفي لعضو الفريق.",
          "correct": false
        },
        {
          "text": "تأجيل القرار حتى السبرينت التالي.",
          "correct": false
        },
        {
          "text": "تحديث هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "تقييم تأثير اعتماد الطريقة الجديدة.",
          "correct": false
        },
        {
          "text": "التواصل بشأن التأثير مع أصحاب المصلحة الرئيسيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد البائعين في المشروع تأخر في توفير حل منتج مرتبط، مما يؤثر على تواريخ الإطلاق.\n\nماذا يجب أن يفعل مدير المشروع لمساعدة فريق أجايل في التعامل مع هذا العائق؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع البائع لفهم البدائل.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث تاريخ الإطلاق مع الفريق.",
          "correct": false
        },
        {
          "text": "جعل القائد التقني يصعد المشكلة إلى المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "جعل أعضاء الفريق والخبراء يعملون معًا على الحل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لضمان الجودة، تم إجراء تدقيق جودة على العمليات المستخدمة في خطة تنفيذ المشروع. إحدى مشكلات عدم المطابقة التي أثارها المدقق كانت غياب قوائم الحضور لاجتماعات مراجعة مخاطر المشروع.\n\nلماذا تعتبر قائمة الحضور مهمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "هي وثيقة يتم تسجيلها ضمن سجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "هي سجل يُظهر عدد الحاضرين في الاجتماع.",
          "correct": false
        },
        {
          "text": "هي ممارسة قياسية في المشاريع لعقد اجتماعات مراجعة المخاطر بشكل اختياري.",
          "correct": false
        },
        {
          "text": "هي دليل على أن اجتماعات مراجعة المخاطر عُقدت مع أعضاء فريق المشروع المناسبين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم اكتشاف مشكلة تتعلق بالامتثال خلال تنفيذ المشروع. تسبب ذلك في إجراء تدقيق داخلي على المنتج، مما أدى إلى تأخير في الجدول الزمني.\n\nماذا كان يجب أن يفعل مدير المشروع في البداية لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان توثيق متطلبات الامتثال.",
          "correct": true
        },
        {
          "text": "إنشاء قوالب لتوثيق الامتثال.",
          "correct": false
        },
        {
          "text": "توظيف مستشار امتثال.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة في بداية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تواجه المؤسسات تحديات مختلفة في مجالاتها التشغيلية بسبب عوامل خارجية. وقد تطلب هذا من الشركات تطوير مستندات تفاعل رسمية لتوجيه عملياتها المختلفة.\n\nكيف يجب على مدير المشروع إطلاع أعضاء الفريق وأصحاب المصلحة على خصوصية المعايير التنظيمية للمؤسسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ستكون العوامل الخارجية المختلفة مدخلاً إلى خطة إدارة المشروع وستشكل جزءًا من الإحاطة في اجتماع الانطلاق.",
          "correct": true
        },
        {
          "text": "يجب أن يكون أعضاء الفريق وأصحاب المصلحة على دراية مسبقة بالعوامل الخارجية وإدراجها أمر اختياري.",
          "correct": false
        },
        {
          "text": "يجب على أي شخص يشارك في المشروع فهم هذه العوامل الخارجية المختلفة وبذل جهد للبحث عنها.",
          "correct": false
        },
        {
          "text": "سيتم إبلاغ أعضاء الفريق وأصحاب المصلحة بهذه العوامل الخارجية المختلفة من خلال قناة الاتصال الرسمية للمؤسسة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "اقترب المشروع من الاكتمال عندما ظهر أحد أصحاب المصلحة المؤثرين والذي لم يتم التعرف عليه مسبقًا وهدد بتعطيل المشروع بعدم الموافقة على مستندات الإغلاق.\n\nما الإجراءان اللذان كان يجب على مدير المشروع اتخاذهما لتجنب ذلك؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "كان يجب على مدير المشروع تنفيذ تحديد أصحاب المصلحة خلال مرحلة بدء المشروع.",
          "correct": false
        },
        {
          "text": "كان يجب على مالك المشروع إبلاغ مدير المشروع بجميع أصحاب المصلحة في المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يتم تحديد وتحليل أصحاب المصلحة بشكل مستمر طوال مدة المشروع.",
          "correct": false
        },
        {
          "text": "كان ينبغي على صاحب المصلحة أن يتقدم للتعريف بنفسه في بداية المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يتم توعية أصحاب المصلحة بمخاوفهم بشكل مستمر طوال المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "يواجه المشروع عددًا كبيرًا من المشكلات التي تؤدي إلى عيوب وشكاوى من أصحاب المصلحة. كان مدير المشروع يفكر في نهج سريع وفعال لمعالجة هذه المشكلات.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "جمع أعضاء فريق المشروع وعقد جلسة عصف ذهني.",
          "correct": false
        },
        {
          "text": "الرجوع إلى الأصول التنظيمية للعمليات (OPAs) لتقييم الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "استخدام تحليل الاتجاه لإشراك بعض أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "استخدام مخطط إيشيكاوا للمساعدة في تحديد المشكلات.",
          "correct": false
        },
        {
          "text": "استخدام مخطط باريتو لتحديد كيفية معالجة تحديات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "دخل مدير المشروع إلى مكتب المشروع ووجد أحد أعضاء الفريق وممثل المورد في خلاف حول بند في اتفاقية التوريد. يدعو مدير المشروع المورد إلى جلسة تفاوض مع فريق المشروع لحل النزاع.\n\nوفقًا لمبادئ التفاوض، ما الهدف الذي يجب أن يسعى إليه مدير المشروع والفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "التخلي عن هدف المشروع لتحقيق نتيجة رابح-خاسر.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع بنتيجة رابح-خاسر.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع بنتيجة رابح-رابح.",
          "correct": true
        },
        {
          "text": "تحقيق هدف المشروع بغض النظر عن نتيجة التفاوض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "يعمل مدير المشروع في الشهر الخامس من تنفيذ مشروع إنشاء. أبلغ المخطط أن مؤشر أداء الجدول الزمني الحالي (SPI) ومؤشر أداء التكلفة (CPI) هما 0.8 و0.9 على التوالي.\n\nما الخياران اللذان سيساعدان في تسريع المشروع؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تعديل إجراءات العمل لتبسيطها وتحسين الكفاءة باستخدام الموارد الحالية.",
          "correct": false
        },
        {
          "text": "تغيير المسار الحرج عن طريق استبدال بعض أنشطة المسار الحرج بأنشطة تحتوي على هامش.",
          "correct": false
        },
        {
          "text": "زيادة عدد الموارد لإشراك مزيد من الأشخاص وإنجاز الأنشطة بشكل أسرع.",
          "correct": false
        },
        {
          "text": "إعادة ترتيب الجدول الزمني بحيث يمكن تنفيذ بعض الأنشطة على المسار الحرج بالتوازي لتقليل مدة المشروع.",
          "correct": false
        },
        {
          "text": "مطالبة الموارد بالعمل لساعات إضافية لتسريع المشروع وتحقيق نتائج أفضل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مع اقتراب المشروع من الاكتمال، نشأ صراع بين مالك المنتج وراعي المشروع حول من يمتلك الفوائد الناتجة عن التسليم، مما أدى إلى نزاع قانوني.\n\nماذا كان يجب على مدير المشروع فعله لمنع حدوث هذا الصراع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد راعي المشروع كأحد أصحاب المصلحة في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تطوير واعتماد الحالة التجارية (business case) بشكل مشترك مع مالك المنتج وراعي المشروع.",
          "correct": true
        },
        {
          "text": "تحديد وتوثيق أي مشكلات محتملة في سجل القضايا ومراقبتها بشكل متكرر.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تفصيلي للعمل (WBS) وتنفيذ تتبع منهجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا لمشروع في مجال تكنولوجيا المعلومات. المشروع في مرحلة البدء، واكتشف الفريق وجود مشكلة في التوافق في البنية التحتية التقنية المستخدمة من قبل البائع والمنظمة.\n\nما الخطوة الأولية التي يجب أن يتخذها مدير المشروع لمعالجة هذه المشكلة بفعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "فحص ما إذا كانت هناك بدائل أخرى.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى فريق البنية التحتية التقنية.",
          "correct": false
        },
        {
          "text": "الرجوع إلى قاعدة بيانات الدروس المستفادة.",
          "correct": true
        },
        {
          "text": "التشاور مع راعي المشروع بشأن المشكلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أجرى مدير مشروع تحليلًا مع أصحاب المصلحة المعنيين للتحقق من توافق المشروع مع استراتيجية المؤسسة والقيمة التجارية المتوقعة. تغيب العديد من أصحاب المصلحة الرئيسيين عن جلسة التحليل ولم يتم تضمين مدخلاتهم.\n\nما العاقبة الرئيسية لغياب أصحاب المصلحة عن جلسة التحليل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأخر الموافقة الرسمية على طلبات تغيير المشروع.",
          "correct": false
        },
        {
          "text": "عدم رضا أصحاب المصلحة عن التسليمات الأساسية للمشروع.",
          "correct": false
        },
        {
          "text": "قد يؤدي إلى صراعات في المراحل اللاحقة من المشروع.",
          "correct": false
        },
        {
          "text": "مدخلات غير متسقة حول الفوائد من أصحاب المصلحة الرئيسيين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع نشر لاستبدال بعض المعدات التي ستصبح قديمة قريبًا. كشفت مراجعة الجدول الزمني والتكلفة عن تأخير محتمل مدته 5 أشهر.\n\nكيف يجب على مدير المشروع معالجة المخاطر الناتجة عن هذا التأخير؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل الأثر التجاري من أجل إعادة ترتيب أولويات التسليمات.",
          "correct": true
        },
        {
          "text": "طلب التفاوض مع البائعين لتمديد فترة الدعم.",
          "correct": false
        },
        {
          "text": "طلب شراء معدات جديدة فورًا لتجنب مشكلات الدعم.",
          "correct": false
        },
        {
          "text": "الاعتراف بهذه القيود وأخذها بعين الاعتبار أثناء التخطيط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، تم إبلاغ مدير المشروع بأن بعض الموارد سيتم سحبها من المشروع قريبًا. ماذا يجب على مدير المشروع أن يفعل لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة اجتماع لإبقاء أصحاب المصلحة على اطلاع.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة في اجتماع المراجعة التالي المجدول.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر بإدراج هذه المخاطرة المتعلقة بالموارد.",
          "correct": false
        },
        {
          "text": "طلب تسوية الموارد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التخطيط في المشروع، يجد مدير المشروع صعوبة في تحديد أصحاب المصلحة. وبدون مدخلات من أصحاب المصلحة المناسبين، سيكون من الصعب الحصول على ملاحظات المستخدمين.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إبلاغ رعاة المشروع.",
          "correct": false
        },
        {
          "text": "الرجوع إلى ميثاق المشروع لتحديد أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "مراجعة وثيقة نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق المشروع في السبرينت الثالث عشر من مشروع مكون من أربعة عشر سبرينت. وضع الفريق ميزة مبتكرة على سجل المنتجات للنسخة القادمة. تم إعلام مالك المنتج بأن أحد المنافسين سيطلق منتجًا جديدًا يحتوي على ميزة مشابهة للتي تم وضعها في السجل. يطالب مالك المنتج بإدراج هذه الميزة المبتكرة في الإصدار الحالي.\n\nماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم اجتماع مراجعة مع فريق التطوير لفهم حجم العمل المطلوب.",
          "correct": false
        },
        {
          "text": "الاجتماع مع مالك المنتج وأصحاب المصلحة المعنيين لمناقشة التغيير وتحليل تأثيره.",
          "correct": true
        },
        {
          "text": "إجراء التقييمات المطلوبة ورفع طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "إبلاغ مالك المنتج بأنه سيتم تضمين هذه الميزة في الإصدار القادم من المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تصنيع معدات مشروع حاسمة من قبل مورد خارجي في الخارج. كشف مسح الجودة عن عدم الامتثال لبعض مواصفات المشروع.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعيين أفراد من المشروع للإشراف على منشأة المورد لضمان الامتثال للمواصفات.",
          "correct": false
        },
        {
          "text": "مراجعة عقد الإنتاج لتحديد ما إذا كانت المواصفات المشار إليها مدرجة فيه.",
          "correct": true
        },
        {
          "text": "جدولة ورشة عمل مع ممثلي المورد لتقديم نظرة عامة على مواصفات المشروع.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعات منتظمة مع المورد للتحكم شخصيًا في هذا الوضع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير المشروع على مشروع مشتريات لشركة تمتلك فريقًا مخصصًا لإدارة المشتريات يتولى جميع العقود. أظهر التقرير الفصلي وجود ستة عقود لا تتماشى مع أهداف الشركة.\n\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاحتفاظ بالعقود الستة رغم عدم توافقها.",
          "correct": false
        },
        {
          "text": "اقتراح إنهاء جميع العقود غير المتوافقة.",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع مراجعة العقود.",
          "correct": false
        },
        {
          "text": "طلب من العميل مراجعة العقود.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع تقدم العمل، علم فريق المشروع أن خطرًا تم تحديده قد تحقق. قرر مدير المشروع تنفيذ خطة الاستجابة للمخاطر، لكن الاحتياطي المخصص للطوارئ لا يغطي الميزانية الكاملة لتلك الخطة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من راعي المشروع استخدام الاحتياطي الإداري لتغطية باقي تكلفة الاستجابة.",
          "correct": false
        },
        {
          "text": "طلب من راعي المشروع تقديم ميزانية إضافية لتعويض الزيادة في التكاليف.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير لتعديل نطاق العمل والتكلفة وخطوط الأساس للجدول الزمني لدعم الخطة الجديدة.",
          "correct": true
        },
        {
          "text": "استخدام الاحتياطي المخصص وتقييم الخيارات لتقليل الميزانية لتغطية العمل المتبقي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق مشروع موزع سبرينت تضمن مهام معقدة قبل الموعد المحدد. أثناء اجتماع المراجعة، قاطع أحد الأعضاء الجدد الفريق وطلب من الجميع شرح أدوارهم وما ينوون العمل عليه في السبرينت التالي.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعامل مع الموقف فورًا والرد مباشرة على العضو الجديد.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق أن من الأفضل مناقشة هذا في اجتماع آخر.",
          "correct": true
        },
        {
          "text": "طلب من كل عضو في الفريق شرح دوره وما سيعمل عليه في السبرينت القادم.",
          "correct": false
        },
        {
          "text": "تحديد اجتماعات فردية بين كل عضو والعضو الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إغلاق المشروع، وجد العميل بعض العيوب في التسليم. ماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الناتج مقابل معايير القبول.",
          "correct": true
        },
        {
          "text": "تمديد المشروع حتى يتم قبول جميع التسليمات.",
          "correct": false
        },
        {
          "text": "إقناع العميل بقبول الناتج كما هو.",
          "correct": false
        },
        {
          "text": "دفع الغرامة عن العنصر المعيب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تحول تنظيمي يحتوي على مسارين للعمل يعملان بالتوازي بين المقر الرئيسي ومكتب خارجي في الخارج. قبل بدء التنفيذ، من المقرر أن يلتقي مدير المشروع بقائد المكتب الخارجي.\n\nما الذي يجب أن يكون محور الاجتماع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ قائد المكتب الخارجي بالقيمة الاستراتيجية للمشروع، والتسليمات الرئيسية، والمشاركة المتوقعة منه.",
          "correct": true
        },
        {
          "text": "التوصل إلى اتفاق بشأن استراتيجيات الشراء التي يجب اعتمادها من قبل المكتب الخارجي.",
          "correct": false
        },
        {
          "text": "مساعدة قائد المكتب الخارجي في التواصل مع موظفي المقر بشأن المشروع.",
          "correct": false
        },
        {
          "text": "تحديد وتعيين خبير مختص (SME) لتمثيل المشروع في المكتب الخارجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تعاقد عميل مع شركة لإدارة مشروع كبير في بيئة رشيقة يضم العديد من المتعهدين الفرعيين.\n\nيقوم العميل بإعطاء أوامر مباشرة لهؤلاء المتعهدين بدلاً من التواصل مع مدير مشروع الشركة، مما تسبب في حدوث نزاعات داخل الفريق.\n\nما الذي يجب على مدير المشروع فعله لمنع تكرار هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبقاء الفريق على اطلاع بتوقعات العميل.",
          "correct": false
        },
        {
          "text": "دعوة العميل إلى اجتماع تخطيط الفريق.",
          "correct": false
        },
        {
          "text": "إخبار الفريق بتجنب النزاعات مع العميل.",
          "correct": false
        },
        {
          "text": "طلب من العميل عدم إعطاء أوامر مباشرة للمتعهدين الفرعيين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، قرر الراعي استبدال خبير في الموضوع (SME) ضمن المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "التفاوض مع الراعي للاحتفاظ بالخبير ضمن المشروع.",
          "correct": false
        },
        {
          "text": "ضمان وجود نقل معرفة كافٍ بين الخبير وخلفه.",
          "correct": true
        },
        {
          "text": "إبلاغ الخبير الجديد أن قاعدة معارف المشروع تحتوي على جميع المعلومات المطلوبة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الراعي لشرح النزاعات داخل فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام العميل بمراجعة المنتج وطلب ميزات إضافية لم تكن موجودة في وثائق المتطلبات. وقد تم بالفعل تحسين حدود العمل قيد التقدم (WIP) للفرق التي تعمل على مكونات مختلفة.\n\nكيف يجب على مدير المشروع البدء في معالجة متطلبات العميل؟",
      "explanation": "",
      "choices": [
        {
          "text": "بناء المنتج وفقًا لمتطلبات العميل المتفق عليها مسبقًا.",
          "correct": false
        },
        {
          "text": "مناقشة إمكانية وتأثير الميزات الجديدة مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "تقسيم العمل المتعلق بالميزات الجديدة على الفرق القائمة.",
          "correct": false
        },
        {
          "text": "إصدار إصدارات من الميزات الإضافية للتحقق من صحتها لدى العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت منظمة بشراء منتج مشابه في منتصف دورة تطوير منتج محتمل، مما قد يؤدي إلى تداخل في محفظة المنتجات.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم جدوى وقابلية استمرار المشروع مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "مواصلة تطوير المنتج من أجل مصلحة المنظمة.",
          "correct": false
        },
        {
          "text": "مناقشة الأثر المحتمل لعملية الشراء مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع حتى تظهر رؤية واضحة لخارطة طريق المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد إرسال تقرير الحالة الأخير عبر البريد الإلكتروني، علم مدير المشروع أن عددًا من المستلمين لم يعودوا مشاركين في المشروع. يحتاج مدير المشروع إلى التحقق من قائمة التوزيع لتقارير الحالة المستقبلية.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة وتحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث خطة إدارة الجدول الزمني.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث مصفوفة توزيع المسؤوليات.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث خطة إدارة الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق مشروع موزع على ثلاث دول مختلفة صعوبة في ترتيب الاجتماعات. كما أن أعضاء الفريق غير واضحين بشأن متطلبات المشروع ويجدون صعوبة في الحصول على إجابات لأسئلتهم.\n\nما الذي يجب فعله لزيادة نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل بشكل مستقل حتى يحين وقت دمج الأعمال.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات وزيادة مشاركة المعلومات.",
          "correct": true
        },
        {
          "text": "زيادة عدد اجتماعات الفريق لمناقشة الأسئلة.",
          "correct": false
        },
        {
          "text": "طرح الأسئلة على المديرين الوظيفيين لحل المشكلات عبر الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق مشروع تكيفي موزع عالميًا ويتحدث أعضاؤه لغات رئيسية مختلفة. تُعقد الاجتماعات اليومية افتراضيًا بلغة مشتركة. تم إبلاغ مدير المشروع بوجود مشكلات في التواصل. تؤدي الفروقات في النطق واللهجات والمفردات إلى صعوبة الفهم بين الأعضاء.\n\nما الذي يجب أن يخصصه مدير المشروع لتحسين الاجتماعات اليومية وتجنب سوء الفهم؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام المكالمة لتلخيص حالة العمل شفوياً كما يوضحها أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "استخدام لوحة مهام إلكترونية لعرض حالة العمل وتقدمه بشكل مرئي.",
          "correct": true
        },
        {
          "text": "طلب تغيير في ميزانية المشروع لتوفير خدمة الترجمة.",
          "correct": false
        },
        {
          "text": "مطالبة جميع أعضاء الفريق بالإبلاغ عن العمل المنجز والقادم والعوائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد. لا تزال المتطلبات قيد التطور، لكن هناك حاجة لتقديم قيمة تجارية بسرعة.\n\nما هو النهج الذي يجب أن يتبعه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير استراتيجيات تخفيف لمعالجة مخاطر المتطلبات المتغيرة.",
          "correct": false
        },
        {
          "text": "استخدام سجل المنتج (Product Backlog) وتنفيذ المتطلبات ذات الأولوية الأعلى أولاً.",
          "correct": true
        },
        {
          "text": "ضمان توثيق تغييرات النطاق في مصفوفة تتبع المتطلبات.",
          "correct": false
        },
        {
          "text": "تطوير مخطط تناقص المزايا (Feature Burndown Chart) وإظهار التقدم في المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع ذو خبرة يوجه مدير مشروع جديد تم تعيينه في أول مشروع له. أثناء تحضير مدير المشروع الجديد للمشروع، شعر بالإرهاق بسبب العدد الكبير من أصحاب المصلحة الذين تم تحديدهم من قبل الفريق.\n\nماذا يجب أن يخبر مدير المشروع ذو الخبرة مدير المشروع الجديد ليفعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحليل لأصحاب المصلحة لتحديد الأهمية النسبية.",
          "correct": true
        },
        {
          "text": "تصنيف أصحاب المصلحة الرئيسيين باستخدام سجل العمل.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الاتصالات وفقًا لتفضيلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد أولويات أصحاب المصلحة بناءً على سجل أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الوقوف اليومي، اكتشف مدير المشروع أن أحد مطوري البرمجيات يواجه صعوبة في إكمال العمل بسبب نقص الخبرة في اختبار الأتمتة، مما قد يؤثر على هدف السبرينت. يوجد مهندس ضمان الجودة في الفريق لديه خبرة في اختبار الأتمتة ولكنه مشغول حاليًا بإعداد عرض تقديمي للموظفين الجدد.\n\nما الإجراء الذي سيزيد من فرص تحقيق هدف السبرينت؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تعيين مهمة الأتمتة إلى المهندس بمجرد انتهائه من العرض التقديمي.",
          "correct": false
        },
        {
          "text": "تدريب مطور البرمجيات على اختبار الأتمتة فورًا ثم المتابعة.",
          "correct": false
        },
        {
          "text": "طلب مساعدة مهندس ضمان الجودة لمطور البرمجيات في أقرب وقت ممكن.",
          "correct": true
        },
        {
          "text": "إعادة جدولة اختبار الأتمتة حتى يتوفر مهندس ضمان الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع مصفاة نفط في منتصف مرحلة التنفيذ. اكتشف فريق المشروع أن المشروع تأخر بسبب تغيير في اللوائح البيئية، وتأخيرات في المشتريات، وتغير الحكومة. ومع ذلك، لا يزال التسليم النهائي مطلوبًا بشكل عاجل.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إيقاف المشروع فورًا لتجنب المزيد من الخسائر، وامتصاص الخسارة الحالية.",
          "correct": false
        },
        {
          "text": "مراجعة تأثير التغييرات، والامتثال للوائح الجديدة، ثم اقتراح خطة واقعية.",
          "correct": true
        },
        {
          "text": "ترتيب المشتريات اللازمة، ومواصلة المشروع كما هو مخطط.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع والتفاوض مع الحكومة الجديدة لدفع الفواتير حتى تلك النقطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في أولى دوراته الست. الفريق موزع عالميًا، لذلك تُعقد الاجتماعات افتراضيًا. بعد الاجتماع اليومي الخامس، يدرك مدير المشروع أن ليس جميع الأعضاء يشاركون بنشاط.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "سؤال أعضاء الفريق عن سبب ضعف المشاركة.",
          "correct": false
        },
        {
          "text": "الانخراط وتوجيه الفريق لتشجيع جميع الأعضاء على المشاركة.",
          "correct": true
        },
        {
          "text": "مطالبة كل عضو بالمشاركة بشكل فردي في الاجتماعات القادمة.",
          "correct": false
        },
        {
          "text": "السماح للفريق بإيجاد طريقته الخاصة للمشاركة الكاملة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع لتحديث البنية التحتية لتقنية المعلومات في أحد البنوك. حصل مؤخرًا على موافقة خطة إدارة التغيير من الراعي. الآن، يطلب الراعي تنفيذ تقنية جديدة في الحل.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة التقنية الجديدة كخطر في سجل المخاطر.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تحديث الجداول وخطوط الأساس للتكلفة لتضمين التقنية الجديدة.",
          "correct": false
        },
        {
          "text": "طلب من الراعي شراء التقنية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعبر أحد المطورين عن قلقه من الوقت الذي يقضيه في الاجتماعات اليومية وتحديث القصص وإنشاء المهام ومراجعة التبعيات، بدلاً من كتابة الشيفرة. يدعم باقي الفريق هذا الرأي.\n\nماذا يجب أن يفعل القائد الخادم (servant leader) بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب اقتراحات حول كيفية إدارة الوقت بشكل أكثر فعالية.",
          "correct": false
        },
        {
          "text": "تقليل التفاعل بين أعضاء الفريق لزيادة وقت التطوير.",
          "correct": false
        },
        {
          "text": "شرح مفهوم “رادياتور المعلومات” (information radiator) للفريق.",
          "correct": false
        },
        {
          "text": "الاعتراف بإحباط المطور والتأكيد على فائدة كل نشاط.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل أحد المطورين التسليم الخاص بميزة معينة. مالك المنتج غير متأكد من كيفية تقييم جودة التسليم.\n\nبالنظر إلى أن المشروع يستخدم نهج أجايل، ما الأداة أو التقنية التي يجب على مالك المنتج استخدامها؟",
      "explanation": "",
      "choices": [
        {
          "text": "الحكم الخبير",
          "correct": false
        },
        {
          "text": "اتخاذ القرار",
          "correct": false
        },
        {
          "text": "العروض التوضيحية / المراجعات",
          "correct": true
        },
        {
          "text": "قوائم التحقق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا معقدًا لتطوير البرمجيات. لا يستطيع فريق المشروع الاتفاق على العملية التي يجب استخدامها عند حل مشكلة معينة.\n\nما النهج الذي يجب على مدير المشروع اتباعه لمساعدة الفريق في الوصول إلى توافق؟",
      "explanation": "",
      "choices": [
        {
          "text": "فرض السلطة الخبيرة وتحديد المسار للفريق.",
          "correct": false
        },
        {
          "text": "تحديث مصفوفة RACI وتعيين العمل لفريق مختلف.",
          "correct": false
        },
        {
          "text": "تعيين قائد فريق جديد لديه خبرة في حل مشاكل مشابهة.",
          "correct": false
        },
        {
          "text": "تيسير اجتماع وتشجيع الأعضاء على اقتراح حلول محتملة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إغلاق المشروع، يرى الفريق أن الاستعراض النهائي (retrospective) للسبرينت غير ضروري لأنه لم يتبقّ أي سبرينت.\n\nما النتيجة المفيدة المحتملة من عقد هذا الاستعراض؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحسين السرعة إذا تم تشكيل نفس الفريق مستقبلًا",
          "correct": false
        },
        {
          "text": "فرص الترقية لأعضاء الفريق",
          "correct": false
        },
        {
          "text": "معلومات قد تكون مفيدة للمشاريع المستقبلية",
          "correct": true
        },
        {
          "text": "نصائح للتكيف مع العمل الجماعي إذا حدث قريبًا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم طلب بعض مواد المشروع من الخارج. أبلغ المورّد فريق المشروع بأن المواد لن تصل في الوقت المحدد بسبب تأخير في التخليص الجمركي، مما سيؤثر على المسار الحرج.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "مطالبة فريق الخدمات اللوجستية بترتيب تخليص عاجل.",
          "correct": false
        },
        {
          "text": "مراجعة سجل المخاطر وتنفيذ الاستجابة المناسبة.",
          "correct": true
        },
        {
          "text": "تحديد السبب الجذري للتأخير وإضافته إلى وثائق العطاء.",
          "correct": false
        },
        {
          "text": "ضمان تغطية المورّد لأي تكاليف إضافية بسبب التأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مشروع مدته عام، سلّم الفريق كل ما طُلب وحدده مالك المنتج وحقق جميع أهداف السبرينت. كان المشروع يسير على المسار الصحيح من حيث الجدول والنطاق والميزانية. بعد بضعة أشهر من إطلاق المنتج، أظهرت استطلاعات رضا العملاء انخفاضًا مفاجئًا في رضا العملاء.\n\nما الذي يجب على مدير المشروع فعله لمنع تكرار هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع انطلاق (kick-off) في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تحسين تطبيق تقنيات اختبار الأتمتة.",
          "correct": false
        },
        {
          "text": "زيادة مشاركة مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "إجراء مراجعات دورية بمشاركة العميل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا في مشروع تحقيق. بسبب تعقيد المشروع، لم يكن مدير المشروع متأكدًا مما إذا كانت هناك أي لوائح تنطبق.\n\nكيف يجب على مدير المشروع تحديد اللوائح التي تنطبق على المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع مدير لديه سلطة أعلى لاتخاذ هذا القرار.",
          "correct": false
        },
        {
          "text": "الاتصال بمدير مكتب إدارة المشاريع (PMO) لأنه المسؤول عن تحديد اللوائح المطلوبة للمشاريع الأجايل.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين وفريق المشروع لفهم ما إذا كانت هناك أي لوائح تنطبق.",
          "correct": true
        },
        {
          "text": "طلب رسالة موقعة من العميل لتأكيد ما إذا كانت هناك لوائح تنطبق على أي من مخرجات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الانطلاق مع الراعي وأعضاء مختلفين في المشروع، اتضح أن وجود بعض المشاركين لم يكن ضروريًا. بالإضافة إلى ذلك، لم يكن أحد الخبراء المطلوبين على علم بالاجتماع ولم يحضره.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء منصة اتصال ثابتة لتوفير التحديثات حول المشروع لجميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إدارة مشاركة أصحاب المصلحة من خلال إشراكهم في المراحل المناسبة من المشروع.",
          "correct": true
        },
        {
          "text": "تطوير ميثاق المشروع بما في ذلك أدوار ومسؤوليات جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إنشاء مصفوفة المسؤوليات لإخطار أصحاب المصلحة بالاجتماعات التي يتعين عليهم حضورها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع أسبوعي للفريق، استعرض مدير المشروع تقدم المهام ووجد أن أحد أعضاء الفريق الكبار لم يتبع الخطة. حيث قام بتنفيذ المهام وفقًا لتفضيلاته الشخصية، دون التواصل مع مدير المشروع. هذا العضو خبير ويُعتبر موردًا حاسمًا للمشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا؟",
      "explanation": "",
      "choices": []
    },
    {
      "type": "multiple-choice",
      "text": "يقترب مدير مشروع مبتدئ من مدير مشروع كبير ويطلب مساعدته في بدء عملية الإغلاق النهائي لمشروع. قبل تقديم الإرشاد، يطلب مدير المشروع الكبير مزيدًا من المعلومات.\n\nما الذي يجب أن يسأله مدير المشروع الكبير أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "السؤال عما إذا تم استيفاء معايير قبول جميع المخرجات.",
          "correct": true
        },
        {
          "text": "السؤال عما إذا تم إنجاز المخرجات ضمن الميزانية وفي الوقت المحدد.",
          "correct": false
        },
        {
          "text": "السؤال عما إذا كان العميل قد دفع جميع نفقات تطوير المنتج.",
          "correct": false
        },
        {
          "text": "السؤال عما إذا تم تنفيذ أنشطة ضمان الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-select",
      "text": "يعمل مدير مشروع في شركة إنشاءات. المشروع الحالي هو مبادرة متعددة السنوات بقيمة عدة ملايين من الدولارات لإعادة بناء ملعب. تم الانتهاء من المرحلة الأولى من المشروع ضمن الإطار الزمني المحدد (ثلاثة أشهر) وضمن الميزانية.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانتقال إلى المرحلة التالية.",
          "correct": false
        },
        {
          "text": "الحصول على الموافقة من مدير البرنامج.",
          "correct": false
        },
        {
          "text": "البدء بإغلاق العقدي للمرحلة.",
          "correct": true
        },
        {
          "text": "البدء بعملية الإغلاق الإداري.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع لجنة التوجيه، أثار أحد التنفيذيين الكبار قلقًا من أنه بالرغم من أن معايير التكلفة الرئيسية يتم الإبلاغ عنها بأنها على المسار، إلا أن المشروع قد لا يكون يُسلم الأعمال التي تم جدولتها في الأصل.\n\nما القياس الذي يجب أن يستخدمه مدير المشروع لمعالجة هذا القلق؟",
      "explanation": "",
      "choices": [
        {
          "text": "فرق التكلفة (CV)",
          "correct": false
        },
        {
          "text": "القيمة المكتسبة (EV)",
          "correct": false
        },
        {
          "text": "فرق الجدول الزمني (SV)",
          "correct": true
        },
        {
          "text": "القيمة المخططة (PV)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق يتغيب كثيرًا عن اجتماعات فريق المشروع. بدلاً من العمل على المشروع الحالي، كان هذا العضو يعمل على مهمة مخصصة له من قبل مديره الوظيفي.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة تخصيص الموارد مع المدير الوظيفي لعضو الفريق.",
          "correct": true
        },
        {
          "text": "إزالة عضو الفريق من المشروع بسبب غياباته المتكررة.",
          "correct": false
        },
        {
          "text": "تسجيل الغيابات في تقييم أداء عضو الفريق.",
          "correct": false
        },
        {
          "text": "طلب رأي عضو فريق آخر حول المشكلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتصميم وتطوير استراتيجية لمؤسسة حكومية. يدرك مدير المشروع أن المشروع يحتوي على كمية محدودة من المعلومات التفصيلية لإعداد التقديرات، ولكن هناك عدة منظمات حكومية أخرى اعتمدت بالفعل نفس الاستراتيجية بنجاح.\n\nفي هذا السيناريو، أي نوع من طرق التقدير يجب على مدير المشروع اختياره؟",
      "explanation": "",
      "choices": [
        {
          "text": "النمذجة المعيارية (Parametric modeling)",
          "correct": false
        },
        {
          "text": "التقدير التشبيهي (Analogous estimation)",
          "correct": true
        },
        {
          "text": "التقدير بالنقاط الثلاث (Three-point estimating)",
          "correct": false
        },
        {
          "text": "حكم الخبراء (Expert judgment)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ لمشروع تكنولوجيا معلومات للرعاية الصحية، استقال مدير المشروع من جهة العميل ولم يتم تعيين بديل. يكتشف مدير المشروع الداخلي أن أصحاب المصلحة الرئيسيين لم يعودوا يتلقون التحديثات في الوقت المناسب.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة الرئيسيين فورًا بشكل مباشر.",
          "correct": false
        },
        {
          "text": "إبلاغ الرعاة بالمستجدات.",
          "correct": false
        },
        {
          "text": "الاستمرار في إرسال المعلومات حتى يتم تلقي رد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع لفريق المشروع، حدد أعضاء الفريق قائمة بالمخاطر التي قد تحدث أثناء تنفيذ المشروع. يرغب راعي المشروع في الاجتماع بمدير المشروع لتقييم أهمية كل خطر.\n\nما نوع التحليل الذي يجب على مدير المشروع تنفيذه للتحضير للاجتماع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل المخاطر النوعي (Qualitative risk analysis)",
          "correct": true
        },
        {
          "text": "تحليل المخاطر الكمي (Quantitative risk analysis)",
          "correct": false
        },
        {
          "text": "تحليل مونت كارلو (Monte Carlo risk analysis)",
          "correct": false
        },
        {
          "text": "تحليل حكم الخبراء (Expert judgment analysis)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند بدء المشروع، تم طلب عرض سعر للخدمات المطلوبة من أحد الموردين، وتم تقدير العمل بمبلغ 100,000 دولار أمريكي. مع تقدم المشروع، تم تحديث المتطلبات واتباع عملية الشراء الخاصة بالشركة، وتم استلام عرض معدل يتجاوز 250,000 دولار. الأموال المخصصة للاحتياطي غير كافية لتغطية الفرق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة بدء عملية الشراء واختيار مورد جديد.",
          "correct": false
        },
        {
          "text": "مراجعة نوع العقد الذي سيتم منحه للمورد.",
          "correct": false
        },
        {
          "text": "المضي قدمًا بأفضل عرض وفقًا لعملية الشراء.",
          "correct": false
        },
        {
          "text": "إشراك لجنة التوجيه وتصعيد المشكلة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أطلقت شركة مشروعًا استراتيجيًا جديدًا. تم تحديد الهدف ونطاق المشروع بشكل غير دقيق خلال اجتماع اللجنة التنفيذية، وتم تعيين أصحاب المصلحة. يحتاج مدير المشروع إلى عقد اجتماع بدء المشروع، ولكن معظم أصحاب المصلحة في مواقع مختلفة والبعض منهم في إجازة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع بدء المشروع مع أصحاب المصلحة المتاحين وتحديث الآخرين لاحقًا.",
          "correct": false
        },
        {
          "text": "تأجيل اجتماع بدء المشروع حتى عودة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة جلسات فردية مع أصحاب المصلحة قبل مغادرتهم.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع افتراضي لبدء المشروع مع أصحاب المصلحة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصميم فندق حضري يضم فريقًا دوليًا ومتعدد التخصصات والثقافات. مدير المشروع بصدد إعداد النسخة الأولى من خطة إدارة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام أسلوب الشلال في إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تفويض معظم المهام لأعضاء الفريق المتواجدين في نفس المنطقة الزمنية.",
          "correct": false
        },
        {
          "text": "استخدام قناة تواصل واحدة لجميع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "دمج الاعتبارات الثقافية ضمن خطة إدارة المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع مسؤول عن مشروع كبير يتضمن التعامل مع العديد من الموردين. مصدر قلق رئيسي يتعلق بجودة وتسليم المنتجات والخدمات المشتراة في الوقت المحدد كما التزم بها الموردون.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تلبية المنتجات لمتطلبات الجودة وتسليمها في الوقت المحدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدراج بند في سجل المخاطر لتوثيق التأثيرات المحتملة المتعلقة بتأخيرات التوريد، وتقليل خطر الجودة غير المثلى.",
          "correct": false
        },
        {
          "text": "إجراء مراجعات أداء الشراء بانتظام مع جميع الموردين المتعاقد معهم لضمان تسليم المنتجات والخدمات في الوقت المحدد ووفقًا للعقد المتفق عليه.",
          "correct": true
        },
        {
          "text": "تفويض إدارة عملية الشراء والتعامل مع الموردين إلى قسم المشتريات في المؤسسة لأنه يمتلك الأدوات والوسائل اللازمة للتعامل مع عدد كبير من الموردين.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الموردين مع جميع الموردين لضمان توافقهم مع الخطة وتقليل خطر عدم التسليم أو المنتجات منخفضة الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتلقى مدير المشروع بريدًا إلكترونيًا بعد وقت قصير من بدء السبرينت. الرسالة من أحد أصحاب المصلحة الرئيسيين غير الملمين بمنهجيات الأجايل ويعبر فيها عن شكوى جدية بشأن العمل الذي بدأ للتو. يصر صاحب المصلحة على أن أحد المخرجات يجب تغييره.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "معالجة الطلب خلال اجتماع السكوم اليومي وطلب رأي فريق المشروع.",
          "correct": false
        },
        {
          "text": "تعديل سجل الأعمال الخلفية لتنفيذ التغيير، وإخبار الفريق ببدء العمل على المخرج المطلوب فورًا.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع صاحب المصلحة ومالك المنتج لمناقشة الطلب.",
          "correct": true
        },
        {
          "text": "إلغاء السبرينت الحالي، وجدولة اجتماع مراجعة استثنائي ودعوة صاحب المصلحة لمناقشة الطلب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مورد أجنبي لإنتاج آلة محددة في مصنع. قبل تسليم آخر مكونين، يُبلغ المورد مدير المشروع بأنه بحاجة إلى إعادة التفاوض بشأن الأسعار وإلا فلن يتم تسليم المكونات.\n\nما الذي يجب أن يفعله مدير المشروع أولًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع قضية قانونية ضد الشركة لخرق العقد.",
          "correct": false
        },
        {
          "text": "التوجه لموردين بديلين للحصول على المكونين المتبقيين.",
          "correct": false
        },
        {
          "text": "العمل مع المورد للاتفاق على أسعار جديدة لتقليل الأثر المالي.",
          "correct": false
        },
        {
          "text": "تفعيل خطة الاستجابة لهذا الخطر بناءً على مؤشرات التفعيل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مشروع تنبؤي، كان مدير المشروع بصدد الانتهاء من معايير الإغلاق لمشروع تطوير نظام مهم. في هذه المرحلة، أبلغ أحد أصحاب المصلحة المسؤولين عن المخاطر والامتثال مدير المشروع بأن هناك مخرجًا إضافيًا يجب إنجازه بسبب قانون جديد تم تمريره مؤخرًا من قبل الحكومة المحلية. من المتوقع أن يؤثر هذا التغيير على تاريخ إصدار المشروع المجدول.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة وإبلاغهم أن الطلب لم يكن جزءًا من معايير الإغلاق.",
          "correct": false
        },
        {
          "text": "التعاون مع صاحب المصلحة وتقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى الراعي لتجنب تأخير موعد الإصدار.",
          "correct": false
        },
        {
          "text": "إضافة هذا الخطر الجديد إلى سجل المخاطر ومراقبته لأن التغييرات خارج نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إبلاغ مدير المشروع أن أول شحنة من عدة شحنات رئيسية قادمة من بلد آخر ستتأخر. هذه الشحنات تقع على المسار الحرج، وسيؤدي هذا التأخير إلى فوات أحد المعالم الرئيسية.\n\nما الذي يجب أن يفعله مدير المشروع أولًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل الدروس المستفادة وخطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني للمشروع وإخطار أصحاب المصلحة بالتأخير.",
          "correct": false
        },
        {
          "text": "تسجيل التأخير في سجل المشكلات وتطوير خطة عمل فورية.",
          "correct": true
        },
        {
          "text": "تحديد الأطراف المسؤولة عن التأخير لإصدار غرامات مالية عليهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعرب أحد أصحاب المصلحة عن قلقه من أن المشروع يتأخر عن الجدول الزمني، بناءً على معلومات غير رسمية من فريق المشروع. على الرغم من أن بعض المهام قد تأخرت، إلا أن لديها هوامش زمنية حرة، والمشروع ما زال يسير وفقًا للخطة. تواصل مدير المشروع فورًا مع صاحب المصلحة لعرض وشرح أحدث تقارير حالة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إصدار مذكرة تفيد بأن حالة المشروع لا تُشارك إلا من خلال القنوات المعتمدة.",
          "correct": false
        },
        {
          "text": "إدراج صاحب المصلحة في قائمة البريد الخاصة بتقارير الحالة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات الخاصة بالمشروع مع الفريق وتحديثها إذا لزم الأمر.",
          "correct": true
        },
        {
          "text": "تعديل تقارير الحالة لتحديد التأخيرات التي تستوجب اتخاذ إجراء بوضوح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الانتهاء من مرحلة التطوير لمنتج جديد. على وشك بدء اختبار التحقق، ولكن قائد الاختبار لا يتفق مع معايير الاختبار.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "فهم سبب الخلاف وتقديم طلب تغيير إلى لجنة التحكم بالتغيير إذا كان مناسبًا.",
          "correct": true
        },
        {
          "text": "تنفيذ خطة لتعديل معايير الاختبار لبدء اختبار التحقق كما هو مجدول.",
          "correct": false
        },
        {
          "text": "الإبقاء على معايير اختبار التحقق دون تغيير لأن التعديلات ستؤثر على جدول المشروع.",
          "correct": false
        },
        {
          "text": "شرح كيف أن التغييرات قد تؤثر على المشروع وإقناع قائد الاختبار بالالتزام بالمعايير الأصلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا لمشروع متعدد الجنسيات موجود مسبقًا، ولا يعرف أصحاب المصلحة الرئيسيين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب اجتماع مع مدير الموارد.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "طلب رأي أو حكم الخبراء من الراعي.",
          "correct": false
        },
        {
          "text": "تحديد أداة الاتصال وتحديث الخطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تسير مؤسسة في منتصف مشروع مدته خمس سنوات، وكل شيء يسير حسب الجدول الزمني. تُشير التقييمات الأخيرة إلى أن المشروع لن يتوافق مع تنظيم دولي تم إصداره مؤخرًا.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "المضي في المشروع لأن التنظيم الجديد لم يكن جزءًا من متطلبات المشروع الأصلية.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل مع لجنة توجيه المشروع لمراجعة التنظيم الجديد وإيجاد حل.",
          "correct": true
        },
        {
          "text": "الاستفادة من الاحتياطي الاحترازي لتمويل المهام الإضافية المطلوبة للامتثال للتنظيم الجديد.",
          "correct": false
        },
        {
          "text": "طلب أموال من الاحتياطي الإداري لأن التنظيم الجديد يُعتبر خطرًا غير معروف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم نشر حل جديد في عدة دول. طلبت الدولة (أ) تغييرًا في الحل ليتوافق مع سوق عملائها المحلي. قبل مدير المشروع المسؤول عن الدولة (أ) هذا التغيير. وعندما استلم مدير المشروع في الدولة (ب) النسخة الجديدة من الحل، فشلت الاختبارات لأن النسخة لا تتوافق مع أنظمة الدولة (ب).\n\nما الذي كان يجب فعله لتجنب هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "منع الموافقة على التغييرات.",
          "correct": false
        },
        {
          "text": "ضمان توافق جميع الدول مع متطلبات الدولة (أ).",
          "correct": false
        },
        {
          "text": "تحليل جميع طلبات التغيير خلال نشر الحل في كل دولة على مستوى عالمي قبل التنفيذ.",
          "correct": true
        },
        {
          "text": "ضمان أن أي دولة تطلب تغييرات تتحمل تكلفة التغييرات المطلوبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يراجع مدير المشروع حالة المشروع مع الفريق ويلاحظ أن أحد الموارد التابعة لمورد خارجي يمكن الاستغناء عنها في وقت أبكر من المخطط له. بعد مراجعة الجدول الزمني وتأكيد التغيير، يُبلغ المدير المورد. يعترض المورد قائلاً إن المورد يجب أن يبقى لفترة محددة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإبقاء على الجدول كما هو لأن المورد يجب أن يبقى.",
          "correct": false
        },
        {
          "text": "تأكيد التغييرات في الجدول الزمني ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الاستعداد لتحرير المورد وإعادته إلى المورد الأصلي.",
          "correct": false
        },
        {
          "text": "مراجعة الشروط والأحكام في عقد المورد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انتهى مدير المشروع للتو من إعداد ميثاق المشروع وحصل على الموافقة من الراعي. خلال عرض الميثاق على أصحاب المصلحة، لاحظ أن بعضهم لم يشارك بنشاط في الاجتماع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدراج ذلك في سجل المخاطر لأن مدير المشروع غير متأكد من فهم أصحاب المصلحة لمسؤولياتهم.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات فردية مع هؤلاء أصحاب المصلحة للتأكد من فهمهم للمخرجات الرئيسية ومسؤولياتهم.",
          "correct": true
        },
        {
          "text": "إبلاغ الراعي بمخاوفه بشأن قلة مشاركة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "طلب من فريق المشروع مراقبة مشاركة هؤلاء أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تسليم برنامج جديد. تم إطلاق البرنامج في بيئة الإنتاج، ولكن أعضاء الفريق ما زالوا يتلقون اتصالات من المستخدمين للاستفسار عن كيفية استخدام البرنامج أو الإبلاغ عن مشاكل، رغم أن المشروع قد تم إغلاقه إداريًا.\n\nما الذي كان يجب أن يفعله مدير المشروع لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدراج نشاط في نطاق المشروع يسمح للفريق بدعم الأداة بعد الإطلاق.",
          "correct": false
        },
        {
          "text": "إبلاغ المؤسسة بانتهاء المشروع رسميًا وفقًا لخطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "ضمان انتقال المنتج النهائي إلى جهة أو فريق آخر لتولي مسؤولية البرنامج خلال دورة حياته.",
          "correct": true
        },
        {
          "text": "الطلب من أعضاء الفريق التوقف عن الرد على الأسئلة وتشجيع المستخدمين على مراجعة الوثائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "شركة اعتادت استخدام الأساليب التنبؤية بدأت باستخدام الأجايل في جزء من مشروع. نظرًا للنتائج الإيجابية، طلب الراعي تحويل المشروع بالكامل إلى أجايل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اقتراح تطبيق التحول إلى أجايل في المشاريع الجديدة فقط.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": true
        },
        {
          "text": "استشارة مالك المنتج لأنه قد تكون لديه أسباب للاستمرار بالأسلوب التنبؤي.",
          "correct": false
        },
        {
          "text": "تحويل المخرجات إلى قصص مستخدمين وإبلاغ الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم استبدال عضو أساسي في فريق أجايل بعضو أقل خبرة. أحد أصحاب المصلحة قلق من أن المشروع لن يتم تسليمه في الوقت المحدد بسبب هذا التغيير.\n\nما الذي يجب أن يفعله مدير المشروع لضمان نجاح تسليم المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة هذا القلق كخطر في سجل المخاطر وتصعيده إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "الاجتماع مع مديره الوظيفي لتقييم الوضع والحصول على توجيهات.",
          "correct": false
        },
        {
          "text": "عكس قرار الاستبدال وإعادة العضو السابق إلى الفريق.",
          "correct": false
        },
        {
          "text": "تقييم تأثير الاستبدال وإجراء تعديلات إضافية في الموارد إذا لزم الأمر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة لوحة سكرم لمشروع هجين، اقترح أحد أعضاء الفريق إضافة مهمة خارج نطاق الأساس. يمكن أن تقلل هذه المهمة من خطر المشروع، وتم طرحها أثناء المراجعة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم جدوى وتأثير إدراج المهمة وإدراجها في السبرنتات المستقبلية إذا كان ذلك مناسبًا.",
          "correct": true
        },
        {
          "text": "إعطاء التعليمات لمالك المنتج لتقييم فائدة النشاط فيما يتعلق بمتطلبات المشروع الأولية.",
          "correct": false
        },
        {
          "text": "توجيه الفريق نحو نشاط المسار الحرج ووضع المهمة في عمود المهام المؤجلة للمراجعة لاحقًا.",
          "correct": false
        },
        {
          "text": "توثيق المهمة ضمن وثائق المشروع، مع ملاحظة أنها قد تقلل المخاطر لكنها خارج النطاق المعتمد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم توسيع مشروع أجايل من مرحلة دراسة الجدوى إلى مرحلة التنفيذ. بسبب ضيق الوقت، تم تعيين نفس الفريق للمشروع باستثناء عضو واحد تم استبداله بعضو جديد. لا يتفق العديد من أعضاء الفريق مع العضو الجديد وهم غير مستعدين للعمل في المرحلة التالية.\n\nكيف يجب على مدير المشروع التأكد من أن الفريق مستعد للمرحلة القادمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تقييم للتسليم التدريجي.",
          "correct": false
        },
        {
          "text": "إجبار الفريق على البقاء معًا.",
          "correct": false
        },
        {
          "text": "طلب التزام رسمي من الفريق.",
          "correct": true
        },
        {
          "text": "إزالة العضو الجديد من الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع فريقًا لمشروع يهدف إلى تعزيز قدرة منتج في السوق.\n\nما الذي يجب أن يكون أهم اعتبار عند تحديد مؤشرات الأداء الرئيسية (KPIs) للفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاتساق مع نمو وتطور الفرد.",
          "correct": false
        },
        {
          "text": "الاتساق مع احتياجات العميل.",
          "correct": true
        },
        {
          "text": "الاتساق مع أهداف مدير المشروع.",
          "correct": false
        },
        {
          "text": "الاتساق مع أهداف العمل الخاصة بالراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع أجايل في مرحلته الثالثة. خلال هذه المرحلة، يتواصل العميل مع مدير المشروع لطلب ميزات إضافية. تُعتبر هذه الميزات مهمة ويمكن استيعابها دون الحاجة إلى موارد إضافية كبيرة. يطلب العميل تنفيذ التغييرات فورًا في السبرنت الحالي.\n\nكيف يجب أن يرد مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تذكير العميل بأنه لا يُسمح بإجراء تغييرات وفقًا للعقد.",
          "correct": false
        },
        {
          "text": "تعديل السبرنت الحالي لإدراج الميزات الإضافية.",
          "correct": false
        },
        {
          "text": "إعطاء أولوية للميزات الإضافية في بداية السبرنت القادم.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بأنه سيتم إدراج الميزات الجديدة في مرحلة لاحقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في منتصف دورات التكرار العشر. خلال التكرار الأخير، اضطر الفريق للعمل لساعات إضافية لتحقيق الهدف. في مراجعة التكرار، اتفق الفريق على أنهم استغرقوا وقتًا أطول من المخطط لأنهم لم يمتلكوا الخبرة المطلوبة عند تنفيذ المهام المخصصة لأول مرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب تدريب إضافي للفريق من الراعي.",
          "correct": false
        },
        {
          "text": "طلب من الراعي الموافقة على طلب تغيير للحصول على وقت إضافي في التكرارات المستقبلية.",
          "correct": false
        },
        {
          "text": "طلب من الفريق إعادة تقييم تقديرات الجهد في جلسة تخطيط التكرار.",
          "correct": true
        },
        {
          "text": "طلب من مالك المنتج إعادة ترتيب أولويات سجل المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "الفريق أ من المشروع يطلق برنامجًا معقدًا بالتعاون مع الفرق ب، ج، و د.\n\nما الذي يجب أن يكون أولوية مدير مشروع الفريق أ خلال المراحل الأولى من المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم حدث لبناء الفريق يضم أعضاء من الفرق أ، ب، ج، و د.",
          "correct": false
        },
        {
          "text": "تضمين لوحة قياسات للفرق ب، ج، و د.",
          "correct": false
        },
        {
          "text": "تحديد نفس الأولويات كما لدى الفرق ب، ج، و د.",
          "correct": false
        },
        {
          "text": "طلب من الفرق أ، ب، ج، و د تحديد التبعيات الحرجة والمخاطر والمعالم الرئيسية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لكي يعمل الفريق بشكل أمثل، يجب أن يمتلك ميثاق مشروع يوضح الرؤية أو الهدف من المشروع ومجموعة واضحة من الاتفاقيات التشغيلية.\n\nلتحقيق ذلك، ما السؤال الذي يجب أن يجيب عنه ميثاق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "لماذا يتم تنفيذ هذا المشروع؟",
          "correct": true
        },
        {
          "text": "لماذا أعطت المؤسسة الأولوية لهذا المشروع؟",
          "correct": false
        },
        {
          "text": "ما هي المخاطر الرئيسية وكيفية التخفيف منها؟",
          "correct": false
        },
        {
          "text": "من سيقوم بالعمل؟",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في أول دورة من عشر تكرارات. بعد مراجعة التكرار، تلقى الفريق ملاحظات من أصحاب المصلحة بأن أول مخرج لا يتماشى مع أهداف المشروع.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الفريق الاجتماع مع أصحاب المصلحة لفهم احتياجاتهم.",
          "correct": false
        },
        {
          "text": "طلب من مالك المنتج مراجعة سجل المنتج وأولوياته.",
          "correct": true
        },
        {
          "text": "طلب من أصحاب المصلحة ترتيب أولويات احتياجاتهم.",
          "correct": false
        },
        {
          "text": "طلب من الراعي تحديد أولويات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنشأ فريق أجايل سجل مخاطر لمشروع. تم تحديد جميع المخاطر الأولية من خلال مقابلات أصحاب المصلحة وورش العمل ومعلومات من ميثاق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع لإدارة سجل المخاطر والمخاطر المرتبطة خلال بقية مدة المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم وتحديد أولويات المخاطر خلال كل اجتماع مراجعة تكرار.",
          "correct": false
        },
        {
          "text": "تضمين المخاطر كموضوع في اجتماعات سكرم اليومية.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر ومراجعة المخاطر مع الفريق بشكل منتظم.",
          "correct": true
        },
        {
          "text": "القضاء على جميع مخاطر المشروع باستخدام إدارة المخاطر التكرارية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اجتماعات التعاون اليومية، يشتكي العديد من أعضاء الفريق من أنهم لا يستطيعون التركيز بسبب بيئة العمل الصاخبة.\n\nمن المسؤول عن حل هذه المشكلة من خلال إنشاء بيئة عمل أكثر ملاءمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الراعي.",
          "correct": false
        },
        {
          "text": "أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "مالك المنتج.",
          "correct": false
        },
        {
          "text": "مدير المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق مشروع أجايل يقوم ببناء موقع إلكتروني لعميل. أبلغ العميل مالك المنتج أن شركته قررت إطلاق الموقع قبل شهر من الموعد المحدد، من أجل استغلال فرصة عمل.\n\nما الذي يجب أن يطلبه مدير المشروع من الفريق فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخصيص موارد إضافية لإكمال العمل قبل شهر من الموعد.",
          "correct": false
        },
        {
          "text": "الاجتماع كمجموعة لتقييم ما يمكن إنجازه وفقًا للجدول الزمني الجديد.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بأنه من غير الممكن إطلاق الموقع في وقت مبكر.",
          "correct": false
        },
        {
          "text": "عقد اجتماع استرجاعي لفهم كيفية تسريع العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع جديد بتطبيق ممارسات أجايل لتحسين أداء الفريق.\n\nما هو الأسلوب الذي يجب أن يتبعه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام تقنيات الاستماع النشط لتلبية احتياجات الفريق.",
          "correct": false
        },
        {
          "text": "طلب ميزانية من قسم المالية لتدريب أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تخصيص ميزانية لأنشطة الفريق خلال مرحلة التخطيط.",
          "correct": false
        },
        {
          "text": "ضمان إجراء اجتماعات استرجاعية للفريق بانتظام.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اعتمد فريق مشروع أجايل ممارسات مرنة لتلبية الحاجة إلى تطوير تطبيق. أحد أعضاء الفريق الكبار يحضر الاجتماعات بشكل غير منتظم، بما في ذلك اجتماعات الوقوف اليومية، ويطلب من الآخرين تقديم تحديثات الحالة نيابة عنه.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب إزالة العضو الكبير من الفريق بسبب مشاكل في المشاركة.",
          "correct": false
        },
        {
          "text": "تذكير العضو الكبير بالالتزام باتفاقية العمل الخاصة بالفريق.",
          "correct": true
        },
        {
          "text": "تصعيد مسألة مشاركة العضو الكبير إلى الإدارة العليا.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق الآخرين تغطية مهام العضو الكبير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل لتطبيق عملية أتمتة جديدة في مصنع قيد التنفيذ. يحتاج مدير المشروع إلى مورد خارجي للمساعدة في التثبيت.\n\nماذا يجب أن يفعل مدير المشروع قبل أن يبدأ المورد في العمل مع الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تفويض جميع القرارات الرئيسية إلى فريق المورد لتجنب تحمل المخاطر.",
          "correct": false
        },
        {
          "text": "عقد جلسة تعريفية لضمان وجود فهم مشترك لأهداف المشروع ومتطلباته.",
          "correct": true
        },
        {
          "text": "تقديم مصفوفة الاتصال بحيث يكون جميع أعضاء الفريق والموردين معروفين.",
          "correct": false
        },
        {
          "text": "تذكير الفريق بأن المورد يعمل لصالحهم وأن بإمكانهم اتخاذ القرارات النهائية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق بدأ يفقد اهتمامه تدريجيًا بالمشروع الجاري.\n\nما الذي يجب أن يفعله مدير المشروع لضمان مشاركة هذا العضو؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحدث مع العضو، وفهم المشكلة، ومطالبته بوضع إجراءات تصحيحية.",
          "correct": true
        },
        {
          "text": "طلب من عضو آخر في الفريق أن يكون مرشدًا للعضو غير المشارك.",
          "correct": false
        },
        {
          "text": "عقد اجتماع جماعي لمناقشة توقعات المشاركة.",
          "correct": false
        },
        {
          "text": "طلب من العضو غير النشط حضور تدريب إضافي لتحسين مهاراته التواصلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير المشروع بإنشاء قائمة أصحاب المصلحة ويقرر الآن كيفية توزيع المعلومات بفعالية على العميل.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع جميع أصحاب المصلحة وجهًا لوجه أسبوعيًا.",
          "correct": false
        },
        {
          "text": "إرسال التحديثات إلى جميع أصحاب المصلحة، بما في ذلك العميل.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لأصحاب المصلحة وإعداد خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "مراجعة البيانات السابقة المرسلة إلى عملاء آخرين واتباع نفس النهج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر مدير المشروع في منظمة هجينة سريعة النمو بالإحباط المتزايد بسبب الكم الهائل من التغيرات في العمليات اليومية. غادر العديد من الأعضاء الجدد الفريق أو تمت ترقيتهم إلى أدوار أخرى في المنظمة.\n\nماذا يجب أن يفعل مدير المشروع لضمان بقاء حوكمة المشروع مستقرة؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع القيادة لتحديث الأصول التنظيمية للعمليات (OPAs).",
          "correct": true
        },
        {
          "text": "تطوير عقد اجتماعي جديد لتمكين الفريق.",
          "correct": false
        },
        {
          "text": "تحديث ميثاق الفريق بأعضاء الفريق الجدد.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المشروع بانتظام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأت الشركة في تنفيذ مشاريع أجايل. يشعر الراعي بالإحباط ولا يفهم عملية جمع المتطلبات الجديدة، والتي تبدو غير مكتملة وتتحرك بسرعة كبيرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مساعدة الراعي على فهم الأدوات والتقنيات المختلفة المتاحة ولماذا تم اختيار هذه الطريقة.",
          "correct": true
        },
        {
          "text": "تحديث سجل أصحاب المصلحة لتحديد الراعي كمصدر محتمل للعوائق.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بعدم رضا الراعي والتحول من التخطيط التكراري إلى التخطيط التنبؤي.",
          "correct": false
        },
        {
          "text": "إيقاف العمل في المشروع حتى يتمكن سكرم ماستر من مراجعة سجل المنتج بالكامل مع الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع في مرحلة بدء مشروع جديد ويستعد لتطوير ميثاق فريق المشروع. يتكون فريق المشروع من أعضاء من أقسام مختلفة داخل المنظمة، والتعاون أمر حيوي لنجاح المشروع. ماذا يجب أن يفعل مدير المشروع لإنشاء ميثاق فريق فعال؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء ميثاق الفريق بشكل مستقل، وتحديد توقعاته وأهدافه للفريق.",
          "correct": false
        },
        {
          "text": "عقد اجتماع انطلاقة مع الفريق لتحديد الغرض والأدوار والمسؤوليات والأهداف بشكل تعاوني.",
          "correct": true
        },
        {
          "text": "تفويض مهمة إعداد الميثاق إلى عضو فريق كبير لديه خبرة في إدارة المشاريع.",
          "correct": false
        },
        {
          "text": "مشاركة قالب عام لميثاق فريق المشروع مع الفريق ودعوتهم لتعديله حسب الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بالتوسع، ويفكر مدير المشروع فيما إذا كان يجب توظيف موارد جديدة أو الاستعانة بموارد من فريق مورد معتمد. ما الذي يجب أن يركز عليه مدير المشروع بخصوص هذا القرار؟",
      "explanation": "",
      "choices": [
        {
          "text": "استراتيجية التوريد والمعايير الخاصة بالمؤسسة.",
          "correct": false
        },
        {
          "text": "تكلفة توظيف موارد جديدة مقابل الاستعانة بمصادر خارجية.",
          "correct": true
        },
        {
          "text": "قوة الموارد الداخلية في المؤسسة مقابل موارد المورد.",
          "correct": false
        },
        {
          "text": "تكلفة الموارد الداخلية مقابل تكلفة موارد المورد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تحاول مؤسسة اعتماد أساليب أجايل لتنفيذ المشاريع لعملائها. خلال تخطيط المشروع، اقترح مالك المنتج أن أي إصدار للعميل يجب أن يحصل على موافقة من القسم القانوني قبل الإرسال. يشعر فريق التطوير بالإحباط لأن هذا قد يؤخر الإصدارات وجدول التسليم.\n\nنظرًا لأن الأقسام الأخرى في المنظمة لا تستخدم أجايل، ما هو دور مدير المشروع كقائد خادم؟",
      "explanation": "",
      "choices": [
        {
          "text": "نصح الإدارة العليا بإدخال تقنيات أجايل إلى جميع الأقسام لضمان تقديم خدمات سلسة للعملاء.",
          "correct": false
        },
        {
          "text": "الاستمرار في استخدام الإجراءات التنظيمية الموحدة لضمان الامتثال للسياسات وتجنب خلق مشاكل.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بالإجراءات التنظيمية وطلب مناقشة ذلك مع قيادة المنظمة.",
          "correct": false
        },
        {
          "text": "العمل مع القسم القانوني والأقسام الأخرى المعنية لمراجعة العمليات التي تدعم تسليم المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثار أحد أعضاء الفريق قلقًا من أن بعض التسليمات قد لا تكون متوافقة مع بعض اللوائح.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ترتيب اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين للحصول على توضيح حول اللوائح التي قد تؤثر على تسليمات المشروع.",
          "correct": true
        },
        {
          "text": "طلب رسالة رسمية من العميل لتأكيد ما إذا كانت اللوائح تنطبق على تسليمات المشروع.",
          "correct": false
        },
        {
          "text": "سؤال مكتب إدارة المشاريع (PMO) إذا كانت تسليمات المشروع خاضعة للوائح، وإذا كان الأمر كذلك، كيفية المتابعة لضمان الامتثال.",
          "correct": false
        },
        {
          "text": "الاتصال بمدير عضو الفريق الذي أثار القلق لتحديد المهام المطلوبة للحفاظ على الامتثال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على شركة إطلاق منتج عالمي استجابة لتهديد تنافسي. كجزء من نهج أجايل، يختار الفريق الإقليم X كأساس لاختبار التكرار الأول. بينما يفي المنتج بالمعايير والمتطلبات في الإقليم X، إلا أنه لا يفي بمعيارين في إقليمين آخرين.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من أن المنتج يفي بالمعايير والمتطلبات في الإقليم X، والتخطيط للتكرارات المستقبلية لمعالجة عدم الامتثال في الأقاليم الأخرى.",
          "correct": true
        },
        {
          "text": "توثيق ذلك كعدم امتثال في خطة إدارة الجودة وتصحيحه في التكرار التالي.",
          "correct": false
        },
        {
          "text": "إعادة تخطيط جميع التكرارات لتفي بمعايير الأقاليم الثلاثة ضمن نطاق العمل.",
          "correct": false
        },
        {
          "text": "الاتصال بالعملاء في كل إقليم للتوصل إلى اتفاق حول التصميم الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق سكرم في منتصف الطريق نحو الإصدار. خلال عرض السبرينت، قام أحد المطورين باختيار برنامج جديد وعرضه على الفريق. لم يكن هذا العمل مخططًا له، لكنه يفي بتاريخ الإصدار. ومع ذلك، تم تعطيل عدة ميزات ذات أولوية في السبرينتين القادمتين.\n\nما الإجراءات التي يجب أن يتخذها الفريق لتقليل التعطيل؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع مالك المنتج على قائمة الأعمال لإدخال البرنامج الجديد.",
          "correct": true
        },
        {
          "text": "يتخذ فريق سكرم القرارات بنفسه كفريق منظم ذاتيًا ويعرض التغيير خلال العرض.",
          "correct": false
        },
        {
          "text": "يتواصل المطورون مع سكرم ماستر بخصوص التغيير لتحديد المكان والوقت المناسب لمناقشته.",
          "correct": false
        },
        {
          "text": "يقيم فريق سكرم البرنامج الجديد ويبلغ العميل بتأثيره على خطة الإصدار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرب نهاية مشروع كبير، لم تكن بعض التقارير الفنية المتعلقة بالخدمة المقدمة جاهزة. طلب مدير المشروع من أعضاء الفريق المستندات المفقودة، لكن الفريق ادعى أنهم قد أنجزوا مهامهم المكلفة بالفعل.\n\nكيف يجب على مدير المشروع معالجة هذا القلق؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الهيكل التنظيمي لتأكيد المناصب والعلاقات.",
          "correct": false
        },
        {
          "text": "الرجوع إلى مخطط RACI للتحقق من الأدوار والمسؤوليات المسندة.",
          "correct": true
        },
        {
          "text": "مناقشة قائمة الأنشطة وضمان فهم الفريق للعمل المطلوب.",
          "correct": false
        },
        {
          "text": "إدخال جميع الافتراضات والقيود في سجل الافتراضات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اشتكى مدير وظيفي مشارك في المشروع من تقارير مقاييس الجودة الأخيرة المتعلقة بجميع التكرارات السابقة. لا يعتقد الفريق أن هذه الشكوى صحيحة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصحيح التقارير لتلبية شكوى المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "التحدث مع المدير الوظيفي لفهم مخاوفه المحددة.",
          "correct": true
        },
        {
          "text": "مراجعة مصفوفة RACI لتحديد المسؤول عن مقاييس الجودة.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق جودة للتحقق من صحة مقاييس الجودة المطبقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من المقرر أن يزور أحد أعضاء الفريق موقع عميل خارجي الأسبوع المقبل. ومع ذلك، سمع مدير المشروع هذا العضو يخبر منسق المشروع أن مديره الوظيفي رفض منحه إجازة تعويضية مقابل الزيارة. يحتاج مدير المشروع إلى ضمان أن يقوم العضو بالزيارة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مباشرة مع عضو الفريق لإبلاغه بما تم سماعه.",
          "correct": false
        },
        {
          "text": "التأكد من عضو الفريق بأن الزيارة للعميل يمكن أن تتم.",
          "correct": true
        },
        {
          "text": "مواجهة المدير الوظيفي بشأن إجازة عضو الفريق.",
          "correct": false
        },
        {
          "text": "تسجيل المشكلة كخطر في سجل المخاطر وتعيين عضو فريق آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أطلق رائد أعمال مشروعًا لتطوير البرمجيات. تمت الموافقة على ميثاق المشروع، وتم تعيين مدير مشروع للإشراف على تنفيذ المشروع. أثناء التطوير، ظهرت مخاطر سياسية غير متوقعة، مما أدى إلى حاجة ملحة لتسريع المشروع. طلب الراعي تقريرًا حول أي تأخيرات متوقعة.\n\nأي أداة يجب أن يستخدمها مدير المشروع لإعداد التقرير عن التأخيرات المتوقعة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل الاتجاهات",
          "correct": true
        },
        {
          "text": "تحليل السبب الجذري",
          "correct": false
        },
        {
          "text": "تقارير الجودة",
          "correct": false
        },
        {
          "text": "قائمة الإنجازات المرحلية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كانت الشركة تقدم خدمات تقنية للعملاء باستخدام عمالة خارجية. عندما تولى مدير مشروع جديد، قام الفريق بتوظيف أفراد متخصصين لتقليل التكاليف عن طريق تقديم الخدمة داخليًا. بعض أصحاب المصلحة مستاؤون من أن الموارد تستغرق وقتًا طويلاً لتقديم الخدمة.\n\nماذا يجب أن يفعل مدير المشروع لمعالجة هذا القلق؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة الاتصال مع أصحاب المصلحة المستائين.",
          "correct": false
        },
        {
          "text": "زيادة فهم أصحاب المصلحة لنهج المشروع.",
          "correct": true
        },
        {
          "text": "إعادة توظيف المتعاقد الخارجي الذي قدم الخدمة سابقًا.",
          "correct": false
        },
        {
          "text": "تطوير مسار تصاعدي وإبلاغ أصحاب المصلحة بخطة التدرج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام بائع في مشروع كبير ومعقد بتنفيذ أعمال أكثر مما كان متوقعًا في عقد الوقت والمواد. أدى هذا النوع من العقود إلى تأخر المشروع عن الجدول وتجاوز الميزانية. العقد على وشك الانتهاء.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء طلب عرض أسعار (RFQ) لتكوين قائمة بموردين جدد.",
          "correct": false
        },
        {
          "text": "التحول إلى اتفاقية خدمات رئيسية مع ملاحق للعمل الإضافي حسب الحاجة.",
          "correct": true
        },
        {
          "text": "استشارة مستودع الدروس المستفادة لتكوين قائمة بموردين محتملين جدد.",
          "correct": false
        },
        {
          "text": "محاولة التفاوض على عقد بسعر ثابت مع البائع الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اعتمد الفريق مؤخرًا نهج أجايل ويتبع نموذج سكرم. هناك نزاع بين المطور الرئيسي وعضو فريق ضمان الجودة بخصوص الأساليب المتبعة، مما يؤثر على أهداف السبرينت.\n\nماذا يجب أن يفعل مدير المشروع لحل هذه النزاعات؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعوة لاجتماعات منفصلة مع كل عضو واقتراح أن يحلوا النزاع بأنفسهم.",
          "correct": false
        },
        {
          "text": "تحليل الوضع ومساعدة الأعضاء على فهم تأثير النزاع.",
          "correct": false
        },
        {
          "text": "مساعدة أعضاء الفريق على التعاون وحل المشكلة معًا.",
          "correct": true
        },
        {
          "text": "مناقشة الوضع في جلسة الاسترجاع وإنشاء بند عمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بداية مشروع، قرر الفريق اعتماد نهج أجايل لتنفيذه، باستخدام قصص المستخدم لتوثيق المتطلبات. كجزء من إطار الرقابة في المؤسسة، ستطلب إدارة الامتثال الداخلية نسخة من وثيقة المتطلبات المعتمدة.\n\nماذا يجب أن يتم لتلبية هذا الطلب؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة نهج المشروع مع قسم الامتثال، وضمان فهمهم لكيفية تلبية أهداف الرقابة.",
          "correct": true
        },
        {
          "text": "طباعة وتجميع جميع قصص المستخدم في حزمة واحدة في نهاية المشروع والحصول على موافقة مالك المنتج.",
          "correct": false
        },
        {
          "text": "تعيين مطلب الامتثال كمهمة على لوحة كانبان الخاصة بالمشروع لمالك المنتج.",
          "correct": false
        },
        {
          "text": "مراجعة نهج المشروع مع الامتثال، موضحًا أن هدف الرقابة غير مطلوب لأن المشروع يستخدم أجايل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء المرحلة النهائية من المشروع، طلب أحد أصحاب المصلحة الرئيسيين من مدير المشروع تقديم إحاطة لمجلس الإدارة التنفيذي حول العائد على الاستثمار (ROI) وأي قيمة تجارية جديدة تم تحديدها خلال تنفيذ المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "عرض تحليل التكلفة والفائدة.",
          "correct": false
        },
        {
          "text": "عرض الفوائد المحققة.",
          "correct": true
        },
        {
          "text": "عرض خطة إدارة التكاليف.",
          "correct": false
        },
        {
          "text": "عرض عوامل النجاح المالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من أجل تحديد نهج هجين جديد للمشروع، قرر مدير المشروع أن من الضروري إجراء تقييم لثقافة المنظمة.\n\nما العنصران اللذان يجب على مدير المشروع موازنتهما؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستكشاف والاستقرار",
          "correct": false
        },
        {
          "text": "السرعة والنماذج التقليدية",
          "correct": false
        },
        {
          "text": "المرونة وقابلية التنبؤ",
          "correct": true
        },
        {
          "text": "الاضطراب والامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال إحدى التكرارات، قضى الفريق ضعف الوقت المتوقع على أحد عناصر قائمة المنتج المتراكمة بسبب تعقيده وعدم إمكانية تقسيمه إلى عناصر أصغر.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "دمج نهج تكيفي لبقية المشروع.",
          "correct": false
        },
        {
          "text": "دمج نهج تنبؤي لبقية المشروع.",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة المخاطر لهذه التكرار.",
          "correct": false
        },
        {
          "text": "الطلب من مالك المنتج إعادة ترتيب أولويات قائمة المنتج.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مالك منتج جديد ولا يعرف كيفية ترتيب أولويات مواصفات المنتج وذكر هذا التحدي لمدير المشروع.\n\nماذا يجب أن يفعل مدير المشروع لمساعدة مالك المنتج؟",
      "explanation": "",
      "choices": [
        {
          "text": "ترتيب أولويات قائمة المنتج المتراكم نيابة عن مالك المنتج.",
          "correct": false
        },
        {
          "text": "توجيه مالك المنتج حول كيفية ترتيب أولويات مواصفات المنتج.",
          "correct": true
        },
        {
          "text": "الطلب من مالك المنتج تلقي تدريب على الأساليب الرشيقة.",
          "correct": false
        },
        {
          "text": "الطلب من فريق المشروع ترتيب أولويات قائمة المنتج المتراكم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع لإنشاء وظيفة عمل جديدة في الشركة. بعد عدة أشهر من الانتهاء، لا يزال مدير المشروع يتولى العمليات التجارية للمشروع أثناء عمله على مشروع آخر.\n\nما الذي كان يجب على مدير المشروع فعله في بداية المشروع لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن يكون تعديل الهيكل التنظيمي أحد مخرجات المشروع.",
          "correct": false
        },
        {
          "text": "إدراج خطة الانتقال كمخرج في عملية إغلاق المشروع.",
          "correct": true
        },
        {
          "text": "توضيح مخطط RACI مع راعي المشروع في بداية المشروع.",
          "correct": false
        },
        {
          "text": "ضمان تضمين عملية التوظيف في خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بداية مشروع، يشعر أحد أصحاب المصلحة بالقلق من أن المبادرة قد لا تقدم قيمة للمنظمة.\n\nما الذي يجب على مدير المشروع فعله أولًا لزيادة فرص نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة دراسة الجدوى وخطة إدارة الفوائد مع صاحب المصلحة.",
          "correct": true
        },
        {
          "text": "توفير تواصل مستمر لحالة المشروع لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة تدريب للجميع حول استخدام المنتج الجديد.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق للتأكد من تحقيق الفوائد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستفيد مشروع مبتكر من الذكاء الاصطناعي (AI) لتحديد المركبات الكيميائية لتطوير منتجات جديدة. يمكن أن تختلف مدة مرحلة المعالجة بالذكاء الاصطناعي من ثلاثة أيام إلى أسبوعين، وتكون النتائج غير متوقعة. الهدف الأساسي للمشروع هو تقديم مواصفات منتج واحدة على الأقل خلال فترة زمنية ثابتة مدتها شهران مع الالتزام بميزانية صارمة لا يمكن زيادتها.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لتحسين استخدام الميزانية الثابتة وتقديم أعلى قيمة تجارية ممكنة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن تقتصر تكرارات المواصفات على 50٪ من إجمالي مدة المشروع.",
          "correct": false
        },
        {
          "text": "ضمان أن تقتصر معالجة الذكاء الاصطناعي على 25٪ من إجمالي ميزانية المشروع.",
          "correct": false
        },
        {
          "text": "تخطيط تكرار مباشرة بعد معالجة الذكاء الاصطناعي لتحليل أهداف التطوير وتحديد أولوياتها.",
          "correct": true
        },
        {
          "text": "تخطيط أعمال المواصفات كمهمة تنبؤية ذات مدة ثابتة لضمان القيمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق مشروع موزع جغرافيًا مشكلات في التطوير بين الفرق المتجاورة والفرق الافتراضية، مما أدى إلى انخفاض الإنتاجية.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه المشكلات؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجبار أعضاء الفريق على العمل من موقع واحد.",
          "correct": false
        },
        {
          "text": "الحصول على خبرة خاصة لتقديم المشورة لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تطوير بروتوكولات لحل النزاعات بين أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "تنظيم اجتماعات وجهًا لوجه مع أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع المراجعة الرجعية، اشتكى أعضاء فريق المشروع من أن القضايا المفتوحة التي لم يتم حلها أثناء التكرار تؤثر على سرعتهم. ماذا يجب أن يفعل مدير المشروع لتحسين الإنتاجية؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان حضور أعضاء الفريق لاجتماعات الوقوف اليومية لمناقشة العوائق.",
          "correct": true
        },
        {
          "text": "توثيق القضايا في سجل القضايا والانتظار لحلها لاحقًا.",
          "correct": false
        },
        {
          "text": "تمديد اجتماعات الوقوف اليومية لمناقشة القضايا بمزيد من التفصيل.",
          "correct": false
        },
        {
          "text": "تصعيد القضايا إلى راعي المشروع لحلها فورًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع لديه فريق تم تشكيله حديثًا ويضم أعضاء مبتدئين لم يسبق لهم العمل في مشاريع رشيقة من قبل. يرغب مالك المنتج في التأكد من أن الفريق يعمل كما هو متوقع خلال التكرار.\n\n\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخصيص وقت لتوجيه أعضاء الفريق حول العمليات الرشيقة.",
          "correct": true
        },
        {
          "text": "التأكيد على أهمية ترتيب أولويات الأعمال المتراكمة للتكرار.",
          "correct": false
        },
        {
          "text": "تحسين الإنتاجية باستخدام تقنيات سكرم.",
          "correct": false
        },
        {
          "text": "التواصل بفعالية بشأن معلومات المشروع والتحديثات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب المشروع من الاكتمال ويريد أحد أصحاب المصلحة معرفة كيف ستؤثر نتائج المشروع على المنظمة. ما الذي يجب أن يراجعه مدير المشروع مع صاحب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "دراسة الجدوى",
          "correct": false
        },
        {
          "text": "خطة إدارة الفوائد",
          "correct": true
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "سجل الافتراضات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، حدد فريق التدقيق أن المتطلبات التنظيمية الحرجة لا يتم تلبيتها. ما الذي كان يجب أن يفعله مدير المشروع أولًا لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل القضايا بمتطلبات التنظيم.",
          "correct": false
        },
        {
          "text": "تقييم البيئات التنظيمية الداخلية والخارجية.",
          "correct": true
        },
        {
          "text": "جعل فريق التدقيق يراجع خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "ضم عضو من فريق التدقيق إلى المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير مشروع جديد مشروعًا بعد مغادرة المدير السابق للشركة. يعرف المدير الجديد أن المدير السابق كان يستخدم أسلوبًا سلطويًا للغاية ويتخذ جميع القرارات المتعلقة بالمشروع. لاحظ المدير الجديد أن معنويات مشرف كبير منخفضة.\n\nما الذي يجب أن يفعله مدير المشروع الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة مستوى سلطة المشرف.",
          "correct": false
        },
        {
          "text": "تحديد سبب انخفاض المعنويات.",
          "correct": true
        },
        {
          "text": "تعديل دور المشرف في المشروع.",
          "correct": false
        },
        {
          "text": "التحدث إلى المشرف وتحديث سجل القضايا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نشأ خلاف بين عضوين في الفريق حول كيفية المضي قدمًا قبل إصدار المنتج. يحتاج الفريق إلى العمل معًا لإكمال إصدار المنتج.\n\nما الذي يجب على مدير المشروع فعله أولًا لتهدئة الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "توظيف مدرب رشيق لتعليم أعضاء الفريق كيفية إدارة الخلاف دون الإضرار بالمشروع.",
          "correct": false
        },
        {
          "text": "مراقبة تفاعلات أعضاء الفريق والتحدث معهم بشأن شكاواهم قبل تطبيق تقنية لحل النزاعات.",
          "correct": true
        },
        {
          "text": "تنظيم اجتماعات مع كلا العضوين وإدارة الموارد البشرية لتذكيرهم بأهمية التسليم القادم للمنتج.",
          "correct": false
        },
        {
          "text": "شرح لأعضاء الفريق أنهم يهدرون الوقت في الخلاف بدلاً من تسليم وظائف المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتسليم برنامج جديد لطلاب الجامعة. في هذا المشروع، يتم تسليم البرنامج إلى شريحة محددة من الأشخاص. لفهم هذه الشريحة بشكل أفضل، يحتاج مدير المشروع إلى تطوير نموذج مستخدم نموذجي.\n\nكيف يجب أن يفعل مدير المشروع ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء شخصية وهمية (شخصية المستخدم).",
          "correct": true
        },
        {
          "text": "التعاقد مع شركة معمارية.",
          "correct": false
        },
        {
          "text": "إرسال استبيان عام للجمهور.",
          "correct": false
        },
        {
          "text": "نشر خطة تسويق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب مالك المنتج من مدير المشروع والفريق الرشيق عرض الوظائف المكتملة لأصحاب المصلحة الرئيسيين في المشروع. المشروع لا يزال في مراحله الأولى وقد أكمل ثلاث تكرارات فقط من الوظائف. هذه هي المرة الأولى التي يتعرض فيها أصحاب المصلحة لمشروع رشيق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعزيز دور مالك المنتج في التواصل وإدارة أصحاب المصلحة بشكل مباشر.",
          "correct": false
        },
        {
          "text": "ضبط التوقعات مع أصحاب المصلحة بشأن ماهية الرشاقة والمنهج المتبع، وأنهم سيشاهدون كمية صغيرة فقط من الوظائف.",
          "correct": true
        },
        {
          "text": "عرض الوظائف المكتملة على أصحاب المصلحة، جنبًا إلى جنب مع متطلبات المستخدم والنماذج الأولية للحل المتاحة.",
          "correct": false
        },
        {
          "text": "حماية الفريق من المشتتات من خلال توفير رابط إلى بيئة اختبار القبول حتى يتمكن أصحاب المصلحة من رؤية الوظائف مباشرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع فرقًا متعددة التخصصات. خلال اجتماع مراجعة المشروع الأخير، أدرك مدير المشروع أن هناك احتكاكًا بين بعض أعضاء الفريق.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد أعضاء الفريق ومراجعة أدائهم في المشروع.",
          "correct": false
        },
        {
          "text": "التشاور مع الراعي للعثور على بدائل لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تقييم المشكلة وتطبيق تقنيات حل النزاعات.",
          "correct": true
        },
        {
          "text": "الإبلاغ عن المشكلة في الملخص التنفيذي الشهري للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم شركة ما الأساليب التنبؤية منذ فترة طويلة جدًا وتحاول تنفيذ بعض المبادرات التكرارية ضمن إطار عمل المشروع. تم تعيين مدير مشروع لقيادة أول مشروع في هذا البيئة الهجينة.\n\nكيف يجب على مدير المشروع بناء الوعي بالنهج الهجين داخل المؤسسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع فريق المشروع من أجل تحديد الأدوار والمسؤوليات.",
          "correct": false
        },
        {
          "text": "بناء جدول المشروع بجلسات تكرارية وإبلاغ أصحاب المصلحة بذلك.",
          "correct": false
        },
        {
          "text": "دعوة أصحاب المصلحة الرئيسيين لحضور الاجتماعات اليومية واجتماعات مراجعة المشروع.",
          "correct": false
        },
        {
          "text": "التوصية بتدريب كبار المدراء على المنهجية التكرارية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينضم مدير مشروع جديد إلى فريق قائم. يتم إبلاغ مدير المشروع أن هناك شخصيات قوية في الفريق، مما أدى إلى تدخل الإدارة لحل مشاكل أداء الفريق.\n\nما الذي يجب أن يفعله مدير المشروع الجديد عند انضمامه إلى هذا الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ الخطة التي وضعتها الإدارة العليا لحل النزاعات داخل الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة سجلات سرعة الفريق ومراقبة الفريق والتفاعلات بين الأعضاء.",
          "correct": true
        },
        {
          "text": "اتباع نصيحة أكثر أعضاء الفريق صوتًا بشأن كيفية تحسين ديناميكية الفريق.",
          "correct": false
        },
        {
          "text": "مراقبة الفريق وتحديد من يجب إزالته من الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخطط مدير المشروع للإصدار التالي لفريق تطوير البرمجيات. أكمل الفريق إصدارين حتى الآن، وتم تأكيد سجل المنتج للإصدار القادم.\n\nأي من الأدوات التالية يجب أن يستخدمها مدير المشروع لتخطيط مدة الإصدار القادم؟",
      "explanation": "",
      "choices": [
        {
          "text": "خريطة طريق المنتج",
          "correct": false
        },
        {
          "text": "تقويم الموارد",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS)",
          "correct": true
        },
        {
          "text": "مخطط التقدم (Burndown Chart)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وصل فريق المشروع مؤخرًا إلى أحد المعالم الرئيسية بنجاح. لاحظ مدير المشروع أن أداء الفريق كان ممتازًا.\n\nأي نهج يجب أن يستخدمه مدير المشروع للتواصل مع الفريق حول أدائهم؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجنب قول أي شيء عن أدائهم لأن من المتوقع أن يحقق الفريق المعالم بنجاح.",
          "correct": false
        },
        {
          "text": "الانتظار حتى نهاية المشروع وإبلاغ الفريق بما تم تنفيذه جيدًا وما لم يتم بشكل جيد في كل مرحلة.",
          "correct": false
        },
        {
          "text": "تقديم تغذية راجعة للفريق حول أدائهم الجيد في اجتماع المشروع القادم.",
          "correct": true
        },
        {
          "text": "تجاهل ما تم إنجازه بالفعل في المشروع وطلب من الفريق التركيز على ما تبقى.",
          "correct": false
        }
      ]
    }
  ]
}
