{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "يعمل اثنان من مديري المشاريع على تخصيص الموارد لمشاريعهما الخاصة. حدد كلا المديرين نفس خبير الموضوع (SME) كعنصر مفيد لمشروعهما.\n\nيستخدم المشروع A نهجًا تنبؤيًا، بينما يستخدم المشروع B نهجًا رشيقًا (Agile).\n\nلأي مشروع يجب تخصيص هذا الخبير؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب تخصيص الخبير للمشروع A لأن تخطيط المشروع استند إلى دعم هذا الخبير.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع B لأن النجاح في المشاريع الرشيقة يُحدد بالتميز الفني.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع الذي يديره مدير مشروع أقل خبرة لتحسين فرص النجاح.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع B لأن النهج الرشيق يعطي الأولوية للمرونة والتكيف.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت دعوة أحد أصحاب المصلحة الكبار إلى اجتماع مراجعة Sprint وطلب من أحد أعضاء الفريق وصف المنتج النهائي الذي سيقوم المشروع بتسليمه.\n\nلم يتمكن عضو الفريق من الرد وأحال السؤال إلى عضو آخر أكثر خبرة في الفريق.\n\nما الذي كان يجب فعله بشكل مختلف في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "كان ينبغي على عضو الفريق أن يوجه صاحب المصلحة إلى سؤال Scrum Master.",
          "correct": false
        },
        {
          "text": "كان ينبغي على عضو الفريق أن يوجه صاحب المصلحة إلى سؤال مالك المنتج.",
          "correct": true
        },
        {
          "text": "كان ينبغي على صاحب المصلحة تأجيل سؤاله إلى اجتماع المراجعة التالي.",
          "correct": false
        },
        {
          "text": "كان ينبغي على صاحب المصلحة توجيه السؤال إلى مدير المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع لتطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعر بأنه سيضيف فائدة كبيرة للمشروع.\n\nلكن هذا المتطلب لا يتماشى مع أهداف المشروع التي وثقها مالك العمل.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن يفهم صاحب المصلحة هدف المشروع.",
          "correct": true
        },
        {
          "text": "تشجيع صاحب المصلحة على اتباع المتطلبات المكتوبة للأعمال.",
          "correct": false
        },
        {
          "text": "إدراج المتطلب الإضافي ضمن المشروع وإبلاغ مالك العمل بذلك.",
          "correct": false
        },
        {
          "text": "تسريع المشروع واقتراح المتطلب الجديد على مالك العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مشروع هجين، قام مدير المشروع بمراجعة أداء الفريق ولاحظ أن وتيرة الفريق ليست سريعة بما يكفي للوصول إلى هدف نقطة التقييم التالية.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعطاء الأولوية لمحتوى سجل المنتج وإزالة بعض القصص.",
          "correct": false
        },
        {
          "text": "زيادة مدة Sprint لإتاحة وقت أطول للفريق.",
          "correct": false
        },
        {
          "text": "استخدام الاجتماعات اليومية لتقييم العوائق والمشكلات.",
          "correct": true
        },
        {
          "text": "إنشاء طلب تغيير لتعديل أهداف نقطة التقييم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بتطوير خطة إدارة المشروع. تم تحديد مدة المشروع بثلاثة أشهر بسبب متطلبات تنظيمية واعتمادًا على كبار الموظفين.\n\nما الهدفان من أهداف المشروع اللذان يجب تحديدهما بشكل جيد بما يكفي لإدراجهما في خطة إدارة المشروع؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تحسين العمليات وتقليل إعادة العمل من خلال الحفاظ على معدل منخفض لتناوب كبار الموظفين.",
          "correct": false
        },
        {
          "text": "تطوير خرائط عمليات مفصلة لمواءمة الأنشطة التشغيلية مع نظام البرمجيات الجديد.",
          "correct": false
        },
        {
          "text": "تعزيز عملية التطوير من خلال تصميم نماذج جديدة لوثائق التصميم.",
          "correct": false
        },
        {
          "text": "تقليل البصمة البيئية للشركة باستخدام إرشادات مفصلة لإعادة التدوير لجميع الموظفين.",
          "correct": false
        },
        {
          "text": "تحديد الاحتياجات التدريبية وإنشاء خطة تطوير لإكمال التسليم خلال ثلاثة أشهر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في الاجتماع الأول لمشروع بناء طريق، يُذَكِّر مدير المشروع الفريق بأهمية الالتزام بجميع القواعد عند أداء مهامهم والتفاعل مع أصحاب المصلحة.\n\nلاحقًا في المشروع، يبدأ أعضاء الفريق في الحضور متأخرين للاجتماعات ولا يلتزمون بالقواعد المتفق عليها.\n\nلضمان عدم تأثر نتائج المشروع وجدوله الزمني، ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "معالجة المسألة مع أعضاء الفريق المحددين الذين انتهكوا القواعد.",
          "correct": true
        },
        {
          "text": "إزالة أعضاء الفريق الذين انتهكوا القواعد.",
          "correct": false
        },
        {
          "text": "ترقية جميع أعضاء الفريق الذين لم ينتهكوا أي قواعد.",
          "correct": false
        },
        {
          "text": "السماح للفريق بالتحقيق مع الأعضاء الذين ينتهكون القواعد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تطوير تطبيق جوال. يدرك مدير المشروع أن النهج الرشيق (Agile) هو الأنسب لهذا المشروع، لكن معظم أعضاء الفريق ليس لديهم خبرة في هذا النوع من النهج.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام النهج الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب إعادة تعيين المشروع إلى فريق يمتلك خبرة في النهج الرشيق.",
          "correct": false
        },
        {
          "text": "طلب استبدال أعضاء الفريق الذين لم يستخدموا النهج الرشيق من قبل.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب حول مبادئ وعقلية النهج الرشيق لأعضاء الفريق الحالي.",
          "correct": true
        },
        {
          "text": "استخدام نهج تنبؤي لأن الفريق معتاد عليه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نظرًا لطبيعة المشروع التنبؤية المعقدة، قررت المؤسسة استخدام نهج رشيق في إحدى مراحل المشروع.\n\nأحد أعضاء الفريق لا يفهم نهج Agile ويستمر في تخصيص المهام لبقية الفريق. بعد فترة، لا يستطيع الفريق التكيف وينشأ صراع يؤخر التسليمات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استبدال عضو الفريق بشخص لديه خبرة في Agile.",
          "correct": false
        },
        {
          "text": "الانتظار حتى يتمكن الفريق من حل النزاع وتنظيم نفسه.",
          "correct": false
        },
        {
          "text": "إعادة تأكيد مبادئ وأدوار Agile لإنشاء هيكل يمكن للفريق استخدامه.",
          "correct": true
        },
        {
          "text": "تولي التحكم في سجل Sprint وتوزيع المهام على أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مشروع يمتد لعدة سنوات، أعلن مورد رئيسي عن تقاعده.\n\nيشعر مدير المشروع بالقلق من تأثير ذلك على المشروع وقد حدد أن عدة مهام حرجة ستتأثر.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من أعضاء الفريق المتبقين العمل لساعات إضافية لإكمال المهام المتأثرة.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بأن مهام المورد لن تُنجز في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "التعاون مع مدير الموارد لتحديد وتدريب بديل مناسب.",
          "correct": true
        },
        {
          "text": "تشجيع عضو الفريق المتقاعد على تأجيل تقاعده لتجنب تعطيل المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع إدارة عدة مشاريع في خمس دول مختلفة، وقد تم إصدار توجيه جديد بشأن الزي الرسمي وترتيبات المكاتب.\n\nقوبل هذا التوجيه بمقاومة في ثلاث دول، مما أدى إلى سلسلة من سوء الفهم والاستياء ومشكلات قانونية محتملة.\n\nما الذي كان يجب على مدير المشروع فعله للتعامل بشكل أفضل مع هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب توضيح واستثناءات من الإدارة العليا قبل إصدار توجيه عام لجميع الدول.",
          "correct": false
        },
        {
          "text": "تقييم الخصائص الثقافية والشخصية في الدول المختلفة قبل إصدار توجيه عام.",
          "correct": true
        },
        {
          "text": "تحديد الحالة الاجتماعية والاقتصادية لأعضاء الفريق قبل إصدار توجيه واسع.",
          "correct": false
        },
        {
          "text": "الحصول على قائمة بالتفضيلات الشخصية من أعضاء الفريق قبل إصدار التوجيه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تخطط شركة تنظيم فعاليات لحدث جديد لعميل يعقد مؤتمرات نصف سنوية.\n\nيقود المشروع مدير مشروع جديد قام بمراجعة سجل الدروس المستفادة من الحدث السابق، وهو قلق من احتمال تكرار مشكلة سابقة.\n\nكيف يجب أن يتصرف مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد السبب الجذري للمشكلة والتشاور مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "معالجة المشكلة إذا ظهرت أثناء التخطيط للحدث.",
          "correct": false
        },
        {
          "text": "اقتراح إعادة جدولة المؤتمر القادم.",
          "correct": false
        },
        {
          "text": "تنفيذ نفس الاستراتيجيات المستخدمة في الحدث السابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التوقيع على مشروع استراتيجي أدى إلى تكاليف إضافية، لم يتمكن مدير المشروع من تبرير هذه النفقات الإضافية مقابل القيمة التجارية التي تم تحقيقها.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تقييم للفوائد المحتملة المحددة في دراسة الجدوى الأولية كمبرر كافٍ للتكاليف الإضافية.",
          "correct": false
        },
        {
          "text": "قياس وتتبع الفوائد المحددة في دراسة الجدوى طوال دورة حياة المشروع.",
          "correct": true
        },
        {
          "text": "إجراء إعادة تقييم للحالة الحالية للمؤسسة بعد تنفيذ المشروع لإظهار الفوائد المحققة.",
          "correct": false
        },
        {
          "text": "مشاركة الفوائد غير المالية أو غير الملموسة مثل رضا العملاء والسمعة الجيدة كمؤشرات للقيمة المحققة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع جديد مشروع إنشاءات. بعد مراجعة خطة إدارة المشروع، يدرك مدير المشروع أن متطلبات الصحة والسلامة لم يتم التعامل معها بشكل كافٍ.\n\nمدير المشروع لديه مخاوف جدية ويريد معالجة هذا القصور.\n\nما هو القلق الأساسي في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "عدم معالجة قضايا الصحة والسلامة يمكن أن يضر بثقة العميل وسمعة المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يلتزم المشروع بجميع المتطلبات والمسؤوليات القانونية والتنظيمية.",
          "correct": true
        },
        {
          "text": "قد يتعرض الجدول الزمني للمشروع للخطر عند تنفيذ تدابير السلامة الإضافية.",
          "correct": false
        },
        {
          "text": "يعلم مدير المشروع أنه من الضروري تحقيق مؤشرات الأداء المحددة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استمر مشروع إنشاءات لمدة 18 شهرًا تقريبًا، وكان مؤشر أداء الجدول الزمني (SPI) هو 0.68.\n\nيرغب مدير المشروع في إكمال المشروع حسب الخطة دون تكاليف إضافية.\n\nما الذي يجب على مدير المشروع فعله لإكمال المشروع في الوقت المحدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "تسريع الجدول عن طريق زيادة الموارد (Crash).",
          "correct": false
        },
        {
          "text": "تسريع الجدول عن طريق تنفيذ المهام بالتوازي (Fast track).",
          "correct": true
        },
        {
          "text": "تقليل نطاق المشروع.",
          "correct": false
        },
        {
          "text": "تقليل جودة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استدعى الراعي في مشروع بملايين الدولارات مدير المشروع لاجتماع طارئ.\n\nقدم العميل طلبًا رسميًا لتقليص الجدول الزمني بشكل كبير من أجل الامتثال لموعد قانوني نهائي.\n\nما الذي يجب على مدير المشروع فعله للتحضير لهذا الاجتماع؟",
      "explanation": "",
      "choices": [
        {
          "text": "بدء إجراءات تسريع المشروع بالتوازي (Fast-tracking).",
          "correct": false
        },
        {
          "text": "تنفيذ التغييرات المطلوبة في الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "تحليل أدوات تسريع المهام (Crash).",
          "correct": false
        },
        {
          "text": "إعداد تقرير تقييم تأثير التغيير لمراجعته في الاجتماع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المبيعات الرئيسي والفريق غير قادرين على تقديم تقرير حالة المشروع في الوقت المحدد لمشروع دمج تقارير المبيعات الجديدة.\n\nبالإضافة إلى ذلك، لا يلبي التقرير التوقعات التي تم تسليط الضوء عليها في اجتماعات المراجعة الجماعية. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.",
          "correct": true
        },
        {
          "text": "التأكد من أن الخطة موثقة ومشتركة بين الفريق وأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "زيادة وتيرة اجتماعات الفريق لتقديم تقرير الحالة.",
          "correct": false
        },
        {
          "text": "ضمان منح أعضاء الفريق المزيد من الوقت للتخطيط والمناقشة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مشارك في مشروع تتطور فيه المتطلبات باستمرار.\n\nما الذي يجب أن يفعله مدير المشروع لتحقيق النجاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تحديثات منتظمة وطلب الموافقة على النتائج من مالك المنتج.",
          "correct": true
        },
        {
          "text": "العمل مع الفريق للتأكد من أنهم على المسار الصحيح ويسلمون في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "الحفاظ على جو عمل مريح لتحسين التماسك داخل الفريق.",
          "correct": false
        },
        {
          "text": "ضمان توثيق العمليات وتحديث مالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لإعادة تصميم نظام نقاط البيع لمتجر. الفريق يقوم حاليًا باختبار الوظائف الجديدة، وعندما يقترح أحد أصحاب المصلحة الرئيسيين تغييرًا من شأنه تحسين رضا العملاء بشكل كبير، يتبين أن التغيير يتطلب موارد إضافية.\n\nما الذي يجب أن يقوم به مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إيقاف الاختبار وجدولة اجتماع لمراجعة التغييرات المقترحة مع الموارد.",
          "correct": false
        },
        {
          "text": "استكمال الاختبارات بينما يجتمع مدير المشروع مع صاحب المصلحة لمراجعة التغييرات.",
          "correct": false
        },
        {
          "text": "توثيق التغييرات المقترحة وتقييم أثرها على الوقت والتكلفة والموارد.",
          "correct": true
        },
        {
          "text": "تأجيل التغييرات المقترحة والسماح للفريق بإكمال الاختبار والتنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتأخر المشروع حاليًا عن الجدول الزمني، وعند انضمام عضو جديد معروف بأدائه العالي، يلاحظ مدير المشروع أن العضو يفتقر للتدريب الخاص بالمشروع، لكنه يمتلك المهارات والخبرة ذات الصلة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان حصول العضو الجديد على التدريب قبل الانضمام للفريق.",
          "correct": false
        },
        {
          "text": "تعيين العضو الجديد لمهام حرجة تحت مراقبة دقيقة أثناء تلقي التدريب.",
          "correct": false
        },
        {
          "text": "تعيين العضو الجديد لمهام غير حرجة دون مراقبة دقيقة مع تقديم التدريب.",
          "correct": true
        },
        {
          "text": "رفض إضافة العضو الجديد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مسؤول عن إطلاق منتج بمواعيد سوق عدوانية. يُقدّر مجموع النقاط بـ 600 نقطة مع سرعة 60 نقطة في كل دورة.\n\nوقد تم تعيين فريق يصل إلى 12 عضوًا لهذا المشروع. أي من العبارات التالية صحيحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمثل سرعة 60 نقطة في كل دورة الحد الأدنى من العمل، ويمثل 12 عضوًا الحد الأقصى لحجم الفريق.",
          "correct": true
        },
        {
          "text": "تمثل سرعة 60 نقطة أن المشروع تحت السيطرة، ويمثل 12 عضوًا أن المشروع خارج السيطرة.",
          "correct": false
        },
        {
          "text": "تمثل سرعة 60 نقطة أن المشروع تحت السيطرة، ويمثل 12 عضوًا الحد الأقصى لحجم الفريق.",
          "correct": false
        },
        {
          "text": "تمثل سرعة 60 نقطة الحد الأدنى من العمل، ويمثل 12 عضوًا أن المشروع تحت السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء حضور اجتماع حوكمة مع الإدارة العليا، تم إعلام مدير المشروع شفهيًا بتدقيق خارجي وشيك لمشاريع مختارة.\n\nسيسمح هذا التدقيق للمؤسسة بالحفاظ على شهادة الجودة الخاصة بها. ما الذي يجب على مدير المشروع فعله أولًا للتحضير للتدقيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث كافة الوثائق المتعلقة بالمشروع لتعكس الحالة الحالية.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع لضمان الامتثال الكامل لعملية التدقيق.",
          "correct": false
        },
        {
          "text": "الاتصال بالمدققين لفهم نطاق التدقيق ومتطلباته.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع الفريق لإبلاغهم بنطاق ومتطلبات التدقيق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتقنية المعلومات (IT) لفريق جديد في مشروع تطوير برمجيات في بيئة رشيقة.\n\nيقوم مدير المشروع بتقدير مدة المشروع بناءً على خبرته السابقة في مؤسسة أخرى. كيف ينبغي لمدير المشروع التحقق من صحة هذا الافتراض والتخطيط بشكل صحيح وإدارة الجدول الزمني للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء استطلاع داخل المؤسسة وجمع بيانات لتأكيد الادعاءات.",
          "correct": false
        },
        {
          "text": "التقدير بناءً على اجتماعات مراجعة السبرنت ومدخلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دراسة اجتماعات التخطيط السابقة والسياق الثقافي للمشاريع في المؤسسة.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تشكيل فريق عالمي متعدد الوظائف لتنفيذ مبادرة متعددة الجنسيات.\n\nما الذي يجب أن يفعله مدير المشروع لضمان المشاركة الكاملة للفريق طوال المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنسيق معلومات المناطق الزمنية والاتفاق على أوقات الاجتماعات.",
          "correct": true
        },
        {
          "text": "ضمان توفير البرنامج بلغات متعددة.",
          "correct": false
        },
        {
          "text": "ترجمة وثائق المشروع.",
          "correct": false
        },
        {
          "text": "تقديم إرشادات حول الأدوات والممارسات المشتركة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين فقط من خلال المكالمات الهاتفية، كما هو موضح في خطة إدارة الاتصالات.\n\nبعد ثلاثة أسابيع من تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال غير الرسمية المتكررة من هذا الطرف. كيف يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستمرار في الاتصال الهاتفي لأنه كان فعالًا حتى الآن.",
          "correct": false
        },
        {
          "text": "الاجتماع مع صاحب المصلحة لمناقشة احتياجاته وتوقعاته في التواصل.",
          "correct": true
        },
        {
          "text": "إرسال بريد إلكتروني لصاحب المصلحة يطلب تغيير نهج الاتصال.",
          "correct": false
        },
        {
          "text": "تعيين أحد أعضاء الفريق كحلقة وصل بين مدير المشروع وصاحب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على مشروع عالي الأولوية قائم على التغيير وقد فشل مرارًا في الوفاء بالمواعيد النهائية للإصدار.\n\nيتعرف مدير المشروع على أن السبب هو أن أحد أعضاء الفريق ذوي الخبرة مخصص لعدة مشاريع ولديه سعة محدودة. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الراعي بالمشكلة.",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني وتقديم طلب تغيير.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة على الفور مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "تقييم عبء العمل لعضو الفريق ذو الخبرة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار قبول المنتج لمشروع برمجي، أبلغ الراعي مدير المشروع أن البرنامج لن يتم قبوله إلا إذا تم تغيير لون السمة من الأحمر إلى الأزرق.\n\nراجع مدير المشروع وثائق التخطيط وتأكد من أن اللون يجب أن يكون أحمر، لكن الراعي أصر على اللون الأزرق. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اقتراح أن يقدم الراعي طلب تغيير رسمي لتعديل متطلب لون السمة.",
          "correct": true
        },
        {
          "text": "إبلاغ الراعي بأن عليه قبول اللون لأن العقد يوضح بوضوح أنه يجب أن يكون أحمر.",
          "correct": false
        },
        {
          "text": "الموافقة على تغيير اللون لتجنب الخلاف المحتمل.",
          "correct": false
        },
        {
          "text": "طلب من قسم المشتريات تغيير اللون لتلبية توقعات الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ مدير المشروع أن أعضاء الفريق لا يتعاونون أو يتصرفون بشكل استباقي.\n\nما الذي كان يجب على مدير المشروع القيام به في بداية المشروع لتحقيق بيئة عمل أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تقييم لديناميكيات الفريق.",
          "correct": true
        },
        {
          "text": "تخصيص جميع المهام في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تيسير اجتماعات إضافية للفريق.",
          "correct": false
        },
        {
          "text": "تقسيم المشروع إلى مزيد من الجولات (iterations).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في نهاية المرحلة الأولى من مشروع توسيع ملعب، يدرك مدير المشروع أنه سيتأخر عن الجدول الزمني في المرحلة التالية من المشروع.\n\nيعود التأخير إلى متطلبات السلامة الجديدة التي يجب الالتزام بها. يشعر أصحاب المصلحة بالإحباط لأنهم لم يكونوا على علم بالتغييرات المحتملة في متطلبات السلامة. ما الذي كان يجب فعله لتجنب هذا الموقف وضمان وعي أصحاب المصلحة بالاضطرابات المحتملة؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة الاحتياطي الاحتياطي للمشروع لاستيعاب المشكلات غير المتوقعة المتعلقة بالسلامة.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات اتصال منتظمة مع مشرف الموقع للبقاء على اطلاع بمتطلبات السلامة.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية تقييم للمخاطر بشكل استباقي خلال بدء المشروع لتحديد التأخيرات المحتملة المتعلقة بالسلامة.",
          "correct": true
        },
        {
          "text": "طلب موارد وأفراد إضافيين لمعالجة مخاوف السلامة عند ظهورها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدرك مدير المشروع أن الفريق بحاجة إلى تدريب على تقنية معينة مطلوبة في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذا الخطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم معرفة الفريق بالتقنية والبحث عن خيارات التدريب الموصى بها.",
          "correct": true
        },
        {
          "text": "التعاقد مع مزود خبير لتنفيذ الجزء من العمل الذي يستخدم هذه التقنية المحددة.",
          "correct": false
        },
        {
          "text": "إنشاء بند في سجل المخاطر وإبلاغ الراعي.",
          "correct": false
        },
        {
          "text": "معالجة أي فجوات تدريبية عند ظهورها خلال المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع طويل الأمد مدته ثلاث سنوات.\n\nما النهج الذي يجب على مدير المشروع اتباعه لمعالجة الأنشطة القريبة الأجل، بينما يتم التخطيط للأعمال طويلة الأجل على مستوى عالٍ وتفصيلها لاحقًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز على جمع الفريق والتسليم في أقرب وقت ممكن.",
          "correct": false
        },
        {
          "text": "إشراك الراعي في عمليات التحقق من صحة المتطلبات وتحديد الأولويات.",
          "correct": false
        },
        {
          "text": "عقد ورش عمل مع العميل لتحديد تواريخ التسليم.",
          "correct": false
        },
        {
          "text": "التحقق من صحة المتطلبات وتنفيذ التخطيط الموجي التدريجي (rolling wave planning).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع بدء المشروع، أبلغ الراعي فريق المشروع بأنه لا يمكنه حضور أي اجتماعات خلال النصف الأول من المشروع.\n\nيرغب الراعي في تعيين بديل. ما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب أن يكون البديل يتمتع بنفوذ كبير وسلطة في اتخاذ القرار.",
          "correct": false
        },
        {
          "text": "تحديد اجتماع مع الراعي البديل في أقرب وقت ممكن لمناقشة الأجندة القادمة.",
          "correct": false
        },
        {
          "text": "طلب الاهتمام الكامل من الراعي وتصعيد هذه المسألة إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "تحليل تأثير التغيير والعمل مع الراعي لتحديد بديل مناسب.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة في قطاع المالية مشروعًا جديدًا هجينًا للامتثال للوائح حكومية جديدة. حدد الفريق سرعة موثوقة تبلغ 65 نقطة قصة في كل تكرار. كل تكرار يستغرق أسبوعين.\n\nيرغب الراعي في معرفة متى سينتهي المشروع إذا تبقى 1040 نقطة قصة. كم عدد الأشهر المطلوبة لإكمال المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "شهرين",
          "correct": false
        },
        {
          "text": "4 أشهر",
          "correct": false
        },
        {
          "text": "8 أشهر",
          "correct": true
        },
        {
          "text": "16 شهرًا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير مشروع جديد مسؤولية مشروع جارٍ بعد استقالة المدير السابق. أثناء مراجعة الوثائق، يكتشف المدير الجديد انحرافات كبيرة في عملية الشراء التي استخدمها المدير السابق للتعاقد مع مقدمي الخدمات الحاليين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاتصال بالمدير السابق لفهم سبب اتباع نهج شراء غير اعتيادي.",
          "correct": false
        },
        {
          "text": "الاتصال بمقدمي الخدمة لمناقشة الانحراف ومطالبتهم بحل المشكلة.",
          "correct": false
        },
        {
          "text": "الإبلاغ عن مقدمي الخدمة والمدير السابق للجنة الأخلاقيات في المؤسسة.",
          "correct": false
        },
        {
          "text": "وضع علامة على عملية الشراء غير المعتادة كمشكلة حرجة لعرضها على الإدارة العليا.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع بمعالجة مخاوف مالك المنتج بشأن تسليم المنتج القابل للإصدار (MVP) في السبرنت الرابع.\n\nأي من المقاييس التالية يجب على مدير المشروع استخدامها؟",
      "explanation": "",
      "choices": [
        {
          "text": "مؤشر الأداء المجدول (SPI)",
          "correct": false
        },
        {
          "text": "مؤشر تكلفة الجدول الزمني (SCI)",
          "correct": false
        },
        {
          "text": "معدل التناقص (Burndown Rate)",
          "correct": true
        },
        {
          "text": "تحليل المخاطر النوعي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إعلام مدير مشروع في شركة تصنيع بفشل المعدات التي تم تسليمها خلال الاختبارات الأولية.\n\nفشلت الآلة في الامتثال لمواصفات التصميم القياسية، مما أدى إلى أعطال ومخاوف تتعلق بالسلامة.\n\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة إجراءات الاختبار الأولي والتنفيذ.",
          "correct": true
        },
        {
          "text": "تقييم العوامل البيئية والفردية.",
          "correct": false
        },
        {
          "text": "تقييم الوثائق الفنية للآلة.",
          "correct": false
        },
        {
          "text": "التحقق من الاتصالات بين أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة مشروعًا هجينًا جديدًا للامتثال للوائح الحكومية. حدد الفريق سرعة قدرها 50 نقطة قصة لكل تكرار. يستغرق كل تكرار أسبوعًا واحدًا.\n\nيريد الراعي معرفة متى سينتهي المشروع إذا بقي 1500 نقطة قصة.",
      "explanation": "",
      "choices": [
        {
          "text": "30 أسبوعًا",
          "correct": true
        },
        {
          "text": "15 أسبوعًا",
          "correct": false
        },
        {
          "text": "4 أسابيع",
          "correct": false
        },
        {
          "text": "أسبوع واحد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم فريق سكرم نهجًا هجينًا بتكرارات مدتها أسبوعين. من المقرر إصدار المنتج القابل للإصدار (MVP) في نهاية التكرار الحالي، وقد أكمل الفريق الميزات الأساسية والميزات ذات الأولوية المتوسطة؛ ومع ذلك، لا تزال بعض الميزات ذات الأولوية الأخرى قيد التطوير.\n\nيستعد مدير المشروع لتقرير شهري للجنة التوجيهية.\n\nما الذي يجب على مدير المشروع أن يوصي به؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة جدولة مراجعة إصدار المنتج القابل للإصدار حتى تكتمل جميع الميزات المتفق عليها.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المشروع لتضمين فقط الميزات المكتملة في الإصدار.",
          "correct": false
        },
        {
          "text": "إكمال مراجعة التكرار وإصدار المنتج القابل للإصدار بالميزات المكتملة.",
          "correct": true
        },
        {
          "text": "تقدير الجهد المطلوب وتقديم طلب تغيير لإضافة المزيد من الموارد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التحقق من التسليمات، يدرك مدير المشروع أن أحد أعضاء الفريق استخدم إصدارًا أقدم من وثيقة تعريف النطاق، مما تسبب في أخطاء كبيرة.\n\nما الذي يجب على مدير المشروع فعله لإدارة هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة التسليمات الأخيرة خلال الاجتماع القادم.",
          "correct": false
        },
        {
          "text": "تحديث سجل وثائق المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية التحكم في التغيير.",
          "correct": true
        },
        {
          "text": "مشاركة النسخة المحدثة من وثيقة تعريف النطاق مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع الوقوف اليومي، أبلغ أحد أعضاء الفريق أن قصة المستخدم التي كانت جزءًا من تخطيط السبرنت أصبحت غير صالحة بسبب تغيير في السياسة تم الإعلان عنه مؤخرًا.\n\nما الذي يجب أن يفعله مدير المشروع استجابةً لهذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إغلاق قصة المستخدم المتعلقة بتغيير السياسة وشرح أنها لم تعد صالحة.",
          "correct": true
        },
        {
          "text": "إزالة قصة المستخدم من السبرنت الحالي وجدولتها للسبرنت التالي.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بأن قصص المستخدم المتعهد بها في السبرنت لا يمكن تعديلها.",
          "correct": false
        },
        {
          "text": "إزالة قصة المستخدم من السبرنت وطلب من الفريق تسريع إكمال السبرنت الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع جديد. يختلف اثنان من الموارد الرئيسية في المشروع حول أحد المتطلبات.\n\nيرغب مدير المشروع في فهم وجهتي النظر، لكن أحد الموارد غير راغب في الاجتماع معه.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "قبول موقف المورد الأعلى رتبة.",
          "correct": false
        },
        {
          "text": "مراجعة الأصول التنظيمية للعمليات (OPA).",
          "correct": false
        },
        {
          "text": "الرجوع إلى قواعد الفريق ورؤية المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد في مشروع في مرحلة التنفيذ. انتهى المشروع للتو من تسليمات المرحلة الأولى.\n\nخلال ورشة عمل لمراجعة نطاق المرحلة الثانية من المشروع، اشتكى بعض أصحاب المصلحة من أنهم لم يتم إبلاغهم بالفوائد التي تم تحقيقها.\n\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى اللجنة التوجيهية لأن الراعي كان يجب أن يبلغ أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الراعي لأن السؤال جاء من بعض كبار أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسجيل المشكلة في سجل القضايا، مناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "تسجيل المشكلة في السجل، مراجعة مصفوفة أصحاب المصلحة، وتحديث خطة إدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع لمشروع بناء تم إبلاغه أن تصريحًا مطلوبًا من الحكومة المحلية لم يتم الحصول عليه بعد.\n\nالتقدم للحصول على التصريح سيؤخر تسليم المشروع 21 يومًا بتكلفة 40,000 دولار أمريكي. الغرامة لعدم وجود التصريح هي 1,900 دولار يوميًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدم للحصول على التصريح وتأخير تسليم المشروع 21 يومًا.",
          "correct": true
        },
        {
          "text": "تجاهل متطلبات التصريح والمتابعة في تنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "محاولة التفاوض مع الحكومة المحلية للحصول على إعفاء.",
          "correct": false
        },
        {
          "text": "تخصيص مبلغ الغرامة كنفقات إضافية للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في صناعة منظمة، والفريق يعمل على مشروع يتم فيه ترتيب المتطلبات في سجل المنتج (Backlog).\n\nتم تحديد الحد الأدنى من المنتج القابل للإصدار (MVP). يعلم مدير المشروع أن الجهة التنظيمية للمشروع تطلب نموذجًا أوليًا للتفتيش قبل إطلاق المنتج، ولم يتم تضمين النموذج الأولي في تعريف MVP.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحدث مع مالك المنتج لإعطاء أولوية لأنشطة الامتثال في سجل المنتج لتقديم النموذج الأولي إلى الجهة التنظيمية.",
          "correct": true
        },
        {
          "text": "تحديد المتطلبات المفقودة، وإدراج العمل التنظيمي مباشرة في سجل المنتج، وتعيين العمل للفريق.",
          "correct": false
        },
        {
          "text": "إعادة جدولة إطلاق المنتج حتى يتمكن الفريق من إنتاج نموذج أولي للتفتيش كما هو مطلوب.",
          "correct": false
        },
        {
          "text": "إنشاء تعريف جديد لـ MVP يتضمن متطلبات النموذج الأولي المطلوب وترتيب أولوياته مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع على وشك الانتهاء، ويريد العميل الاحتفال بالنجاح من خلال مشاركة دراسة حالة توضح الفوائد التي أنشأها المشروع. يشعر مدير المشروع والفريق بعدم الارتياح بشأن مشاركة دراسة حالة في هذه المرحلة.\n\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون مع العميل لإنشاء دراسة حالة تسلط الضوء على فوائد المشروع.",
          "correct": false
        },
        {
          "text": "الاعتراف بالطلب ولكن التأكيد على محدودية دراسة الحالة في هذه المرحلة.",
          "correct": true
        },
        {
          "text": "إحالة العميل إلى فريق المشروع للحصول على تفاصيل الفوائد التي حققها المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بأن إعداد دراسة حالة سيتطلب عملاً وموارد إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع داخلي لمكتب إدارة المشاريع (PMO) في المؤسسة. تم رعاية المشروع في البداية من قبل قائد مكتب إدارة المشاريع السابق الذي تم استبداله لاحقًا. القائد الجديد لا يرى قيمة كبيرة في المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم اجتماع انطلاق جديد للمشروع مع القائد الجديد لمكتب إدارة المشاريع وفريق المشروع.",
          "correct": false
        },
        {
          "text": "استخدام البيانات السابقة للحصول على رعاية المشروع من القائد الجديد نظرًا لأن المشروع كان فعالًا.",
          "correct": false
        },
        {
          "text": "استخدام الفوائد التي تم تتبعها طوال المشروع لإثبات قيمة المشروع.",
          "correct": true
        },
        {
          "text": "مواصلة المشروع كما هو مخطط له لأنه تم اعتماده بالفعل وهو قيد التنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع قيد التنفيذ حاليًا. تم إبلاغ مدير المشروع بوجود عملية جديدة قد تكون مفيدة إذا تم دمجها في المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم كيفية دمج العملية الجديدة.",
          "correct": false
        },
        {
          "text": "إصدار أمر أولوية لإجراء التغيير.",
          "correct": false
        },
        {
          "text": "تحديد فائدة التغيير.",
          "correct": true
        },
        {
          "text": "تعديل وثيقة المتطلبات للتغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء ورشة عمل لتصميم روبوت جديد، سأل المهندسون مدير المشروع عن بروتوكولات السلامة والبيئة لإجراءات تشغيله.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "توظيف مهندس متخصص لدعم فريق التصميم.",
          "correct": false
        },
        {
          "text": "تزويد الفريق بأصول العمليات التنظيمية وميثاق المشروع.",
          "correct": true
        },
        {
          "text": "الرجوع إلى وثائق الدروس المستفادة من مشاريع مشابهة.",
          "correct": false
        },
        {
          "text": "إجراء مقارنة معيارية مع مصانع مماثلة لجمع قيود الامتثال الخاصة بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء جلسة تخطيط المشروع، يحاول مدير المشروع تحديد خطة إصدار لتحقيق تقديم قيمة متسقة وكسب رضا العميل. اقترح أحد أصحاب المصلحة الكبار إصدار المنتج في نهاية المشروع حتى يرى العميل جميع الميزات دفعة واحدة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من فريق المشروع اقتراح جدول إصدار بناءً على تعقيد الميزات المحددة.",
          "correct": false
        },
        {
          "text": "اقتراح ثلاث إصدارات: واحدة في البداية، وأخرى في المنتصف، وأخرى في نهاية المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء خطط إصدار لكل مرة يتم فيها تسليم ميزة منتج لإجراء اختبارات الجودة والمراجعات.",
          "correct": false
        },
        {
          "text": "اقتراح تسليم المنتج على مدار عدة تكرارات لجمع ملاحظات العملاء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد تسعة أشهر، تنتهي المرحلة الأولى من المشروع بإطلاق منتج جديد للعميل. يشعر العميل بعدم الرضا ويذكر أن العديد من الميزات الأساسية مفقودة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم الميزات المفقودة مع العميل وتطوير خطة لإدراجها في المرحلة التالية التي تستمر تسعة أشهر.",
          "correct": false
        },
        {
          "text": "مراجعة خطة المشروع لتحديد ما إذا كانت الميزات المفقودة جزءًا من النطاق الأصلي أو تمت إضافتها لاحقًا.",
          "correct": true
        },
        {
          "text": "طلب تمويل إضافي لتقليل دورة الإصدار الحالية حتى يتمكن الفريق من تقديم القيمة في وقت أقرب.",
          "correct": false
        },
        {
          "text": "إعادة بدء المشروع باستخدام دورة حياة رشيقة ودمج إنشاء منتج قابل للإصدار (MVP).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة مصفوفية ويدير مشروعًا من المقرر إكماله خلال شهر واحد. في اجتماع المشروع اليوم، أُبلغ مدير المشروع أن الأخطاء في كود البرنامج تتزايد باستمرار. وأثناء مناقشة الأمر مع قائد فريق التطوير، قيل له إن ذلك أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوّت الموعد النهائي، لكن مدير المشروع قلق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في جدول المشروع للسماح بمزيد من الوقت للتطوير.",
          "correct": false
        },
        {
          "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أن الخطر قد تم التخفيف منه.",
          "correct": false
        },
        {
          "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يمتثل لمتطلبات الجودة الموثقة.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير من خلال عملية التحكم بالتغييرات لتمديد الموعد النهائي، مما يسمح بمزيد من الوقت للتطوير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمتلك المؤسسة سياسة تتطلب من جميع مديري المشاريع إجراء تدقيق موحد شهريًا على مشروع لمدير مشروع آخر. بعد مراجعة أحد التدقيقات، اشتكى أعضاء الفريق من أن المراجع لم يراجع تسليماتهم بعدالة. راجع مدير المشروع نتائج التدقيق ووافق على النتائج.\n\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب أن تُجرى التدقيقات الإلزامية بتواتر أقل.",
          "correct": false
        },
        {
          "text": "استخدام اجتماعات الحالة لمراجعة التسليمات بدلاً من التدقيقات الرسمية.",
          "correct": false
        },
        {
          "text": "توضيح أن التدقيقات تُجرى بناءً على مقاييس معيارية موحدة.",
          "correct": true
        },
        {
          "text": "الإبلاغ عن مدير المشروع الذي أجرى التدقيق غير العادل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقع المقر الرئيسي لشركة متعددة الجنسيات في أوروبا، مع العديد من المكاتب الإقليمية في دول أخرى حول العالم. قرر مدير العمليات في أحد المكاتب الإقليمية إنشاء مكتب إدارة مشاريع (PMO). تم اختيار مدير مشروع لإدارة المشروع، والذي لا يزال في مراحله الأولى. يحتاج مدير المشروع إلى مواءمة توقعات أصحاب المصلحة مع فوائد عملية المشروع والاستراتيجية التجارية.\n\nأي وثيقة يجب أن يطورها مدير المشروع لهذا الغرض؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل الجدوى التجارية (Business Case)",
          "correct": false
        },
        {
          "text": "خطة إدارة الفوائد (Benefits Management Plan)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع (Project Management Plan)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم مؤخرًا بيع الجزء الأكبر من شركة محلية إلى شركة دولية. وتفرض الشركة الأم الجديدة استخدام لوائح الصحة والسلامة والبيئة (HSE) على جميع المشاريع في الشركة المحلية.\n\nما الذي يجب أن يفعله مديرو المشاريع للبقاء ممتثلين؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانتظار حتى تقوم الإدارة الوظيفية المسؤولة عن اللوائح بإبلاغهم بتغيير العملية.",
          "correct": false
        },
        {
          "text": "طلب من الإدارة المسؤولة عن لوائح HSE تعيين عضو جديد في الفريق.",
          "correct": false
        },
        {
          "text": "التحدث مع راعي المشروع للحصول على توضيح بشأن اللوائح الجديدة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق HSE لفهم تأثير اللوائح الجديدة على المشاريع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإنهاء أحد المشاريع، ويطلب الراعي رؤى حول تحقيق الفوائد. كيف يمكن لمدير المشروع حساب قيمة نتائج المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم الفوائد النوعية والكمية للمشروع.",
          "correct": true
        },
        {
          "text": "تسعير الفوائد الملموسة وتقسيمها على النفقات.",
          "correct": false
        },
        {
          "text": "إجراء تقييم مالي استعادي.",
          "correct": false
        },
        {
          "text": "تقييم النتائج ومقارنتها بالميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت شركة تشكيل فرق رشيقة (Agile) داخل المؤسسة لتحسين نتائج المشاريع والاستفادة من الفرص الجديدة في السوق. تم توظيف مدير مشروع يتمتع بخبرة واسعة في المنهجيات الرشيقة للإشراف على العملية.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "توظيف وتعيين وتقييم ممارسي المشاريع الرشيقة الجدد.",
          "correct": false
        },
        {
          "text": "تنفيذ مكتب إدارة مشاريع رشيقة (Agile PMO).",
          "correct": false
        },
        {
          "text": "تحديد المعايير اللازمة لإطلاق المشاريع الرشيقة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل استعادي لتجارب المشاريع السابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريقان A و B على مشروعين رشيقين مختلفين لنفس العميل. يستخدم الفريقان نفس الطريقة لحساب وحدات العمل، وكل تكرار مدته أسبوعان. في أول تكرارين، أكمل الفريق A 150 وحدة عمل وأكمل الفريق B 200 وحدة عمل. يتم إنجاز مهام كلا الفريقين حسب الخطة. أبلغ العميل عن 5 أخطاء لكل وحدة عمل للفريق A و10 أخطاء لكل وحدة عمل للفريق B.\n\nما هو الاستنتاج الذي يجب أن يصل إليه مدير المشروع بخصوص أداء الفريقين؟",
      "explanation": "",
      "choices": [
        {
          "text": "الفريق B يؤدي بشكل أفضل من الفريق A لأنه أكمل عددًا أكبر من وحدات العمل في نفس المدة.",
          "correct": false
        },
        {
          "text": "أنجز الفريقان مهامهما حسب الخطة؛ وبالتالي، فإن أداءهما متساوٍ.",
          "correct": false
        },
        {
          "text": "الفريق A يؤدي بشكل أفضل من الفريق B لأنه يحتوي على عدد أقل من الأخطاء لكل وحدة عمل.",
          "correct": true
        },
        {
          "text": "أنهى الفريقان تكرارين فقط؛ لذا من المبكر تقييم أدائهما.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تكنولوجي معقد في مرحلة التنفيذ. تتم إضافة تقنيات جديدة إلى سجل المنتج استنادًا إلى متطلبات العميل، وهو ما سيؤدي إلى تغييرات كبيرة في المنتج النهائي.\n\nما الذي يجب على مدير المشروع فعله لتلبية توقعات العميل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تخطيط التكرارات والإصدارات لتلبية كل توقعات العميل.",
          "correct": false
        },
        {
          "text": "إدارة توقعات العميل بناءً على احتياجات العمل الخاصة بالمؤسسة.",
          "correct": true
        },
        {
          "text": "قبول المتطلبات الجديدة، وجدولة اجتماعات لتخطيط جدول إصدار جديد.",
          "correct": false
        },
        {
          "text": "دفع الفريق إلى زيادة المرونة وقبول التحدي الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعلنت الشركة الأم عن مشروع تكامل لجميع الشركات التابعة لها. يغطي مشروع التكامل أقسام الشؤون القانونية والموارد البشرية والمالية في الشركات التابعة. تستثمر الإدارة العليا في هذا المشروع كأول مشروع رشيق لها وتم تعيين مدير مشروع جديد.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة لمناقشة المخاطر.",
          "correct": false
        },
        {
          "text": "تطوير ميثاق الفريق.",
          "correct": false
        },
        {
          "text": "وضع خطة لتعزيز مستوى نضج الفريق في المنهجيات الرشيقة.",
          "correct": false
        },
        {
          "text": "تطوير استراتيجية انتقالية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا هجينًا بعقد ذو وقت وسعر ثابت. يجد مدير المشروع صعوبة في إقناع الفريق بتقديم جداولهم الزمنية. أبلغ الفريق أن العمل سيتم تسليمه كل أسبوعين، لذا لا حاجة للجداول الزمنية. لكن مدير المشروع يحتاج إلى الجداول الزمنية لإجراء تقييم لتكاليف المشروع.\n\nما الذي يجب على مدير المشروع فعله لضمان تقديم الجداول الزمنية من جميع أعضاء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من مكتب إدارة المشاريع (PMO) التأكد من تقديم الفريق للجداول الزمنية.",
          "correct": false
        },
        {
          "text": "إرسال تذكير أسبوعي لكل عضو في الفريق يطلب فيه تقديم الجداول الزمنية.",
          "correct": false
        },
        {
          "text": "شرح تأثير عدم تقديم الجداول الزمنية على تقييم تكاليف المشروع.",
          "correct": true
        },
        {
          "text": "تغيير تكرار تقديم الجداول الزمنية من كل أسبوعين إلى أسبوعياً.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع لتحسين سجل المنتج، يختلف أحد أصحاب المصلحة من قسم الشؤون القانونية مع مالك المنتج حول أولوية عنصر معين. يقول مالك المنتج إن الأولوية الحالية تضيف أقصى قيمة للمشروع، بينما يقول صاحب المصلحة إن هذا العنصر يجب أن يكون أولوية لأنه مطلب قانوني تنظيمي.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانصياع لسلطة مالك المنتج في تحديد الأولويات وتذكير صاحب المصلحة بأن هذه ليست مسؤوليته.",
          "correct": false
        },
        {
          "text": "فحص مواقف سابقة مماثلة في سجل الدروس المستفادة وتحديد الأولوية بناءً على ذلك.",
          "correct": false
        },
        {
          "text": "استخدام تقنيات التفاوض لإقناع مالك المنتج بتغيير الأولوية كما اقترح صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "تيسير مناقشة بين مالك المنتج وصاحب المصلحة لمناقشة وجهات نظرهم ومخاوفهم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سلسلة متاجر كبيرة في مرحلة تنفيذ مشروع لاستبدال أنظمة الدفع في جميع متاجرها في عدة دول. تم اتباع نهج تنبؤي في تخطيط المشروع، ويتم التنفيذ عبر عدة دورات لكل دولة. توقف التنفيذ في الدولة C بسبب قوانين جديدة تنظم أمان تنفيذ الحل الجديد للدفع.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لتجنب تأخير كبير في المشروع؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة الامتثال للقوانين في كل دولة بشكل مستمر أثناء التخطيط وبعد التنفيذ في كل دولة.",
          "correct": false
        },
        {
          "text": "توثيق مخاطر الامتثال القانوني في خطة إدارة المشروع للدولة C خلال مرحلة التنفيذ والدورات.",
          "correct": false
        },
        {
          "text": "نشر أنظمة بديلة متوافقة مع معايير الأمان والإطار القانوني للدولة C.",
          "correct": false
        },
        {
          "text": "تنفيذ مرحلة التنفيذ في دولة أخرى بعد التحقق من معايير الامتثال، أثناء التحضير لحل خاص بالدولة C.",
          "correct": false
        },
        {
          "text": "إبلاغ اللجنة التوجيهية بالتأخير، وإيقاف المشروع حتى يتم اتخاذ قرار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا يتطلب موافقة من جهة حكومية. الجهة تقوم حاليًا بصياغة تشريع سيؤثر على عملية الموافقة، لكن من غير الواضح متى سيصبح القانون ساريًا. يشعر مدير المشروع بالقلق من أن التشريع قد يؤخر المعالم الرئيسية للمشروع أو يحد من خيارات التطوير.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدم بطلب لاحتياطي إضافي تحضيرًا للتأخير المتوقع في معالم المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة نطاق المشروع وتقديم طلب لاستبعاد الأنشطة المرتبطة بالتشريع.",
          "correct": false
        },
        {
          "text": "تقييم التعرض للمخاطر بشكل مستمر لتقليل التأثيرات السلبية على المشروع ونتائجه.",
          "correct": true
        },
        {
          "text": "المضي قدمًا في المشروع بناءً على افتراض أن التشريع سيُمرَّر دون تأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة دولية بتنفيذ تقنية مبتكرة في أحد مصانع الإنتاج التابعة لها. وقد أثبتت هذه التقنية بالفعل عوائد إيجابية في موقع آخر.\n\nما الذي يجب أن يعتبره مدير المشروع جانبًا أساسيًا في التنفيذ الناجح لهذه التقنية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم حالة العمل لضمان أن العائد على الاستثمار يفي أو يتجاوز مؤشرات الأداء في الموقع الأول.",
          "correct": false
        },
        {
          "text": "التشاور مع مدير التقنية لضمان ملاءمة التقنية للموقع الجديد.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل لمشاركة المعلومات لعرض التقنية الجديدة وفوائدها على أصحاب المصلحة في الموقع الجديد.",
          "correct": true
        },
        {
          "text": "تطوير ميثاق المشروع للتنفيذ في الموقع الجديد باستخدام الدروس المستفادة من الموقع الأول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء الفحص النهائي لأحد المخرجات، لاحظ فريق الجودة وجود انحراف في أحد المكونات. ومع ذلك، لم يذكر العميل أي شيء يتعلق بذلك في مواصفاته.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "إحالة الأمر إلى خبير تقني.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق لضمان الجودة.",
          "correct": true
        },
        {
          "text": "الموافقة على المخرج لأنه لا ينحرف عن مواصفات العميل.",
          "correct": false
        },
        {
          "text": "رفض المخرج بسبب الانحراف عن مواصفات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مشروع لتكنولوجيا جديدة، ظهرت حالة من الارتباك بسبب عدم وجود حالة مستقبلية واضحة ومُبلغة بخصوص المنتج.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء خطة إدارة الفوائد والحصول على الموافقة عليها.",
          "correct": true
        },
        {
          "text": "سؤال راعي المشروع عن النتيجة المتوقعة للمشروع.",
          "correct": false
        },
        {
          "text": "مناقشة النطاق والأهداف مع المالك الوظيفي.",
          "correct": false
        },
        {
          "text": "مراجعة حالة العمل للمشروع لتحديد البدائل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت الموافقة على لائحة جديدة ستؤثر على المخرجات في المرحلة الرابعة من المشروع. يتم التسليم باتباع نهج تكراري ويتم حاليًا إكمال المرحلة الثانية.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع راعي المشروع لمناقشة زيادة التكاليف.",
          "correct": false
        },
        {
          "text": "الحصول على موافقة اللجنة التوجيهية على الميزانية الإضافية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الخبراء المتخصصين لتقييم الأثر على الأهداف.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة على استثناء من تنفيذ اللائحة الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا حاسمًا لتسليم حل جديد. المدير التنفيذي مهتم جدًا بالمشروع، والمدير المالي هو مالك المنتج. أثناء مرحلة الاختبار، يطلب المدير المالي متطلبًا غير وظيفي إضافيًا لتقليل وقت معالجة المعاملات. سيتسبب هذا المطلب الجديد في تأخير تاريخ الإطلاق، ويصر المدير المالي على تنفيذه.\n\nما الذي يجب على مدير المشروع فعله لتقليل أثر المطلب الجديد على تاريخ الإطلاق وإدارة توقعات المدير التنفيذي والمدير المالي؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع المدير المالي واقتراح تأجيل تنفيذ المطلب الجديد إلى ما بعد الإطلاق.",
          "correct": false
        },
        {
          "text": "طلب تدخل المدير التنفيذي لإيقاف تنفيذ المطلب الجديد لأن التطوير قد اكتمل.",
          "correct": false
        },
        {
          "text": "إخبار فريق المشروع بتحديث سجل المنتج بالمطلب الجديد وتعديل خطط المشروع.",
          "correct": false
        },
        {
          "text": "تقييم نطاق المطلب غير الوظيفي الجديد لتحديد تأثيره المحدد على تاريخ الإطلاق المخطط.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اقترح أحد أعضاء الفريق استخدام منتج جديد لتسريع تطوير الميزات، لكن ذلك سيزيد من ميزانية المشروع. يتبع الفريق نهجًا تدريجيًا في تطوير المنتج، ويكون مالك المنتج مسؤولًا عن تحديد الأولويات وإدارة سجل المنتج.\n\nما الذي يجب على مدير المشروع فعله أولًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع مالك المنتج وعرض الفوائد والسلبيات المتعلقة باستخدام المنتج الجديد.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث خطة إدارة التكاليف لاستيعاب الأثر المحتمل على الميزانية.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي لتنفيذ المنتج الجديد من راعي المشروع.",
          "correct": false
        },
        {
          "text": "تعديل معايير القبول لقصص المستخدم لدمج المنتج الجديد بفعالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع حاليًا على مشروع منذ بدايته ويعلم أن هناك العديد من الافتراضات والاعتماديات الأساسية لنجاح المشروع.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب دعم من راعي المشروع لتخصيص مورد مخصص لمتابعة وتحقيق الفوائد.",
          "correct": false
        },
        {
          "text": "توجيه فريق المشروع لتوثيق جميع الافتراضات وتتبع جميع التغييرات.",
          "correct": true
        },
        {
          "text": "تيسير جلسة عصف ذهني مع الفريق لصياغة خطة شاملة لتخفيف المخاطر.",
          "correct": false
        },
        {
          "text": "طلب من مكتب إدارة المشاريع (PMO) تنفيذ نظام قياس الفوائد للتحقق من مقاييس الفائدة والمخاطر المرتبطة بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تطوير نظام جديد لاستبدال عملية يدوية حالية. أثناء عرض نتائج دورة Sprint، عبّر أصحاب المصلحة التجاريون عن قلقهم من أنهم لن يحصلوا على أي قيمة من استخدام هذا النظام.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الأمر مع مدير المنتج وتحديد قصص مستخدم جديدة لمعالجة مخاوف العمل.",
          "correct": false
        },
        {
          "text": "عقد اجتماع للجنة التوجيه لتحديد عوامل النجاح الحرجة للمشروع.",
          "correct": false
        },
        {
          "text": "إنشاء خطة إدارة الفوائد ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة مقاييس الأداء مع أصحاب المصلحة لضمان أن النظام حقق المقاييس المتفق عليها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد عدة مقابلات مع أصحاب المصلحة الرئيسيين ومراجعة ميثاق المشروع، وجد مدير المشروع أن الهيكل التنظيمي الحالي للمشروع لم يعد مناسبًا للأهداف الاستراتيجية للمشروع.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم وثائق الدروس المستفادة والتحقق من أي هيكل تنظيمي تم استخدامه في مشاريع مماثلة سابقًا.",
          "correct": false
        },
        {
          "text": "طلب من الفريق توثيق الخطر في سجل مخاطر المشروع وتطوير خطة استجابة للمخاطر وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "تقييم الفجوات بين الهيكل التنظيمي الحالي والفوائد المتوقعة للمشروع لتحديد الإجراءات المطلوبة.",
          "correct": true
        },
        {
          "text": "طلب من الفريق مراجعة ميثاق المشروع وتقييم مدى ملاءمة أهداف المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع هجين (تنبؤي - رشيق). أثناء اجتماع وقوف، ذكر أحد أعضاء الفريق أنه استنادًا إلى تجربة في مشروع سابق، يعتقد أن أحد المخرجات القادمة قد يحتاج إلى الامتثال للوائح الحكومية.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى مكتب إدارة المشاريع (PMO) حتى يحددوا ما إذا كان هناك امتثال مطلوب.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع حتى يتم التأكد من أن المخرج يخضع لأي لوائح.",
          "correct": false
        },
        {
          "text": "مراجعة الدروس المستفادة من المشروع السابق لتحديد ما إذا كان هناك أي امتثال مطلوب.",
          "correct": true
        },
        {
          "text": "إزالة المهمة من المسار الحرج وتكليف المورد بالعمل على مطلب آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حصل نظام حسابات القبض الذي تم إطلاقه مؤخرًا على غرامة من هيئة تنظيمية لأنه لم يمتثل للوائح المحلية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد إدارة التحكم بالمخاطر.",
          "correct": false
        },
        {
          "text": "تحديد عملية التحكم في الجودة.",
          "correct": true
        },
        {
          "text": "تنفيذ سجل للتحكم في القضايا.",
          "correct": false
        },
        {
          "text": "إشراك قسم التدقيق في تخطيط المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمر شركة بتغيير تنظيمي. تم تغيير معظم الإدارة العليا، بما في ذلك المشرف المباشر على مدير المشروع. يتمتع المشرف بأسلوب عمل هجومي، وقد وجه تعليقات نقدية إلى مدير المشروع بشأن المشروع الجاري دون فهم الوضع بشكل كافٍ. يشعر مدير المشروع بعدم الارتياح للعمل مع المشرف الجديد.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع مراجعة للمشروع لشرح النقاط الرئيسية للمشروع للمشرف الجديد.",
          "correct": false
        },
        {
          "text": "تطبيق توصيات المشرف الجديد على المشروع.",
          "correct": false
        },
        {
          "text": "تقييم تأثير التغيير التنظيمي على المشروع.",
          "correct": true
        },
        {
          "text": "إبلاغ فريق المشروع بأن عليهم الاستعداد لتقبل التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء آخر دورة تخطيط في مشروع رشيق، اكتشف الفريق أنه لم يتم تضمين اللوائح الإلزامية في الحد الأدنى من المنتج القابل للتطبيق (MVP).\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الفريق تضمين هذا المطلب التنظيمي في قائمة مهام الدورة.",
          "correct": false
        },
        {
          "text": "طلب من مالك المنتج مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": true
        },
        {
          "text": "طلب من أصحاب المصلحة مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": false
        },
        {
          "text": "طلب موافقة الراعي على تضمين هذا المطلب التنظيمي في قائمة مهام الدورة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير مشروع حديثًا ببدء مشروع طويل الأجل عندما أقرّت الحكومة تشريعًا جديدًا يُلزم جميع المهندسين العاملين في الولاية بالتسجيل. يعتمد التسجيل على مجال العمل، والخبرة، والتطوير المهني المُنجز خلال السنوات الثلاث الماضية. ونظرًا لقيود الميزانية في الشركة خلال السنوات الثلاث الماضية، كانت الفرص المتاحة للمهندسين لتلقي تدريب مهني رسمي محدودة.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال طلب إلى لجنة إدارة التغيير لتقييم الوضع.",
          "correct": false
        },
        {
          "text": "مراجعة مصفوفة مهارات الفريق وتحديث خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "إرسال جميع المهندسين إلى تدريب مهني لتلبية المتطلبات.",
          "correct": false
        },
        {
          "text": "إبلاغ المهندسين بأنهم بحاجة إلى التسجيل للاستمرار في العمل بالشركة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو النهج الذي يجب أن يستخدمه مدير المشروع لتعزيز التعاون بين المطورين في نموذج تطوير رشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختبار القبول",
          "correct": false
        },
        {
          "text": "تطوير قائم على السلوك",
          "correct": true
        },
        {
          "text": "تطوير التطبيقات المشترك",
          "correct": false
        },
        {
          "text": "تطوير التطبيقات السريع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع حالة العمل، أقرّ مدير المشروع بأن العديد من ظروف السوق قد تغيرت بشكل كبير مؤخرًا. نتيجة لذلك، قد تكون القيمة المتوقعة من المشروع الجاري مهددة.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إيقاف المشروع فورًا بسبب الشك في أن المشروع سيحقق القيمة المتوقعة.",
          "correct": false
        },
        {
          "text": "الاستمرار في المشروع لأن مدير المشروع لم يتلق إخطارًا رسميًا بأي تغيير في ظروف السوق.",
          "correct": false
        },
        {
          "text": "مطالبة فريق المشروع بالتحقيق في تطور ظروف السوق خلال الأشهر الستة الماضية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة المعلومات وسؤاله عمّا إذا كانت المؤسسة لا تزال تدعم تسليم المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصدرت الجهة التنظيمية الحكومية المحلية إخطارًا لجميع الشركات بشأن مشروع جديد يهدف إلى تسهيل الإبلاغ عن المعلومات إلى جهة تنظيمية دولية. ومع ذلك، وبسبب الطبيعة الديناميكية للمشروع، هناك احتمال لتغيير المتطلبات في حين أن تاريخ التسليم يبقى ثابتًا. يشعر مدير المشروع المعيّن لهذا المشروع بالقلق إزاء عدم اليقين والإطار الزمني القصير للتسليم.\n\nكيف يجب على مدير المشروع الاستعداد بشكل أفضل لمواجهة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ أساليب تدريجية ومتزايدة في المجالات المناسبة من المشروع للتكيف مع المتطلبات المتغيرة.",
          "correct": true
        },
        {
          "text": "الاجتماع مع الراعي لتحديد جدول زمني تفصيلي لضمان الانتهاء من المشروع في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "تطوير خطة طوارئ تفصيلية باستخدام تقنية التسريع لتسريع أنشطة المشروع حسب الحاجة.",
          "correct": false
        },
        {
          "text": "تعزيز استراتيجيات الاتصال والمشاركة مع الحكومة المحلية لضمان التوافق والتحديثات في الوقت المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تحديث نظام قديم. تم تثبيت خطة إدارة المشروع وتم تسليم المتطلبات إلى قسم تكنولوجيا المعلومات للتطوير. ومع ذلك، أعلن الرئيس التنفيذي للشركة عن التوجه الاستراتيجي الجديد وخطط قادمة لتنفيذ نظام تخطيط موارد المؤسسات (ERP).\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب توصيات من راعي المشروع للحفاظ على سير المشروع.",
          "correct": false
        },
        {
          "text": "فهم وتوضيح كيف يتماشى المشروع الحالي مع الرؤية العامة للمؤسسة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع لفريق المشروع للتخطيط وتأكيد توزيع الموارد للمشروع الجديد.",
          "correct": false
        },
        {
          "text": "مراجعة الجدول الزمني للمشروع لضمان اكتماله في الوقت المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين ممارس رشيق (Agile Practitioner) لقيادة مشروع تطوير برنامج في صناعة جديدة نسبيًا حيث لم يتم بعد تحديد معايير الامتثال الخارجية بشكل واضح. \n\nما الذي يجب أن يفعله الممارس الرشيق لضمان نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحدث إلى مديري مشاريع رشيقة في منظمات أخرى تواجه نفس التحديات لمعرفة كيف يعالجون المشكلات.",
          "correct": false
        },
        {
          "text": "تطوير مجموعة من المعايير التي تناسب الدور ودعم الفريق في تنفيذها.",
          "correct": false
        },
        {
          "text": "استخدام أفضل الممارسات العالمية كدليل لتنفيذ المشروع مع دمج أحدث الاتجاهات التكنولوجية ومراقبة معايير الامتثال.",
          "correct": true
        },
        {
          "text": "الرجوع إلى بيانات سابقة من صناعات مرتبطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصبح بيئة العمل غير مستقرة لأن أحد أصحاب المصلحة قام بتغيير نتائج المشروع ومخرجاته في منتصف مرحلة التنفيذ. مع مراعاة هذا الطرف المعني، كيف يجب على مدير المشروع ضمان تسليم فوائد المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن فريق المشروع يوافق على خطة إدارة المشروع وتقديم تحديثات مستمرة لصاحب المصلحة.",
          "correct": false
        },
        {
          "text": "دمج كل من الأساليب الرشيقة والتنبؤية وإدارة التغييرات في نطاق المشروع بأقل انحراف ممكن.",
          "correct": false
        },
        {
          "text": "ضمان أن تسليمات المشروع وأهدافه مصممة وفقًا للمتطلبات الأولية.",
          "correct": false
        },
        {
          "text": "إشراك صاحب المصلحة بناءً على مستوى التأثير وضمان التقاط متطلباته بشكل كافٍ وفقًا لعملية إدارة التغيير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مدير مشروع بوضع خطة لمشروع جديد. خلال أول اجتماع للتخطيط، يسأل أصحاب المصلحة عن قيمة المشروع وكيفية ارتباطه بأهداف المنظمة.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إحالة أصحاب المصلحة إلى خطة إدارة النطاق.",
          "correct": false
        },
        {
          "text": "إحالة أصحاب المصلحة إلى ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "دعوة راعي المشروع لحضور الاجتماع للإجابة على الأسئلة.",
          "correct": false
        },
        {
          "text": "طلب الوثائق اللازمة من مكتب إدارة المشاريع (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على تطبيق تنظيمي لديه مدة محددة للتسليم. يستخدم الفريق نهجًا هجينًا وقد قسم التطوير إلى ثلاث دورات. لم تنتج أول دورتين النتائج المطلوبة بسبب التأخيرات من الوحدات الوظيفية. يشعر مدير المالية بالقلق بسبب العقوبات الوشيكة إذا لم يتم الانتهاء من التطبيق، والفريق demoralized.\n\nمن المسؤول عن تحفيز فريق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "مدير المالية",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مدير المشروع",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب العميل تغييرًا كبيرًا في النطاق نتيجة لتغيرات في بيئة السوق، مما سيضيف تكلفة كبيرة على المشروع. تم اعتماد هذا التغيير من خلال عملية التحكم في التغيير.\n\nما الذي يجب أن يفعله مدير المشروع لإعادة المشروع إلى المسار الصحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تقييم خط الأساس للنطاق وتأثيره على أهداف المشروع.",
          "correct": false
        },
        {
          "text": "استخدام الاحتياطي الإداري لمراعاة عدم اليقين في الجدول الزمني.",
          "correct": true
        },
        {
          "text": "مراقبة المخاطر لضمان فعالية عملية إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "إعادة تقييم خطة إدارة التكاليف لمعالجة تأثير التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا تلقى طلبًا لنطاق إضافي بسبب تغييرات في طلب السوق. يطلب التغيير أيضًا إطارًا زمنيًا أسرع للتسليم.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم أداء الشركة ونطاق المشاريع الأخرى لضمان الحد الأدنى من التأثير.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل مع الرعاة وطلب زيادة ميزانية المشروع.",
          "correct": false
        },
        {
          "text": "جمع البيانات وتحليل بيئة العمل للتحقق من فوائد العمل.",
          "correct": false
        },
        {
          "text": "تقييم التقنيات الجديدة والمنافسين، ثم مقارنة التغيير بها.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل للمخاطر، ثم تحديث خطة إدارة المخاطر وسجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع تنفيذ مكاتب منزلية عن بُعد. تفاجأ مدير المشروع بعلامات مبكرة من المقاومة من أصحاب مصلحة رئيسيين في المؤسسة. يعارض هؤلاء أصحاب المصلحة التغيير بشدة وسيتطلب الأمر المزيد من الإقناع أكثر مما كان يتوقعه مدير المشروع.\n\nما الأداتان أو التقنيتان اللتان يجب استخدامهما لتحديد تأثير أصحاب المصلحة على مستوى المؤسسة والمشروع؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "مصفوفة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "مخطط RACI",
          "correct": false
        },
        {
          "text": "تحليل أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "خريطة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "خريطة المشاركة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تراجع في بيئة الأعمال، لا يستطيع العميل دفع المبلغ الكامل الشهري للمشروع، بل فقط جزء منه.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الأمر مع الإدارة وإيقاف المشروع بسبب قيود ميزانية العميل.",
          "correct": false
        },
        {
          "text": "تسليم الميزات ذات القيمة الأعلى للعمل استنادًا إلى الميزانية المتاحة.",
          "correct": true
        },
        {
          "text": "تسليم الميزات التي تحتوي على مكونات مستقلة صغيرة حسب الميزانية المتوفرة.",
          "correct": false
        },
        {
          "text": "المتابعة في التطوير حسب الخطة وعدم التسليم إلا عند دفع المبلغ الكامل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع جديد في مؤسسة بإدارة أول مشروع باستخدام النهج الرشيق (Agile). قرر مدير المشروع البدء بتقييم قدرة المؤسسة على التكيف مع مشروع رشيق.\n\nما الخصائص الثلاث التي ستساعد في ضمان نجاح المشروع؟ (اختر ثلاثًا)",
      "explanation": "",
      "choices": [
        {
          "text": "بيئة عمل آمنة",
          "correct": false
        },
        {
          "text": "مؤشرات الأداء الرئيسية (KPIs)",
          "correct": false
        },
        {
          "text": "الاستعداد للتجريب",
          "correct": false
        },
        {
          "text": "السرعة للوصول إلى السوق",
          "correct": false
        },
        {
          "text": "إمكانية التنبؤ",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتابع مدير مشروع تنفيذ بنية تحتية تعتمد على مزود خدمة. أبلغ مزود الخدمة مدير المشروع أن بعض المكونات من جهة خارجية لن يتم تصنيعها أو دعمها بعد الآن. ووفقًا للمراجعة الأولية، فإن هذا سيؤدي إلى تأخير كبير في الجدول وزيادة في الميزانية.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد هذه المسألة إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مراجعة مع الفريق.",
          "correct": false
        },
        {
          "text": "تحديث حالة المشروع لتعكس هذه النتائج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخضع مشروع ما للتدقيق بسبب كمية استهلاك المياه. فرع تراخيص المياه التابع للحكومة يقوم بتغيير سياساته ليكون أكثر تقييدًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "توجيه موارد المشروع لمعارضة المعيار الجديد لترخيص المياه.",
          "correct": false
        },
        {
          "text": "إلغاء المشروع بسبب حالة عدم اليقين الناتجة عن التغيير في السياسة.",
          "correct": false
        },
        {
          "text": "تقييم تأثير تغيير السياسة على نطاق المشروع.",
          "correct": true
        },
        {
          "text": "إنشاء جدول زمني جديد للمشروع بناءً على التغييرات المحتملة في سياسة المياه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت شركة بتنفيذ مشروع تحول كبير للاستعداد للاقتصاد المتغير. أثناء تنفيذ مشروع التحول، ظهرت تقنية جديدة لم تكن متوقعة في خطة إدارة المخاطر.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد هذا الأمر إلى قسم تكنولوجيا المعلومات وتنظيم تدريب للأعضاء المتأثرين في الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المشتريات وتحديد العقود المتأثرة بعمليات الشراء القادمة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المخاطر وتطبيق عملية تخطيط المخاطر للمشروع.",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى لجنة التوجيه التالية وتنظيم جلسة عصف ذهني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع تطوير برمجيات حرج على مدار ست دورات سابقة. قبل يومين من الدورة الأخيرة، عُقد عرض توضيحي لأصحاب المصلحة، حيث أعرب صاحب مصلحة جديد عن أن المنتج لن يلبي توقعات السوق.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الأمر مع راعي المشروع وصاحب المصلحة الجديد وطلب منهما حل مشكلة التوقعات.",
          "correct": false
        },
        {
          "text": "مراجعة نطاق المشروع وخطته مع صاحب المصلحة الجديد.",
          "correct": true
        },
        {
          "text": "مراجعة قائمة المهام المطلوبة مع فريق التطوير وصاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "اتباع خطة إدارة التغيير وتعديل النطاق والخطة بناءً على طلب أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع رشيق في مرحلته الأخيرة. خلال اجتماع الوقوف اليومي، أدرك الفريق أنهم لن يتمكنوا من إكمال جميع الأنشطة المخطط لها للدورة. أنشأ أعضاء الفريق خطة طوارئ.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة خطة الطوارئ مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "مناقشة خطة الطوارئ مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مناقشة خطة الطوارئ مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ خطة الطوارئ فورًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مرحلة تكرارية حرجة من المشروع، أصبحت مشكلة سبق تحديدها كمخاطر، مؤكدة وتسببت في توقف التقدم. بعد إدخال العنصر الجديد في سجل القضايا، ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعزيز الاتصالات وإشراك أصحاب المصلحة في الحل عند الضرورة.",
          "correct": true
        },
        {
          "text": "تغيير خطة إدارة الاتصالات وتعيين مالك للمشكلة.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة داخل الفريق خلال اجتماع الاستعراض القادم للمشروع.",
          "correct": false
        },
        {
          "text": "إضافة المشكلة إلى سجل المنتج لعرضها في الدورة الحالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ من مشروع، تم تعيين مدير مشروع جديد ليحل محل المدير السابق. عند بدء إدارة المشروع، اكتشف المدير الجديد أن أداء الفريق قد انخفض بشكل كبير، مما أثر على مؤشرات الأداء الرئيسية (KPIs) للمشروع. وقد أظهر هذا الفريق أداءً جيدًا في مشاريع مماثلة سابقًا.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك لتحسين الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الموارد والأصول التنظيمية.",
          "correct": false
        },
        {
          "text": "تطبيق تقنيات الضغط الزمني لإعادة المشروع إلى المسار.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مع الفريق لتحديد السبب الجذري لتدهور الأداء.",
          "correct": true
        },
        {
          "text": "تقدير تأثيرات خط الأساس وتقديم طلب تغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى فريق المشروع مؤخرًا دورة تطوير لميزتين في نظام إدارة الأسطول. على الرغم من تسليم الميزات المطلوبة، واجه الفريق عدة مشاكل وصراعات خلال الدورة. شعر أعضاء الفريق بالإحباط من هذه التجربة وهم الآن يفتقرون إلى الحافز بسبب ما حدث.\n\nما الذي يمكن لمدير المشروع فعله لزيادة تحفيز الفريق ومشاركته في المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ترتيب اجتماعات فردية مع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة تقدم الدورة مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة إجراءات التخطيط للدورة مع الفريق.",
          "correct": false
        },
        {
          "text": "إجراء مراجعة استعادية للدورة مع الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أظهر أحد أصحاب المصلحة الرئيسيين اهتمامًا في بداية مشروع رشيق معقد، لكنه أصبح أقل مشاركة مع تقدم الدورات بسبب مسؤوليات إضافية. بعد عدة دورات، رفض هذا صاحب المصلحة ميزة تم تسليمها. يعيد الفريق العمل على الميزة المرفوضة للدورة التالية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "توثيق رؤية المشروع وأهدافه.",
          "correct": false
        },
        {
          "text": "تحليل التغيرات في خصائص أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة الرئيسيين في عملية اتخاذ القرار.",
          "correct": true
        },
        {
          "text": "تخصيص الاتصالات مع أصحاب المصلحة حسب احتياجاتهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لقيادة مشروع رشيق. يريد مدير المشروع استخدام التحفيز لتشجيع الفريق على الأداء الجيد طوال فترة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ نظام مكافآت بهدف إبقاء الفريق متحمسًا ومشاركًا.",
          "correct": true
        },
        {
          "text": "استخدام الاحتياطيات الإدارية لتمويل أنشطة بناء الفريق.",
          "correct": false
        },
        {
          "text": "تضخيم تقديرات المشروع لتوفير هامش مالي لأنشطة الفريق.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي من راعي المشروع لأنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت قيادة الشركة الاستثمار في منتج جديد باستخدام نهج رشيق. بدأت الفرق التجارية وفِرَق المنتج في نشاط التخطيط لهذا المشروع الجديد.\n\nما هي العوامل الثلاثة الأساسية التي يحتاجها مدير المشروع لتسليم هذا المنتج؟ (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "رؤية المنتج",
          "correct": false
        },
        {
          "text": "خارطة طريق المنتج",
          "correct": false
        },
        {
          "text": "قائمة المنتج عالية المستوى",
          "correct": false
        },
        {
          "text": "مؤشرات الأداء الرئيسية (KPIs)",
          "correct": false
        },
        {
          "text": "مؤشرات أداء الجدول الزمني (SPIs)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تشكيل فريق جديد لمشروع سيستخدم نهجًا تنبؤيًا في جمع المتطلبات ونهجًا رشيقًا في التطوير والاختبار. ليس كل أعضاء الفريق لديهم خبرة في العمل ضمن بيئة رشيقة. بدأ الجدول الزمني في الانزلاق بسبب الهيكل غير الواضح لنهج التطوير الرشيق.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعداد اجتماعات حالة أسبوعية لمراجعة تقدم الفريق وتصعيد التأخيرات بانتظام.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق والسماح للأعضاء باتخاذ القرارات وتحديد أهداف الأداء.",
          "correct": false
        },
        {
          "text": "إنشاء اجتماعات وقوف يومية لتتبع التقدم وتصعيد التأخيرات لأصحاب المصلحة حسب الحاجة.",
          "correct": true
        },
        {
          "text": "إجراء اجتماعات دورية وتحديد الأعضاء ذوي الأداء المنخفض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أصحاب المصلحة الكبار في الأعمال وذو خبرة طويلة يمارس ضغطًا على فريق رشيق لتسليم معظم الوظائف الموعودة للعميل بعد 18 شهرًا بدلًا من تسليمات تدريجية متعددة خلال تلك الفترة.\n\nما الذي يجب أن يفعله قائد المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع الفريق الرشيق لجدولة التسليمات التزايدية لتمكين تسليم القيمة التجارية في وقت أقرب للعميل.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعات مع العميل لتحديد قدرته على دعم التسليمات التزايدية المتعددة.",
          "correct": false
        },
        {
          "text": "تقديم تفاصيل القلق للفريق الرشيق وضبط أهدافهم وخطط الإطلاق لتتوافق مع طلب صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "العمل مع صاحب المصلحة لفهم المخاوف مع توضيح فوائد التسليمات التزايدية في الوقت نفسه.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع استثماري لمعالجة المياه. أصدرت الحكومة المحلية مؤخرًا قانونًا يتطلب الامتثال لمعايير المياه النظيفة وفقًا للمعايير العالمية. هذه لائحة جديدة بدأت في الشهر الماضي وتم تمريرها بسرعة.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ أصحاب المصلحة والاستمرار في المشروع وفقًا للخطط الأصلية لأن القانون صدر بعد بدء المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع والتوصية بالاستمرار لأن المتطلبات القانونية الجديدة يمكن تحقيقها.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لتأثير اللوائح على المشروع والأعمال التجارية وإبلاغ أصحاب المصلحة بها.",
          "correct": true
        },
        {
          "text": "التوصية بإيقاف جميع أعمال المشروع فورًا حتى يتم فهم تأثير اللوائح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الاستحواذ على شركة ناشئة في مراحلها المبكرة من قبل شركة كبرى. في ظل هذا السيناريو الجديد، طُلب من مدير المشروع مراجعة خارطة طريق المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد تعريف القيمة مع أصحاب المصلحة وإعادة ترتيب أولويات قائمة المشروع وفقًا لذلك.",
          "correct": true
        },
        {
          "text": "إعادة ترتيب أولويات قائمة المشروع من خلال إعطاء الأولوية للميزات التي تزيد من العائد على الاستثمار (ROI).",
          "correct": false
        },
        {
          "text": "إعادة ترتيب خارطة الطريق من خلال التركيز على الفوائد طويلة الأمد وتقليل الدين التقني.",
          "correct": false
        },
        {
          "text": "إطلاق استطلاع للعملاء لتقييم الميزات الرئيسية للمشروع قبل إعادة ترتيب خارطة الطريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تنفيذ نظام لإدارة صحة الأصول. أشار راعي الأعمال التنفيذي إلى أن النظام من المتوقع أن يُحسّن جودة العمليات ويطيل عمر الأصول.\n\nما الذي يجب على مدير المشروع فعله لإثبات القيمة التجارية بمجرد أن يكون النظام قيد التشغيل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد معايير النجاح الحرجة، وتحديد وفورات التكاليف المحتملة، ومقاييس الأداء المستمرة للمشروع.",
          "correct": true
        },
        {
          "text": "كتابة حالات اختبار تتماشى مع القيم التجارية وضمان وضوح معايير القبول أثناء اختبار قبول المستخدم (UAT).",
          "correct": false
        },
        {
          "text": "التحقق من أن جميع المتطلبات ومعايير القبول تتماشى مع القيمة والتوقعات التجارية.",
          "correct": false
        },
        {
          "text": "التحقق من العائد على الاستثمار (ROI) ومراجعة أداء الأصول الحالي واستخدامه كنقطة مرجعية للقياسات المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع لتسليم حل في الدولة (أ). ونظرًا لاحتمالية حدوث خرق أمني، فإن حكومة الدولة (أ) تحظر التكنولوجيا التي سيتم استخدامها في الحل، مما يؤثر سلبًا على المشروع. مدير المشروع يقترب من إتمام التثبيت بعد أن اشترى بالفعل المواد والتكنولوجيا المحظورة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المشروع واتباع عملية التحكم في التغيير.",
          "correct": true
        },
        {
          "text": "طلب من الفريق القانوني مراجعة التغيير وتحديد الاستجابة المناسبة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع بشأن المشكلة وطلب التوجيه بشأن الخطوات التالية.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بأن المشروع لا يمكنه تسليم النطاق المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يُطوّر مشروع منتجًا يكون فيه الوقت إلى السوق أمرًا حاسمًا. خلال مرحلة التنفيذ، قدم العميل طلب تغيير لتضمين أحدث التقنيات التي ستُحسن ميزات المنتج وتوفر ميزة تنافسية. سيؤثر التغيير على قيود المشروع، لكن الفوائد تفوق التكلفة والجهد.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اعتماد نهج تسليم تزايدي وإطلاق الميزات الأساسية للمنتج إلى السوق أولًا لمواجهة المنافسة.",
          "correct": true
        },
        {
          "text": "بدء مشروع منفصل لتبني التكنولوجيا الجديدة تدريجيًا بهدف تحسين ميزات المنتج مع نضج التكنولوجيا.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية تغيير متكاملة ومراجعة قيود المشروع لإدارة النطاق المعزز بشكل فعال.",
          "correct": false
        },
        {
          "text": "إغلاق المشروع الحالي وبدء مشروع جديد باستخدام نهج تسليم تزايدي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طُلب من مدير مشروع إدارة مشروع سيمكن الشركة من الامتثال لتنظيم جديد قادم. بعد انطلاق المشروع مباشرة، تم تعديل النطاق ليعمل فريق المشروع الآن على مهام محددة، بينما يدير فريق عالمي البرنامج لعدة دول بالتوازي. لم تتم مشاركة خطة إدارة المشروع بعد، والمشروع له موعد نهائي ثابت.\n\nما الذي يجب على مدير المشروع فعله للتعامل مع النطاق والتغييرات؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء إدخال خطر في خطة إدارة المخاطر بسبب غياب خطة إدارة المشروع العالمية.",
          "correct": false
        },
        {
          "text": "إضفاء الطابع الرسمي على التغيير في النطاق مع راعي المشروع لتحديد المسؤولية على المهام المحددة.",
          "correct": false
        },
        {
          "text": "مراجعة الأصول التنظيمية للعمل (OPA) من مواقف مماثلة والنهج التي تم تنفيذها.",
          "correct": false
        },
        {
          "text": "تحديد قائمة أولية (Backlog) وبدء العمل على المهام الأكثر وضوحًا، ثم تحسين النطاق تدريجيًا.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تتزامن مرحلة تنفيذ المشروع مع عطلة في الدولة التي يقيم بها غالبية أعضاء الفريق. هذه المرحلة حرجة، ويُطلب من جميع أعضاء الفريق العمل خلال العطلة، مما يؤثر سلبًا على معنويات الفريق.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب المساعدة من فرق أخرى في دول أخرى.",
          "correct": false
        },
        {
          "text": "تأجيل أنشطة المشروع.",
          "correct": false
        },
        {
          "text": "إعداد خطة مشاركة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة الموارد بشكل أفضل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن المشروع متأخر عن الجدول الزمني بسبب تأخر تسليم المواد. أبلغ فريق المشتريات مدير المشروع بأن القواعد الجديدة التي فرضتها الحكومة لشراء هذه المواد تسببت في هذا التأخير.\n\nفي أي خطة يجب توثيق هذه القواعد الجديدة؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة المشتريات.",
          "correct": true
        },
        {
          "text": "خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "خطة مشاركة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "خطة إدارة الجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ المشروع، أعرب العديد من أصحاب المصلحة عن مخاوف بشأن أداء الفريق والتسليم. يعتقد مدير المشروع أن المشروع يتقدم حسب النطاق والميزانية والجدول الزمني المعتمدين.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال بريد إلكتروني لأصحاب المصلحة لطمأنتهم بالإجراءات.",
          "correct": false
        },
        {
          "text": "الرجوع إلى خطة إدارة الاتصالات لإدارة توقعات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "طلب تدخل راعي المشروع.",
          "correct": false
        },
        {
          "text": "مطالبة أصحاب المصلحة بتصعيد مخاوفهم إلى المدير التنفيذي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تنفيذ متطلب عمل لمشروع تكنولوجيا معلومات يؤثر على عدة تطبيقات. يلاحظ مالك التطبيق أن التغييرات في وظيفة في التطبيق (X) يمكن أن تبدأ فقط عند الانتهاء من تطوير ميزة جديدة في التطبيق (Y).\n\nما نوع التبعية التي يمثلها هذا المثال؟",
      "explanation": "",
      "choices": [
        {
          "text": "بداية إلى بداية (SS).",
          "correct": false
        },
        {
          "text": "انتهاء إلى بداية (FS).",
          "correct": true
        },
        {
          "text": "بداية إلى انتهاء (SF).",
          "correct": false
        },
        {
          "text": "انتهاء إلى انتهاء (FF).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تسببت مشكلة غير متوقعة في الحاجة إلى شراء آلة جديدة ضرورية لتلبية المواصفات المطلوبة للجودة.\n\nمن أين يمكن الحصول على الأموال اللازمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "أصحاب المصلحة الرئيسيين",
          "correct": false
        },
        {
          "text": "الاحتياطي الإداري",
          "correct": true
        },
        {
          "text": "الاحتياطي المخصص للطوارئ",
          "correct": false
        },
        {
          "text": "راعي المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير مشروع إنشاء بقيمة 15 مليون دولار أمريكي تحقيق معلم محدد في المشروع في وقت أقرب من المخطط له لأن نمطًا موسميًا من الطقس القاسي متوقع قريبًا. المشروع يعاني بالفعل من تجاوز في الميزانية، وراعي المشروع غير مستعد لتوفير تمويل إضافي.\n\nما الأداة أو التقنية التي يجب أن يستخدمها مدير المشروع لتحقيق هذا المعلم قبل بدء الطقس القاسي؟",
      "explanation": "",
      "choices": [
        {
          "text": "المحاكاة",
          "correct": false
        },
        {
          "text": "التنفيذ المتوازي (Fast Tracking)",
          "correct": true
        },
        {
          "text": "تسوية الموارد",
          "correct": false
        },
        {
          "text": "الضغط على الجدول الزمني (Crashing)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تغييرات تنظيمية، تم استبدال أحد أصحاب المصلحة الرئيسيين بموظف جديد. الاجتماع التالي لمراجعة حالة المشروع لن يحدث حتى الشهر القادم.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة اجتماع منفصل مع صاحب المصلحة الجديد لإطلاعه على حالة المشروع.",
          "correct": true
        },
        {
          "text": "إعداد وإرسال تقرير حالة المشروع لصاحب المصلحة الجديد للمراجعة.",
          "correct": false
        },
        {
          "text": "طلب المشورة من راعي المشروع حول كيفية الحصول على دعم صاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "الانتظار حتى نافذة الاتصال التالية لمشاركة المعلومات مع صاحب المصلحة الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتشف فريق المشروع فرصة لتحسين البرنامج دون التأثير على الميزانية أو الجدول الزمني. نفذ الفريق التحسين دون التوثيق المناسب، مما تسبب لاحقًا في مشاكل في الإنتاج.\n\nما العملية التي كان يجب تنفيذها لمنع ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحكم في الجدول الزمني",
          "correct": false
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر",
          "correct": false
        },
        {
          "text": "تخطيط إدارة النطاق",
          "correct": false
        },
        {
          "text": "إجراء التحكم المتكامل في التغيير",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تجريبي جاهز للإغلاق ويرغب فريق المشروع في توثيق التحديات التي تم التغلب عليها والفرص المستقبلية.\n\nأين سيتم توثيق هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديثات أصول العمليات التنظيمية",
          "correct": false
        },
        {
          "text": "تقرير أداء العمل",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "سجل الدروس المستفادة",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق المشروع تحديد متطلبات المشروع والمنتج.\n\nما الأدوات أو التقنيات التي تم استخدامها لإنجاز ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "المقارنة المعيارية، مخطط الشبكة، وتحليل الاتجاهات",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS)، تحليل الاتجاهات، والملاحظة/المحادثة",
          "correct": false
        },
        {
          "text": "العصف الذهني، مخططات التقارب، والخرائط الذهنية",
          "correct": true
        },
        {
          "text": "مخططات التقارب، المقارنة المعيارية، والملاحظة/المحادثة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم حساب الميزانية الأصلية عند الإنجاز (BAC) لمشروع بقيمة 100,000 دولار أمريكي، لكن التقدير عند الإنجاز (EAC) هو 120,000 دولار. إذا كان مؤشر الأداء الزمني (SPI) يساوي 1، فما هو مؤشر الأداء التكلفة (CPI)؟",
      "explanation": "",
      "choices": [
        {
          "text": "يساوي 1.2",
          "correct": false
        },
        {
          "text": "أقل من 1",
          "correct": true
        },
        {
          "text": "يساوي 1",
          "correct": false
        },
        {
          "text": "أكبر من 1",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار أحد مكونات المشروع، يكتشف مختبر كبير ميزة وظيفية تضمن أداء الحل المستقبلي للمشروع. سيؤدي ذلك إلى تغيير في نطاق العمل.\n\nما نوع طلب التغيير الذي يجب تقديمه لتضمين هذه الوظيفة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء وقائي",
          "correct": true
        },
        {
          "text": "إجراء تصحيحي",
          "correct": false
        },
        {
          "text": "إصلاح عيب",
          "correct": false
        },
        {
          "text": "تحديث النطاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة وثائق المشروع، اكتشف مدير المشروع أنه تم إجراء تعديلات بدون الموافقات اللازمة.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد الأمر إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة التغيير.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة المتطلبات.",
          "correct": false
        },
        {
          "text": "تصعيد الأمر إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب التزامات تجاه مشروع آخر، لم يقم محاسب بتسليم تقرير مهم إلى مدير المشروع في الوقت المحدد. لم يكن مدير المشروع يتوقع التأخير ولم يكن على علم بأن المحاسب لديه أولويات متضاربة.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "الرجوع إلى مصفوفة RACI.",
          "correct": false
        },
        {
          "text": "الرجوع إلى الجداول الزمنية.",
          "correct": false
        },
        {
          "text": "الرجوع إلى خطة تخصيص الموارد.",
          "correct": true
        },
        {
          "text": "الرجوع إلى تقويم الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الذي يجب أن يفعله مدير المشروع للحصول على موافقة أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إدارة مشاركة أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "مراقبة والتحكم في عمل المشروع.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع بين الراعي وأصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصميم جاهز للانتقال إلى الإنتاج.\n\nما النشاط المطلوب لإغلاق المرحلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد الميزانية الموجزة.",
          "correct": false
        },
        {
          "text": "إدارة الجودة.",
          "correct": false
        },
        {
          "text": "ضمان إتمام الإجراءات الوقائية.",
          "correct": false
        },
        {
          "text": "تسجيل تأثيرات التخصيص على أي عملية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق موزع جغرافيًا مشروعًا بنجاح.\n\nيرغب مدير المشروع في الحصول بسرعة على ملاحظات الفريق لأغراض التحليل الإحصائي.\n\nما الطريقة التي يجب أن يستخدمها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مؤتمر فيديو.",
          "correct": false
        },
        {
          "text": "مجموعة تركيز.",
          "correct": false
        },
        {
          "text": "استبيانات.",
          "correct": true
        },
        {
          "text": "بريد إلكتروني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع جديد مسؤولية مشروع تمت الموافقة عليه مؤخرًا.\n\nما العامل الأساسي الذي سيلعب دورًا في تحديد طريقة الاتصال؟",
      "explanation": "",
      "choices": [
        {
          "text": "متطلبات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تكرار التوزيع.",
          "correct": false
        },
        {
          "text": "نموذج المرسل-المستقبل.",
          "correct": false
        },
        {
          "text": "أساليب إدارة الاجتماعات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة تقرير الحالة، يلاحظ مدير المشروع أنه على مدار ستة أشهر، كانت جودة الترميز لمطور معين أقل إحصائيًا من مطور آخر مكلف بنفس المهمة.\n\nما الأداة التي يجب أن يستخدمها مدير المشروع لتتبع مصدر المشكلة والعودة إلى السبب الجذري القابل للتنفيذ؟",
      "explanation": "",
      "choices": [
        {
          "text": "المخطط البياني (Histogram)",
          "correct": false
        },
        {
          "text": "مخطط التحكم (Control chart)",
          "correct": false
        },
        {
          "text": "مخطط التشتت (Scatter diagram)",
          "correct": false
        },
        {
          "text": "مخطط عظمة السمكة (Ishikawa diagram)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند الانتهاء من المشروع، لا يمكن التوصل إلى اتفاق مع العميل من خلال المفاوضات.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "بدء دعوى قانونية بما أن كل الأعمال قد أُنجزت.",
          "correct": false
        },
        {
          "text": "بدء مرحلة الإغلاق.",
          "correct": false
        },
        {
          "text": "استكشاف خيار التحكيم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يطلب أحد أصحاب المصلحة غير المحددين مسبقًا داخل مؤسسة العميل تغييرًا قد يؤثر على نطاق المشروع. ويملك هذا الطرف تأثيرًا قويًا داخل مؤسسته.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد موعد اجتماع، وبناءً على نتائجه، تحديث خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تحديد صاحب المصلحة الجديد وتحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع جميع أصحاب المصلحة لمناقشة التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب مشكلة في الميزانية، قرر فريق المشروع استخدام معدات منخفضة التكلفة بدرجة أعلى من عدم اليقين في الاختبار لتقليل التكاليف. ومع ذلك، فإن نتائج الاختبار غير مستقرة وتخلق تناقضات. أحد أعضاء الفريق يقترح استخدام معدات عالية الدقة بدرجة أقل من عدم اليقين في الاختبار لتحسين جودة الاختبار.\n\nكيف يجب على مدير المشروع الرد على هذا الاقتراح؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفض الاقتراح بسبب القيود المالية والالتزام بخطة إدارة الجودة.",
          "correct": false
        },
        {
          "text": "قبول الاقتراح لأن المعدات عالية الدقة تنتج نتائج دقيقة باحتمال أقل للخطأ.",
          "correct": false
        },
        {
          "text": "تقييم الاقتراح لتحديد ما إذا كانت المعدات عالية الدقة تنتج نتائج دقيقة بدرجة أقل من عدم اليقين.",
          "correct": true
        },
        {
          "text": "قبول الاقتراح لأن الجودة أهم من الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ تحليل نوعي لمخاطر المشروع، يكتشف مدير المشروع أن المنتج يفتقر إلى \"تعريف الإنجاز\" (Definition of Done).\n\nما نوع هذا الخطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطر تجاري",
          "correct": false
        },
        {
          "text": "خطر خارجي",
          "correct": false
        },
        {
          "text": "خطر إداري",
          "correct": false
        },
        {
          "text": "خطر تقني",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل الفريق للعمل على مشروع عالمي بتسليمات متكررة، شارك قائد المشروع خطة قياس الأداء مع الفريق. لم يُعجب أعضاء الفريق بالخطة المقترحة، حيث عبروا عن أنها غير واقعية.\n\nما الذي يجب أن يفعله قائد المشروع لضمان مشاركة أعضاء الفريق في تنفيذ خطة إدارة الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "مطالبة أعضاء الفريق بالالتزام بالخطة، وإلا فلن يتم تقييمهم بشكل صحيح.",
          "correct": false
        },
        {
          "text": "إدراج التقييم الذاتي في بداية ومنتصف ونهاية المشروع لتعزيز استقلالية الفريق.",
          "correct": true
        },
        {
          "text": "طلب من فريق الموارد البشرية تقديم عرض حول مقاييس الأداء في الشركة.",
          "correct": false
        },
        {
          "text": "التحدث مع أعضاء الفريق بشكل فردي لإقناعهم بفوائد الخطة المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع التغذية الراجعة، أبلغ أعضاء الفريق مدير المشروع أن التحقق من التسليمات صعب لأن متطلبات التكنولوجيا تستمر في التغيير قبل مواعيد التسليم، مما يتسبب في إعادة العمل. اقترح مدير المشروع اعتماد منهجية إدارة مشروع أكثر ملاءمة لمعالجة هذا الأمر في المشاريع القادمة.\n\nما هي منهجية إدارة المشروع التي ستكون مناسبة لهذا الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "أجايل (Agile)",
          "correct": true
        },
        {
          "text": "التنبؤية (Predictive)",
          "correct": false
        },
        {
          "text": "الشلال (Waterfall)",
          "correct": false
        },
        {
          "text": "التزايدية (Incremental)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي المخرجات الرئيسية لعملية تحديد المخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقرير المخاطر وسجل المخاطر",
          "correct": false
        },
        {
          "text": "تقرير المخاطر، سجل المخاطر، وتحديث مستندات المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة المخاطر، سجل المخاطر، واستجابات المخاطر",
          "correct": false
        },
        {
          "text": "تقرير المخاطر، مصفوفة الاحتمالية والأثر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء عقد اجتماع مراجعة ختامية (Retrospective)، فوجئ أعضاء الفريق بنتائج الأداء التي شاركها قائد المشروع. أعرب الفريق بأكمله عن جهلهم بقياسات الأداء وأدوات القياس المتوفرة.\n\nما الذي كان يجب على قائد المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الموارد البشرية شرح أدوات قياس الأداء المختلفة.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق بضرورة تعبئة ملاحظاتهم بانتظام.",
          "correct": false
        },
        {
          "text": "تقديم تغذية راجعة مستمرة لأعضاء الفريق حول أدائهم.",
          "correct": false
        },
        {
          "text": "التخطيط ووضع إطار واضح لقياس الأداء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل فريق للعمل على مشروع عالمي، دعا قائد المشروع إلى اجتماع تعارف بين أعضاء الفريق المتنوعين.\n\nما الذي يجب أن يفعله مدير المشروع لتحفيز الفريق على التعبير عن توقعاتهم؟",
      "explanation": "",
      "choices": [
        {
          "text": "مطالبة أعضاء الفريق بكتابة توقعاتهم على أوراق ملاحظات لاصقة.",
          "correct": false
        },
        {
          "text": "طرح أسئلة مباشرة لكل عضو في الفريق والانتظار لإجاباتهم.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق بالمكافآت المرتبطة بنجاح المشروع.",
          "correct": false
        },
        {
          "text": "البدء بإجراء تقييم ذاتي للفريق لزيادة استقلالية الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتكون فريق مشروع افتراضي من أعضاء من بلدان مختلفة باختلافات ثقافية. يشعر مدير المشروع بالقلق من أن هذه الاختلافات قد تؤدي إلى سوء تواصل وصراعات.\n\nما الذي يجب أن يفعله مدير المشروع لتقليل احتمالية حدوث صراعات بفعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد قواعد العمل الخاصة بالمشروع بشكل تعاوني والتواصل بها بوضوح.",
          "correct": true
        },
        {
          "text": "مطالبة الفريق باستخدام الاتصالات الكتابية فقط.",
          "correct": false
        },
        {
          "text": "تعيين العضو الأعلى مرتبة في أحد الفرق ليكون الحكم عند نشوء نزاع.",
          "correct": false
        },
        {
          "text": "اتخاذ قرارات حل النزاعات وإبلاغ الفريق بها لاحقًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يوجد نزاع بين عضوين من الفريق بشأن مهمة في المشروع.\n\nما هي طريقة حل النزاع التي يجب أن يستخدمها مدير المشروع لتحقيق نتيجة رابحة للطرفين؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون/حل المشكلة",
          "correct": true
        },
        {
          "text": "الإجبار/التوجيه",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "التسوية/المصالحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع غير قادر على إكمال قائمة أهداف المشروع بسبب التوجيهات المتضاربة من مديري قسمين مختلفين.\n\nما هو الأسلوب الذي سيسمح للمديرين بتعديل توجيهاتهم وتحقيق نتيجة رابحة للطرفين؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون/حل المشكلة",
          "correct": true
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "الإجبار/التوجيه",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب مدير المشروع من كل عضو من أعضاء الفريق المشاركين في نزاع تقديم تنازل لحل الموقف.\n\nأي أسلوب من أساليب حل النزاعات يتوافق مع هذا النهج؟",
      "explanation": "",
      "choices": [
        {
          "text": "التسوية/المصالحة",
          "correct": true
        },
        {
          "text": "التعاون/حل المشكلة",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ قائد المشروع أن عضوًا جديدًا في الفريق يشعر بعدم الحماس ويصل متأخرًا إلى العمل دائمًا، مما يتسبب في تأخير التسليمات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من قسم الموارد البشرية التعامل مع الحضور، ونصح العضو بالوصول في الوقت المحدد، وتذكيره بالحوافز في نهاية المشروع.",
          "correct": false
        },
        {
          "text": "طلب من عضو أقدم في الفريق التحدث إلى العضو الجديد، ومشاركة تجاربه الشخصية، ومعرفة أسباب ضعف الأداء.",
          "correct": false
        },
        {
          "text": "خلال الاجتماع اليومي، الطلب من جميع الأعضاء الوصول في الوقت المناسب، وتخطيط لفعالية بعد العمل للاحتفال بتقدم المشروع.",
          "correct": false
        },
        {
          "text": "التحدث مع العضو بشكل فردي، مع التأكيد على أهمية العمل الجماعي وقيمة مساهمة كل عضو.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من العبارات التالية تميز بشكل صحيح بين الإدارة والقيادة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المديرون يسألون كيف ومتى؛ القادة يسألون ماذا ولماذا.",
          "correct": true
        },
        {
          "text": "المديرون يركزون على الأهداف طويلة المدى؛ القادة يركزون على الأهداف قصيرة المدى.",
          "correct": false
        },
        {
          "text": "المديرون يتحدون الوضع القائم؛ القادة يقبلون الوضع القائم.",
          "correct": false
        },
        {
          "text": "المديرون يلهمون الثقة؛ القادة يعتمدون على السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد المشاريع، يوجد صاحب مصلحة لا يرى أي فائدة من المشروع. أحيانًا يستخدم السياسة لوضع عراقيل لمنع إتمام المشروع بنجاح.\n\nما هي شخصية هذا النوع من أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الهادئ (Stoic)",
          "correct": false
        },
        {
          "text": "المحايد",
          "correct": false
        },
        {
          "text": "الداعم (Champion)",
          "correct": false
        },
        {
          "text": "المعارض (Antagonist)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع في شركة صغيرة لمشروع معقد وجديد. أوصى مدير البرنامج بتكوين فريق يضم أفرادًا بخبرات تكمل بعضها البعض.\n\nما هي خصائص الشبكة التي يجب بناؤها؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنسيق مركزي، أعضاء الفريق مع أصحاب مصلحة داخليين وخارجيين، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        },
        {
          "text": "منظمة ذاتيًا، أعضاء الفريق مع أصحاب مصلحة داخليين وخارجيين، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": true
        },
        {
          "text": "منظمة ذاتيًا، أعضاء الفريق مع أصحاب مصلحة داخليين فقط، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        },
        {
          "text": "تنسيق مركزي، أعضاء الفريق مع أصحاب مصلحة داخليين فقط، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اختار مدير مشروع في منظمة منهجية أجايل لتنفيذ مشروع تقني متقدم. قام المدير ببناء شبكة مهنية ويريد أن ينضم مالك المنتج إليها.\n\nما هما الفائدتان اللتان سيستخدمهما مدير المشروع لتشجيع مالك المنتج على الانضمام والمشاركة في الشبكة؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "الوصول إلى المعرفة والقوى العاملة العالمية",
          "correct": false
        },
        {
          "text": "مخاطر وتكاليف أقل",
          "correct": false
        },
        {
          "text": "فرصة للتفاعل مع الموارد",
          "correct": false
        },
        {
          "text": "شبكة مهنية رسمية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في بيئة أجايل على مشروع سيمتد لعدة سنوات. طلب المستخدم النهائي تنفيذ مشروع تجريبي خلال الربع الأول من المشروع.\n\nما هي الأوقات المثلى لإجراء مراجعة جاهزية رسمية؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "كل ربع سنة",
          "correct": false
        },
        {
          "text": "كل شهر",
          "correct": false
        },
        {
          "text": "عند نقاط التسليم الرئيسية",
          "correct": false
        },
        {
          "text": "في بداية المشروع التجريبي",
          "correct": false
        },
        {
          "text": "في نهاية المشروع التجريبي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يضم العديد من أصحاب المصلحة الذين لديهم أولويات متعارضة.\n\nما الذي يجب على مدير المشروع فعله لتقليل النزاعات؟",
      "explanation": "",
      "choices": [
        {
          "text": "توثيق وتسليم كافة المخرجات بعد موافقة الجميع عليها.",
          "correct": true
        },
        {
          "text": "تولي القيادة في جميع جوانب المفاوضات.",
          "correct": false
        },
        {
          "text": "التفاوض على جميع الجوانب بمساعدة مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "التفاوض على جميع الجوانب باستخدام أجايل لتسهيل التسليمات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متضاربة. طلبت الإدارة العليا من مدير المشروع تجنب \"الضجيج\"، خاصة في المشاريع ذات الطابع السياسي.\n\nعلى الرغم من صعوبة العثور على الموارد، ماذا يجب على مدير المشروع فعله لضمان سير المشروع بسلاسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطبيق مبدأ \"إذا قدمت لي خدمة، سأقدم لك خدمة بالمقابل\".",
          "correct": false
        },
        {
          "text": "التحلي بالثبات بين الأقوال والأفعال لتجنب الصراعات مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "استخدام المجاملات للحصول على الموارد والتعاون نحو أهداف مشتركة.",
          "correct": false
        },
        {
          "text": "توزيع الموارد النادرة بكفاءة لتلبية احتياجات المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الذي يجب أن يفعله مدير المشروع أولاً عندما لا يلتزم الأشخاص بعملية الامتثال للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا أو الراعي.",
          "correct": false
        },
        {
          "text": "بدء عملية تدقيق.",
          "correct": false
        },
        {
          "text": "تسجيل حالة عدم الامتثال ومراقبة التقدم.",
          "correct": false
        },
        {
          "text": "فهم أسباب عدم الامتثال.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق المشروع على تحديد التبعيات لحوالي 350 نشاطًا في مشروع جارٍ.\n\nما الإجراءات التي يجب أن يتخذها الفريق لإدارة التبعيات بنجاح؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الراعي بالتبعيات.",
          "correct": false
        },
        {
          "text": "تقييم التبعيات وتوثيقها.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بالتبعيات.",
          "correct": false
        },
        {
          "text": "ضمان مراقبة التبعيات.",
          "correct": false
        },
        {
          "text": "استخدام تبعيات من نوع نهاية إلى بداية فقط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب العميل تغييرًا في وظيفة منتج سيتم تسليمه في العدوة القادمة. الأخصائي المسؤول عن هذا التغيير مكلّف أيضًا بتسليم مهمة في مشروع آخر. يحتاج مدير المشروع إلى التفاوض على توفر الأخصائي.\n\nمن المسؤول عن تأكيد توفر هذا الأخصائي؟",
      "explanation": "",
      "choices": [
        {
          "text": "راعي المشروع",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": true
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "قسم الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تلقى مدير المشروع بريدًا إلكترونيًا من المصنع يفيد بعدم تسليم معدات أساسية كما هو مخطط. يجب على مدير المشروع الترتيب مع موردين آخرين لتطبيق حل مؤقت.\n\nمن المسؤول عن تأكيد توفر الموارد لهذا الحل؟",
      "explanation": "",
      "choices": [
        {
          "text": "مزود الخدمة",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": true
        },
        {
          "text": "قسم الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت فريق المشروع في منتصف مشروع تسليم تدريجي أنهم بحاجة إلى مساعدة خبير في المجال (SME) يعمل في قسم مختلف. طلب الفريق من الخبير الانضمام إليهم والمساعدة في مهمة محددة، وأبلغوا قائد المشروع بذلك.\n\nماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقق من ميزانية المشروع وتقييم التأثير وإمكانية إضافة مورد إضافي.",
          "correct": false
        },
        {
          "text": "التحدث مع راعي المشروع والحصول على الموافقة، مع شرح أن هذا المورد مهم وحاسم.",
          "correct": false
        },
        {
          "text": "التحدث إلى المدير الوظيفي لهذا المورد المطلوب والتحقق من مدى توافره وقدرته.",
          "correct": false
        },
        {
          "text": "تسهيل تنسيق الموارد مع الموارد المطلوبة بناءً على اتفاقية عمل الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد بدأ منذ ثمانية أشهر. لدى المدير فريق جودة يعمل بجد، ومتحفز، وناجح.\n\nما نوع الإدارة والقيادة التي يجب على مدير المشروع استخدامها في هذه المرحلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمكين الفريق لتحسين النتائج.",
          "correct": true
        },
        {
          "text": "تقديم الدعم من خلال التكرارات والتغذية الراجعة الدورية.",
          "correct": false
        },
        {
          "text": "المساعدة في حل النزاعات.",
          "correct": false
        },
        {
          "text": "تقديم الملاحظات أو التدريب أو المساعدة فقط عند طلبها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم عضو جديد إلى المشروع خلال مرحلة التنفيذ. يتطلب العمل تعاونًا قويًا مع بقية أعضاء الفريق.\n\nما الذي يجب على مدير المشروع فعله لتعزيز بيئة تعاونية؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال بريد إلكتروني للفريق يطلب منهم التعاون مع العضو الجديد.",
          "correct": false
        },
        {
          "text": "مشاركة جميع المعلومات المتاحة وتخصيص وقت لشرح تفاصيل العمل الجاري.",
          "correct": false
        },
        {
          "text": "طلب من كل عضو أن يصف اهتماماته وخبراته في الاجتماع القادم.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل ليوم واحد مع الفريق بأكمله لتعريف العضو الجديد بالمشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشارك فريق المشروع بنشاط في التحضير للتسليم الأخير قبل إطلاق المنتج النهائي في بيئة الإنتاج. \n\nما الذي يجب على مدير المشروع فعله لضمان تزامن الفريق بالكامل؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان حضور الفريق للاجتماعات اليومية ومشاركتهم الفعالة.",
          "correct": true
        },
        {
          "text": "ضمان توفر المعلومات اللازمة وسهولة وصول كل عضو إليها.",
          "correct": false
        },
        {
          "text": "ضمان عرض العمل المطلوب على لوحة بيضاء مرئية ومتاحة للجميع.",
          "correct": false
        },
        {
          "text": "ضمان توفر مكان للفريق لإجراء المحادثات المنتظمة عند الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "إدارة الجودة عنصر حيوي في أي مشروع.\n\nأي من الجوانب التالية لمراقبة الجودة يُعد من مكونات نظام قياس عالي الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "الدقة",
          "correct": true
        },
        {
          "text": "عدم الدقة",
          "correct": false
        },
        {
          "text": "عدم التكرار",
          "correct": false
        },
        {
          "text": "المدة الزمنية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "الإصدار الأول الذي تم تسليمه إلى فريق مراقبة الجودة يعاني من أداء ضعيف، ويشتكي المختبرون من أنهم لا يستطيعون إكمال جميع حالات الاختبار كما هو مخطط.\n\nما هي الأداة التي تساعد على مراقبة الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط التشغيل (Run Chart)",
          "correct": true
        },
        {
          "text": "مخطط تدفق البيانات (Data Flow Diagram)",
          "correct": false
        },
        {
          "text": "مخطط الانسياب (Flow Chart)",
          "correct": false
        },
        {
          "text": "مخطط غير مراقب (Non-Control Chart)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تطوير المشروع، لاحظ مدير المشروع أن النتائج ليست بالجودة المتوقعة.\n\nما هي الأداة أو الوثيقة التي تُظهر العناصر التي تؤثر على المقاييس الرئيسية؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط باريتو (Pareto Chart)",
          "correct": true
        },
        {
          "text": "مخطط التشغيل (Run Chart)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": false
        },
        {
          "text": "سجل المخاطر (Risk Register)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير المشروع اتخاذ قرارات يوميًا، بغض النظر عن أهمية القرار أو مدى حرجِه.\n\nما الذي يجب أن يفعله مدير المشروع لضمان أن تكون قراراته غير متحيزة وعقلانية؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام البيانات دون التحقق من دقتها.",
          "correct": false
        },
        {
          "text": "فهم أنه لا يمكن تحقيق كل شيء.",
          "correct": true
        },
        {
          "text": "اتخاذ القرارات بسرعة.",
          "correct": false
        },
        {
          "text": "اتخاذ القرارات فقط عندما تكون النتائج مؤكدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد، وكانت أول مهمة له هي المساعدة في إنشاء هيكل تقسيم العمل (WBS).\n\nما هي الأداة أو التقنية أو الوثيقة التي تُستخدم كنقطة انطلاق لإنشاء WBS فعال؟",
      "explanation": "",
      "choices": [
        {
          "text": "خط الأساس للنطاق (Scope Baseline)",
          "correct": false
        },
        {
          "text": "قائمة الأنشطة (Activity List)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": true
        },
        {
          "text": "قاموس WBS",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في برنامج يمتد لخمس سنوات، انضم العديد من أعضاء الفريق إلى المشاريع الفرعية وغادروها.\n\nبسبب ذلك، غالبًا ما تنشأ صراعات بين أعضاء الفريق.\n\nما هي التقنية التي يجب أن يستخدمها مدير المشروع لحل هذه الصراعات على المدى الطويل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجبار (Forcing)",
          "correct": false
        },
        {
          "text": "التهدئة (Smoothing)",
          "correct": false
        },
        {
          "text": "التسوية (Compromise)",
          "correct": false
        },
        {
          "text": "حل المشكلات (Problem-solving)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ الفريق قائد المشروع أنهم غير متأكدين من احتياجات أصحاب المصلحة، على الرغم من جهود جمع المتطلبات المتعددة والمشاركة في اجتماعات الحالة.\n\nكيف يجب على مدير المشروع التعامل مع هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مطالبة الفريق بالعمل مع أصحاب المصلحة لتحليل متطلباتهم التفصيلية والموافقة على المواصفات.",
          "correct": false
        },
        {
          "text": "مناقشة خيار إلغاء المشروع مع الفريق لأن المخاطر كبيرة جدًا للاستمرار.",
          "correct": false
        },
        {
          "text": "مطالبة الفريق بكتابة مجموعة من قصص المستخدم لتوثيق الاحتياجات، وترتيبها حسب الأولوية وإدارتها.",
          "correct": false
        },
        {
          "text": "توثيق ما يعتقد الفريق أنه احتياجات أصحاب المصلحة، وعرضه عليهم، وطلب تعليقاتهم لمشاركتها مع الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع استرجاعي، أبدى أعضاء الفريق عدم تفاعلهم، مشيرين إلى أنهم يكررون نفس الأفكار مرارًا وتكرارًا.\n\nكيف يمكن لمدير المشروع التعامل مع هذا الوضع بأفضل طريقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من أعضاء الفريق الانتباه أكثر للجلسة حتى لو كانوا يظنون أنهم يعرفون ما سيُقال.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق تقديم ملاحظاتهم حتى لو كانت مماثلة لملاحظات الآخرين لتأكيد النقاط.",
          "correct": false
        },
        {
          "text": "تشجيع الفريق على تقديم ملاحظات أفضل لأنهم يعرفون الأسئلة مسبقًا.",
          "correct": false
        },
        {
          "text": "تشجيع الفريق على تقديم أفكار لتحسين العمليات ودعم التغييرات بناءً على الملاحظات المستلمة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يساعد مدير مشروع مؤسسته في الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الرشيقة. سأل أحد أعضاء الفريق متى يجب القيام بتعريف المتطلبات عالية المستوى وتصميم الحل في المنهجية الرشيقة.\n\nكيف يجب أن يرد مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "في الرشيقة، يجب أن تبدأ هذه الأنشطة بمجرد تجميع الفريق، ويفضل في السبرينت الأول.",
          "correct": false
        },
        {
          "text": "في الرشيقة، يجب على الفريق التخطيط لأداء بعض هذه الأنشطة كجزء من السبرينت صفر قبل بدء التطوير.",
          "correct": true
        },
        {
          "text": "في الرشيقة، يجب على الفريق تجنب الهدر، لذا يجب أن تتم هذه الأنشطة كجزء من التطوير.",
          "correct": false
        },
        {
          "text": "في الرشيقة، يتبع الفريق استراتيجية اللحظة الأخيرة المسؤولة ويجب تأجيل هذه الأنشطة قدر الإمكان.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا رشيقًا في مرحلة التنفيذ. بعد عدة سبرينتات، يدرك مدير المشروع أن تقديرات الفريق غير واقعية.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لإزالة هذا العائق؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الفريق مناقشة هذه المشكلة في الاجتماع الاسترجاعي القادم لتجنب التأثير على السبرينت الحالي.",
          "correct": false
        },
        {
          "text": "الحصول على موافقة من راعي المشروع لإضافة هامش احتياطي للسبرينت، وتغيير تاريخ الانتهاء.",
          "correct": false
        },
        {
          "text": "طلب من الفريق مناقشة هذه المشكلة في الاجتماع اليومي، مع الالتزام بإكمال السبرينت الحالي.",
          "correct": false
        },
        {
          "text": "تنظيم جلسات تحسين قائمة المنتج لفهم النطاق بشكل أفضل ومراجعة التقديرات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع يومي، أثار فريق المشروع عائقًا يتمثل في أن أحد الخبراء من أصحاب المعرفة في المجال يغير تعريف الإنجاز النهائي بشكل متكرر، وأعربوا عن خوفهم من أن هذا يعكس انعدام الثقة.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تذكير الفريق بالتركيز على عملهم، والالتزام بالتحدث مع الخبير.",
          "correct": false
        },
        {
          "text": "تذكير مالك المنتج بدعم الفريق والتحدث مع الخبير.",
          "correct": false
        },
        {
          "text": "تذكير الخبير بالالتزام بتعريف الإنجاز النهائي المتفق عليه مبدئيًا.",
          "correct": false
        },
        {
          "text": "تذكير الفريق بأن التغذية الراجعة المستمرة ضرورية للنجاح.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا، وقد طلب الراعي معرفة سبب تطوير بعض مكونات المشروع داخليًا. أين يمكن العثور على هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "في خطة إدارة المشتريات، تحت قرارات البناء مقابل الشراء",
          "correct": true
        },
        {
          "text": "في ميثاق المشروع، تحت قسم الافتراضات والقيود",
          "correct": false
        },
        {
          "text": "في وثيقة الهيكلية التقنية، تحت حدود الحل",
          "correct": false
        },
        {
          "text": "في وثيقة الهيكلية الحلول، تحت الغرض والتبرير من المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة الاختبار، وأبلغ فريق مراقبة الجودة مدير المشروع بأن جودة التسليمات من أحد الموردين ضعيفة. وقد أظهرت التحقيقات أن الموظفين المعينين لا يحملون الشهادات المطلوبة.\n\nكيف نشأت هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "لم تتضمن مقترحات الموردين قائمة الأشخاص المعينين في المشروع.",
          "correct": false
        },
        {
          "text": "لم يطلب راعي المشروع ثلاث مراجع من عملاء سابقين.",
          "correct": false
        },
        {
          "text": "لم تتضمن خطة إدارة المشتريات الشهادات المطلوبة.",
          "correct": true
        },
        {
          "text": "كانت معايير فريق مراقبة الجودة مرتفعة جدًا واختبروا بشكل مفرط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا ذو جدول تسليم صارم وتاريخ إنجاز محدد. يتطلب المشروع مكونات باهظة وهشة عرضة لإعادة العمل والرفض. يقوم مدير المشروع بوضع معايير اختيار الموردين.\n\nما هي الإستراتيجية التي يجب اتباعها لاختيار المورد؟",
      "explanation": "",
      "choices": [
        {
          "text": "أقل سعر بغض النظر عن موقع مستودع المورد.",
          "correct": false
        },
        {
          "text": "سعر مقبول إذا كان المورد أقرب إلى موقع المشروع.",
          "correct": true
        },
        {
          "text": "توصية راعي المشروع بناءً على خبرة سابقة.",
          "correct": false
        },
        {
          "text": "توصيات أعضاء الفريق بناءً على تجارب سابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير المشروع على مشروع معقد يكون فيه المورد مسؤولًا عن تسليم عدة مكونات أساسية. مدير المشروع وفريق الموردين في مناطق زمنية مختلفة، وأصبح هذا الفرق الزمني يمثل تحديًا كبيرًا، مما أدى إلى مشكلات في الإنتاجية. يواجه أعضاء الفريق من كلا الطرفين صعوبة في تنسيق الاجتماعات، وتبادل التحديثات، والتواصل بفعالية بسبب الفروقات الزمنية.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة جدول المشروع عن كثب واتخاذ الإجراءات إذا تم تجاوز المعالم الرئيسية.",
          "correct": false
        },
        {
          "text": "طلب من كلا الفريقين تغيير ساعات عملهم إلى منطقة زمنية مشتركة.",
          "correct": true
        },
        {
          "text": "البحث عن مساحة عمل مشتركة ونقل فريق المورد إلى جانب فريق المشروع.",
          "correct": false
        },
        {
          "text": "إنهاء العقد والبحث عن مورد جديد في نفس المنطقة الزمنية المحلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى مدير مشروع للتو مشروعًا في مؤسسة تقدّر الدروس المستفادة. يشجع القادة جميع أصحاب المصلحة في المشاريع على استخدام العمليات والأدوات والنتائج من مستودع الدروس المستفادة في المشاريع المستقبلية. أثناء الاستعداد لتحديث مستودع الدروس المستفادة، جمع مدير المشروع بيانات المشروع ذات الصلة وردود الفعل.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخزين جميع التعليقات والتوصيات المستلمة للرجوع إليها مستقبلًا.",
          "correct": false
        },
        {
          "text": "تحليل وتنظيم النتائج مع أصحاب المصلحة لاستخلاص الأفكار.",
          "correct": true
        },
        {
          "text": "توثيق النتائج ومشاركتها مع أصحاب المصلحة للمراجعة والتعليق.",
          "correct": false
        },
        {
          "text": "استرجاع جميع التعليقات والتوصيات التي تم استلامها في السابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو الهدف الرئيسي من أسلوب القيادة الرؤيوية؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعم الفريق لتنظيم نفسه وتحديد رؤية مشتركة.",
          "correct": false
        },
        {
          "text": "قيادة تبني أحدث التقنيات والممارسات.",
          "correct": false
        },
        {
          "text": "توفير التوجيه طويل الأجل وتحفيز الفريق لتحقيقه.",
          "correct": true
        },
        {
          "text": "تحديد الأولويات وتوزيع المهام بما يتماشى مع الرؤية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي أسلوب قيادة يساعد الأشخاص على التواصل حتى عند العمل عن بُعد ولم يسبق لهم الالتقاء؟",
      "explanation": "",
      "choices": [
        {
          "text": "الأسلوب التشاركي",
          "correct": false
        },
        {
          "text": "الأسلوب العاطفي (التقاربي)",
          "correct": true
        },
        {
          "text": "أسلوب تحديد الإيقاع",
          "correct": false
        },
        {
          "text": "أسلوب التدريب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروعك، تحتاج إلى بعض المساعدة في تسهيل الاجتماعات، متابعة عناصر الإجراءات، تقديم أعضاء الفريق الجدد، والتوسط في النزاعات.\n\nمن هو العضو الأنسب في الفريق لمساعدتك في هذه الأنشطة؟",
      "explanation": "",
      "choices": [
        {
          "text": "عضو فريق موجه نحو السلطة.",
          "correct": false
        },
        {
          "text": "عضو فريق موجه نحو العلاقات.",
          "correct": true
        },
        {
          "text": "عضو فريق موجه نحو الإنجاز.",
          "correct": false
        },
        {
          "text": "عضو فريق موجه نحو التسليم.",
          "correct": false
        }
      ]
    }
  ]
}
