{
  "title": "مركز الإبداع - الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 230,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "A real estate organization conducts a monthly review of its strategic project portfolio.nnn\tn\t\tn\t\t\tn\t\t\tProject An\t\t\tProject Bn\t\tn\tn\tn\t\tn\t\t\tStart daten\t\t\tMarch 2016n\t\t\tMay 2017n\t\tn\t\tn\t\t\tExpected completion daten\t\t\tApril 2019n\t\t\tJuly 2020n\t\tn\t\tn\t\t\tProject managern\t\t\tPM-An\t\t\tPM-Bn\t\tn\tnnnDuring a review in March 2018, it was found that Project B is experiencing problems that had previously not been identified in its risk management process. With Project A starting approximately one year prior, what information should be requested from Project A so that Project B may take preventive and/or corrective actions?",
      "explanation": "",
      "choices": [
        {
          "text": "Work performance reports",
          "correct": false
        },
        {
          "text": "Lessons learned repository",
          "correct": true
        },
        {
          "text": "Issue log",
          "correct": false
        },
        {
          "text": "Activity list",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After the kickoff meeting for an industrial project, the assigned project manager must lead the team in identifying project risks. As team members are distributed in 6 countries, which risk identification method is best used in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Affinity diagram",
          "correct": false
        },
        {
          "text": "Decision tree analysis",
          "correct": false
        },
        {
          "text": "The Delphi technique",
          "correct": true
        },
        {
          "text": "Monte Carlo analysis",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Several team members are discussing the project manager's management techniques and the team cannot agree if the focus is on management or leadership. What is the valid option?",
      "explanation": "",
      "choices": [
        {
          "text": "Acts as a manager as it focuses on control, efficiency and effectiveness",
          "correct": false
        },
        {
          "text": "Act as Leader as you join People, Direction and Speed",
          "correct": false
        },
        {
          "text": "Act as a manager as you enter Command and Doing the right things",
          "correct": false
        },
        {
          "text": "None of the above",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing the build of an off-shore data center. In addition, the project manager is the custodian of the assets procured by the project. The project manager is informed by a team member that an asset was lost, and the team member is ready to pay for the missing asset.nnHow should the project manager handle this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Request your team member to purchase, replace and update the asset register with a new asset tag",
          "correct": false
        },
        {
          "text": "Inform the customer, purchase the new asset, and update the asset and risk register",
          "correct": false
        },
        {
          "text": "Inform management, replace the asset with the help of an insurance claim, and update the asset register",
          "correct": false
        },
        {
          "text": "Inform customer and management immediately, launch an investigation, update the risk register and take action based on outcome",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a complex initiative with diverse stakeholders and must cultivate strong stakeholder relationships. The project manager also has to build a shared understanding of the project with all stakeholders.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Facilitate interactive workshops to discuss goals and expectations.",
          "correct": true
        },
        {
          "text": "Conduct detailed stakeholder mapping exercises.",
          "correct": false
        },
        {
          "text": "Deliver formal presentations summarizing project updates.",
          "correct": false
        },
        {
          "text": "Distribute comprehensive project documentation for individual review.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "You are managing a project with significant regulatory aspects. A vendor responsible for a core module is undergoing an organization-wide transformation and it is unlikely that the deliverable will be ready on time. Your risk mitigation plan is to use paper forms until the module is implemented but this strategy is likely to slow down the frontline interactions.nnWhat kind of risk could you introduce to the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Secondary risk",
          "correct": true
        },
        {
          "text": "Residual risk",
          "correct": false
        },
        {
          "text": "Primary risk",
          "correct": false
        },
        {
          "text": "Compliance risk",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Throughout the life cycle of a project, the project manager will normally face problems, gaps, inconsistencies, or conflicts that occur unexpectedly. This requires some action so that project performance is not impacted.nnWhich project document will be used to record and track this?",
      "explanation": "",
      "choices": [
        {
          "text": "Issue log",
          "correct": true
        },
        {
          "text": "Risk register",
          "correct": false
        },
        {
          "text": "Lessons learned",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What leadership quality must a project manager have?",
      "explanation": "",
      "choices": [
        {
          "text": "Honesty",
          "correct": true
        },
        {
          "text": "Aggressiveness",
          "correct": false
        },
        {
          "text": "Powerful",
          "correct": false
        },
        {
          "text": "Servant leader",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder has submitted several requests for new functions for a product under development. The project manager just completed the scope definition for the product's next version release and communicated the scope statement to all stakeholders.nnWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Revise the communications management plan to define the number of new feature and function requests that can be submitted.",
          "correct": false
        },
        {
          "text": "Review the acceptance criteria for the product deliverables as defined in the scope statement.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders to emphasize their alignment with product objectives and the goals of the project.",
          "correct": false
        },
        {
          "text": "Review the scope management plan to determine how new functionality requests are to be accommodated.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the end of an iteration, a team member tells the project manager that a planned task is unfinished because of an issue that appeared days ago but could not be resolved. Why should the project manager discuss the issue during the retrospective to prevent this type of situation in the future?",
      "explanation": "",
      "choices": [
        {
          "text": "It is a timely opportunity to discuss issues and ideas for improvement to encourage team-based problem solving.",
          "correct": true
        },
        {
          "text": "It allows the project manager to address the issue during a demo, which leads to high levels of buy-in from the team members.",
          "correct": false
        },
        {
          "text": "The team member will have the opportunity to resolve the issue before the retrospective.",
          "correct": false
        },
        {
          "text": "The project manager can emphasize how to maximize the time available to resolve the issue.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The stakeholders and project team working on an agile project meet with the project manager at the end of an iteration. The project manager learns that the schedule is slipping, although all work was planned to meet the high-level objectives outlined in the project scope.nnWhat should the project manager have done to keep the project on track?",
      "explanation": "",
      "choices": [
        {
          "text": "Worked with the team to understand their expectations of using the agile approach.",
          "correct": false
        },
        {
          "text": "Empowered team members to self-organize specific tasks to meet the objectives.",
          "correct": true
        },
        {
          "text": "Prioritized work that could have had an early finish to allow for early benefits realization.",
          "correct": false
        },
        {
          "text": "Selected and sequenced the work in order to meet the high-level objectives.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The director of security compliance is upset because the compliance team has not been informed about the product design decisions taken by the agile team members over the past five iterations.nnWhat should the project manager do to start correcting the situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Invite a delegate from the security compliance team to attend the daily standup meetings.",
          "correct": false
        },
        {
          "text": "Ask the security compliance director to assign a delegate from the compliance team to work full time with the agile team.",
          "correct": false
        },
        {
          "text": "Meet with the security compliance director to determine a strategy to fulfill the compliance requirements.",
          "correct": true
        },
        {
          "text": "Ask the product owner to increase the budget to add iterations for the re-work needed for compliance.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is responsible for a new agile project that is global in nature. After a few sprints have been completed, the quality assurance team, based in a different country from the PM, has generated a long defect list. The PM is certain that these issues are not related to project quality, but are from language misinterpretation.nnWhat should the project manager do to address these issues",
      "explanation": "",
      "choices": [
        {
          "text": "Request additional budget to hire a local quality assurance team.",
          "correct": false
        },
        {
          "text": "When the project is nearing completion, merge the development team with the quality assurance team to test the deliverables.",
          "correct": false
        },
        {
          "text": "Meet with the quality assurance team to criticize the list they provided.",
          "correct": false
        },
        {
          "text": "While performing sessions with the full project team, review the project requirements and their descriptions.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager and team have worked together in a predictive project management environment for five years. The organization has decided to implement agile project management and trains the project manager on this approach. The team begins their next project using agile, but after five sprints the team still is dependent on the project manager to make decisions related to the project.nnHow can the project manager help the team?",
      "explanation": "",
      "choices": [
        {
          "text": "Regularly provide the team members feedback on all tasks.",
          "correct": false
        },
        {
          "text": "Inform the team that they can make their own decisions.",
          "correct": false
        },
        {
          "text": "Appoint a different project team with agile project management experience.",
          "correct": false
        },
        {
          "text": "Support the team and mentor them on how they can make their own decisions related to the project.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has started a new project with a 24 month timeline. Soon after the kickoff, the sponsor informs the project manager that the timeline needs to be shortened to 6 months.nnWhat should the project manager do in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Focus on developing a minimum viable product (MVP) by referencing the product backlog for items with the highest prioritization that can be completed in the new timeline.",
          "correct": true
        },
        {
          "text": "Refer to the product backlog to identify the items that can be completed in the shortest amount of time and add them to the project to complete in the new timeline.",
          "correct": false
        },
        {
          "text": "Work with the sponsor to increase the budget to hire vendors to develop the deliverables in the compressed timeline.",
          "correct": false
        },
        {
          "text": "Implement fast tracking and record this timeline change in the risk register.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has an after-hours get-together. One of the team members who was recently hired and new to the team did not receive an invitation to the get-together. At the next few standups, the new employee is visibly upset and does not participate much during the sessions.nnHow should the project manager address this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Schedule another after-hours get-together and invite the new team member.",
          "correct": false
        },
        {
          "text": "Meet with the new team member to talk about their concerns.",
          "correct": true
        },
        {
          "text": "During the next standup, ask the new team member to participate more.",
          "correct": false
        },
        {
          "text": "Invite the new team member to meet after-hours to discuss the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a big project. The project sponsor would like the project manager to perform a stakeholder analysis.nnWhich points should the project manager consider while performing this analysis?",
      "explanation": "",
      "choices": [
        {
          "text": "Interests, rights, ownership, knowledge, and contribution.",
          "correct": false
        },
        {
          "text": "Interests, requirements, rights, knowledge, and impact.",
          "correct": false
        },
        {
          "text": "Power, impact, influence, requirements, and expectations.",
          "correct": true
        },
        {
          "text": "Project role, impact, rights, knowledge, and interests.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member is working on a critical task for a project, and approaches the project manager immediately before the start of a project meeting and informs the project manager that the task was not completed on time.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Dismiss the team member from the meeting and ask him/her to continue working on the task.",
          "correct": false
        },
        {
          "text": "Reallocate the task to another team member and emphasize the importance of finishing it on a time.",
          "correct": false
        },
        {
          "text": "Send an e-mail to the whole team and ask them for support in completing this specific task.",
          "correct": false
        },
        {
          "text": "During the meeting, review all open tasks with the team and jointly decide on which action to take.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During nondestructive testing at a construction site, it was discovered that certain components are failing workability tests. The project team has identified the root cause of these failures and proposed a solution. However, the project deadline is tight and the solution would require an increase in the budget.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Invite suppliers to submit bids for a lower-cost solution.",
          "correct": false
        },
        {
          "text": "Submit a change request to the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Request additional funding from the project sponsor.",
          "correct": false
        },
        {
          "text": "Update the risk management plan to include the solution.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is experiencing delays because cultural differences are causing misunderstandings among some stakeholders.nnWhat should the project manager do to handle this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the stakeholder register to identify potential replacements for the stakeholders having difficulties.",
          "correct": false
        },
        {
          "text": "Review the stakeholder engagement plan to determine the strategies to improve stakeholder communication.",
          "correct": true
        },
        {
          "text": "Submit a change request to the change control board (CCB) to replace the stakeholders.",
          "correct": false
        },
        {
          "text": "Monitor the communication between the stakeholders to identify any misunderstandings.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company has been following a predictive approach and always waits for the preceding phase to be completed before evaluating the quality of their products. A new project manager with experience in hybrid approaches has been assigned to help increase the efficiency of the company's quality management process.nnWhat should the new project manager do to address the process improvements?",
      "explanation": "",
      "choices": [
        {
          "text": "Continue with the process as is, and wait until the next phase to suggest any improvements.",
          "correct": false
        },
        {
          "text": "Define a ground rule to comply with the quality standard and ask the team members to apply it.",
          "correct": false
        },
        {
          "text": "Discuss the process improvement with the project management office (PMO) lead to update the project delivery framework.",
          "correct": false
        },
        {
          "text": "Understand the context and interdependencies of the process from the team members and then define improvements.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project approval committee is concerned about a project plan that will take three years to complete. The committee is concerned that the deliverable may not meet industry needs and may be less valuable than anticipated.nnWhat can the project manager do to demonstrate the value of the deliverable to stakeholders?",
      "explanation": "",
      "choices": [
        {
          "text": "Add an additional sprint to the timeline for potential modifications.",
          "correct": false
        },
        {
          "text": "Have the project team build a prototype to share with stakeholders.",
          "correct": true
        },
        {
          "text": "Record the committee's expressed concerns in the issue log.",
          "correct": false
        },
        {
          "text": "Add the committee to the communication management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is on a hybrid project. The project manager meets with the sponsor to get the project milestones. The sponsor requests for more specific information in the project charter.nnHow should the project manager respond to this request?",
      "explanation": "",
      "choices": [
        {
          "text": "Provide the sponsor with a project charter from a similar project as a reference.",
          "correct": false
        },
        {
          "text": "Meet with the project stakeholders to get the project schedule approved first.",
          "correct": false
        },
        {
          "text": "Inform the sponsor that before detailed team planning can occur, the project charter needs approval first.",
          "correct": true
        },
        {
          "text": "Invite the sponsor to the team retrospective meeting so the sponsor can get the information requested.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Midway through a project, a project manager learns that the project management planning application is failing to record updates to the project. What should the project manager do in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Task a project team member to manually update the project plan from now on.",
          "correct": false
        },
        {
          "text": "Inform the project management office (PMO) and have them resolve this issue.",
          "correct": false
        },
        {
          "text": "Update the project plan to allow the project team to focus on the project deliverables.",
          "correct": true
        },
        {
          "text": "Record this issue in the issue register and work with the sponsor to implement a new project management application.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Operations for a new technology-based project are being transitioned to a new project team. Early in the execution phase, the project manager discovers major gaps in the documentation, which will hamper knowledge transfer. The solution launch date cannot be delayed, and the budget cannot be increased.nnHow should the project manager structure the project to optimize the work within the project constraints?",
      "explanation": "",
      "choices": [
        {
          "text": "Double the team size by assigning less expensive, outsourced resources.",
          "correct": false
        },
        {
          "text": "Split knowledge transfer and knowledge testing to run in parallel.",
          "correct": false
        },
        {
          "text": "Eliminate all slack and re-plan the tasks using a rolling wave approach.",
          "correct": false
        },
        {
          "text": "Use agile sprints and Kanban to accelerate learning and fault-finding.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the execution phase of a project, a change in the baseline requirements needs to be done. As the project manager, which of the following is necessary to be performed?",
      "explanation": "",
      "choices": [
        {
          "text": "Invoke the project's change management procedure.",
          "correct": true
        },
        {
          "text": "Re-estimate the impacts on cost and schedule.",
          "correct": false
        },
        {
          "text": "Validate among stakeholders.",
          "correct": false
        },
        {
          "text": "Root cause analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which two decision-making styles are quickest and would be used when there is little time to make a decision? (check two choices)",
      "explanation": "",
      "choices": [
        {
          "text": "Command Style",
          "correct": false
        },
        {
          "text": "Consultative Style",
          "correct": false
        },
        {
          "text": "Consensus Style",
          "correct": false
        },
        {
          "text": "Majority Vote Style",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project status meeting, the project manager discovers that stakeholders have different expectations that are not aligned. None of these expectations have been met, which has created tension in the meeting.nnWhat should the project manager do to keep things moving on the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the risk register to reflect the difference in expectations as a high risk.",
          "correct": false
        },
        {
          "text": "Ask stakeholders to send their expectations by email to ensure that they are included in the project plan.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders privately and update the responsibility matrix.",
          "correct": true
        },
        {
          "text": "Show stakeholders that the current status is aligned with the work breakdown structure (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a new project that revisits a previously completed project. Why should the project manager refer to the previous project lessons learned knowledge base and historic information first?",
      "explanation": "",
      "choices": [
        {
          "text": "To identify resources who worked on the previous project",
          "correct": false
        },
        {
          "text": "To define the project requirements and finalize the scope",
          "correct": false
        },
        {
          "text": "To determine a baseline for the project budget",
          "correct": false
        },
        {
          "text": "To understand issues in the previous project",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A functional manager wants to use resources already allocated to a project. What should the project manager of that project do?",
      "explanation": "",
      "choices": [
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        },
        {
          "text": "Ask the functional manager to delay their project.",
          "correct": false
        },
        {
          "text": "Accept the project delay due to reassignment of resources.",
          "correct": false
        },
        {
          "text": "Negotiate the resource requirement with the functional manager.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project is about to start and is subject to strict time and budget constraints. When reviewing the lessons learned repository, the project manager learns that constant scope creep caused a similar project to fail.n\tWhat should the project manager do now to avoid project failure?",
      "explanation": "",
      "choices": [
        {
          "text": "Refuse to accept out-of-scope change requests that would increase project duration and budget.",
          "correct": false
        },
        {
          "text": "Manage stakeholder expectations to exclude the possibility of changes in order to meet project goals.",
          "correct": false
        },
        {
          "text": "Adjust the project scope and schedule to stay within constraints and avoid potential changes.",
          "correct": false
        },
        {
          "text": "Establish formal change approval processes to guide teams to deliver essential features first.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is entering the user acceptance testing phase. After several business end users raised questions and concerns, the project manager discovered that critical business requirements were omitted from the business requirements analysis.nnnnWhat should the project manager do to resolve this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Interview the team that conducted the analysis to learn why these business requirements were omitted.",
          "correct": false
        },
        {
          "text": "Modify the requirements management plan and communicate to the stakeholders that the project schedule might be impacted.",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the project sponsor to report end users' concerns.",
          "correct": false
        },
        {
          "text": "Meet with the change control board (CCB) to review change requests.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While developing the initial schedule baseline, the project manager learns that a functional manager reassigned two resources needed for a critical task to another strategic project. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Perform a quantitative risk analysis to determine the impact of the change on the project.",
          "correct": false
        },
        {
          "text": "Request a review of the reassignment by the change control board (CCB).",
          "correct": false
        },
        {
          "text": "Meet with the functional manager to negotiate allocation of replacement resources.",
          "correct": true
        },
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a newly approved multi-national project. The successful implementation of the project relies on deliverables from a variety of departments.nnWhat is the most important thing the project manager can do to ensure the successful implementation of the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Work with the project team members to create ground rules for communications and develop a project plan.",
          "correct": false
        },
        {
          "text": "Facilitate sessions with key stakeholders to gather relevant information and define detailed product requirements.",
          "correct": false
        },
        {
          "text": "Meet with the functional managers of the relevant departments to ensure alignment with project objectives.",
          "correct": true
        },
        {
          "text": "Develop a resource management plan to define the resources required from each department.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A stakeholder requests more frequent and detailed project status reports than a previous agreement. The stakeholder also expresses interest in getting more involved with the project.nnHow should the project manager address this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Provide the stakeholder with an update on the project's status and send detailed status reports as soon as possible.",
          "correct": false
        },
        {
          "text": "Revise the stakeholder engagement assessment matrix to show the stakeholder's engagement level as supportive.",
          "correct": false
        },
        {
          "text": "Update the stakeholder communication plan and ensure that the team is aligned on the new reporting requirements.",
          "correct": true
        },
        {
          "text": "Develop a stakeholder cube that defines the relationship between the stakeholder and the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team for a project is composed of individuals from different backgrounds, ages, and interests. The team is struggling to work together.nnnnHow would meeting with the team to develop mutual values and a shared vision enable the project manager to facilitate better teamwork?",
      "explanation": "",
      "choices": [
        {
          "text": "An official team meeting to discuss the importance of teamwork would motivate the team and improve project performance.",
          "correct": false
        },
        {
          "text": "A better understanding of team members' priorities would create a common language that would foster cooperation.",
          "correct": true
        },
        {
          "text": "Understanding each team member's viewpoint would pinpoint areas where education and training was necessary.",
          "correct": false
        },
        {
          "text": "By developing its own understanding of the goals and objectives of the project, the team would gain confidence.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that a stakeholder thinks that only certain stakeholders are getting all the project updates and feels left out of the information loop. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Prepare a status update report and send it to all stakeholders.",
          "correct": false
        },
        {
          "text": "Meet with all stakeholders together and ask them to compare information.",
          "correct": false
        },
        {
          "text": "Review the communications management plan to ensure that all stakeholders are included.",
          "correct": true
        },
        {
          "text": "Revise the project communications strategy to ensure more frequent distribution of status reports.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies a risk during the implementation phase of a project which was not anticipated during planning. How would facilitating a brainstorming session allow the project manager to mitigate the risk while keeping the project on schedule?",
      "explanation": "",
      "choices": [
        {
          "text": "Brainstorming would enable the project manager to apply qualitative data analysis techniques.",
          "correct": false
        },
        {
          "text": "Brainstorming with the project team can identify multiple ideas in a short amount of time.",
          "correct": true
        },
        {
          "text": "Brainstorming with project stakeholders can result in new assumptions regarding risk tolerance.",
          "correct": false
        },
        {
          "text": "Brainstorming ways to add funding can help mitigate the risk and compress the schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While reviewing the quality of deliverables with the team, the project manager determines that several quality issues could have been avoided by using a checklist. The project manager implements a checklist to ensure future deliverables would align with the project management plan.nnnnWhat did the project manager do in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Defined new quality metrics.",
          "correct": false
        },
        {
          "text": "Used corrective action.",
          "correct": true
        },
        {
          "text": "Facilitated a retrospective.",
          "correct": false
        },
        {
          "text": "Conducted a lessons learned meeting.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex project is in the planning phase. The sponsor assigns a newly certified project manager to the project. Upon review of the project charter, the project manager uncovers several factors that could impact the project in unpredictable ways.nnnnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the project plan with details about schedule and budget forecasts.",
          "correct": false
        },
        {
          "text": "Inform the project sponsor about the possible impacts these factors may have on the project.",
          "correct": false
        },
        {
          "text": "Develop a risk management plan with details about the various factors.",
          "correct": true
        },
        {
          "text": "Extend the issue log to include a what-if scenario analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex manufacturing project has multiple stakeholders in multiple locations. The project is entering a high-activity phase and the project manager needs to ensure that all stakeholders are kept informed with timely updates.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Schedule training sessions on effective communications with all stakeholders.",
          "correct": false
        },
        {
          "text": "Determine the most appropriate technology to use to communicate with all stakeholders.",
          "correct": false
        },
        {
          "text": "Schedule regular status reports to be sent to all stakeholders.",
          "correct": false
        },
        {
          "text": "Revise the communications management plan to have a more frequent update schedule.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the planning phase for the expansion of a services company, stakeholders conducted a feasibility study to establish the type of new service the company should provide. During an alternatives analysis, another type of service was determined to be more effective. The change control board (CCB) has approved the change request for the alternative service.nnnnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Implement the change as approved.",
          "correct": true
        },
        {
          "text": "Modify the change to reduce the impact on the schedule and budget.",
          "correct": false
        },
        {
          "text": "Request justification from the CCB for the change.",
          "correct": false
        },
        {
          "text": "Conduct a cost-benefit analysis of the alternative service.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project sponsors for a multinational project have put a process in place that generates emails and reports at the end of each phase. The goal is to ensure the project remains unified across the company. The company plans to use the process as a model for future, similar projects.nnnnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the communications management plan to include details about the emails and reports.",
          "correct": true
        },
        {
          "text": "Include a formal sign-off at the end of each phase to engage the stakeholders.",
          "correct": false
        },
        {
          "text": "Hold status meetings to solicit input from project sponsors for the emails and reports.",
          "correct": false
        },
        {
          "text": "Update the stakeholder engagement plan at the end of each phase to maintain their commitment to the project's success.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A large project involving functional groups in four countries is nearing completion. The project manager is meeting with the functional managers to prepare closeout documents.nnnnWhy should the project sponsor sign off on the acceptance of project deliverables?",
      "explanation": "",
      "choices": [
        {
          "text": "Because the project sponsor is responsible for procuring funding and committing resources to the project",
          "correct": true
        },
        {
          "text": "Because the project sponsor communicates directly with the customer regarding acceptance of deliverables",
          "correct": false
        },
        {
          "text": "Because the functional managers have authority to approve project objectives but not final deliverables",
          "correct": false
        },
        {
          "text": "Because the functional managers are too geographically dispersed to sign off on the deliverables",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After completing a project, the team meets to conduct a lessons learned session. During this meeting, the team sees that all deliverables were completed to the defined parameters. However, during the testing, there were a large number of errors identified.nnWhat should the project manager have done in this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Set up a meeting with the testing team to get more information about the testing methods to be used.",
          "correct": false
        },
        {
          "text": "Evaluated when the mitigation strategy will be implemented to prepare for future projects.",
          "correct": false
        },
        {
          "text": "Conducted a Monte Carlo analysis which will determine potential outcomes and responses.",
          "correct": true
        },
        {
          "text": "Planned for these errors in the risk register as something to look for in future projects.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on an agile project. The project has 100 user stories broken down into ten iterations. Each user story is worth US$100. The actual expenditure is US$4,500 and 50 user stories have been delivered after 5 iterations.nnWhich statement is accurate?",
      "explanation": "",
      "choices": [
        {
          "text": "The project is behind schedule and is over budget.",
          "correct": false
        },
        {
          "text": "The project is on schedule and is under budget.",
          "correct": true
        },
        {
          "text": "The project is on schedule and on budget.",
          "correct": false
        },
        {
          "text": "The project is behind schedule and under budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to join a mega industrial project already underway. The latest performance indices are CPI=0.42 and SPI=0.20. This project is:",
      "explanation": "",
      "choices": [
        {
          "text": "Ahead of schedule and under budget",
          "correct": false
        },
        {
          "text": "Ahead of schedule and over budget",
          "correct": false
        },
        {
          "text": "Behind schedule and under budget",
          "correct": false
        },
        {
          "text": "Behind schedule and over budget",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During an iteration the team realizes that the project will overrun the budget. This is due to the support resources being involved for longer than planned. Company policy requires immediate notification when there is any change to the budget.nnWhat should project manager do to manage the project budget?",
      "explanation": "",
      "choices": [
        {
          "text": "Estimate the additional project cost and plan to propose the new budget to the change review board.",
          "correct": false
        },
        {
          "text": "Reduce the resources and ask the team to manage tasks within the planned cost.",
          "correct": false
        },
        {
          "text": "Discuss with the project team to reduce the use of support resources by the project.",
          "correct": true
        },
        {
          "text": "Accept the cost overrun risk, depending on the contingency amount of the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned a project for a customer with a history of being demanding and unclear about requirements. The customer has refused to accept previous deliverables without providing clear feedback.nnHow should the project manager proceed with this project?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the sponsor to define a detailed schedule leading to project completion on time.",
          "correct": false
        },
        {
          "text": "Work with the customer and the product owner to clearly define the minimum viable product (MVP).",
          "correct": true
        },
        {
          "text": "Implement an iterative approach in order to obtain formal acceptance of each deliverable.",
          "correct": false
        },
        {
          "text": "Request to terminate the project until the customer is able to provide concrete expectations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is running an agile project that is half completed. During the most recent sprint retrospective, the team members see that they worked more hours than were originally scheduled.nnHow should the project manager address this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Note the additional hours in the budget and leverage the budget reserves.",
          "correct": false
        },
        {
          "text": "Reach out to the sponsor asking for additional project team members to increase velocity.",
          "correct": false
        },
        {
          "text": "Work with the project team to identify why this occurred and what can be done to prevent it in future sprints.",
          "correct": true
        },
        {
          "text": "Empower the team to address this issue and present the sponsor with the proposed resolution.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which agile project parameter is least likely to change during project execution?",
      "explanation": "",
      "choices": [
        {
          "text": "Project vision",
          "correct": true
        },
        {
          "text": "Definition of done",
          "correct": false
        },
        {
          "text": "Product owner",
          "correct": false
        },
        {
          "text": "Product backlog",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team finds it difficult to complete a checklist because they have different interpretations of what the project aims to achieve. How can the project manager help them gain a common understanding of the project's overall purpose?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the project vision.",
          "correct": true
        },
        {
          "text": "Review the full list of user stories.",
          "correct": false
        },
        {
          "text": "Review the Agile Manifesto.",
          "correct": false
        },
        {
          "text": "Conduct the first sprint retrospective.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member informs the project manager during a project meeting that a due task was not completed on time because of a last-minute work crisis.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the task dependency, priority and impact of delay on the whole project",
          "correct": false
        },
        {
          "text": "Talk to to the team member privately, ask him/her to work overtime on the task",
          "correct": false
        },
        {
          "text": "Ask other team members to step in and assist in the completion of the task",
          "correct": false
        },
        {
          "text": "Review the task progress with the team and decide the course of action",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a scaled agile framework, which responsibilities of a release train engineer can be performed by a project manager? (Choose 3).",
      "explanation": "",
      "choices": [
        {
          "text": "Managing risks",
          "correct": false
        },
        {
          "text": "Coaching on global technical excellence",
          "correct": false
        },
        {
          "text": "Escalating impediments",
          "correct": false
        },
        {
          "text": "Coaching on global continual improvement",
          "correct": false
        },
        {
          "text": "Coaching on team continual improvement",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A software developer who is working on a critical component has to take emergency leave from the project. Due to time constraints, the project manager cannot hire a new replacement developer for the team.nnWhat should the project manager do to manage the situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Move the critical component to the final iteration it can be worked on after the developer returns from leave.",
          "correct": false
        },
        {
          "text": "Request the project sponsor to extend the project until the developer returns and finishes the work.",
          "correct": false
        },
        {
          "text": "Prolong the iteration to allow time for the developer to return and complete the component.",
          "correct": false
        },
        {
          "text": "Ask team members to find a way to complete the missing developer's work in this iteration.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to hire suppliers for an international project that has a performance period of several years. The project manager needs to allow for conditions such as changes in inflation rates.nnWhat type of contract should the project manager use?",
      "explanation": "",
      "choices": [
        {
          "text": "Time and material (T&M)",
          "correct": false
        },
        {
          "text": "Cost plus fixed fee (CPFF)",
          "correct": false
        },
        {
          "text": "Cost plus incentive fee (FPIF)",
          "correct": false
        },
        {
          "text": "Fixed price with economic price adjustment (FPEPA)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project initiation, the project manager learns that a key stakeholder will leave the project for a month to consult on another strategic project.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the issue log and notify the other stakeholders.",
          "correct": true
        },
        {
          "text": "Ask the functional manager to provide a replacement while the stakeholder is unavailable.",
          "correct": false
        },
        {
          "text": "Interview the stakeholder to gather relevant information and expert judgment.",
          "correct": false
        },
        {
          "text": "Update the risk management plan to include the impact of the stakeholder's absence.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project's statement of work (SOW) requires that the project be delivered in nine months. The project manager believes that the timeline is not realistic.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Involve the change control board (CCB) in the Perform Integrated Change Control process",
          "correct": false
        },
        {
          "text": "Submit a written request to the project sponsor for additional resources and budget",
          "correct": false
        },
        {
          "text": "Meet with subject matter experts (SMEs) and the project sponsor to set expectations",
          "correct": true
        },
        {
          "text": "Negotiate a new timeline with the project sponsor",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, the team finds that changes must be made to a component sourced from an outside supplier. The component is being used in the project.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the component supplier to discuss the product warranty.",
          "correct": false
        },
        {
          "text": "Review the contract terms and the Procurement Management Plan.",
          "correct": true
        },
        {
          "text": "List the potential risks that would result from the change.",
          "correct": false
        },
        {
          "text": "Process a change request to modify the project management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the execution phase when the project manager needs to assign new resources to the existing project team. What should the project manager do to ensure the team works effectively and meets project requirements on time?",
      "explanation": "",
      "choices": [
        {
          "text": "Create accessible library services.",
          "correct": false
        },
        {
          "text": "Conduct a brainstorming session.",
          "correct": false
        },
        {
          "text": "Integrate skills development activities.",
          "correct": true
        },
        {
          "text": "Monitor project team cohesiveness.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a new multinational project. This will be the project manager's first time working with team members from different countries.nnWhat should the project manager do to prepare themselves for the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Attend cultural sensitivity training to understand and respect cultural differences.",
          "correct": true
        },
        {
          "text": "Brush up on language skills if necessary to facilitate effective communication.",
          "correct": false
        },
        {
          "text": "Conduct team-building exercises to foster collaboration and trust among team members.",
          "correct": false
        },
        {
          "text": "Develop an awareness of local customs with the understanding that culture is learned.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The owner of a consulting company initiates a project to expand the number of services the company provides. The company has a competitive advantage, outstanding expertise, and an excellent reputation. The executive team wants to evaluate and rank criteria such as uncertainty and valuation regarding the addition of these new services.nnWhich technique should the project manager use to help the company make this evaluation?",
      "explanation": "",
      "choices": [
        {
          "text": "Cause-and-effect diagram",
          "correct": false
        },
        {
          "text": "Forecasting",
          "correct": false
        },
        {
          "text": "Multicriteria decision analysis",
          "correct": true
        },
        {
          "text": "Risk assessment matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a new project. The client has mentioned that the project's inception is based on ideas and assumptions put forward by their business partners. What should the project manager do to ensure that they have a clear understanding of the project objectives?",
      "explanation": "",
      "choices": [
        {
          "text": "Conduct in-depth interviews with the client's business partners to uncover their expectations and objectives.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders, including the client's business partners, to gather input and define project objectives.",
          "correct": true
        },
        {
          "text": "Initiate the project and develop a comprehensive project plan based on available information and assumptions.",
          "correct": false
        },
        {
          "text": "Meet with the client to discuss the project's initial ideas and assumptions and seek clarification on their vision.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Team members express frustration because their functional manager does not listen to their opinions. They seem reluctant to devote themselves to the remainder of the project.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Demonstrate support for the team by discussing their goals and beliefs.",
          "correct": true
        },
        {
          "text": "Break the remaining work into smaller tasks and divide the tasks among the team.",
          "correct": false
        },
        {
          "text": "Ask the team to prioritize the tasks remaining in the project.",
          "correct": false
        },
        {
          "text": "Discuss the team's concerns with the functional manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Midway through a project, the project manager identifies new stakeholders. Each of these new stakeholders plays a different project role.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the project sponsor to learn if new roles have been created.",
          "correct": false
        },
        {
          "text": "Review the stakeholder register.",
          "correct": false
        },
        {
          "text": "Submit a change request to the change control board (CCB).",
          "correct": false
        },
        {
          "text": "Update the stakeholder management plan.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project's execution phase, two stakeholders complain that they receive insufficient information on the project's status. The stakeholders have been included in the regular status meetings, and status reports are being shared with them.nnWhy should the project manager meet with these stakeholders?",
      "explanation": "",
      "choices": [
        {
          "text": "To gather data on the issue in order to update the issue log.",
          "correct": false
        },
        {
          "text": "To determine what information they are lacking and develop an understanding of their communication needs.",
          "correct": true
        },
        {
          "text": "Send the stakeholders copies of the Emails previously sent to prove that they are included in the project's communications plan.",
          "correct": false
        },
        {
          "text": "To develop a better working relationship with these stakeholders in order to prioritize and rank their requirements.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An organization is redesigning and relaunching a key product. The stakeholders are all company executives and want to ensure that the product launch will be a success.nnWhat should the project manager do to ensure project success?",
      "explanation": "",
      "choices": [
        {
          "text": "Implement a detailed communication management plan so that stakeholders are kept informed of the project status.",
          "correct": false
        },
        {
          "text": "Communicate the critical nature of this project to the team and escalate any issues to the sponsor.",
          "correct": false
        },
        {
          "text": "Ensure that all of the stakeholders attend the daily standups so that they can adjust the project as needed.",
          "correct": false
        },
        {
          "text": "Work to identify and align performance indicators with the deliverable.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is developing the schedule for a new software development project. The project network diagram shows two separate paths:nnPath A: Tasks 1-2-3-4 (all with a duration of 5 days each)n\tPath B: Tasks 5-6-7 (durations of 3, 7, and 2 days respectively)n\tThere are no external dependencies between these paths.nnWhat is the critical path for this project?",
      "explanation": "",
      "choices": [
        {
          "text": "1-2-3-4",
          "correct": true
        },
        {
          "text": "5/6/2007",
          "correct": false
        },
        {
          "text": "1-2-3-4-5-6-7",
          "correct": false
        },
        {
          "text": "1-2-6-7",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a status review meeting, it was determined that the product will not meet project scope requirements in a particular scenario. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Perform risk analysis and update project scope.",
          "correct": false
        },
        {
          "text": "Initiate integrated change control process.",
          "correct": true
        },
        {
          "text": "Review the baselines to determine the critical path.",
          "correct": false
        },
        {
          "text": "Inform customer and negotiate an extended deadline.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After all deliverables have been completed, a project manager needs to formally close a project. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the project documents with quality control measurements to prove deliverables have been met.",
          "correct": false
        },
        {
          "text": "Obtain stakeholder acceptance and initiate project closeout.",
          "correct": true
        },
        {
          "text": "Release the project team and estimate any unused funds.",
          "correct": false
        },
        {
          "text": "Incorporate the issue log into the lessons learned register to produce the final report.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a project that has completed the planning phase. The project sponsor is confident that the project management plan has allowed for sufficient budget and scheduled time. The project manager believes that unforeseen events could affect the ability to complete the project successfully.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Identify and evaluate potential risks and develop a risk action plan.",
          "correct": true
        },
        {
          "text": "Meet with the project sponsor to request additional funding to mitigate potential risks.",
          "correct": false
        },
        {
          "text": "Discuss the risk potential with the functional manager and identify resources that could ensure project success.",
          "correct": false
        },
        {
          "text": "Document potential constraints and limitations in the risk management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager and the project team identified risks, performed a qualitative risk analysis, and prepared a risk response plan. However, delays in the response to risk events are affecting the project schedule.nnHow would assigning risk owners to the risk responses help avoid these delays?",
      "explanation": "",
      "choices": [
        {
          "text": "Risk owners work with the project sponsor to ensure the risk response plan will be effective.",
          "correct": false
        },
        {
          "text": "Risk owners identify likely constraints and assumptions before the risk events occur.",
          "correct": false
        },
        {
          "text": "Risk owners are responsible for implementing the appropriate risk response strategy.",
          "correct": true
        },
        {
          "text": "The risk report assigns management of delays in the project schedule to the appropriate risk owner.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While reviewing the approved project schedule, the project manager realizes that the milestones are unrealistic due to longer-than-expected procurement lead times for certain key project components. The project manager needs to update the schedule baseline to reflect the long lead times.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Modify the work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Update the assumption log.",
          "correct": false
        },
        {
          "text": "Modify the procurement management plan.",
          "correct": false
        },
        {
          "text": "Submit a change request.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager joins a project overseen by a senior project manager. The sponsor asks the new project manager to develop the quality management plan.nnWhy should the project manager initially consult with the senior project manager?",
      "explanation": "",
      "choices": [
        {
          "text": "To learn the established quality processes and plans and how appropriate standards were selected.",
          "correct": true
        },
        {
          "text": "To determine what product requirements have already been collected and to gather more as needed.",
          "correct": false
        },
        {
          "text": "To develop cost-benefit analyses and benchmarking samples to be used for risk management.",
          "correct": false
        },
        {
          "text": "To draft a change request for revision to the quality metrics and quality checklists.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, key stakeholders request a change to ensure that the final product will satisfy their requirements. Why should the project manager submit a change request?",
      "explanation": "",
      "choices": [
        {
          "text": "To record the requirements needed for the stakeholders' sign-off in order to update the issues log.",
          "correct": false
        },
        {
          "text": "To ensure that the request is formally documented and incorporated according to the integrated change control process.",
          "correct": true
        },
        {
          "text": "To provide justification for any impact the change might have on the project's budget or schedule.",
          "correct": false
        },
        {
          "text": "To ensure stakeholder responsibility regarding potential impact of the change on project budget and schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project where the team is regularly missing user story due dates. What should the project manager do to resolve this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Work with the sponsor to move out the deliverable hand over date.",
          "correct": false
        },
        {
          "text": "Review the time allotted to iterations and sprints, adjusting them as needed.",
          "correct": false
        },
        {
          "text": "Meet with the project team to identify if further agile methodologies training is necessary.",
          "correct": true
        },
        {
          "text": "Implement a reward program for the project team to encourage completing stories on the due dates.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager was recently hired in a new organization and has been assigned to their first project. A colleague of the project manager warns about too much stakeholder involvement and adding extra complexity to the project.nnWhich behavior will neither add complexity nor uncertainty to the project during project scope process?",
      "explanation": "",
      "choices": [
        {
          "text": "Influential stakeholders understanding and agreement",
          "correct": true
        },
        {
          "text": "Stakeholder setting achievable goals",
          "correct": false
        },
        {
          "text": "Disagreement between stakeholders",
          "correct": false
        },
        {
          "text": "Optimistic biases on project scope",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A local government provides subsidies for healthcare activities. An organization plans to leverage this subsidy for a project to provide health testing services for at-risk populations. After the project has started, the government announces that this testing service might not qualify for the subsidy.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Escalate the project risk to a higher level.",
          "correct": true
        },
        {
          "text": "Meet with the project sponsor to redefine project benefits.",
          "correct": false
        },
        {
          "text": "Inform the stakeholders of the need to develop a contingency plan.",
          "correct": false
        },
        {
          "text": "Submit a change request to the change control board (CCB).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to regulatory changes, a government agency is now a key stakeholder in a complex project. An agency representative has asked the project manager to explain how well the advantages derived from the project align with the agency's business strategies.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the other stakeholders to discuss the project objectives.",
          "correct": false
        },
        {
          "text": "Review the assumption log.",
          "correct": false
        },
        {
          "text": "Update the stakeholder engagement plan.",
          "correct": false
        },
        {
          "text": "Refer to the benefits management plan.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager in a predictive environment has recently completed agile training and is starting to manage projects in an agile fashion. The organization is new to agile and not everyone understands the principles.nnHow should the project manager gain support going forward?",
      "explanation": "",
      "choices": [
        {
          "text": "Hold a session with the stakeholders explaining the business value of prioritization, mindset, accountability, and improved quality.",
          "correct": true
        },
        {
          "text": "Conduct a cost benefit analysis for the new project comparing predictive and agile approaches and present it to the stakeholders.",
          "correct": false
        },
        {
          "text": "Invite the stakeholders to a backlog grooming session so that they understand the scope of work and the development approach.",
          "correct": false
        },
        {
          "text": "Send the stakeholders video links explaining agile approaches as well as supporting case studies from the industry.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a new project. During the initial review of the project charter, the project manager reaches out to the project sponsor to discuss important information that is missing in the document.nnWhat piece of information is appropriate for the project manager to request?",
      "explanation": "",
      "choices": [
        {
          "text": "Measurable objectives of critical success factors",
          "correct": true
        },
        {
          "text": "Detailed description and requirements of the final deliverable",
          "correct": false
        },
        {
          "text": "Work breakdown structure (WBS)",
          "correct": false
        },
        {
          "text": "Performance measurement baseline",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager works for an organization that uses the predictive method of project management. The project manager has completed training for agile project management and begins to manage projects using the agile method. Stakeholders are not familiar with agile and are having difficulty understanding the new project methodology.nnHow should the project manager address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Hold a session with the stakeholders to introduce agility - explaining the business value of prioritization, accountability, and improved quality from frequent reviews.",
          "correct": true
        },
        {
          "text": "Conduct a cost benefit analysis for the new project comparing predictive and agile approaches and present it to the stakeholders.",
          "correct": false
        },
        {
          "text": "Invite the stakeholders to a backlog grooming session so that they understand the scope of work and the development approach.",
          "correct": false
        },
        {
          "text": "Send the stakeholders video links explaining agile approaches as well as supporting case studies from the industry.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project management office (PMO) normally runs projects using the waterfall approach. A project currently in development is impacted by local regulations which are being updated regularly. The project team feels that implementing agile techniques would benefit the project due to the constantly changing regulations.nnWhat should the project manager do in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Leverage budget reserves to add vendors familiar with the regulations to the project team.",
          "correct": false
        },
        {
          "text": "Conduct an analysis of how incorporating agile methodologies will impact the project.",
          "correct": true
        },
        {
          "text": "Present this request to the PMO and the project sponsor.",
          "correct": false
        },
        {
          "text": "Implement the request and train the project team on agile methodologies.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is brainstorming the best project management methodology to recommend to senior management for adoption. The project team's idea is characterized by frequent requirement changes, incremental and iterative changes, customer focus, and defined stages with specific documents produced to meet industry regulatory standards.nnWhich project management methodology is preferred in this case?",
      "explanation": "",
      "choices": [
        {
          "text": "Agile",
          "correct": false
        },
        {
          "text": "Hybrid",
          "correct": true
        },
        {
          "text": "Predictive",
          "correct": false
        },
        {
          "text": "Waterfall",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has adopted a new project management methodology which entails holding regular review and retrospective meetings every two weeks. In addition, there are daily status meetings and whiteboards are the main tool used to document decisions and action points.nnWhich project management methodology has the team adopted?",
      "explanation": "",
      "choices": [
        {
          "text": "Traditional",
          "correct": false
        },
        {
          "text": "Agile",
          "correct": true
        },
        {
          "text": "Waterfall",
          "correct": false
        },
        {
          "text": "Iterative",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project performance evaluation meeting, a team established that the performance of the project as of the status date was as follows: schedule performance index (SPI) = 0.5; cost performance index (CPI) = 1.5. The client had identified cost and schedule performance as key in terms of value.nnBased on these performance figures, which of the following describes the value being delivered to the client as of the status date?",
      "explanation": "",
      "choices": [
        {
          "text": "Good cost value and poor schedule value",
          "correct": true
        },
        {
          "text": "Poor cost value and good schedule value",
          "correct": false
        },
        {
          "text": "Good cost value and good schedule value",
          "correct": false
        },
        {
          "text": "Poor cost value and poor schedule value",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team is determining which activities to complete first during an upcoming project iteration for a new product development. Which factor should they use to rank the order of activities that will be delivered?",
      "explanation": "",
      "choices": [
        {
          "text": "Size of the activity",
          "correct": false
        },
        {
          "text": "Value of the activity to stakeholders",
          "correct": true
        },
        {
          "text": "Cost of the activity",
          "correct": false
        },
        {
          "text": "Ease of completion of the activity",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is midway through project delivery. The project manager decides to hold a stakeholder engagement meeting with senior management and the clients to examine if the project deliverables are achieving business value.nnWhich of the documents contains critical information to help the project manager with this?",
      "explanation": "",
      "choices": [
        {
          "text": "Work breakdown structure",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Project scope statement",
          "correct": false
        },
        {
          "text": "Business case",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is part of a project management strategy focus group that is brainstorming the ways projects will be used to add business value to the organization in the upcoming quarter. Which statement(s) describes broadly how organizations use projects to add business value?",
      "explanation": "",
      "choices": [
        {
          "text": "Projects are used to develop new products, processes, or services.",
          "correct": false
        },
        {
          "text": "Projects are used to modify existing products, processes, or services.",
          "correct": false
        },
        {
          "text": "Projects are used to deliver day-to-day activities, processes, or services.",
          "correct": false
        },
        {
          "text": "Projects are used to develop and modify products, processes, or services.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What methodology uses new approaches to implement solutions to problems that are encountered daily?",
      "explanation": "",
      "choices": [
        {
          "text": "Ideation 2.0",
          "correct": true
        },
        {
          "text": "Scrum",
          "correct": false
        },
        {
          "text": "Kanban",
          "correct": false
        },
        {
          "text": "Hybrid",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is halfway through a project using a predictive methodology when the organization announces a transition to a hybrid approach. The project sponsor instructs the team to transition to this new hybrid approach immediately, even though the team has no prior experience with hybrid projects.nnWhat is the best course of action for the project manager to take?",
      "explanation": "",
      "choices": [
        {
          "text": "Finish project delivery with the predictive methodology.",
          "correct": false
        },
        {
          "text": "Extend the project timeline to accommodate the change.",
          "correct": false
        },
        {
          "text": "Reevaluate project scope and prioritize critical tasks.",
          "correct": true
        },
        {
          "text": "Request a complete overhaul of the project plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A global organization that has always used predictive project management is now moving towards agile project management. In the first agile project of the organization, members from remote teams are failing to attend the daily standup meetings.nnHow can the project manager resolve this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Replace remote project team members with co-located team members.",
          "correct": false
        },
        {
          "text": "Assign tasks of lower priority to the remote team members.",
          "correct": false
        },
        {
          "text": "Leverage online meeting platforms for the standups and consider the working hours of remote team members when scheduling.",
          "correct": true
        },
        {
          "text": "Use some of the project budget to provide training on agile methods for all remote team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is a part of a project that is using the Scrum framework. The project manager needs to monitor the impediments log and facilitate the resolution of impediments raised by the team.nnWhat is the correct order of the five steps used to manage the impediments log?",
      "explanation": "",
      "choices": [
        {
          "text": "Prioritize, record, publish, communicate and address",
          "correct": false
        },
        {
          "text": "Record, publish, communicate, prioritize and address",
          "correct": false
        },
        {
          "text": "Record, prioritize, publish, address and communicate",
          "correct": true
        },
        {
          "text": "Prioritize, record, publish, address and communicate",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a project with a lot of stakeholders and competing priorities. What will be the main objective to initiate and conduct negotiations?",
      "explanation": "",
      "choices": [
        {
          "text": "To define the scope",
          "correct": false
        },
        {
          "text": "To resolve conflict",
          "correct": true
        },
        {
          "text": "To minimise the cost",
          "correct": false
        },
        {
          "text": "To reduce the delivery time",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is planning a worldwide product launch. Manufacturing the product is subject to rigid time constraints related to the production line and raw material availability. There are also uncertainties around regional labeling regulations that are expected to evolve within the launch period.nnHow can the project manager integrate planning and development for the unknown labeling requirements?",
      "explanation": "",
      "choices": [
        {
          "text": "Use a hybrid approach, integrating predictive labeling work streams into an agile roll-out schedule.",
          "correct": false
        },
        {
          "text": "Use a hybrid approach, integrating an agile labeling workflow into a predictive roll-out schedule.",
          "correct": true
        },
        {
          "text": "Apply agile planning to both the manufacturing and labeling work streams to align the workflows.",
          "correct": false
        },
        {
          "text": "Apply predictive planning to the labeling work stream and streamline the change control process.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager's company won a digital transformation project request for proposal (RFP) with clear scope, time and cost. As part of the RFP clause, the project manager's company also provided the number of resources required to complete the project. This is a very high investment project, and the customer wants to monitor the progress regularly.nnSince it is a fixed price project, what approach should the project manager use?",
      "explanation": "",
      "choices": [
        {
          "text": "Use a predictive approach and send the daily status report to the customer.",
          "correct": false
        },
        {
          "text": "Use an Agile approach and showcase each successful completion of the story.",
          "correct": false
        },
        {
          "text": "Use a hybrid approach and showcase each successful completion of each module.",
          "correct": true
        },
        {
          "text": "Use a predictive approach and showcase each successful completion of each module.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a new environmental project. When reviewing a vendor's proposal, the project manager identifies a technical risk that will have an impact on the project manager's company's operational cost.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Consult with their functional manager.",
          "correct": false
        },
        {
          "text": "Accept the risk and move on.",
          "correct": false
        },
        {
          "text": "Update the project risk register.",
          "correct": true
        },
        {
          "text": "Assess the risk in a workshop.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer has informed the project manager that they do not accept the project deliverables. What should the project manager do to gain approval?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the acceptance criteria with the customer to address deliverable requirements.",
          "correct": true
        },
        {
          "text": "Review the project charter and stakeholder engagement plan with the customer.",
          "correct": false
        },
        {
          "text": "Examine the quality management plan with the customer.",
          "correct": false
        },
        {
          "text": "Ascertain the customer's objections and perform a risk analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After receiving the project charter, a project manager starts to prepare the project management plan. Although there is a limited amount of detailed activity information in the project management office (PMO), the project manager needs to calculate the expected duration of the project.nnWhat should the project manager use to determine this?",
      "explanation": "",
      "choices": [
        {
          "text": "Analogous estimating",
          "correct": true
        },
        {
          "text": "Bottom-up estimating",
          "correct": false
        },
        {
          "text": "Kick-off meeting feedback",
          "correct": false
        },
        {
          "text": "Input from the project sponsor",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in development when a functional manager leaves the company and is no longer involved with the project.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the change log.",
          "correct": false
        },
        {
          "text": "Update the risk register.",
          "correct": false
        },
        {
          "text": "Update the stakeholder register.",
          "correct": true
        },
        {
          "text": "Update the assumption log.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A construction project is in the execution phase when several new team members from different countries are assigned to the project.nnWhich document should the project manager update first?",
      "explanation": "",
      "choices": [
        {
          "text": "Procurement management plan",
          "correct": false
        },
        {
          "text": "Risk management plan",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": false
        },
        {
          "text": "Communications management plan",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is committed to the success of a multinational project with tight deadlines. A new team member is continually late or misses status meetings. In a one-on-one with the project manager, the team member expresses the belief that working on deliverables is more important than attending status meetings.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Reassign the team member to another project with more flexible deadlines.",
          "correct": false
        },
        {
          "text": "Document this behavior in the team member's personnel file.",
          "correct": false
        },
        {
          "text": "Encourage this team member's attendance, but be flexible if critical work is not affected.",
          "correct": false
        },
        {
          "text": "Meet with the team to ensure they understand that attendance at status meetings is required.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project sponsor assigns a project manager to a new, critical project. This project has tight budget and time constraints.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with functional managers to schedule team resources.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders to obtain their buy-in and support.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to understand the project's purpose and high level requirements.",
          "correct": true
        },
        {
          "text": "Update the requirements management plan to reflect the budget and time constraints.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A manufacturing project is in the implementation phase. During a status meeting, a team member tells the project manager that a solution has been found for a persistent failure on equipment used in the implementation; however, this solution is temporary, and the equipment could fail again in the future.nnWhich document should the project manager update?",
      "explanation": "",
      "choices": [
        {
          "text": "Issue log",
          "correct": true
        },
        {
          "text": "Risk management plan",
          "correct": false
        },
        {
          "text": "Assumption log",
          "correct": false
        },
        {
          "text": "Stakeholder register",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is showing a negative schedule variance. The project manager sees that one team is causing the delays.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the team to identify strategies to resolve the delays.",
          "correct": true
        },
        {
          "text": "Meet with the project sponsor to determine an approach to getting back on schedule.",
          "correct": false
        },
        {
          "text": "Run a risk analysis to determine the impact of the delays on project success.",
          "correct": false
        },
        {
          "text": "Meet with human resources to discuss possible actions to get project back on schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager in a global organization is responsible for a project involving six different companies. Midway through the project, one stakeholder moves from one company to another.nnWhich document should the project manager update?",
      "explanation": "",
      "choices": [
        {
          "text": "Stakeholder engagement plan",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": false
        },
        {
          "text": "Stakeholder register",
          "correct": true
        },
        {
          "text": "Project management plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After comparing actual results to the performance measurement baseline, the project manager discovers that the project's work and cost performance measures are better than expected. The project manager doubts that these positive variances can continue until the end of the project.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Conduct performance reviews with the team members.",
          "correct": false
        },
        {
          "text": "Update the risk register.",
          "correct": true
        },
        {
          "text": "Notify the stakeholders.",
          "correct": false
        },
        {
          "text": "Review the project management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex project is in the planning stage when the sponsor identifies a need for a specialist who is a citizen of a foreign country. The project manager knows that the budget does not allow for this specialist's travel expenses.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Train a resource on the existing team in the special skills.",
          "correct": false
        },
        {
          "text": "Submit a change request for additional budget.",
          "correct": false
        },
        {
          "text": "Find a local replacement.",
          "correct": false
        },
        {
          "text": "Assign the specialist to a virtual team.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key project needs to be completed on time and exceed all established quality levels. Throughout the project, the project manager takes coffee breaks with the team and asks if they have ideas on how to improve their way of working.nnThe project manager's approach is in line with which theory?",
      "explanation": "",
      "choices": [
        {
          "text": "Theory X",
          "correct": false
        },
        {
          "text": "Theory Q",
          "correct": false
        },
        {
          "text": "Theory Y",
          "correct": true
        },
        {
          "text": "Theory T",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is having difficulty managing stakeholders because the stakeholder register does not distinguish how aware of the project they need to be in order for the project to be successful. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the change control board (CCB) to assess the impact of identifying new stakeholders.",
          "correct": false
        },
        {
          "text": "Update the stakeholder communication plan.",
          "correct": false
        },
        {
          "text": "Determine each stakeholder's risk threshold.",
          "correct": false
        },
        {
          "text": "Develop a stakeholder engagement assessment matrix.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "As a result of a drastic cut to the budget, a project's steering committee is replaced with a single sponsor. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Draft a new project update and share it with the project sponsor",
          "correct": false
        },
        {
          "text": "Modify the communications management plan to reflect the change in stakeholder community",
          "correct": true
        },
        {
          "text": "Submit a change request to the change control board (CCB) to record the change in stakeholder structure",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the sponsor to discuss the change to the budget",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies new risks that might affect the completion of critical tasks. The project manager needs to present these new risks to project stakeholders in the monthly status report.nnIn addition to the risk report, which document should the project manager reference when preparing the status report?",
      "explanation": "",
      "choices": [
        {
          "text": "Risk register",
          "correct": true
        },
        {
          "text": "Assumption log",
          "correct": false
        },
        {
          "text": "Risk management plan",
          "correct": false
        },
        {
          "text": "Probability and impact matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recognizes that certain components must be imported to meet the project's requirements. However, due to the potential impact of an unfavorable exchange rate, the project manager decides that incurring a loss is not justifiable and chooses not to take any action to mitigate it.nnWhich risk response strategy did the project manager employ?",
      "explanation": "",
      "choices": [
        {
          "text": "Transfer",
          "correct": false
        },
        {
          "text": "Avoid",
          "correct": false
        },
        {
          "text": "Minimize",
          "correct": false
        },
        {
          "text": "Accept",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is nearing completion when the project manager learns that a change in market regulations may impact the project. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Check the stakeholder register.",
          "correct": false
        },
        {
          "text": "Update the cost baseline.",
          "correct": false
        },
        {
          "text": "Review the risk management plan.",
          "correct": true
        },
        {
          "text": "Perform a cost-benefit analysis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A multinational company with a cross-border project wants to implement new software that will impact several departments. The project manager needs to guarantee alignment of stakeholder expectations with the final product.nnWhat should the project team develop?",
      "explanation": "",
      "choices": [
        {
          "text": "Project statement of work (SOW)",
          "correct": false
        },
        {
          "text": "Stakeholder engagement plan",
          "correct": true
        },
        {
          "text": "Stakeholders engagement assessment matrix",
          "correct": false
        },
        {
          "text": "Risk breakdown structure (RBS)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is working on an older server to develop a software application. The team has ordered a new server for end-user testing as the older server cannot perform this testing. The new server has not arrived in time for the scheduled testing window, delaying the end-user testing.nnWhat should the project manager do for this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Review and adjust the project timeline while waiting for the new server to arrive.",
          "correct": true
        },
        {
          "text": "Perform user testing on the current server.",
          "correct": false
        },
        {
          "text": "Bypass user testing and proceed to the next task.",
          "correct": false
        },
        {
          "text": "Ask the supplier to rush the delivery of the new server.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is attempting to engage project stakeholders in a new project and has invited them to daily standup meetings. However, none of the stakeholders have attended any of the project meetings.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Reach out to stakeholders individually to understand their reasons for non-attendance.",
          "correct": true
        },
        {
          "text": "Continue with the daily standup meetings as scheduled and wait for stakeholders to join.",
          "correct": false
        },
        {
          "text": "Cancel the daily standup meetings and explore alternative communication methods.",
          "correct": false
        },
        {
          "text": "Escalate the issue to higher management and request their intervention.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is learning how to leverage agile methods in their projects. While meeting performance goals, the team is losing motivation and is visibly bored during the daily standups, so much so that it is becoming a distraction.nnWhat could be done in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Schedule team-building exercises focused on increasing engagement.",
          "correct": false
        },
        {
          "text": "Work with the team to target higher levels of performance by providing more challenging goals.",
          "correct": true
        },
        {
          "text": "Have the sponsor attend the standup to address the distracting behavior.",
          "correct": false
        },
        {
          "text": "Work with the sponsor to identify a budget that could be used to incentivize the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is regularly missing milestones. Stakeholders are concerned that the project will miss the deliverable due date. The project manager has been aware of team conflict and learns that a team member is missing some skills needed for project completion.nnWhat should the project manager do in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Reassign the team member who is missing the skills to another task.",
          "correct": false
        },
        {
          "text": "Meet with the team to discuss the issues and develop a plan to address them.",
          "correct": true
        },
        {
          "text": "Tell the stakeholders that the project will miss the deadline and nothing can be done.",
          "correct": false
        },
        {
          "text": "Fire the team member who is missing the skills and hire someone else.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a development project for an external customer in another country. The project manager's company is required to comply with certain regulations, and the project manager's project has been selected for an audit. The customer does not think the audit is necessary and has asked the project manager not to disturb the project team.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Exclude the project development team from the compliance audit as requested by the customer.",
          "correct": false
        },
        {
          "text": "Initiate the audit without informing the customer because the company is required to comply.",
          "correct": false
        },
        {
          "text": "Schedule a steering committee meeting with all stakeholders to discuss and come to a common understanding.",
          "correct": false
        },
        {
          "text": "Meet with the customer to explain the need to meet the compliance requirements and proceed with the audit.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Who has the authority to act as an integral stakeholder and a key decision-maker throughout the life of each project in order to keep it aligned with the business objectives?",
      "explanation": "",
      "choices": [
        {
          "text": "PMO",
          "correct": true
        },
        {
          "text": "Project Manager",
          "correct": false
        },
        {
          "text": "Project Sponsor",
          "correct": false
        },
        {
          "text": "Customer",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a standup, a project team member suggests modifying some features to benefit from a new opportunity. Another team member expresses concern regarding the user experience resulting from the proposed feature.nnHow should the project manager address this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the product owner to discuss both the opportunity and concern about the proposed modification.",
          "correct": true
        },
        {
          "text": "Have the project team vote whether or not to include the modification.",
          "correct": false
        },
        {
          "text": "Note the opportunity in the project backlog and table the discussion. Ask the project team to consider the modification and decide on how to proceed at the next scheduled meeting.",
          "correct": false
        },
        {
          "text": "Meet with stakeholders and the project team to discuss how to proceed regarding the proposed modifications.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An organization has implemented agile for its recent projects, but all of the recent agile projects have missed their delivery milestones. The sponsors for the agile projects are regularly adding new requests to the projects. A project manager is given a new agile project and finds that it has a vague project objective and no clear definition of done (DoD).nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Set up a meeting with the project stakeholders to ensure the communication management plan is clearly defined.",
          "correct": false
        },
        {
          "text": "Ensure the sponsor allows the project team to include the most technical resources to better ensure project success.",
          "correct": false
        },
        {
          "text": "Work closely with the project team to develop and clearly define the project vision.",
          "correct": true
        },
        {
          "text": "Work with the project stakeholders to ensure that the project charter and deliverables are clearly defined.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an important agile project. During the kick-off meeting, the project manager sets the policies and procedures to be followed throughout the project. Midway through the project, the project manager finds that some of the project team are failing to follow the established procedures.nnWhat should the project manager do in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Work with the legal department to document the policies and procedures and have the project team members sign this document.",
          "correct": false
        },
        {
          "text": "Work with the project sponsor to replace team members not following the established procedures.",
          "correct": false
        },
        {
          "text": "Meet with the project team to review the policies and procedures again and stress their importance.",
          "correct": true
        },
        {
          "text": "Develop an incentive program for those who correctly follow the ground rules.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A stakeholder of an agile project asks the project manager to provide the remaining time planned for the project. What tool should the project manager use to provide this information?",
      "explanation": "",
      "choices": [
        {
          "text": "The planning poker analysis",
          "correct": false
        },
        {
          "text": "The release burndown chart",
          "correct": true
        },
        {
          "text": "The count of story points for the remaining user stories",
          "correct": false
        },
        {
          "text": "The work breakdown structure",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager typically conducts retrospective sessions at the end of a project. However, the sponsor believes that retrospectives are a waste of time and budget, and instructs the project manager to significantly reduce or eliminate retrospectives in future projects.nnWhat potential outcome could arise from the sponsor's directive?",
      "explanation": "",
      "choices": [
        {
          "text": "The focus shifts towards discussing issues instead of identifying ways to improve for future projects.",
          "correct": true
        },
        {
          "text": "The opportunity to improve team processes based on specific project observations is missed.",
          "correct": false
        },
        {
          "text": "The emphasis is placed on stakeholder observations about project performance.",
          "correct": false
        },
        {
          "text": "The time management plan is not properly updated.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project management office (PMO) is moving from waterfall to agile project management. The project team has been trained on agile but encounter issues working with company executives using the new processes.nnHow should project manager address this issue?",
      "explanation": "",
      "choices": [
        {
          "text": "Invite the executives to the project standups so they can learn the importance of the project.",
          "correct": false
        },
        {
          "text": "Meet with the executives to train them on the benefits of agile practices.",
          "correct": true
        },
        {
          "text": "Inform the PMO that the project needs to use waterfall as the project will not succeed without executive acceptance.",
          "correct": false
        },
        {
          "text": "Replace the current project stakeholders with the executives.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two agile teams are collaborating on a project. Team A's output is not complete enough for Team B to integrate into their backlog. According to servant leadership and agile principles, how will the project manager resolve this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "The project manager helps Team A solve the issue, and Team A decides how to implement the solution.",
          "correct": true
        },
        {
          "text": "Team B submits a change request to Team A, and Team A validates the change.",
          "correct": false
        },
        {
          "text": "Team B decides how Team A implements the change, project manager supervises.",
          "correct": false
        },
        {
          "text": "The project manager decides how Team A implements the change, and defines acceptance criteria.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which is a key factor that servant leadership aims to establish in order to improve team performance?",
      "explanation": "",
      "choices": [
        {
          "text": "Trust",
          "correct": true
        },
        {
          "text": "Concentration",
          "correct": false
        },
        {
          "text": "Speed",
          "correct": false
        },
        {
          "text": "Accuracy",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a team meeting, team members were discussing the external dependencies of a project and asked the project manager for advice. What should the project manager ask the team to do?",
      "explanation": "",
      "choices": [
        {
          "text": "Team must list out products launched by the competitors and try to copy their style.",
          "correct": false
        },
        {
          "text": "Team must list out all external dependencies and assess the impact of it on project deliveries.",
          "correct": true
        },
        {
          "text": "Team must list out impact of a new competitor in the market.",
          "correct": false
        },
        {
          "text": "Team must concentrate on their assigned work and forget external dependencies. This will not affect their work.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a new agile project, the team is using Kanban Method. Kanban board acts as an information radiator to anyone who sees it, providing up-to-date information on the status of the work of the team.nnHow is the Kanban board technology considered?",
      "explanation": "",
      "choices": [
        {
          "text": "Low-tech, high-touch",
          "correct": true
        },
        {
          "text": "Tool used in PDCA",
          "correct": false
        },
        {
          "text": "Used to show the work done",
          "correct": false
        },
        {
          "text": "Board for story point estimates",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Upon completion of a long-term contract, the project manager confirms with the release manager that all planned features are functioning properly as verified by the quality assurance team. The project manager informs the same to the customer and project stakeholders and obtains the approval to close the project. The project is now closed.nnFor ensuring that the knowledge gained during this project remains available for future reference, what should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Update the lessons learned knowledge base.",
          "correct": true
        },
        {
          "text": "Update the risk register before informing project team members.",
          "correct": false
        },
        {
          "text": "Update and archive the final procurement file.",
          "correct": false
        },
        {
          "text": "Close out the seller performance evaluation documentation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project to deliver a new product to the market. The project sponsor has asked for a broadened scope and to deliver a \"scaled-up version\" of the final product.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Request a formal confirmation of the change.",
          "correct": false
        },
        {
          "text": "Get stakeholder approval to revise the budget.",
          "correct": false
        },
        {
          "text": "Initiate integrated change control process.",
          "correct": true
        },
        {
          "text": "Update project management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a complex infrastructure project that is vital for the company's growth. During the project's initial stages, the project manager identifies a highly influential stakeholder who is resistant to the project. This stakeholder's support is crucial for the project's success, but they have expressed concerns and reservations. How should the project manager handle this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Develop a stakeholder engagement plan that includes strategies to address the concerns of the resistant stakeholder.",
          "correct": true
        },
        {
          "text": "Exclude the resistant stakeholder from the project to prevent potential disruptions and maintain project focus.",
          "correct": false
        },
        {
          "text": "Assign the task of managing the resistant stakeholder to a team member and focus on engaging other stakeholders.",
          "correct": false
        },
        {
          "text": "Seek senior management's intervention to convince the resistant stakeholder of the project's importance.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a periodic review with stakeholders, the project sponsor asks how the project will measure satisfactory completion of the deliverables and how those measurements are applied.nnWhere can the project manager find this information?",
      "explanation": "",
      "choices": [
        {
          "text": "Scope management plan.",
          "correct": false
        },
        {
          "text": "Requirements management plan.",
          "correct": true
        },
        {
          "text": "Quality management plan.",
          "correct": false
        },
        {
          "text": "Work performance reports.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A functional manager questions whether certain aspects of a project are in compliance with the project's goals. Which document should the project manager review to address the functional manager's concern?",
      "explanation": "",
      "choices": [
        {
          "text": "Statement of work (SOW)",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": true
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Project management information system (PMIS)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder requests a change that will solve a critical issue that might affect continuity of operations. However, the project is nearing completion and the change would increase the overall project cost and delay the completion date.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Assign the decision regarding the critical nature of the change to a more knowledgeable stakeholder.",
          "correct": false
        },
        {
          "text": "Submit a change request to the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Revise the work breakdown structure (WBS) and the project scope statement to include the change.",
          "correct": false
        },
        {
          "text": "Communicate the impact on the budget and schedule to the project sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the execution phase when the project manager finds that information has not been sent to stakeholders in the level of detail they expected.nnWhich of the following is the most likely consequence of poor stakeholder communication in a project in the execution phase?",
      "explanation": "",
      "choices": [
        {
          "text": "Decreased project confidence.",
          "correct": true
        },
        {
          "text": "Increased project costs.",
          "correct": false
        },
        {
          "text": "Decreased project quality.",
          "correct": false
        },
        {
          "text": "Delayed project schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager notices schedule performance issues due to the expertise levels of project resources. Some experienced resources check unnecessary details, and some junior-level resources take a long time to complete tasks. What should the project manager do to help the team enhance their performance?",
      "explanation": "",
      "choices": [
        {
          "text": "Identify each individual's knowledge gaps and address those gaps through training.",
          "correct": true
        },
        {
          "text": "Note this in the risk register and address this with the team during a retrospective session.",
          "correct": false
        },
        {
          "text": "Inform the sponsor that the deliverable will not be available on time due to insufficient expertise.",
          "correct": false
        },
        {
          "text": "Meet with human resources to have them address the individuals that are missing skills.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team lead meets with the project manager before a scheduled kick-off meeting. The team lead is worried that expectations regarding project deliverables might not be realistic.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Review the project business case and the results of the feasibility study.",
          "correct": true
        },
        {
          "text": "Facilitate a meeting between the project sponsor and the team lead to discuss the concerns.",
          "correct": false
        },
        {
          "text": "Meet with the stakeholders to discuss the concerns and record their conclusions in the stakeholder engagement plan.",
          "correct": false
        },
        {
          "text": "Identify the risks and agreed-upon risk responses and modify the risk register accordingly.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is concerned that team members spend too much time assisting operations and maintenance staff with a recently completed and delivered project component. The project manager has referred to the organizational process assets document to validate that the component was signed off and ownership was transferred.nnTo which additional documents should the project manager refer?",
      "explanation": "",
      "choices": [
        {
          "text": "Procurement statement of work (SOW) and work performance report",
          "correct": false
        },
        {
          "text": "Requirements management plan and change management plan",
          "correct": false
        },
        {
          "text": "Procurement management plan and project charter",
          "correct": false
        },
        {
          "text": "Final report and project document updates",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team implements a change that was approved by the change control board (CCB). The change was intended to minimize a risk but it had the opposite effect.nnWhat should the project manager have done to avoid this outcome?",
      "explanation": "",
      "choices": [
        {
          "text": "Confirmed the effectiveness of the risk response and monitored progress.",
          "correct": true
        },
        {
          "text": "Updated the assumption log with details concerning the risk.",
          "correct": false
        },
        {
          "text": "Performed a risk analysis to quantify project risk exposure.",
          "correct": false
        },
        {
          "text": "Developed a probability and impact matrix to determine the risk's priority level.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The supplier of a tool for a manufacturing project informs the project manager that delivery of the tool will be late. The project manager orders the tool from another supplier. After the tool from the second supplier arrives, the original supplier delivers the tool and submits an invoice according to the procurement agreement.nnWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Return the tool to the original supplier and refuse to pay the invoice because delivery was late.",
          "correct": false
        },
        {
          "text": "Keep the extra tool as a spare, pay the invoice from the contingency reserve, and update the lessons learned log.",
          "correct": false
        },
        {
          "text": "Consult the original supplier's procurement agreement to apply late delivery terms, and inform legal counsel of the issue.",
          "correct": true
        },
        {
          "text": "Compare the quality of both tools, select the tool that gives the best value, and return the other tool.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An expert resource avoids assignments that include working with a foreign contractor. How should the project manager resolve the situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Question the expert privately about their reluctance or biases and insist on an inclusive attitude.",
          "correct": true
        },
        {
          "text": "Issue a disciplinary warning to the expert and advise their functional manager to send them to diversity training.",
          "correct": false
        },
        {
          "text": "Prevent delays and conflicts by hiring a consultant that the expert is willing to work with.",
          "correct": false
        },
        {
          "text": "Reprimand the expert about their discriminatory behavior during a team meeting to set the right example.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is using a hybrid approach and team performance is consistently excellent during the predictive stages. During the incremental stages, the team begins to show signs of low morale, low commitment, conflicts, and confusion. However, one team member continues to be very confident and excels in performance during this stage.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Recognize the high-performing team member as an example to be followed by the others.",
          "correct": false
        },
        {
          "text": "Provide additional training to the team on agile processes.",
          "correct": false
        },
        {
          "text": "Discuss the issue with the project sponsor and revert the project to use only a predictive approach.",
          "correct": false
        },
        {
          "text": "Meet with the team to discuss the issues and develop a plan to address them.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on an IT project. During an iteration review meeting, a couple of key stakeholders enter into a heated discussion about the prototype's capabilities.nnWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Plan a brainstorming session with the project team to find a resolution to the problem.",
          "correct": false
        },
        {
          "text": "Identify the source of the conflict between the stakeholders and address the issue.",
          "correct": true
        },
        {
          "text": "List the positives and negatives of the situation to determine the impact of this conflict.",
          "correct": false
        },
        {
          "text": "Invite the project sponsor to intervene and act as a negotiator for the key stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has the following characteristics:nnn\tThe project manager is being asked to deliver a business result in a compressed timeline; the original timeline was one month, but the new requested timeline is two weeks.n\tIn the resource planning activity, the project manager heard from another team member that no technical resources are available to join the team; however, the project manager knows the technical resource manager from a previous project.nnnWhat is the first action the project manager should take?",
      "explanation": "",
      "choices": [
        {
          "text": "The project manager is being asked to deliver a business result in a compressed timeline; the original timeline was one month, but the new requested timeline is two weeks.",
          "correct": false
        },
        {
          "text": "In the resource planning activity, the project manager heard from another team member that no technical resources are available to join the team; however, the project manager knows the technical resource manager from a previous project.",
          "correct": false
        },
        {
          "text": "Ensure the product owner knows that there is an issue with acquiring a technical resource.",
          "correct": true
        },
        {
          "text": "Escalate the technical resource issue to upper management.",
          "correct": false
        },
        {
          "text": "Verify the availability of resources by meeting with the previously known technical resource manager.",
          "correct": false
        },
        {
          "text": "Contact a third-party vendor to obtain a technical resource.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A hybrid project has the following characteristics:nnn\tIt is in the early stages.n\tIt has a brand new team.n\tThe project manager will be very busy executing other projects during the first two weeks of the project.nnnDuring this early stage, how should the project manager develop the new project team?",
      "explanation": "",
      "choices": [
        {
          "text": "It is in the early stages.",
          "correct": true
        },
        {
          "text": "It has a brand new team.",
          "correct": false
        },
        {
          "text": "The project manager will be very busy executing other projects during the first two weeks of the project.",
          "correct": false
        },
        {
          "text": "Ensure the team understands self-organizing principles.",
          "correct": false
        },
        {
          "text": "Plan and host several team-building events to normalize the team.",
          "correct": false
        },
        {
          "text": "Provide daily project status updates to keep the team informed.",
          "correct": false
        },
        {
          "text": "Get to know each team member through one-on-one conversations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "All four key stakeholders of a project are concerned that the current release plan will not meet urgent business needs. The project manager needs to help ensure that the team delivers business value within the required timelines.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Assess the work breakdown structure (WBS) and renegotiate scope with the project sponsor.",
          "correct": false
        },
        {
          "text": "Engage with the stakeholders and team members to determine the minimum viable product (MVP) necessary for the launch.",
          "correct": true
        },
        {
          "text": "Calculate the schedule performance index (SPI) and escalate the schedule risk to the project sponsor.",
          "correct": false
        },
        {
          "text": "Modify the schedule baseline to meet stakeholder needs and monitor progress using a burndown chart.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has the following characteristics:nnn\tReoccurring project reviews are set up for the project.n\tDuring the fourth review, the customer requests to change the technical approach for the product in development.nnnWhich action should the project manager take?",
      "explanation": "",
      "choices": [
        {
          "text": "Reoccurring project reviews are set up for the project.",
          "correct": false
        },
        {
          "text": "During the fourth review, the customer requests to change the technical approach for the product in development.",
          "correct": true
        },
        {
          "text": "Inform the team members to immediately implement the new approach.",
          "correct": false
        },
        {
          "text": "Allow the team to select the most appropriate approach and verify findings with stakeholders.",
          "correct": false
        },
        {
          "text": "Research the proposed approach with the stakeholders and select what is best for the team.",
          "correct": false
        },
        {
          "text": "Have the team benchmark the approach to obtain support from the sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Within the fourth iteration of product development, the project manager realizes that the software used for the project management plan is not permitting planned updates.nnWhich action should the project manager take?",
      "explanation": "",
      "choices": [
        {
          "text": "Select a team resource who can update the project management plan template.",
          "correct": false
        },
        {
          "text": "Based on business value for the upcoming iterations, choose a priority for the activities.",
          "correct": false
        },
        {
          "text": "Resolve the issue independently so that team members do not become distracted.",
          "correct": true
        },
        {
          "text": "Add the problem as a new project risk in the risk register and suggest corrective actions.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company that is heavily focused on delivering projects using predictive approaches on-boards a new project manager who uses hybrid approaches. The scope of the project contains a number of unclear requirements.nnHow should the project manager plan the delivery of the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Escalate the issue of unclear requirements to the management team and wait for final authorization.",
          "correct": false
        },
        {
          "text": "Break down the requirements and prioritize the requirements into iterative work packages.",
          "correct": true
        },
        {
          "text": "Ignore the unclear requirements and focus on the delivery plan of the project.",
          "correct": false
        },
        {
          "text": "Wait for the requirements to be more clear before any further action is taken on the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a key flagship solution initiative prioritizing agility, market adaptation, and rapid response to market trends.nnWhich activity should the project manager prioritize first to ensure success?",
      "explanation": "",
      "choices": [
        {
          "text": "Conduct periodic reviews of project plans, objectives, and deliverables to ensure all data is captured.",
          "correct": false
        },
        {
          "text": "Request more funding from the sponsor to hire additional skilled resources and improve quality.",
          "correct": false
        },
        {
          "text": "Collaboratively review project objectives with the sponsor to agree on achievable plans and deliverables.",
          "correct": true
        },
        {
          "text": "Create a business case after a market review to adjust project deliverables based on new objectives.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An approved change request adds an incentive to a lump sum contract if the contractor is able to maintain the current baseline schedule. What should now be updated?",
      "explanation": "",
      "choices": [
        {
          "text": "Scope baseline",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Cost baseline",
          "correct": true
        },
        {
          "text": "Schedule baseline",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An organization is developing a new product. What should the project manager of this development do first to improve the success of the project?",
      "explanation": "",
      "choices": [
        {
          "text": "Work with the project management office (PMO) to develop a detailed project schedule.",
          "correct": false
        },
        {
          "text": "Work with the marketing team to conduct an impact analysis to identify the target market.",
          "correct": false
        },
        {
          "text": "Work with the project sponsor to define the project vision and overall initiative.",
          "correct": true
        },
        {
          "text": "Work with the stakeholders to identify the appropriate project team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on an complex project with multiple stakeholders and competing priorities. Each stakeholder wants to maximize its share of the allocated resources for the requested functionality.nnWhat should the project manager focus on?",
      "explanation": "",
      "choices": [
        {
          "text": "Meeting the personal interests of stakeholders.",
          "correct": false
        },
        {
          "text": "Meeting the mutual interests of all stakeholders.",
          "correct": true
        },
        {
          "text": "Preserving the relationships and rapport with stakeholders.",
          "correct": false
        },
        {
          "text": "Pushing stakeholders to accept the project manager's viewpoint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "As a project manager of a technology firm, a change in the scope is required to implement a change in the project. What tools can be utilized to better understand the impact of the change?",
      "explanation": "",
      "choices": [
        {
          "text": "Pareto chart",
          "correct": false
        },
        {
          "text": "Fishbone diagram",
          "correct": false
        },
        {
          "text": "Deming's PDCA cycle",
          "correct": true
        },
        {
          "text": "Cause and effect diagram",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new product is being constructed by an agile team, but the team has a limited amount of time to complete it. Due to these circumstances, it is important for the team to sustain collaboration for the duration of the project.nnTo build team solidarity, what should the project leader do?",
      "explanation": "",
      "choices": [
        {
          "text": "Institute protocols for handling sprints in a team meeting.",
          "correct": false
        },
        {
          "text": "Facilitate meetings with each member of the team to comprehend project goals.",
          "correct": true
        },
        {
          "text": "Confer product progress with team members by utilizing a burndown chart.",
          "correct": false
        },
        {
          "text": "Analyze the project map for release of product with team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Members from an agile team have been consistently tardy for stand-up meetings and are not meeting project target dates. The project leader assumes the issue may be difficulty with self-managing tasks within the team.nnWhat action should the project leader take?",
      "explanation": "",
      "choices": [
        {
          "text": "Aid the team to construct an agreement amongst them that details coveted behavioral norms.",
          "correct": true
        },
        {
          "text": "Convene with the team to review the issues and detail actions to solve them.",
          "correct": false
        },
        {
          "text": "Adopt a higher leadership role and set an example for the behavior needed.",
          "correct": false
        },
        {
          "text": "Assemble agile and time management training for the team to complete.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile project manager is leading a new software system development project that is in the user acceptance testing phase. The project manager has received positive feedback from the majority of business stakeholders, but the IT director is dissatisfied.nnWhat should the agile project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Review previous project meeting attendance to determine the IT director's participation.",
          "correct": false
        },
        {
          "text": "Analyze the requirements that were approved for the project with the IT director.",
          "correct": false
        },
        {
          "text": "Discuss the IT director's concerns with the project team.",
          "correct": false
        },
        {
          "text": "Collect forthright feedback from the IT director.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a new agile project, there have been hindrances related to budgeting and time management. The remote quality assurance team reported a lengthy defect list following completion of a couple sprints. The project manager concluded that the issues stem from language misinterpretation and not project quality.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Prepare and execute sessions with the full project team to review the list of required tasks and descriptions.",
          "correct": true
        },
        {
          "text": "Create a meeting with the quality assurance team and voice concerns regarding the feedback they provided.",
          "correct": false
        },
        {
          "text": "Request a financial increase from the change control board (CCB) to employ a quality assurance team locally, as opposed to remote.",
          "correct": false
        },
        {
          "text": "Combine the quality assurance team and the development team to complete testing at the conclusion of the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the execution of a project, the finance team identified that they were not involved in building the business case for the project and will not approve the estimated return on investment (ROI). What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Continue developing based on the project management plan and address the issue post-delivery.",
          "correct": false
        },
        {
          "text": "Revisit the scope management plan and note this as a risk to the entire project.",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the product owner and finance team to agree on course corrections.",
          "correct": true
        },
        {
          "text": "Revisit the communications management plan and make necessary adjustments.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product owner presented the backlog to the team, and the team raised concerns over implementing some of the features due to various impediments. What should the project manager suggest that the product owner do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Estimate the financial impact of the impediments and request additional funding.",
          "correct": false
        },
        {
          "text": "Capture the impediments and inform management that their assistance is needed in resolving the impediments.",
          "correct": false
        },
        {
          "text": "Ensure that the impediments are captured and prioritized based upon the highest valued features.",
          "correct": true
        },
        {
          "text": "Begin to remove the impediments, starting with the easiest ones first, to foster team accomplishment.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The product owner decides to launch a product after a couple of releases, knowing that the minimum viable product (MVP) lacks some features. One of the key stakeholders, the marketing vice president, is not happy with the results and questioned the release decision.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Coach the team on the decision-making process, assuming a risk-averse strategy towards product releasing.",
          "correct": false
        },
        {
          "text": "Support the product owner's decision and seek better alignment with this stakeholder in order to avoid this type of issue in the future.",
          "correct": true
        },
        {
          "text": "Assume the responsibility for product releases, making the final call on when something is ready for customer launch.",
          "correct": false
        },
        {
          "text": "Escalate the issue to the sponsor, questioning the authority of the key stakeholder regarding the product launch decision.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product company is transforming the way it develops and releases products in the market. Executives believe that this is a high-risk initiative, and this initiative must be successful.nnWhat should the project manager do in this scenario?",
      "explanation": "",
      "choices": [
        {
          "text": "Develop a communications management plan to inform the employees about the new business model.",
          "correct": false
        },
        {
          "text": "Develop a detailed sprint plan with clear deliverables.",
          "correct": false
        },
        {
          "text": "Adopt an iterative rollout approach that delivers the highest business value earlier.",
          "correct": true
        },
        {
          "text": "Develop a business case with assumptions for the new model.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team is ready to start working on a project with a customer who was very difficult to work with in the past because the customer was unable to describe exactly what they wanted. What approach should the project manager take to remove this impediment?",
      "explanation": "",
      "choices": [
        {
          "text": "Develop and monitor a plan with due dates to reduce the time of completing the product.",
          "correct": false
        },
        {
          "text": "Work with the product owner to define the minimum viable product(s).",
          "correct": true
        },
        {
          "text": "Follow a predictive approach in order to obtain formal acceptance of each deliverable.",
          "correct": false
        },
        {
          "text": "Reinforce the negotiation and soft skills of the team through training.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been moved to a new division and is in charge of an existing project in an unfamiliar domain. When attempting to gain an understanding of the risks for this agile project, what is the primary tool the project manager should employ?",
      "explanation": "",
      "choices": [
        {
          "text": "Interview with the project champion",
          "correct": false
        },
        {
          "text": "Collaborative discussions",
          "correct": true
        },
        {
          "text": "Probability assessments",
          "correct": false
        },
        {
          "text": "Workshops for risk avoidance",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project's deliverables due date is approaching, but one team member's performance is negatively impacting the schedule. What should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Acquire a more skilled resource.",
          "correct": false
        },
        {
          "text": "Remove the team member from the project.",
          "correct": false
        },
        {
          "text": "Mentor the team member.",
          "correct": true
        },
        {
          "text": "Ask the team member's line manager to provide training.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project where requirements are not fully known and a high level of uncertainty exists. Which methodology should be used for this project?",
      "explanation": "",
      "choices": [
        {
          "text": "Agile",
          "correct": true
        },
        {
          "text": "Hybrid",
          "correct": false
        },
        {
          "text": "Predictive",
          "correct": false
        },
        {
          "text": "Waterfall",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is venturing into a new business but has no previous experience in that market. The project manager is having trouble visualizing project requirements.nnWhat should the project manager do next?",
      "explanation": "",
      "choices": [
        {
          "text": "Consult the project charter.",
          "correct": false
        },
        {
          "text": "Reevaluate the business venture's objectives.",
          "correct": false
        },
        {
          "text": "Seek potential customer input.",
          "correct": true
        },
        {
          "text": "Conduct a feasibility study.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project depends on the reliability of one component. The project manager proposes designing redundancy into the system to reduce the impact that failure of this component would have on the success of the project.nnWhat type of risk response is the project manager demonstrating?",
      "explanation": "",
      "choices": [
        {
          "text": "Transfer",
          "correct": false
        },
        {
          "text": "Mitigate",
          "correct": true
        },
        {
          "text": "Accept",
          "correct": false
        },
        {
          "text": "Avoid",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company that manufactures standard equipment for municipalities needs to ensure consistency in tasks performed regularly during product assembly. What should the project manager develop to achieve this?",
      "explanation": "",
      "choices": [
        {
          "text": "Estimate Activity Resources process.",
          "correct": false
        },
        {
          "text": "Design for X (DfX) guidelines.",
          "correct": false
        },
        {
          "text": "Quality checklists.",
          "correct": true
        },
        {
          "text": "Subject matter expert (SME) interviews.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is preparing the charter for a software development project that will outsource 33 percent of user interface (UI) evaluation. The project manager needs software developers to identify the parts of the UI that a third-party can evaluate. However, the software functional manager believes that the project will reduce staff in the software development department and refuses to cooperate.nnWhat should the project manager do first?",
      "explanation": "",
      "choices": [
        {
          "text": "Meet with the functional manager to review the statement of work (SOW).",
          "correct": true
        },
        {
          "text": "Ask the project sponsor to explain the rationale for third-party evaluation to the functional manager.",
          "correct": false
        },
        {
          "text": "Provide a cost/benefit analysis of third-party evaluation to the functional manager.",
          "correct": false
        },
        {
          "text": "Explain the intent of the UI evaluation to the functional manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a kick-off meeting for a critical project, three stakeholders with varying perspectives and interests engaged in a heated argument about the project's goals. How should the project manager address this situation?",
      "explanation": "",
      "choices": [
        {
          "text": "Interrupt the argument and firmly assert their authority to maintain order and control over the meeting.",
          "correct": false
        },
        {
          "text": "Facilitate a structured discussion to understand each stakeholder's perspective and find common ground.",
          "correct": true
        },
        {
          "text": "Conclude the meeting prematurely to allow stakeholders to cool off and reschedule it at a later date.",
          "correct": false
        },
        {
          "text": "Ignore the argument and proceed with the meeting's agenda as planned, addressing the conflict afterward.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to formally complete a project, but a supplier says an invoice has been paid twice. The project manager knows that the invoice was approved, but cannot find evidence of a duplicate payment. The project manager needs to close out this project in order to start a new project.nnWhat should the project manager do?",
      "explanation": "",
      "choices": [
        {
          "text": "Inform the supplier that payment was made only once, begin the close project process, and begin work on the new project.",
          "correct": false
        },
        {
          "text": "Postpone project closure until the accounts payable department can document that the invoice was paid correctly.",
          "correct": true
        },
        {
          "text": "Complete all final project documents, delay work on the new project, and update the documents after payment is verified.",
          "correct": false
        },
        {
          "text": "Meet with the sponsor of the existing project to obtain approval to begin the new project before the existing project is closed.",
          "correct": false
        }
      ]
    }
  ]
}