{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "تقوم مؤسسة عقارية بمراجعة شهرية لمحفظة مشاريعها الاستراتيجية.\n\nالمشروع أالمشروع ب\nتاريخ البدء مارس 2016 ماي 2017\nتاريخ الانتهاء المتوقع أبريل 2019 جويلية 2020\nمدير المشروع PM-A PM-B\n\nخلال مراجعة في مارس 2018، تبيّن أن المشروع ب يعاني من مشاكل لم تُحدد مسبقًا في عملية إدارة المخاطر. وبما أن المشروع أ قد بدأ قبل سنة تقريبًا، ما المعلومة التي يجب طلبها من المشروع أ حتى يتمكن المشروع ب من اتخاذ إجراءات وقائية أو تصحيحية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقارير أداء العمل",
          "correct": false
        },
        {
          "text": "مستودع الدروس المستفادة",
          "correct": true
        },
        {
          "text": "سجل المشكلات",
          "correct": false
        },
        {
          "text": "قائمة الأنشطة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الاجتماع التمهيدي لمشروع صناعي، يجب على مدير المشروع المعين قيادة الفريق في تحديد المخاطر. ونظرًا لأن أعضاء الفريق موزعون في 6 دول، ما هي أفضل طريقة لتحديد المخاطر في هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط التجميع بالتقارب (Affinity diagram)",
          "correct": false
        },
        {
          "text": "تحليل شجرة القرار (Decision tree analysis)",
          "correct": false
        },
        {
          "text": "تقنية دلفي (Delphi technique)",
          "correct": true
        },
        {
          "text": "تحليل مونتي كارلو (Monte Carlo analysis)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يناقش عدة أعضاء في الفريق تقنيات إدارة مدير المشروع ولا يمكنهم الاتفاق إن كان يركز على الإدارة أو القيادة. ما هو الخيار الصحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "يتصرف كمدير لأنه يركز على التحكم والكفاءة والفعالية.",
          "correct": false
        },
        {
          "text": "يتصرف كقائد لأنه يجمع بين الأشخاص والاتجاه والسرعة.",
          "correct": false
        },
        {
          "text": "يتصرف كمدير لأنه يدخل في الأوامر وفعل الأشياء الصحيحة.",
          "correct": false
        },
        {
          "text": "لا شيء مما سبق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع بناء مركز بيانات بحري، وهو المسؤول أيضًا عن الأصول التي تم شراؤها ضمن المشروع. أبلغ أحد أعضاء الفريق عن فقدان أحد الأصول، وأبدى استعداده لتحمل التكلفة.\n\nكيف يجب أن يتعامل مدير المشروع مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من عضو الفريق شراء أصل بديل وتحديث سجل الأصول برمز جديد.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل، وشراء الأصل الجديد، وتحديث سجل الأصول وسجل المخاطر.",
          "correct": false
        },
        {
          "text": "إبلاغ الإدارة، واستبدال الأصل عن طريق مطالبة التأمين، وتحديث سجل الأصول.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل والإدارة فورًا، وفتح تحقيق، وتحديث سجل المخاطر، واتخاذ إجراء بناءً على النتيجة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع مبادرة معقدة تضم أصحاب مصلحة متنوعين، ويجب عليه بناء علاقات قوية معهم، بالإضافة إلى إنشاء فهم مشترك للمشروع بينهم.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تيسير ورش تفاعلية لمناقشة الأهداف والتوقعات.",
          "correct": true
        },
        {
          "text": "إجراء تمرين تفصيلي لرسم خريطة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تقديم عروض رسمية تلخص تقدم المشروع.",
          "correct": false
        },
        {
          "text": "توزيع مستندات المشروع المفصلة للمراجعة الفردية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنت تدير مشروعًا يحتوي على عناصر تنظيمية كبيرة. المورد المسؤول عن وحدة أساسية يمر بتحول تنظيمي شامل، ومن غير المرجح أن تكون النتيجة جاهزة في الوقت المحدد. خطتك لتخفيف المخاطر هي استخدام النماذج الورقية حتى يتم تنفيذ الوحدة، لكن من المرجح أن تؤدي هذه الإستراتيجية إلى إبطاء التفاعل مع المستخدمين.",
      "explanation": "",
      "choices": [
        {
          "text": "خطر ثانوي",
          "correct": true
        },
        {
          "text": "خطر متبقي",
          "correct": false
        },
        {
          "text": "الخطر الأساسي",
          "correct": false
        },
        {
          "text": "خطر الامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال دورة حياة المشروع، يواجه مدير المشروع عادةً مشاكل أو ثغرات أو تناقضات أو صراعات تحدث بشكل غير متوقع. يتطلب هذا اتخاذ إجراء حتى لا يتأثر أداء المشروع.\n\nأي وثيقة من وثائق المشروع ستُستخدم لتسجيل وتتبع ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل المشكلات",
          "correct": true
        },
        {
          "text": "سجل المخاطر",
          "correct": false
        },
        {
          "text": "الدروس المستفادة",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي الصفة القيادية التي يجب أن يتحلى بها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الصدق",
          "correct": true
        },
        {
          "text": "العدوانية",
          "correct": false
        },
        {
          "text": "القوة",
          "correct": false
        },
        {
          "text": "القائد الخدمي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قدّم أحد أصحاب المصلحة الرئيسيين عدة طلبات لوظائف جديدة لمنتج قيد التطوير. أنهى مدير المشروع للتو تحديد نطاق النسخة التالية من المنتج وأرسل بيان النطاق إلى جميع أصحاب المصلحة.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الاتصالات لتحديد عدد الطلبات التي يمكن تقديمها.",
          "correct": false
        },
        {
          "text": "مراجعة معايير القبول المحددة في بيان النطاق.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة لتأكيد توافقهم مع أهداف المنتج وأهداف المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة النطاق لتحديد كيفية التعامل مع طلبات الوظائف الجديدة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في نهاية دورة، أخبر أحد أعضاء الفريق مدير المشروع أن مهمة مخططة لم تُنجز بسبب مشكلة ظهرت قبل أيام ولم يتم حلها. لماذا يجب على مدير المشروع مناقشة هذه المشكلة خلال اجتماع الاستعراض (retrospective) لمنع تكرار مثل هذا الموقف في المستقبل؟",
      "explanation": "",
      "choices": [
        {
          "text": "لأنه وقت مناسب لمناقشة المشكلات وأفكار التحسين وتشجيع حل المشكلات الجماعي.",
          "correct": true
        },
        {
          "text": "لأنه يسمح لمدير المشروع بمعالجة المشكلة أثناء العرض التوضيحي (demo)، مما يزيد من التفاعل.",
          "correct": false
        },
        {
          "text": "لأن عضو الفريق سيتمكن من حل المشكلة قبل اجتماع الاستعراض.",
          "correct": false
        },
        {
          "text": "لتمكين مدير المشروع من التأكيد على الاستفادة القصوى من الوقت المتاح لحل المشكلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلتقي أصحاب المصلحة وفريق المشروع العامل على مشروع أجايلي مع مدير المشروع في نهاية دورة. يكتشف مدير المشروع أن الجدول الزمني يتأخر، رغم أن العمل تم التخطيط له لتحقيق الأهداف العامة الموضحة في نطاق المشروع.\n\nما الذي كان يجب على مدير المشروع فعله للحفاظ على تقدم المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع الفريق لفهم توقعاتهم من استخدام المنهجية المرنة.",
          "correct": false
        },
        {
          "text": "تمكين أعضاء الفريق من تنظيم المهام بأنفسهم لتحقيق الأهداف.",
          "correct": true
        },
        {
          "text": "إعطاء الأولوية للأعمال التي يمكن إنجازها مبكرًا للاستفادة المبكرة.",
          "correct": false
        },
        {
          "text": "اختيار وترتيب العمل لتحقيق الأهداف العامة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير الامتثال الأمني غاضب لأن فريق الامتثال لم يتم إبلاغه بقرارات تصميم المنتج التي اتخذها أعضاء الفريق الأجايل خلال الخمسة تكرارات الماضية.\n\nما الذي يجب على مدير المشروع فعله لتصحيح الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعوة ممثل من فريق الامتثال الأمني لحضور الاجتماعات اليومية.",
          "correct": false
        },
        {
          "text": "طلب من مدير الامتثال الأمني تعيين ممثل من فريق الامتثال للعمل بدوام كامل مع فريق الأجايل.",
          "correct": false
        },
        {
          "text": "الاجتماع مع مدير الامتثال الأمني لتحديد استراتيجية لتلبية متطلبات الامتثال.",
          "correct": true
        },
        {
          "text": "طلب من مالك المنتج زيادة الميزانية لإضافة تكرارات لإعادة العمل المطلوبة للامتثال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع مسؤول عن مشروع أجايل جديد على نطاق عالمي. بعد الانتهاء من بعض التكرارات، أنشأ فريق ضمان الجودة - الموجود في بلد مختلف - قائمة طويلة بالأعطال. مدير المشروع متأكد من أن هذه المشاكل لا تتعلق بجودة المشروع، بل ناتجة عن سوء تفسير لغوي.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه القضايا؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب ميزانية إضافية لتوظيف فريق ضمان جودة محلي.",
          "correct": false
        },
        {
          "text": "عند اقتراب نهاية المشروع، دمج فريق التطوير مع فريق ضمان الجودة لاختبار المخرجات.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق ضمان الجودة لانتقاد القائمة التي قدموها.",
          "correct": false
        },
        {
          "text": "أثناء عقد جلسات مع الفريق الكامل للمشروع، مراجعة متطلبات المشروع ووصفها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع وفريقه عملوا معًا في بيئة إدارة مشاريع تقليدية لمدة خمس سنوات. قررت المؤسسة تطبيق منهجية الأجايل ودربت مدير المشروع على هذا النهج. بدأ الفريق مشروعهم التالي باستخدام الأجايل، لكن بعد خمس تكرارات لا يزال الفريق يعتمد على مدير المشروع في اتخاذ القرارات المتعلقة بالمشروع.\n\nكيف يمكن لمدير المشروع مساعدة الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم ملاحظات دورية لأعضاء الفريق حول جميع المهام.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بأن بإمكانهم اتخاذ قراراتهم الخاصة.",
          "correct": false
        },
        {
          "text": "تعيين فريق مشروع آخر لديه خبرة في إدارة المشاريع بالأجايل.",
          "correct": false
        },
        {
          "text": "دعم الفريق وتوجيههم حول كيفية اتخاذ قراراتهم الخاصة المتعلقة بالمشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مدير المشروع مشروعًا جديدًا بمدة زمنية قدرها 24 شهرًا. بعد وقت قصير من بدء المشروع، أبلغ الراعي مدير المشروع بأن المدة يجب أن تُختصر إلى 6 أشهر.\n\nما الذي يجب على مدير المشروع فعله في هذا السيناريو؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز على تطوير منتج قابل للإطلاق (MVP) من خلال الرجوع إلى قائمة المنتج وتحديد العناصر ذات الأولوية الأعلى التي يمكن إكمالها خلال المدة الزمنية الجديدة.",
          "correct": true
        },
        {
          "text": "الرجوع إلى قائمة المنتج لتحديد العناصر التي يمكن إنجازها في أقصر وقت وإضافتها إلى المشروع لاستكمالها في الإطار الزمني الجديد.",
          "correct": false
        },
        {
          "text": "العمل مع الراعي لزيادة الميزانية وتوظيف موردين لتطوير المخرجات في الوقت المضغوط.",
          "correct": false
        },
        {
          "text": "تطبيق المسار السريع وتسجيل هذا التغيير في الجدول الزمني في سجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أقام فريق المشروع تجمعًا غير رسمي بعد ساعات العمل. أحد أعضاء الفريق الجدد الذين تم توظيفهم مؤخرًا لم يتلقَ دعوة. في الاجتماعات اليومية التالية، بدا أن الموظف الجديد منزعج ولم يشارك كثيرًا في الجلسات.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم تجمع آخر بعد ساعات العمل ودعوة الموظف الجديد.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الموظف الجديد لمناقشة مخاوفه.",
          "correct": true
        },
        {
          "text": "خلال الاجتماع اليومي التالي، مطالبة الموظف الجديد بالمشاركة بشكل أكبر.",
          "correct": false
        },
        {
          "text": "دعوة الموظف الجديد للقاء بعد ساعات العمل لمناقشة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع كبير. يرغب راعي المشروع في أن يجري مدير المشروع تحليلًا لأصحاب المصلحة.\n\nما النقاط التي يجب على مدير المشروع أخذها في الاعتبار أثناء إجراء هذا التحليل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاهتمامات، الحقوق، الملكية، المعرفة، والمساهمة.",
          "correct": false
        },
        {
          "text": "الاهتمامات، المتطلبات، الحقوق، المعرفة، والتأثير.",
          "correct": false
        },
        {
          "text": "السلطة، التأثير، النفوذ، المتطلبات، والتوقعات.",
          "correct": true
        },
        {
          "text": "دور المشروع، التأثير، الحقوق، المعرفة، والاهتمامات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل أحد أعضاء الفريق على مهمة حرجة في المشروع، ويقترب من مدير المشروع مباشرة قبل بدء اجتماع لإبلاغه بأن المهمة لم تكتمل في الوقت المحدد.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طرد عضو الفريق من الاجتماع وطلب منه الاستمرار في العمل على المهمة.",
          "correct": false
        },
        {
          "text": "إعادة تخصيص المهمة إلى عضو فريق آخر والتأكيد على أهمية إنجازها في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "إرسال بريد إلكتروني إلى الفريق بأكمله وطلب الدعم لإكمال هذه المهمة المحددة.",
          "correct": false
        },
        {
          "text": "مراجعة جميع المهام المفتوحة مع الفريق خلال الاجتماع واتخاذ قرار جماعي بالإجراء المناسب.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار غير مدمر في موقع بناء، تم اكتشاف أن بعض المكونات تفشل في اختبارات قابلية العمل. حدد فريق المشروع السبب الجذري لهذه الإخفاقات واقترح حلاً. ومع ذلك، فإن الموعد النهائي ضيق وسيتطلب الحل زيادة في الميزانية.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعوة الموردين لتقديم عروض لحل منخفض التكلفة.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": true
        },
        {
          "text": "طلب تمويل إضافي من راعي المشروع.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المخاطر لتضمين الحل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني المشروع من تأخيرات بسبب الاختلافات الثقافية التي تسبب سوء تفاهم بين بعض أصحاب المصلحة.\n\nما الذي يجب أن يفعله مدير المشروع للتعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة سجل أصحاب المصلحة لتحديد بدائل محتملة لأصحاب المصلحة الذين يواجهون صعوبات.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إشراك أصحاب المصلحة لتحديد استراتيجيات تحسين التواصل معهم.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB) لاستبدال أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراقبة التواصل بين أصحاب المصلحة لتحديد أي سوء فهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تتبع شركة نهجًا تقليديًا وتتبع دائمًا مرحلة سابقة قبل تقييم جودة منتجاتها. تم تعيين مدير مشروع جديد لديه خبرة في النهج الهجينة للمساعدة في تحسين كفاءة عملية إدارة الجودة في الشركة.\n\nما الذي يجب أن يفعله مدير المشروع الجديد لمعالجة تحسينات العملية؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستمرار في العملية كما هي، والانتظار حتى المرحلة التالية لاقتراح أي تحسينات.",
          "correct": false
        },
        {
          "text": "تحديد قاعدة عامة للامتثال للمعايير وتوجيه أعضاء الفريق لتطبيقها.",
          "correct": false
        },
        {
          "text": "مناقشة تحسين العملية مع قائد مكتب إدارة المشاريع (PMO) لتحديث إطار تسليم المشروع.",
          "correct": false
        },
        {
          "text": "فهم السياق والاعتماديات الخاصة بالعملية من أعضاء الفريق ثم تحديد التحسينات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تشعر لجنة الموافقة على المشروع بالقلق بشأن خطة مشروع ستستغرق ثلاث سنوات لإكمالها. اللجنة قلقة من أن الناتج قد لا يلبي احتياجات الصناعة وقد يكون أقل قيمة مما هو متوقع.\n\nما الذي يمكن أن يفعله مدير المشروع لإثبات قيمة الناتج لأصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة سباق إضافي إلى الجدول الزمني لإجراء تعديلات محتملة.",
          "correct": false
        },
        {
          "text": "طلب من فريق المشروع إنشاء نموذج أولي لمشاركته مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تسجيل مخاوف اللجنة في سجل المشكلات.",
          "correct": false
        },
        {
          "text": "إضافة اللجنة إلى خطة إدارة الاتصالات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يعمل على مشروع هجين. يلتقي مدير المشروع مع الراعي للحصول على المعالم الرئيسية للمشروع. يطلب الراعي مزيدًا من المعلومات التفصيلية في ميثاق المشروع.\n\nكيف يجب أن يرد مدير المشروع على هذا الطلب؟",
      "explanation": "",
      "choices": [
        {
          "text": "تزويد الراعي بميثاق مشروع من مشروع مشابه كمثال مرجعي.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة للحصول على الموافقة على جدول المشروع أولًا.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بأنه يجب اعتماد ميثاق المشروع أولًا قبل أن تبدأ التخطيطات التفصيلية للفريق.",
          "correct": true
        },
        {
          "text": "دعوة الراعي إلى اجتماع مراجعة الفريق للحصول على المعلومات المطلوبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف المشروع، يكتشف مدير المشروع أن تطبيق تخطيط إدارة المشروع يفشل في تسجيل التحديثات على المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تكليف أحد أعضاء الفريق بتحديث خطة المشروع يدويًا من الآن فصاعدًا.",
          "correct": false
        },
        {
          "text": "إبلاغ مكتب إدارة المشاريع (PMO) وطلب حل المشكلة.",
          "correct": false
        },
        {
          "text": "تحديث خطة المشروع لتمكين الفريق من التركيز على الإنجازات الأساسية.",
          "correct": true
        },
        {
          "text": "تسجيل هذه المشكلة في سجل المشكلات والعمل مع الراعي لتطبيق تطبيق جديد لإدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم نقل عمليات مشروع جديد قائم على التكنولوجيا إلى فريق مشروع جديد. في بداية مرحلة التنفيذ، يكتشف مدير المشروع وجود فجوات كبيرة في التوثيق، مما سيعيق نقل المعرفة. لا يمكن تأجيل موعد إطلاق الحل، ولا يمكن زيادة الميزانية.\n\nكيف يجب أن يهيكل مدير المشروع العمل ضمن قيود المشروع لتحسين الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "مضاعفة حجم الفريق عن طريق تخصيص موارد خارجية أقل تكلفة.",
          "correct": false
        },
        {
          "text": "فصل نقل المعرفة واختبار المعرفة ليتم تنفيذهما بالتوازي.",
          "correct": false
        },
        {
          "text": "إلغاء أي هامش في الجدول وإعادة تخطيط المهام باستخدام نهج الموجات المتدرجة.",
          "correct": false
        },
        {
          "text": "استخدام سباقات أجايل وتقنية كانبان لتسريع التعلم واكتشاف الأخطاء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة تنفيذ المشروع، يجب إجراء تغيير في متطلبات الأساس.\n\nبصفتك مدير المشروع، ما الذي يجب القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "تفعيل إجراء إدارة التغيير في المشروع.",
          "correct": true
        },
        {
          "text": "إعادة تقدير التأثيرات على التكلفة والجدول الزمني.",
          "correct": false
        },
        {
          "text": "التحقق من صحة التغيير بين أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحليل السبب الجذري.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "ما هما أسلوبا اتخاذ القرار الأسرع واللذان يُستخدمان عندما يكون هناك وقت محدود لاتخاذ القرار؟ (اختر خيارين)",
      "explanation": "",
      "choices": [
        {
          "text": "أسلوب الأمر (Command Style)",
          "correct": false
        },
        {
          "text": "الأسلوب الاستشاري (Consultative Style)",
          "correct": false
        },
        {
          "text": "أسلوب الإجماع (Consensus Style)",
          "correct": false
        },
        {
          "text": "أسلوب التصويت بالأغلبية (Majority Vote Style)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع حالة المشروع، يكتشف مدير المشروع أن أصحاب المصلحة لديهم توقعات مختلفة وغير متوافقة. لم يتم تلبية أي من هذه التوقعات، مما تسبب في توتر خلال الاجتماع.\n\nما الذي يجب على مدير المشروع فعله لمواصلة سير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل المخاطر ليعكس اختلاف التوقعات كمخاطرة عالية.",
          "correct": false
        },
        {
          "text": "طلب من أصحاب المصلحة إرسال توقعاتهم عبر البريد الإلكتروني لضمان تضمينها في خطة المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع بأصحاب المصلحة بشكل خاص وتحديث مصفوفة المسؤوليات.",
          "correct": true
        },
        {
          "text": "عرض لأصحاب المصلحة أن الوضع الحالي يتماشى مع هيكل تقسيم العمل (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد يعيد النظر في مشروع تم تنفيذه سابقًا. لماذا يجب على مدير المشروع الرجوع أولًا إلى قاعدة بيانات الدروس المستفادة والمعلومات التاريخية؟",
      "explanation": "",
      "choices": [
        {
          "text": "لتحديد الموارد التي عملت على المشروع السابق.",
          "correct": false
        },
        {
          "text": "لتعريف متطلبات المشروع وتحديد نطاقه النهائي.",
          "correct": false
        },
        {
          "text": "لتحديد خط أساس لميزانية المشروع.",
          "correct": false
        },
        {
          "text": "لفهم المشكلات التي حدثت في المشروع السابق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يرغب مدير إداري في استخدام الموارد التي تم تخصيصها بالفعل لمشروع. ماذا يجب أن يفعل مدير مشروع ذلك المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد الأمر إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "طلب من المدير الإداري تأجيل مشروعه.",
          "correct": false
        },
        {
          "text": "قبول تأخير المشروع بسبب إعادة تخصيص الموارد.",
          "correct": false
        },
        {
          "text": "التفاوض مع المدير الإداري حول متطلبات الموارد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع جديد على وشك البدء ويخضع لقيود صارمة في الوقت والميزانية. عند مراجعة سجل الدروس المستفادة، يعلم مدير المشروع أن التغير المستمر في النطاق تسبب في فشل مشروع مشابه.\n\nما الذي يجب أن يفعله مدير المشروع الآن لتجنب فشل المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفض قبول طلبات التغيير الخارجة عن النطاق والتي قد تزيد من مدة المشروع وميزانيته.",
          "correct": false
        },
        {
          "text": "إدارة توقعات أصحاب المصلحة لاستبعاد إمكانية التغييرات بهدف تحقيق أهداف المشروع.",
          "correct": false
        },
        {
          "text": "تعديل نطاق المشروع والجدول الزمني للبقاء ضمن القيود وتجنب التغييرات المحتملة.",
          "correct": false
        },
        {
          "text": "إنشاء عمليات رسمية للموافقة على التغييرات لتوجيه الفرق نحو تسليم الميزات الأساسية أولًا.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدخل المشروع مرحلة اختبار قبول المستخدم. بعد أن أثار العديد من المستخدمين النهائيين في الأعمال أسئلة ومخاوف، اكتشف مدير المشروع أن متطلبات العمل الحرجة تم إغفالها من تحليل متطلبات العمل.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مقابلة مع الفريق الذي قام بالتحليل لمعرفة سبب إغفال هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة المتطلبات وإبلاغ أصحاب المصلحة بأن الجدول الزمني قد يتأثر.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع راعي المشروع لإبلاغه بمخاوف المستخدمين النهائيين.",
          "correct": false
        },
        {
          "text": "الاجتماع مع لجنة مراقبة التغيير (CCB) لمراجعة طلبات التغيير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تطوير خط الأساس الأولي للجدول الزمني، علم مدير المشروع أن مديرًا وظيفيًا أعاد تخصيص موردين مطلوبين لمهمة حرجة إلى مشروع استراتيجي آخر. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحليل كمي للمخاطر لتحديد تأثير التغيير على المشروع.",
          "correct": false
        },
        {
          "text": "طلب مراجعة إعادة التخصيص من قبل لجنة مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "الاجتماع مع المدير الوظيفي للتفاوض على تخصيص موارد بديلة.",
          "correct": true
        },
        {
          "text": "تصعيد المسألة إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع دولي جديد تمت الموافقة عليه مؤخرًا. يعتمد التنفيذ الناجح للمشروع على نتائج من مجموعة متنوعة من الأقسام.\n\nما هو أهم شيء يمكن أن يفعله مدير المشروع لضمان التنفيذ الناجح للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع أعضاء فريق المشروع لوضع قواعد أساسية للاتصالات وتطوير خطة المشروع.",
          "correct": false
        },
        {
          "text": "تسهيل جلسات مع أصحاب المصلحة الرئيسيين لجمع المعلومات ذات الصلة وتحديد متطلبات المنتج بالتفصيل.",
          "correct": false
        },
        {
          "text": "الاجتماع مع المدراء الوظيفيين للأقسام ذات الصلة لضمان توافقهم مع أهداف المشروع.",
          "correct": true
        },
        {
          "text": "تطوير خطة إدارة الموارد لتحديد الموارد المطلوبة من كل قسم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب أحد أصحاب المصلحة تقارير حالة مشروع أكثر تكرارًا وتفصيلًا مما تم الاتفاق عليه سابقًا. كما أبدى اهتمامًا بالمشاركة بشكل أكبر في المشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تحديث لحالة المشروع وإرسال تقارير الحالة التفصيلية في أقرب وقت ممكن.",
          "correct": false
        },
        {
          "text": "تحديث مصفوفة تقييم مشاركة أصحاب المصلحة لإظهار أن مستوى مشاركة صاحب المصلحة داعم.",
          "correct": false
        },
        {
          "text": "تحديث خطة الاتصال مع أصحاب المصلحة والتأكد من توافق الفريق مع متطلبات التقارير الجديدة.",
          "correct": true
        },
        {
          "text": "تطوير مصفوفة أصحاب المصلحة (Stakeholder Cube) التي تحدد العلاقة بين صاحب المصلحة والمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتكوّن فريق مشروع من أفراد من خلفيات وأعمار واهتمامات مختلفة. ويواجه الفريق صعوبة في العمل معًا.\n\nكيف يمكن للاجتماع مع الفريق لتطوير قيم مشتركة ورؤية موحدة أن يساعد مدير المشروع في تسهيل العمل الجماعي بشكل أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "سيحفز اجتماع رسمي مع الفريق لمناقشة أهمية العمل الجماعي الفريق ويحسن أداء المشروع.",
          "correct": false
        },
        {
          "text": "سيساهم الفهم الأفضل لأولويات أعضاء الفريق في إنشاء لغة مشتركة تعزز التعاون.",
          "correct": true
        },
        {
          "text": "سيساعد فهم وجهة نظر كل عضو في تحديد المجالات التي تتطلب تعليمًا وتدريبًا.",
          "correct": false
        },
        {
          "text": "من خلال تطوير فهمه الخاص لأهداف المشروع، سيكتسب الفريق الثقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن أحد أصحاب المصلحة يعتقد أن بعض أصحاب المصلحة فقط يحصلون على جميع تحديثات المشروع ويشعر بأنه مستبعد من دائرة المعلومات. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعداد تقرير حالة وإرساله إلى جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع جميع أصحاب المصلحة وطلب منهم مقارنة المعلومات.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات للتأكد من شمول جميع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تعديل استراتيجية الاتصالات لضمان توزيع تقارير الحالة بشكل أكثر تكرارًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع مخاطرة خلال مرحلة التنفيذ لم يتم التنبؤ بها أثناء التخطيط. كيف يمكن أن تساعد جلسة العصف الذهني في تقليل هذه المخاطرة مع الحفاظ على تقدم المشروع وفق الجدول الزمني؟",
      "explanation": "",
      "choices": [
        {
          "text": "سيمكن العصف الذهني مدير المشروع من تطبيق تقنيات تحليل البيانات النوعية.",
          "correct": false
        },
        {
          "text": "يمكن أن يحدد العصف الذهني مع فريق المشروع عدة أفكار في وقت قصير.",
          "correct": true
        },
        {
          "text": "يمكن أن ينتج عن العصف الذهني مع أصحاب المصلحة افتراضات جديدة حول مدى تحمل المخاطر.",
          "correct": false
        },
        {
          "text": "يمكن أن يساعد العصف الذهني بشأن تمويل إضافي في تقليل المخاطر وضغط الجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة جودة المخرجات مع الفريق، يحدد مدير المشروع أن عدة مشاكل جودة كان يمكن تجنبها باستخدام قائمة تحقق. قام مدير المشروع بتنفيذ قائمة تحقق لضمان توافق المخرجات المستقبلية مع خطة إدارة المشروع.\n\nماذا فعل مدير المشروع في هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعريف مقاييس جودة جديدة.",
          "correct": false
        },
        {
          "text": "استخدام إجراء تصحيحي.",
          "correct": true
        },
        {
          "text": "تيسير اجتماع مراجعة ما بعد التنفيذ.",
          "correct": false
        },
        {
          "text": "عقد اجتماع لاستخلاص الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع معقد في مرحلة التخطيط. تم تعيين مدير مشروع جديد حاصل على شهادة حديثة من قبل الراعي. عند مراجعة ميثاق المشروع، يكتشف مدير المشروع عدة عوامل قد تؤثر على المشروع بطرق غير متوقعة.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة المشروع بتفاصيل حول الجدول الزمني وتوقعات الميزانية.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بالتأثيرات المحتملة لهذه العوامل على المشروع.",
          "correct": false
        },
        {
          "text": "تطوير خطة لإدارة المخاطر تتضمن تفاصيل حول العوامل المختلفة.",
          "correct": true
        },
        {
          "text": "توسيع سجل المشكلات ليشمل تحليل سيناريوهات ماذا لو.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصنيع معقد يحتوي على العديد من أصحاب المصلحة في عدة مواقع. يدخل المشروع في مرحلة نشاط عالي ويحتاج مدير المشروع إلى التأكد من أن جميع أصحاب المصلحة يتم إعلامهم بالتحديثات في الوقت المناسب.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة جلسات تدريب على الاتصالات الفعالة مع جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد التكنولوجيا الأنسب لاستخدامها في التواصل مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة تقارير حالة منتظمة يتم إرسالها إلى جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الاتصالات لتتضمن جدولًا زمنيًا أكثر تكرارًا للتحديثات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التخطيط لتوسيع شركة خدمات، أجرى أصحاب المصلحة دراسة جدوى لتحديد نوع الخدمة الجديدة التي يجب أن تقدمها الشركة. خلال تحليل البدائل، تم التوصل إلى أن نوعًا آخر من الخدمات سيكون أكثر فعالية. وقد وافقت لجنة مراقبة التغيير (CCB) على طلب التغيير للخدمة البديلة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ التغيير كما تمت الموافقة عليه.",
          "correct": true
        },
        {
          "text": "تعديل التغيير لتقليل التأثير على الجدول الزمني والميزانية.",
          "correct": false
        },
        {
          "text": "طلب تبرير من لجنة مراقبة التغيير للتغيير.",
          "correct": false
        },
        {
          "text": "إجراء تحليل التكلفة والفائدة للخدمة البديلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام الرعاة لمشروع متعدد الجنسيات بوضع عملية تولد رسائل بريد إلكتروني وتقارير في نهاية كل مرحلة. الهدف هو ضمان توحيد المشروع عبر الشركة. وتخطط الشركة لاستخدام هذه العملية كنموذج لمشاريع مماثلة في المستقبل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة الاتصالات لتتضمن تفاصيل حول رسائل البريد الإلكتروني والتقارير.",
          "correct": true
        },
        {
          "text": "إدراج توقيع رسمي في نهاية كل مرحلة لإشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات حالة لجمع مدخلات من الرعاة لتقارير البريد الإلكتروني.",
          "correct": false
        },
        {
          "text": "تحديث خطة مشاركة أصحاب المصلحة في نهاية كل مرحلة للحفاظ على التزامهم بنجاح المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع كبير يضم مجموعات وظيفية في أربع دول يقترب من الاكتمال. يجتمع مدير المشروع مع المدراء الوظيفيين لإعداد مستندات الإغلاق.\n\nلماذا يجب على راعي المشروع التوقيع على قبول مخرجات المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "لأن راعي المشروع مسؤول عن تأمين التمويل وتخصيص الموارد للمشروع.",
          "correct": true
        },
        {
          "text": "لأن راعي المشروع يتواصل مباشرة مع العميل بخصوص قبول المخرجات.",
          "correct": false
        },
        {
          "text": "لأن المدراء الوظيفيين لديهم صلاحية الموافقة على أهداف المشروع وليس على المخرجات النهائية.",
          "correct": false
        },
        {
          "text": "لأن المدراء الوظيفيين منتشرون جغرافيًا ولا يمكنهم التوقيع على المخرجات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتهاء من مشروع، يجتمع الفريق لعقد جلسة لاستخلاص الدروس المستفادة. خلال الاجتماع، تبين أن جميع المخرجات قد اكتملت وفق المعايير المحددة، لكن أثناء الاختبار، تم اكتشاف عدد كبير من الأخطاء.\n\nما الذي كان يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع مع فريق الاختبار للحصول على مزيد من المعلومات حول طرق الاختبار المستخدمة.",
          "correct": false
        },
        {
          "text": "تقييم متى سيتم تنفيذ استراتيجية التخفيف للتحضير للمشاريع المستقبلية.",
          "correct": false
        },
        {
          "text": "إجراء تحليل مونتي كارلو لتحديد النتائج والاستجابات المحتملة.",
          "correct": true
        },
        {
          "text": "تضمين هذه الأخطاء في سجل المخاطر كعنصر يجب مراقبته في المشاريع المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع رشيق (Agile). يحتوي المشروع على 100 قصة مستخدم موزعة على عشر دورات. كل قصة مستخدم تساوي 100 دولار أمريكي. تم إنفاق 4500 دولار فعليًا وتم تسليم 50 قصة مستخدم بعد خمس دورات.\n\nأي من العبارات التالية صحيحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المشروع متأخر عن الجدول الزمني ويتجاوز الميزانية.",
          "correct": false
        },
        {
          "text": "المشروع يسير حسب الجدول وهو أقل من الميزانية.",
          "correct": true
        },
        {
          "text": "المشروع يسير حسب الجدول ووفق الميزانية.",
          "correct": false
        },
        {
          "text": "المشروع متأخر عن الجدول الزمني وأقل من الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع للانضمام إلى مشروع صناعي ضخم جارٍ تنفيذه. المؤشرات الحالية للأداء هي CPI=0.42 وSPI=0.20. هذا المشروع هو:",
      "explanation": "",
      "choices": [
        {
          "text": "متقدم عن الجدول الزمني وتحت الميزانية",
          "correct": false
        },
        {
          "text": "متقدم عن الجدول الزمني وفوق الميزانية",
          "correct": false
        },
        {
          "text": "متأخر عن الجدول الزمني وتحت الميزانية",
          "correct": false
        },
        {
          "text": "متأخر عن الجدول الزمني وفوق الميزانية",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال إحدى الدورات، أدرك الفريق أن المشروع سيتجاوز الميزانية. ويعود ذلك إلى أن موارد الدعم شاركت لفترة أطول من المخطط لها. تقتضي سياسة الشركة الإبلاغ الفوري عند حدوث أي تغيير في الميزانية.\n\nماذا يجب على مدير المشروع أن يفعل لإدارة ميزانية المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقدير التكلفة الإضافية للمشروع والتخطيط لاقتراح الميزانية الجديدة على لجنة مراجعة التغييرات.",
          "correct": false
        },
        {
          "text": "تقليل الموارد وطلب من الفريق إدارة المهام ضمن التكلفة المخططة.",
          "correct": false
        },
        {
          "text": "مناقشة الأمر مع فريق المشروع لتقليل استخدام موارد الدعم من قبل المشروع.",
          "correct": true
        },
        {
          "text": "قبول مخاطر تجاوز التكلفة اعتمادًا على مبلغ الطوارئ في المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع لعميل له تاريخ من كونه متطلبًا وغير واضح بشأن المتطلبات. وقد رفض العميل قبول التسليمات السابقة دون تقديم ملاحظات واضحة.\n\nكيف يجب على مدير المشروع المضي قدمًا في هذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع الراعي لوضع جدول زمني مفصل يؤدي إلى إكمال المشروع في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "العمل مع العميل ومالك المنتج لتحديد الحد الأدنى القابل للتسليم (MVP) بشكل واضح.",
          "correct": true
        },
        {
          "text": "تنفيذ نهج تكراري من أجل الحصول على قبول رسمي لكل تسليمة.",
          "correct": false
        },
        {
          "text": "طلب إيقاف المشروع حتى يتمكن العميل من تقديم توقعات ملموسة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام النهج الرشيق (Agile) وقد أُنجز نصفه. خلال جلسة الاستعراض الأخيرة للدورة، لاحظ أعضاء الفريق أنهم عملوا لساعات أكثر من المخطط لها.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تسجيل الساعات الإضافية في الميزانية والاستفادة من الاحتياطيات المالية.",
          "correct": false
        },
        {
          "text": "التواصل مع الراعي لطلب أعضاء إضافيين في الفريق لزيادة سرعة التنفيذ.",
          "correct": false
        },
        {
          "text": "العمل مع فريق المشروع لتحديد سبب ذلك وما يمكن فعله لمنعه في الدورات القادمة.",
          "correct": true
        },
        {
          "text": "تمكين الفريق من معالجة هذه المسألة وتقديم الحل المقترح للراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو العامل الأقل احتمالًا أن يتغير أثناء تنفيذ المشروع الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "رؤية المشروع",
          "correct": true
        },
        {
          "text": "تعريف الإنجاز",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "سجل المنتج (Backlog)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجد فريق رشيق صعوبة في إكمال قائمة التحقق لأن لديهم تفسيرات مختلفة لما يهدف إليه المشروع. كيف يمكن لمدير المشروع مساعدتهم في الوصول إلى فهم مشترك للغرض العام من المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة رؤية المشروع.",
          "correct": true
        },
        {
          "text": "مراجعة القائمة الكاملة لقصص المستخدم.",
          "correct": false
        },
        {
          "text": "مراجعة البيان الرشيق (Agile Manifesto).",
          "correct": false
        },
        {
          "text": "إجراء أول مراجعة بعد الدورة (sprint retrospective).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ أحد أعضاء الفريق مدير المشروع أثناء اجتماع المشروع أن المهمة المستحقة لم تُنجز في الوقت المحدد بسبب أزمة عمل مفاجئة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقق من تبعية المهمة، وأولويتها، وتأثير التأخير على المشروع بالكامل.",
          "correct": false
        },
        {
          "text": "التحدث إلى عضو الفريق بشكل خاص وطلب منه العمل لساعات إضافية لإكمال المهمة.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق الآخرين التدخل والمساعدة في إنجاز المهمة.",
          "correct": false
        },
        {
          "text": "مراجعة تقدم المهمة مع الفريق واتخاذ القرار المناسب بشأن الإجراء القادم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في إطار رشيق موسّع (Scaled Agile Framework)، ما هي المسؤوليات التي يمكن لمدير المشروع تنفيذها ضمن دور مهندس قطار الإصدارات (Release Train Engineer)؟ (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة المخاطر",
          "correct": false
        },
        {
          "text": "التوجيه بشأن التميز التقني العالمي",
          "correct": false
        },
        {
          "text": "تصعيد العوائق",
          "correct": false
        },
        {
          "text": "التوجيه بشأن التحسين المستمر العالمي",
          "correct": false
        },
        {
          "text": "التوجيه بشأن التحسين المستمر على مستوى الفريق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مطور برمجيات يعمل على مكون حرج إلى أخذ إجازة طارئة من المشروع. نظرًا للقيود الزمنية، لا يستطيع مدير المشروع توظيف مطور بديل جديد للفريق.\n\nما الذي يجب على مدير المشروع فعله لإدارة هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "نقل المكون الحرج إلى الدورة النهائية ليتم العمل عليه بعد عودة المطور من الإجازة.",
          "correct": false
        },
        {
          "text": "طلب تمديد المشروع من الراعي حتى يعود المطور ويكمل العمل.",
          "correct": false
        },
        {
          "text": "تمديد الدورة الزمنية لإتاحة الوقت لعودة المطور وإكمال المكون.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق إيجاد طريقة لإنجاز عمل المطور الغائب ضمن هذه الدورة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير مشروع إلى التعاقد مع موردين لمشروع دولي يمتد على عدة سنوات. يحتاج مدير المشروع إلى أخذ تغيّرات مثل معدلات التضخم بعين الاعتبار.\n\nما نوع العقد الذي يجب أن يستخدمه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد زمني ومواد (T&M)",
          "correct": false
        },
        {
          "text": "عقد تكلفة زائد رسوم ثابتة (CPFF)",
          "correct": false
        },
        {
          "text": "عقد تكلفة زائد رسوم تحفيزية (FPIF)",
          "correct": false
        },
        {
          "text": "عقد سعر ثابت مع تعديل اقتصادي للسعر (FPEPA)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء بدء المشروع، علم مدير المشروع أن أحد أصحاب المصلحة الرئيسيين سيغادر المشروع لمدة شهر للتشاور في مشروع استراتيجي آخر.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل القضايا وإخطار أصحاب المصلحة الآخرين.",
          "correct": true
        },
        {
          "text": "طلب من المدير الوظيفي توفير بديل أثناء غياب صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "إجراء مقابلة مع صاحب المصلحة لجمع المعلومات والحكم الخبير.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المخاطر لتشمل تأثير غياب صاحب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتطلب بيان العمل (SOW) الخاص بالمشروع تسليمه خلال تسعة أشهر. يعتقد مدير المشروع أن الجدول الزمني غير واقعي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إشراك لجنة مراقبة التغيير (CCB) في تنفيذ عملية التحكم المتكامل في التغيير.",
          "correct": false
        },
        {
          "text": "تقديم طلب كتابي إلى راعي المشروع للحصول على موارد وميزانية إضافية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الخبراء المتخصصين (SMEs) وراعي المشروع لتحديد التوقعات.",
          "correct": true
        },
        {
          "text": "التفاوض على جدول زمني جديد مع راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، وجد الفريق أن هناك حاجة لإجراء تغييرات على أحد المكونات التي تم الحصول عليها من مورد خارجي، ويتم استخدام هذا المكون في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع المورد لمناقشة ضمان المنتج.",
          "correct": false
        },
        {
          "text": "مراجعة شروط العقد وخطة إدارة المشتريات.",
          "correct": true
        },
        {
          "text": "إدراج المخاطر المحتملة الناتجة عن التغيير.",
          "correct": false
        },
        {
          "text": "معالجة طلب تغيير لتعديل خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة التنفيذ ويحتاج مدير المشروع إلى تعيين موارد جديدة إلى الفريق القائم حاليًا.\n\nما الذي يجب أن يفعله مدير المشروع لضمان عمل الفريق بفعالية وتحقيق متطلبات المشروع في الوقت المحدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء خدمات مكتبة يسهل الوصول إليها.",
          "correct": false
        },
        {
          "text": "إجراء جلسة عصف ذهني.",
          "correct": false
        },
        {
          "text": "دمج أنشطة تطوير المهارات.",
          "correct": true
        },
        {
          "text": "مراقبة تماسك فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع في مشروع جديد متعدد الجنسيات، وهذه هي المرة الأولى التي يعمل فيها مع أعضاء فريق من دول مختلفة.\n\nما الذي يجب أن يفعله مدير المشروع للتحضير للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "حضور تدريب على الحساسية الثقافية لفهم واحترام الاختلافات الثقافية.",
          "correct": true
        },
        {
          "text": "مراجعة مهارات اللغة إذا لزم الأمر لتسهيل التواصل الفعّال.",
          "correct": false
        },
        {
          "text": "إجراء تمارين بناء الفريق لتعزيز التعاون والثقة بين الأعضاء.",
          "correct": false
        },
        {
          "text": "تطوير وعي بالعادات المحلية مع فهم أن الثقافة مكتسبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مالك شركة استشارية بإطلاق مشروع لتوسيع عدد الخدمات التي تقدمها الشركة. تمتلك الشركة ميزة تنافسية وخبرة متميزة وسمعة ممتازة. ترغب الإدارة التنفيذية في تقييم وترتيب معايير مثل عدم اليقين والتقييم فيما يتعلق بإضافة هذه الخدمات الجديدة.\n\nما هي التقنية التي يجب أن يستخدمها مدير المشروع لمساعدة الشركة في إجراء هذا التقييم؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط السبب والتأثير",
          "correct": false
        },
        {
          "text": "التنبؤ",
          "correct": false
        },
        {
          "text": "تحليل القرار متعدد المعايير",
          "correct": true
        },
        {
          "text": "مصفوفة تقييم المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد. وذكر العميل أن نشأة المشروع تعتمد على أفكار وافتراضات قدمها شركاؤهم التجاريون.\n\nما الذي يجب على مدير المشروع فعله لضمان فهم واضح لأهداف المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مقابلات معمقة مع شركاء العميل التجاريين للكشف عن توقعاتهم وأهدافهم.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة، بما في ذلك شركاء العميل، لجمع المدخلات وتحديد أهداف المشروع.",
          "correct": true
        },
        {
          "text": "بدء المشروع وتطوير خطة مشروع شاملة بناءً على المعلومات والافتراضات المتاحة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع العميل لمناقشة الأفكار والافتراضات الأولية للمشروع وطلب توضيح لرؤيته.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعبر أعضاء الفريق عن إحباطهم لأن مديرهم الوظيفي لا يستمع إلى آرائهم. ويبدو أنهم مترددون في الالتزام بما تبقى من المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إظهار الدعم للفريق من خلال مناقشة أهدافهم ومعتقداتهم.",
          "correct": true
        },
        {
          "text": "تقسيم العمل المتبقي إلى مهام أصغر وتوزيعها على الفريق.",
          "correct": false
        },
        {
          "text": "طلب من الفريق تحديد أولويات المهام المتبقية في المشروع.",
          "correct": false
        },
        {
          "text": "مناقشة مخاوف الفريق مع المدير الوظيفي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف المشروع، حدد مدير المشروع أصحاب مصلحة جدد. كل واحد من هؤلاء أصحاب المصلحة الجدد يلعب دورًا مختلفًا في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع راعي المشروع لمعرفة ما إذا تم إنشاء أدوار جديدة.",
          "correct": false
        },
        {
          "text": "مراجعة سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة أصحاب المصلحة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة تنفيذ المشروع، اشتكى اثنان من أصحاب المصلحة من أنهم لا يتلقون معلومات كافية عن حالة المشروع. لقد تم تضمينهم في الاجتماعات الدورية، ويتم مشاركة تقارير الحالة معهم.\n\nلماذا يجب على مدير المشروع الاجتماع مع هؤلاء أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "لجمع بيانات حول المشكلة لتحديث سجل القضايا.",
          "correct": false
        },
        {
          "text": "لتحديد المعلومات التي يفتقدونها وفهم احتياجاتهم من التواصل.",
          "correct": true
        },
        {
          "text": "إرسال نسخ من الرسائل الإلكترونية السابقة لأصحاب المصلحة لإثبات شمولهم في خطة الاتصالات.",
          "correct": false
        },
        {
          "text": "تطوير علاقة عمل أفضل مع أصحاب المصلحة لتحديد أولويات متطلباتهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم مؤسسة بإعادة تصميم وإطلاق منتج رئيسي من جديد. جميع أصحاب المصلحة من التنفيذيين ويرغبون في ضمان نجاح إطلاق المنتج.\n\nما الذي يجب على مدير المشروع فعله لضمان نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ خطة إدارة اتصالات مفصلة لإبقاء أصحاب المصلحة على اطلاع بحالة المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بأهمية هذا المشروع وتصعيد أي مشكلات إلى الراعي.",
          "correct": false
        },
        {
          "text": "ضمان حضور جميع أصحاب المصلحة للاجتماعات اليومية حتى يتمكنوا من تعديل المشروع حسب الحاجة.",
          "correct": false
        },
        {
          "text": "العمل على تحديد مؤشرات الأداء ومواءمتها مع المخرجات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بوضع الجدول الزمني لمشروع تطوير برمجيات جديد. يُظهر مخطط شبكة المشروع مسارين منفصلين:\n\nالمسار A: المهام 1-2-3-4 (كل منها مدته 5 أيام)\nالمسار B: المهام 5-6-7 (بمدد 3، 7، و2 أيام على التوالي)\n\nلا توجد تبعيات خارجية بين هذين المسارين.\n\nما هو المسار الحرج لهذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "1-2-3-4",
          "correct": true
        },
        {
          "text": "5/6/2007",
          "correct": false
        },
        {
          "text": "1-2-3-4-5-6-7",
          "correct": false
        },
        {
          "text": "1-2-6-7",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع مراجعة الحالة، تبيّن أن المنتج لن يفي بمتطلبات نطاق المشروع في سيناريو معين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحليل للمخاطر وتحديث نطاق المشروع.",
          "correct": false
        },
        {
          "text": "بدء عملية التحكم المتكامل بالتغيير.",
          "correct": true
        },
        {
          "text": "مراجعة الخطوط الأساسية لتحديد المسار الحرج.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل والتفاوض على تمديد الموعد النهائي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتهاء من جميع التسليمات، يحتاج مدير المشروع إلى إغلاق المشروع رسميًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث مستندات المشروع بقياسات مراقبة الجودة لإثبات أن التسليمات قد تم تحقيقها.",
          "correct": false
        },
        {
          "text": "الحصول على قبول أصحاب المصلحة وبدء إغلاق المشروع.",
          "correct": true
        },
        {
          "text": "إطلاق فريق المشروع وتقدير أي أموال غير مستخدمة.",
          "correct": false
        },
        {
          "text": "دمج سجل القضايا في سجل الدروس المستفادة لإعداد التقرير النهائي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع في مشروع أتم مرحلة التخطيط. يثق راعي المشروع أن خطة إدارة المشروع تضمنت ميزانية وجدولاً زمنياً كافيين، لكن يعتقد مدير المشروع أن أحداثًا غير متوقعة قد تؤثر على القدرة على إكمال المشروع بنجاح.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد وتقييم المخاطر المحتملة ووضع خطة استجابة للمخاطر.",
          "correct": true
        },
        {
          "text": "الاجتماع مع راعي المشروع لطلب تمويل إضافي للتخفيف من المخاطر المحتملة.",
          "correct": false
        },
        {
          "text": "مناقشة احتمالية المخاطر مع المدير الوظيفي وتحديد الموارد لضمان نجاح المشروع.",
          "correct": false
        },
        {
          "text": "توثيق القيود والحدود المحتملة في خطة إدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع والفريق المخاطر، وأجروا تحليلًا نوعيًا، وأعدوا خطة استجابة. ومع ذلك، فإن التأخير في الاستجابة لأحداث المخاطر يؤثر على الجدول الزمني.\n\nكيف يمكن أن يساعد تعيين مالكي المخاطر في تجنب هذه التأخيرات؟",
      "explanation": "",
      "choices": [
        {
          "text": "يعمل مالكو المخاطر مع راعي المشروع لضمان فعالية خطة الاستجابة.",
          "correct": false
        },
        {
          "text": "يقوم مالكو المخاطر بتحديد القيود والافتراضات قبل وقوع المخاطر.",
          "correct": false
        },
        {
          "text": "يتحمل مالكو المخاطر مسؤولية تنفيذ استراتيجية الاستجابة المناسبة.",
          "correct": true
        },
        {
          "text": "يُسند تقرير المخاطر إدارة التأخيرات في الجدول الزمني لصاحب الخطر المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة الجدول الزمني المعتمد للمشروع، أدرك مدير المشروع أن المراحل الرئيسية غير واقعية بسبب فترات التوريد الأطول من المتوقع لبعض مكونات المشروع الرئيسية. يحتاج مدير المشروع إلى تحديث خط الأساس للجدول الزمني ليعكس فترات التوريد الطويلة.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعديل هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "تحديث سجل الافتراضات.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة المشتريات.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم مدير مشروع جديد إلى مشروع يشرف عليه مدير مشروع كبير. طلب الراعي من مدير المشروع الجديد تطوير خطة إدارة الجودة.\n\nلماذا يجب على مدير المشروع في البداية استشارة مدير المشروع الكبير؟",
      "explanation": "",
      "choices": [
        {
          "text": "لتعلّم العمليات والخطط المعتمدة للجودة وكيف تم اختيار المعايير المناسبة.",
          "correct": true
        },
        {
          "text": "لتحديد المتطلبات التي تم جمعها بالفعل وجمع المزيد منها عند الحاجة.",
          "correct": false
        },
        {
          "text": "لتطوير تحليلات التكلفة والمنفعة وعينات المقارنة لاستخدامها في إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "لصياغة طلب تغيير لمراجعة مقاييس الجودة وقوائم التحقق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، طلب أصحاب المصلحة الرئيسيون إجراء تغيير لضمان أن المنتج النهائي سيفي بمتطلباتهم. لماذا يجب على مدير المشروع تقديم طلب تغيير؟",
      "explanation": "",
      "choices": [
        {
          "text": "لتوثيق المتطلبات اللازمة للحصول على توقيع أصحاب المصلحة من أجل تحديث سجل القضايا.",
          "correct": false
        },
        {
          "text": "لضمان توثيق الطلب رسميًا ودمجه وفقًا لعملية التحكم المتكامل بالتغيير.",
          "correct": true
        },
        {
          "text": "لتقديم مبرر لأي تأثير قد يحدثه التغيير على ميزانية المشروع أو جدوله الزمني.",
          "correct": false
        },
        {
          "text": "لضمان مسؤولية أصحاب المصلحة عن التأثير المحتمل للتغيير على ميزانية المشروع وجدوله.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام النهج الرشيق (Agile)، حيث يفوّت الفريق مواعيد تسليم القصص المتكررة (user stories) بانتظام. ما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع الراعي لتأجيل تاريخ تسليم المنتج.",
          "correct": false
        },
        {
          "text": "مراجعة الوقت المخصص للتكرارات وتعديله حسب الحاجة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق لتحديد ما إذا كان هناك حاجة إلى تدريب إضافي على منهجيات Agile.",
          "correct": true
        },
        {
          "text": "تطبيق برنامج مكافآت للفريق لتشجيعهم على إكمال القصص في مواعيدها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد في مؤسسة جديدة في أول مشروع له. حذره أحد الزملاء من الإفراط في إشراك أصحاب المصلحة، مما قد يضيف تعقيدًا إضافيًا للمشروع.\n\nأي سلوك من التالي لن يضيف تعقيدًا أو عدم يقين أثناء عملية تحديد نطاق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "فهم أصحاب المصلحة المؤثرين واتفاقهم.",
          "correct": true
        },
        {
          "text": "تحديد أصحاب المصلحة لأهداف قابلة للتحقيق.",
          "correct": false
        },
        {
          "text": "الخلاف بين أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "التحيزات المتفائلة بشأن نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "توفر حكومة محلية إعانات مالية للأنشطة الصحية. تخطط منظمة للاستفادة من هذه الإعانة لتنفيذ مشروع يقدم خدمات فحص صحي للسكان المعرضين للخطر. بعد بدء المشروع، أعلنت الحكومة أن هذه الخدمة قد لا تكون مؤهلة للحصول على الإعانة.\n\nماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد خطر المشروع إلى مستوى أعلى.",
          "correct": true
        },
        {
          "text": "الاجتماع مع راعي المشروع لإعادة تعريف فوائد المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بالحاجة إلى تطوير خطة طوارئ.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تغييرات تنظيمية، أصبحت وكالة حكومية الآن من أصحاب المصلحة الرئيسيين في مشروع معقد. طلب ممثل الوكالة من مدير المشروع شرح مدى توافق فوائد المشروع مع استراتيجيات الوكالة التجارية.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة الآخرين لمناقشة أهداف المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة سجل الافتراضات.",
          "correct": false
        },
        {
          "text": "تحديث خطة إشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الرجوع إلى خطة إدارة الفوائد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في بيئة تقليدية وقد أنهى مؤخرًا تدريبًا على المنهجية الرشيقة (Agile)، ويبدأ الآن في إدارة المشاريع باستخدام الأسلوب الرشيق. المنظمة جديدة على المنهجية ولم يفهم الجميع مبادئها.\n\nكيف يمكن لمدير المشروع الحصول على الدعم للمضي قدمًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد جلسة مع أصحاب المصلحة لشرح القيمة التجارية لتحديد الأولويات، والعقلية، والمساءلة، وتحسين الجودة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل للتكلفة والمنفعة للمشروع الجديد ومقارنة النهج التقليدي بالرشيق وتقديمه لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دعوة أصحاب المصلحة لحضور جلسة صقل قائمة الأعمال (backlog) لفهم نطاق العمل ونهج التطوير.",
          "correct": false
        },
        {
          "text": "إرسال روابط فيديو لأصحاب المصلحة تشرح النهج الرشيقة ودراسات حالة داعمة من الصناعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لمشروع جديد. أثناء المراجعة الأولية لوثيقة ميثاق المشروع، تواصل مدير المشروع مع راعي المشروع لمناقشة معلومات مهمة مفقودة من الوثيقة.\n\nما المعلومة المناسبة التي يجب أن يطلبها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أهداف قابلة للقياس لعوامل النجاح الحرجة.",
          "correct": true
        },
        {
          "text": "وصف مفصل ومتطلبات المنتج النهائي.",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "خط الأساس لقياس الأداء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة تستخدم المنهجية التقليدية لإدارة المشاريع. أكمل مدير المشروع تدريبًا على الإدارة الرشيقة وبدأ في إدارة المشاريع باستخدام النهج الرشيق. لا يفهم أصحاب المصلحة المنهجية الجديدة ويجدون صعوبة في استيعابها.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد جلسة مع أصحاب المصلحة لتعريفهم بالمنهجية الرشيقة وشرح القيمة التجارية لتحديد الأولويات والمساءلة وتحسين الجودة من خلال المراجعات المتكررة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل للتكلفة والمنفعة للمشروع الجديد ومقارنة النهج التقليدي بالرشيق وتقديمه لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دعوة أصحاب المصلحة لحضور جلسة صقل قائمة الأعمال لفهم نطاق العمل ونهج التطوير.",
          "correct": false
        },
        {
          "text": "إرسال روابط فيديو لأصحاب المصلحة تشرح النهج الرشيقة بالإضافة إلى دراسات حالة داعمة من الصناعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عادةً ما يدير مكتب إدارة المشاريع (PMO) المشاريع باستخدام نهج الشلال (Waterfall). يتأثر مشروع حالي قيد التطوير بلوائح محلية يتم تحديثها بانتظام. يشعر فريق المشروع أن تطبيق تقنيات أجايل (Agile) سيفيد المشروع نظرًا لتغير اللوائح باستمرار.\n\nماذا يجب على مدير المشروع أن يفعل في هذا السيناريو؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستفادة من احتياطي الميزانية لإضافة موردين على دراية باللوائح إلى فريق المشروع.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لكيفية تأثير دمج منهجيات أجايل على المشروع.",
          "correct": true
        },
        {
          "text": "عرض هذا الطلب على مكتب إدارة المشاريع وراعي المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ الطلب وتدريب فريق المشروع على منهجيات أجايل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق المشروع بعصف ذهني لاختيار أفضل منهجية لإدارة المشاريع لتوصي بها للإدارة العليا. فكرة الفريق تتسم بتغيرات متكررة في المتطلبات، تغييرات تدريجية ومتكررة، تركيز على العميل، ومراحل محددة مع مستندات خاصة لتلبية معايير تنظيمية للصناعة.\n\nما هي المنهجية المفضلة لإدارة المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "أجايل (Agile)",
          "correct": false
        },
        {
          "text": "هجينة (Hybrid)",
          "correct": true
        },
        {
          "text": "تنبؤية (Predictive)",
          "correct": false
        },
        {
          "text": "شلال (Waterfall)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اعتمد فريق المشروع منهجية جديدة لإدارة المشاريع تتضمن عقد اجتماعات مراجعة واسترجاع منتظمة كل أسبوعين. بالإضافة إلى ذلك، هناك اجتماعات يومية، وتُستخدم الألواح البيضاء كأداة أساسية لتوثيق القرارات ونقاط العمل.\n\nما هي منهجية إدارة المشروع التي اعتمدها الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقليدية",
          "correct": false
        },
        {
          "text": "أجايل",
          "correct": true
        },
        {
          "text": "شلال",
          "correct": false
        },
        {
          "text": "تكرارية (Iterative)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع تقييم أداء المشروع، توصل الفريق إلى أن الأداء حتى تاريخ الحالة كان كما يلي: مؤشر أداء الجدول الزمني (SPI) = 0.5؛ مؤشر أداء التكلفة (CPI) = 1.5. حدد العميل أن الأداء في الجدول الزمني والتكلفة هو الأهم من حيث القيمة.\n\nاستنادًا إلى هذه الأرقام، أي من التالي يصف القيمة المقدمة للعميل حتى تاريخ الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قيمة تكلفة جيدة وقيمة جدول زمنية ضعيفة",
          "correct": true
        },
        {
          "text": "قيمة تكلفة ضعيفة وقيمة جدول زمنية جيدة",
          "correct": false
        },
        {
          "text": "قيمة تكلفة جيدة وقيمة جدول زمنية جيدة",
          "correct": false
        },
        {
          "text": "قيمة تكلفة ضعيفة وقيمة جدول زمنية ضعيفة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحدد فريق أجايل الأنشطة التي سيتم تنفيذها أولاً خلال التكرار القادم لتطوير منتج جديد. ما العامل الذي يجب أن يستخدموه لترتيب الأنشطة حسب الأولوية؟",
      "explanation": "",
      "choices": [
        {
          "text": "حجم النشاط",
          "correct": false
        },
        {
          "text": "قيمة النشاط لأصحاب المصلحة",
          "correct": true
        },
        {
          "text": "تكلفة النشاط",
          "correct": false
        },
        {
          "text": "سهولة تنفيذ النشاط",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في منتصف تنفيذ المشروع. يقرر عقد اجتماع إشراك أصحاب المصلحة مع الإدارة العليا والعملاء لفحص ما إذا كانت نتائج المشروع تحقق القيمة المرجوة للأعمال.\n\nأي من الوثائق تحتوي على معلومات أساسية لمساعدة مدير المشروع في ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "هيكل تقسيم العمل",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "بيان نطاق المشروع",
          "correct": false
        },
        {
          "text": "دراسة الجدوى (Business Case)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع هو جزء من مجموعة تركيز استراتيجية لإدارة المشاريع تقوم بعصف ذهني حول الطرق التي ستُستخدم بها المشاريع لإضافة قيمة تجارية للمؤسسة في الربع القادم. أي من العبارات التالية تصف بشكل عام كيف تستخدم المؤسسات المشاريع لإضافة قيمة تجارية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تُستخدم المشاريع لتطوير منتجات أو عمليات أو خدمات جديدة.",
          "correct": false
        },
        {
          "text": "تُستخدم المشاريع لتعديل المنتجات أو العمليات أو الخدمات الحالية.",
          "correct": false
        },
        {
          "text": "تُستخدم المشاريع لتسليم الأنشطة أو العمليات أو الخدمات اليومية.",
          "correct": false
        },
        {
          "text": "تُستخدم المشاريع لتطوير وتعديل المنتجات أو العمليات أو الخدمات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي المنهجية التي تستخدم أساليب جديدة لتنفيذ حلول للمشاكل التي تُواجه يوميًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "Ideation 2.0",
          "correct": true
        },
        {
          "text": "سكرم (Scrum)",
          "correct": false
        },
        {
          "text": "كانبان (Kanban)",
          "correct": false
        },
        {
          "text": "هجينة (Hybrid)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في منتصف تنفيذ مشروع يستخدم منهجية تنبؤية، وتُعلن المؤسسة عن الانتقال إلى نهج هجين. يطلب راعي المشروع من الفريق الانتقال فورًا إلى النهج الجديد رغم عدم وجود خبرة سابقة لديهم.\n\nما هو أفضل إجراء يجب أن يتخذه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إكمال تسليم المشروع باستخدام المنهجية التنبؤية.",
          "correct": false
        },
        {
          "text": "تمديد الجدول الزمني للمشروع لاستيعاب التغيير.",
          "correct": false
        },
        {
          "text": "إعادة تقييم نطاق المشروع وأولوية المهام الحرجة.",
          "correct": true
        },
        {
          "text": "طلب إعادة تصميم كاملة لخطة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "منظمة عالمية لطالما استخدمت إدارة المشاريع التنبؤية تتحول الآن إلى إدارة المشاريع بأسلوب أجايل. في أول مشروع أجايل في المنظمة، يفشل أعضاء الفريق عن بُعد في حضور الاجتماعات اليومية.\n\nكيف يمكن لمدير المشروع حل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استبدال أعضاء الفريق عن بُعد بأعضاء فريق موجودين في نفس الموقع.",
          "correct": false
        },
        {
          "text": "تخصيص مهام أقل أولوية لأعضاء الفريق عن بُعد.",
          "correct": false
        },
        {
          "text": "استخدام منصات الاجتماعات عبر الإنترنت للاجتماعات اليومية، وأخذ ساعات العمل لأعضاء الفريق عن بُعد في الاعتبار.",
          "correct": true
        },
        {
          "text": "استخدام جزء من ميزانية المشروع لتوفير تدريب على منهجيات أجايل لجميع أعضاء الفريق عن بُعد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع جزء من مشروع يستخدم إطار عمل سكرم (Scrum). يحتاج المدير إلى مراقبة سجل العوائق وتسهيل حل العوائق التي يثيرها الفريق.\n\nما هو الترتيب الصحيح للخطوات الخمس المستخدمة لإدارة سجل العوائق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد الأولويات، التسجيل، النشر، التواصل، المعالجة",
          "correct": false
        },
        {
          "text": "التسجيل، النشر، التواصل، تحديد الأولويات، المعالجة",
          "correct": false
        },
        {
          "text": "التسجيل، تحديد الأولويات، النشر، المعالجة، التواصل",
          "correct": true
        },
        {
          "text": "تحديد الأولويات، التسجيل، النشر، المعالجة، التواصل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع على مشروع يحتوي على العديد من الأطراف المعنية وأولويات متنافسة. ما هو الهدف الرئيسي لبدء وإجراء المفاوضات؟",
      "explanation": "",
      "choices": [
        {
          "text": "لتحديد نطاق العمل",
          "correct": false
        },
        {
          "text": "لحل النزاع",
          "correct": true
        },
        {
          "text": "لتقليل التكلفة",
          "correct": false
        },
        {
          "text": "لتقليل وقت التسليم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخطط مدير مشروع لإطلاق منتج عالمي. يخضع تصنيع المنتج لقيود زمنية صارمة تتعلق بخط الإنتاج وتوافر المواد الخام. وهناك أيضًا شكوك بشأن لوائح وضع العلامات الإقليمية التي يُتوقع أن تتغير خلال فترة الإطلاق.\n\nكيف يمكن لمدير المشروع دمج التخطيط والتطوير لمتطلبات العلامات غير المعروفة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام نهج هجين، يدمج تدفقات عمل العلامات التنبؤية في جدول زمني مرن (أجايل).",
          "correct": false
        },
        {
          "text": "استخدام نهج هجين، يدمج تدفق عمل العلامات بأسلوب أجايل في جدول زمني تنبؤي.",
          "correct": true
        },
        {
          "text": "تطبيق التخطيط بأسلوب أجايل على كل من التصنيع وتدفقات عمل العلامات لمواءمة العمل.",
          "correct": false
        },
        {
          "text": "تطبيق التخطيط التنبؤي على تدفق عمل العلامات وتبسيط عملية التحكم في التغييرات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فازت شركة مدير المشروع بمناقصة مشروع تحول رقمي بمواصفات واضحة من حيث النطاق والوقت والتكلفة. وكجزء من شروط المناقصة، قدمت الشركة أيضًا عدد الموارد المطلوبة لإكمال المشروع. يُعتبر المشروع استثمارًا ضخمًا، ويرغب العميل في مراقبة التقدم بانتظام.\n\nنظرًا لأن المشروع بسعر ثابت، ما هو النهج الذي يجب أن يتبعه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام نهج تنبؤي وإرسال تقارير الحالة اليومية للعميل.",
          "correct": false
        },
        {
          "text": "استخدام نهج أجايل وعرض كل قصة مكتملة بنجاح.",
          "correct": false
        },
        {
          "text": "استخدام نهج هجين وعرض كل وحدة مكتملة بنجاح.",
          "correct": true
        },
        {
          "text": "استخدام نهج تنبؤي وعرض كل وحدة مكتملة بنجاح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع بيئي جديد. وعند مراجعة عرض مقدم من بائع، حدد مدير المشروع مخاطرة فنية ستؤثر على التكلفة التشغيلية لشركته.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع المدير الوظيفي الخاص به.",
          "correct": false
        },
        {
          "text": "قبول المخاطرة والمضي قدمًا.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر الخاص بالمشروع.",
          "correct": true
        },
        {
          "text": "تقييم المخاطرة في ورشة عمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ العميل مدير المشروع بعدم قبوله لمخرجات المشروع. ماذا يجب أن يفعل مدير المشروع للحصول على الموافقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة معايير القبول مع العميل لمعالجة متطلبات المخرجات.",
          "correct": true
        },
        {
          "text": "مراجعة ميثاق المشروع وخطة مشاركة الأطراف المعنية مع العميل.",
          "correct": false
        },
        {
          "text": "فحص خطة إدارة الجودة مع العميل.",
          "correct": false
        },
        {
          "text": "تحديد اعتراضات العميل وإجراء تحليل للمخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد استلام ميثاق المشروع، يبدأ مدير المشروع في إعداد خطة إدارة المشروع. على الرغم من وجود كمية محدودة من المعلومات التفصيلية حول الأنشطة في مكتب إدارة المشاريع (PMO)، يحتاج مدير المشروع إلى حساب المدة المتوقعة للمشروع.\n\nما الذي يجب أن يستخدمه مدير المشروع لتحديد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدير التشبيهي (Analogous estimating)",
          "correct": true
        },
        {
          "text": "التقدير من الأسفل إلى الأعلى (Bottom-up estimating)",
          "correct": false
        },
        {
          "text": "ملاحظات اجتماع الإطلاق (Kick-off meeting feedback)",
          "correct": false
        },
        {
          "text": "مدخلات من راعي المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تطوير المشروع، يغادر مدير وظيفي الشركة ولم يعد يشارك في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل التغييرات.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        },
        {
          "text": "تحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تحديث سجل الافتراضات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ في مشروع إنشاءات، يتم تعيين عدة أعضاء جدد في الفريق من دول مختلفة.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة المشتريات",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "خطة إدارة الاتصالات",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع ملتزم بنجاح مشروع متعدد الجنسيات بمهل زمنية ضيقة. عضو جديد في الفريق يتأخر باستمرار أو يغيب عن اجتماعات الحالة. في لقاء فردي، يوضح عضو الفريق أنه يعتقد أن العمل على التسليمات أهم من حضور الاجتماعات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تعيين عضو الفريق إلى مشروع آخر بمهل زمنية أكثر مرونة.",
          "correct": false
        },
        {
          "text": "توثيق هذا السلوك في ملف الموظف.",
          "correct": false
        },
        {
          "text": "تشجيع حضور عضو الفريق للاجتماعات، ولكن التكيف إذا لم تتأثر الأعمال الحرجة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق للتأكيد على أن حضور اجتماعات الحالة أمر إلزامي.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعين راعي المشروع مدير مشروع لمشروع جديد وحرج. يتمتع هذا المشروع بقيود صارمة على الميزانية والوقت.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع المديرين الوظيفيين لتحديد جدول الموارد.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة للحصول على دعمهم وموافقتهم.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لفهم هدف المشروع والمتطلبات العامة.",
          "correct": true
        },
        {
          "text": "تحديث خطة إدارة المتطلبات لتعكس قيود الميزانية والوقت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصنيع في مرحلة التنفيذ. خلال اجتماع الحالة، أخبر أحد أعضاء الفريق مدير المشروع بأنه تم العثور على حل لفشل مستمر في أحد المعدات المستخدمة في التنفيذ؛ ومع ذلك، فإن هذا الحل مؤقت وقد يفشل الجهاز مرة أخرى في المستقبل.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل القضايا",
          "correct": true
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        },
        {
          "text": "سجل الافتراضات",
          "correct": false
        },
        {
          "text": "سجل أصحاب المصلحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يظهر المشروع انحرافًا سلبيًا في الجدول الزمني. يرى مدير المشروع أن أحد الفرق هو السبب في التأخيرات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع الفريق لتحديد استراتيجيات لحل التأخيرات.",
          "correct": true
        },
        {
          "text": "الاجتماع مع راعي المشروع لتحديد نهج للعودة إلى الجدول الزمني.",
          "correct": false
        },
        {
          "text": "إجراء تحليل للمخاطر لتحديد تأثير التأخيرات على نجاح المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع قسم الموارد البشرية لمناقشة الإجراءات الممكنة لإعادة المشروع إلى الجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في منظمة عالمية مسؤول عن مشروع يشمل ست شركات مختلفة. في منتصف المشروع، ينتقل أحد أصحاب المصلحة من شركة إلى أخرى.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إشراك أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "سجل أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد مقارنة النتائج الفعلية مع خط الأساس لقياس الأداء، يكتشف مدير المشروع أن مقاييس العمل والتكلفة في المشروع أفضل من المتوقع. يشك مدير المشروع في أن هذه الانحرافات الإيجابية يمكن أن تستمر حتى نهاية المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مراجعات الأداء مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع معقد في مرحلة التخطيط عندما حدد الراعي الحاجة إلى متخصص من دولة أجنبية. يعلم مدير المشروع أن الميزانية لا تسمح بتكاليف سفر هذا المتخصص.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تدريب أحد أعضاء الفريق الحالي على المهارات الخاصة.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير للحصول على ميزانية إضافية.",
          "correct": false
        },
        {
          "text": "العثور على بديل محلي.",
          "correct": false
        },
        {
          "text": "تعيين المتخصص في فريق افتراضي.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع رئيسي يجب إكماله في الوقت المحدد وتجاوز جميع مستويات الجودة المحددة. طوال المشروع، يأخذ مدير المشروع استراحات قهوة مع الفريق ويسألهم إن كانت لديهم أفكار لتحسين طريقة عملهم.\n\nنهج مدير المشروع يتماشى مع أي نظرية؟",
      "explanation": "",
      "choices": [
        {
          "text": "النظرية X",
          "correct": false
        },
        {
          "text": "النظرية Q",
          "correct": false
        },
        {
          "text": "النظرية Y",
          "correct": true
        },
        {
          "text": "النظرية T",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه مدير المشروع صعوبة في إدارة أصحاب المصلحة لأن سجل أصحاب المصلحة لا يوضح مدى وعيهم بالمشروع ليكون ناجحًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع لجنة التحكم بالتغيير (CCB) لتقييم تأثير تحديد أصحاب مصلحة جدد.",
          "correct": false
        },
        {
          "text": "تحديث خطة التواصل مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد مستوى تحمل المخاطر لكل صاحب مصلحة.",
          "correct": false
        },
        {
          "text": "تطوير مصفوفة تقييم مشاركة أصحاب المصلحة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نتيجة لتقليص كبير في الميزانية، تم استبدال لجنة توجيه المشروع براعٍ واحد للمشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "صياغة تحديث جديد للمشروع ومشاركته مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة الاتصالات لتعكس التغيير في مجتمع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB) لتوثيق التغيير في هيكل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع الراعي لمناقشة التغيير في الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحدد مدير المشروع مخاطر جديدة قد تؤثر على إنجاز المهام الحرجة. يحتاج مدير المشروع إلى عرض هذه المخاطر الجديدة على أصحاب المصلحة في التقرير الشهري للحالة.\n\nبالإضافة إلى تقرير المخاطر، ما الوثيقة التي يجب على مدير المشروع الرجوع إليها عند إعداد تقرير الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل المخاطر",
          "correct": true
        },
        {
          "text": "سجل الافتراضات",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        },
        {
          "text": "مصفوفة الاحتمالية والتأثير",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتعرف مدير المشروع على أن بعض المكونات يجب استيرادها لتلبية متطلبات المشروع. ومع ذلك، وبسبب تأثير محتمل لسعر صرف غير ملائم، يقرر مدير المشروع أن تحمل الخسارة غير مبرر ويختار عدم اتخاذ أي إجراء للتخفيف.\n\nما استراتيجية الاستجابة للمخاطر التي استخدمها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحويل",
          "correct": false
        },
        {
          "text": "التجنب",
          "correct": false
        },
        {
          "text": "التقليل",
          "correct": false
        },
        {
          "text": "القبول",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب مشروع من الاكتمال عندما يعلم مدير المشروع أن تغييرًا في اللوائح السوقية قد يؤثر على المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقق من سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديث خط الأساس للتكلفة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المخاطر.",
          "correct": true
        },
        {
          "text": "إجراء تحليل التكلفة والعائد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تريد شركة متعددة الجنسيات ذات مشروع عابر للحدود تنفيذ برنامج جديد سيؤثر على عدة أقسام. يحتاج مدير المشروع إلى ضمان توافق توقعات أصحاب المصلحة مع المنتج النهائي.\n\nما الذي يجب أن يطوره فريق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "بيان عمل المشروع (SOW)",
          "correct": false
        },
        {
          "text": "خطة إشراك أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "هيكل تقسيم المخاطر (RBS)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على خادم قديم لتطوير تطبيق برمجي. وقد طلب الفريق خادمًا جديدًا لاختبار المستخدم النهائي لأن الخادم القديم لا يمكنه تنفيذ هذا الاختبار. لم يصل الخادم الجديد في الوقت المحدد مما أدى إلى تأخير الاختبار.\n\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة وتعديل الجدول الزمني للمشروع أثناء انتظار وصول الخادم الجديد.",
          "correct": true
        },
        {
          "text": "إجراء اختبار المستخدم على الخادم الحالي.",
          "correct": false
        },
        {
          "text": "تخطي اختبار المستخدم والانتقال إلى المهمة التالية.",
          "correct": false
        },
        {
          "text": "مطالبة المورد بتسريع تسليم الخادم الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحاول مدير مشروع إشراك أصحاب المصلحة في مشروع جديد وقد دعاهم إلى اجتماعات الوقوف اليومية. ومع ذلك، لم يحضر أي من أصحاب المصلحة أي اجتماع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التواصل مع كل صاحب مصلحة بشكل فردي لفهم أسباب عدم الحضور.",
          "correct": true
        },
        {
          "text": "الاستمرار في عقد الاجتماعات كما هو مخطط وانتظار انضمام أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إلغاء الاجتماعات واستكشاف وسائل تواصل بديلة.",
          "correct": false
        },
        {
          "text": "تصعيد الأمر للإدارة العليا وطلب تدخلهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتعلم فريق المشروع كيفية استخدام الأساليب الرشيقة (Agile) في مشاريعهم. على الرغم من تحقيق أهداف الأداء، بدأ الفريق يفقد الحافز ويظهر عليه الملل أثناء الاجتماعات اليومية مما أصبح يمثل مصدر إزعاج.\n\nما الذي يمكن فعله في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدولة تمارين لبناء الفريق تركز على زيادة التفاعل.",
          "correct": false
        },
        {
          "text": "العمل مع الفريق على تحديد أهداف أكثر تحديًا لرفع مستوى الأداء.",
          "correct": true
        },
        {
          "text": "دعوة الراعي لحضور الاجتماع للتعامل مع السلوك المشتت.",
          "correct": false
        },
        {
          "text": "العمل مع الراعي لتحديد ميزانية يمكن استخدامها لتحفيز الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يفشل فريق المشروع بانتظام في تحقيق المعالم المحددة. يشعر أصحاب المصلحة بالقلق من أن المشروع سيفشل في تسليم النتائج في الموعد المحدد. كان مدير المشروع على علم بوجود صراعات داخل الفريق وتعلّم أن أحد أعضاء الفريق يفتقر إلى بعض المهارات اللازمة لإكمال المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تعيين عضو الفريق الذي يفتقر إلى المهارات إلى مهمة أخرى.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق لمناقشة المشكلات ووضع خطة لمعالجتها.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة أن المشروع سيتأخر ولا يمكن فعل شيء.",
          "correct": false
        },
        {
          "text": "فصل عضو الفريق الذي يفتقر إلى المهارات وتوظيف شخص آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروع تطوير لعميل خارجي في دولة أخرى. يجب على شركة مدير المشروع الامتثال للوائح معينة، وقد تم اختيار مشروع مدير المشروع للتدقيق. لا يعتقد العميل أن التدقيق ضروري وطلب من مدير المشروع عدم إزعاج فريق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استبعاد فريق التطوير من التدقيق حسب طلب العميل.",
          "correct": false
        },
        {
          "text": "بدء التدقيق دون إبلاغ العميل لأن الشركة ملزمة بالامتثال.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع اللجنة التوجيهية وجميع أصحاب المصلحة لمناقشة الأمر والتوصل إلى تفاهم مشترك.",
          "correct": false
        },
        {
          "text": "الاجتماع مع العميل لشرح ضرورة الامتثال للمتطلبات والمضي قدمًا في التدقيق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من يمتلك السلطة ليكون طرفًا أساسيًا في المشروع وصاحب قرار رئيسي طوال دورة حياة المشروع لضمان توافقه مع الأهداف التجارية؟",
      "explanation": "",
      "choices": [
        {
          "text": "مكتب إدارة المشاريع (PMO)",
          "correct": true
        },
        {
          "text": "مدير المشروع",
          "correct": false
        },
        {
          "text": "راعي المشروع",
          "correct": false
        },
        {
          "text": "العميل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع يومي، يقترح أحد أعضاء فريق المشروع تعديل بعض الميزات للاستفادة من فرصة جديدة. بينما يعبر عضو آخر عن قلقه بشأن تجربة المستخدم الناتجة عن الميزة المقترحة.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع مالك المنتج لمناقشة كل من الفرصة والقلق المتعلق بالتعديل المقترح.",
          "correct": true
        },
        {
          "text": "إجراء تصويت بين الفريق لتحديد ما إذا كان سيتم تضمين التعديل.",
          "correct": false
        },
        {
          "text": "تسجيل الفرصة في السجل الاحتياطي وتأجيل النقاش وطلب من الفريق مناقشة الأمر في الاجتماع التالي.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة والفريق لمناقشة كيفية المضي قدمًا بشأن التعديلات المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نفذت مؤسسة طريقة أجايل (Agile) في مشاريعها الأخيرة، ولكن جميع تلك المشاريع فشلت في تحقيق مواعيد التسليم. وكان الرعاة يضيفون طلبات جديدة باستمرار. تم تعيين مدير مشروع جديد في مشروع أجايل جديد ووجد أن الهدف غير واضح ولا يوجد تعريف واضح للانتهاء (DoD).\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم اجتماع مع أصحاب المصلحة لضمان تعريف خطة التواصل بشكل واضح.",
          "correct": false
        },
        {
          "text": "ضمان السماح للفريق باختيار أفضل الموارد التقنية لضمان نجاح المشروع.",
          "correct": false
        },
        {
          "text": "العمل عن كثب مع الفريق لوضع وتحديد رؤية واضحة للمشروع.",
          "correct": true
        },
        {
          "text": "العمل مع أصحاب المصلحة لضمان تحديد ميثاق المشروع والمخرجات بشكل واضح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروع أجايل مهم. خلال اجتماع الإطلاق، يحدد مدير المشروع السياسات والإجراءات التي يجب اتباعها طوال مدة المشروع. في منتصف المشروع، يكتشف مدير المشروع أن بعض أعضاء الفريق لا يتبعون الإجراءات المحددة.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع القسم القانوني لتوثيق السياسات والإجراءات وجعل أعضاء الفريق يوقعون على هذا المستند.",
          "correct": false
        },
        {
          "text": "العمل مع راعي المشروع لاستبدال الأعضاء الذين لا يتبعون الإجراءات المحددة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق لمراجعة السياسات والإجراءات مجددًا والتأكيد على أهميتها.",
          "correct": true
        },
        {
          "text": "تطوير برنامج حوافز لأولئك الذين يتبعون القواعد بشكل صحيح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب أحد أصحاب المصلحة في مشروع أجايل من مدير المشروع تقديم الوقت المتبقي المخطط له للمشروع.\n\nما الأداة التي يجب على مدير المشروع استخدامها لتقديم هذه المعلومة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل تخطيط البوكر (Planning Poker)",
          "correct": false
        },
        {
          "text": "مخطط الانحدار للإصدار (Release Burndown Chart)",
          "correct": true
        },
        {
          "text": "عدد نقاط القصص للمستخدمين المتبقين",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عادةً ما يعقد مدير المشروع جلسات تقييم بأثر رجعي في نهاية المشروع. ومع ذلك، يعتقد الراعي أن هذه الجلسات مضيعة للوقت والميزانية، ويأمر بتقليلها أو إلغائها بشكل كبير في المشاريع المستقبلية.\n\nما النتيجة المحتملة لهذا التوجيه؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز يتحول إلى مناقشة المشكلات بدلاً من تحديد طرق التحسين للمشاريع المستقبلية.",
          "correct": true
        },
        {
          "text": "يتم فقدان فرصة تحسين عمليات الفريق استنادًا إلى ملاحظات المشروع المحددة.",
          "correct": false
        },
        {
          "text": "يتم التركيز على ملاحظات أصحاب المصلحة حول أداء المشروع.",
          "correct": false
        },
        {
          "text": "لا يتم تحديث خطة إدارة الوقت بشكل صحيح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينتقل مكتب إدارة المشاريع (PMO) من استخدام النهج التقليدي إلى إدارة المشاريع بأسلوب أجايل. تم تدريب الفريق على أجايل لكنه يواجه مشكلات في التعامل مع المدراء التنفيذيين في الشركة باستخدام العمليات الجديدة.\n\nكيف يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعوة المدراء التنفيذيين إلى الاجتماعات اليومية ليتعلموا أهمية المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع المدراء التنفيذيين لتدريبهم على فوائد ممارسات أجايل.",
          "correct": true
        },
        {
          "text": "إبلاغ مكتب إدارة المشاريع بأن المشروع يجب أن يستخدم النهج التقليدي لأنه لن ينجح دون قبول المدراء التنفيذيين.",
          "correct": false
        },
        {
          "text": "استبدال أصحاب المصلحة الحاليين بالمدراء التنفيذيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتعاون فريقان يعملان بأسلوب أجايل في مشروع مشترك. مخرجات الفريق A غير مكتملة بالشكل الكافي ليقوم الفريق B بدمجها ضمن مهامه.\n\nوفقًا لمبادئ القيادة الخدمية (Servant Leadership) وأجايل، كيف يجب على مدير المشروع حل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يساعد مدير المشروع الفريق A في حل المشكلة، ويقوم الفريق A بتحديد كيفية تنفيذ الحل.",
          "correct": true
        },
        {
          "text": "يقدم الفريق B طلب تغيير للفريق A، ويتولى الفريق A اعتماد التغيير.",
          "correct": false
        },
        {
          "text": "يحدد الفريق B كيف يقوم الفريق A بتنفيذ التغيير، ويشرف مدير المشروع.",
          "correct": false
        },
        {
          "text": "يقرر مدير المشروع كيف يقوم الفريق A بتنفيذ التغيير، ويحدد معايير القبول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو العامل الرئيسي الذي تهدف القيادة الخدمية إلى ترسيخه لتحسين أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "الثقة",
          "correct": true
        },
        {
          "text": "التركيز",
          "correct": false
        },
        {
          "text": "السرعة",
          "correct": false
        },
        {
          "text": "الدقة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع الفريق، ناقش الأعضاء التبعيات الخارجية للمشروع وطلبوا نصيحة مدير المشروع.\n\nما الذي يجب أن يطلبه مدير المشروع من الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب على الفريق حصر المنتجات التي أطلقها المنافسون ومحاولة تقليد أسلوبهم.",
          "correct": false
        },
        {
          "text": "يجب على الفريق سرد جميع التبعيات الخارجية وتقييم تأثيرها على تسليمات المشروع.",
          "correct": true
        },
        {
          "text": "يجب على الفريق سرد تأثير دخول منافس جديد للسوق.",
          "correct": false
        },
        {
          "text": "يجب على الفريق التركيز على المهام المخصصة لهم ونسيان التبعيات الخارجية لأنها لن تؤثر على عملهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع أجايل جديد، يستخدم الفريق طريقة كانبان. يعمل لوح كانبان كأداة عرض معلومات لأي شخص يراه، حيث يعرض حالة العمل الحالية للفريق.\n\nكيف يتم اعتبار تقنية لوحة كانبان؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقنية منخفضة ولكن عالية التفاعل (Low-tech, high-touch)",
          "correct": true
        },
        {
          "text": "أداة مستخدمة في دورة PDCA",
          "correct": false
        },
        {
          "text": "تستخدم لإظهار الأعمال المنجزة",
          "correct": false
        },
        {
          "text": "لوحة لتقدير نقاط القصص",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند إتمام عقد طويل الأمد، يؤكد مدير المشروع مع مدير الإصدار أن جميع الميزات المخططة تعمل بشكل صحيح كما تم التحقق منها من قبل فريق ضمان الجودة. ثم يبلغ مدير المشروع العملاء وأصحاب المصلحة بذلك ويحصل على الموافقة لإغلاق المشروع. تم الآن إغلاق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع لضمان توفر المعرفة المكتسبة من هذا المشروع للمراجع المستقبلية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث قاعدة المعرفة للدروس المستفادة.",
          "correct": true
        },
        {
          "text": "تحديث سجل المخاطر قبل إبلاغ أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تحديث وأرشفة ملف المشتريات النهائي.",
          "correct": false
        },
        {
          "text": "إغلاق وثائق تقييم أداء البائع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع مشروعًا لتقديم منتج جديد إلى السوق. طلب راعي المشروع توسيع نطاق العمل وتسليم \"نسخة موسعة\" من المنتج النهائي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب تأكيد رسمي على التغيير.",
          "correct": false
        },
        {
          "text": "الحصول على موافقة أصحاب المصلحة لتعديل الميزانية.",
          "correct": false
        },
        {
          "text": "بدء عملية التحكم المتكاملة في التغيير.",
          "correct": true
        },
        {
          "text": "تحديث خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع مشروع بنية تحتية معقد وحيوي لنمو الشركة. في المراحل الأولية للمشروع، يحدد مدير المشروع صاحب مصلحة ذو تأثير كبير لكنه يعارض المشروع. دعم هذا الشخص ضروري لنجاح المشروع، لكنه أعرب عن مخاوف وتحفظات.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير خطة لإشراك أصحاب المصلحة تتضمن استراتيجيات لمعالجة مخاوف هذا الطرف المقاوم.",
          "correct": true
        },
        {
          "text": "استبعاد صاحب المصلحة المقاوم من المشروع لتجنب الاضطرابات والتركيز على المشروع.",
          "correct": false
        },
        {
          "text": "تعيين أحد أعضاء الفريق لإدارة صاحب المصلحة المقاوم والتركيز على إشراك الآخرين.",
          "correct": false
        },
        {
          "text": "طلب تدخل الإدارة العليا لإقناع صاحب المصلحة بأهمية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة دورية مع أصحاب المصلحة، يسأل راعي المشروع كيف سيتم قياس الإنجاز المرضي للتسليمات وكيف سيتم تطبيق تلك القياسات.\n\nأين يمكن لمدير المشروع أن يجد هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة النطاق.",
          "correct": false
        },
        {
          "text": "خطة إدارة المتطلبات.",
          "correct": true
        },
        {
          "text": "خطة إدارة الجودة.",
          "correct": false
        },
        {
          "text": "تقارير أداء العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشكك مدير وظيفي فيما إذا كانت بعض جوانب المشروع تتماشى مع أهداف المشروع.\n\nما الوثيقة التي يجب على مدير المشروع مراجعتها لمعالجة قلق المدير الوظيفي؟",
      "explanation": "",
      "choices": [
        {
          "text": "بيان العمل (SOW)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "نظام معلومات إدارة المشروع (PMIS)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يطلب أحد أصحاب المصلحة الرئيسيين إجراء تغيير من شأنه حل مشكلة حرجة قد تؤثر على استمرارية العمليات. ومع ذلك، فإن المشروع يقترب من الانتهاء، وسيؤدي التغيير إلى زيادة التكلفة الإجمالية وتأخير تاريخ الانتهاء.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تفويض قرار أهمية التغيير إلى صاحب مصلحة أكثر خبرة.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم في التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تعديل هيكل تقسيم العمل (WBS) وبيان نطاق المشروع لتضمين التغيير.",
          "correct": false
        },
        {
          "text": "إبلاغ راعي المشروع بالتأثير على الميزانية والجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة تنفيذ المشروع، يكتشف مدير المشروع أن المعلومات لم تُرسل إلى أصحاب المصلحة بالمستوى المتوقع من التفاصيل.\n\nما هو الأثر الأكثر احتمالاً للتواصل الضعيف مع أصحاب المصلحة في مرحلة التنفيذ؟",
      "explanation": "",
      "choices": [
        {
          "text": "انخفاض ثقة المشروع.",
          "correct": true
        },
        {
          "text": "زيادة تكاليف المشروع.",
          "correct": false
        },
        {
          "text": "انخفاض جودة المشروع.",
          "correct": false
        },
        {
          "text": "تأخر في الجدول الزمني للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ مدير المشروع مشكلات في أداء الجدول الزمني بسبب مستويات خبرة موارد المشروع. بعض الموارد المتمرسة تتحقق من تفاصيل غير ضرورية، وبعض الموارد الأقل خبرة تستغرق وقتًا طويلاً لإكمال المهام.\n\nما الذي يجب أن يفعله مدير المشروع لمساعدة الفريق على تحسين أدائه؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد الفجوات المعرفية لكل فرد ومعالجتها من خلال التدريب.",
          "correct": true
        },
        {
          "text": "تسجيل ذلك في سجل المخاطر ومعالجة ذلك مع الفريق أثناء جلسة الاستعراض.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بأن التسليم لن يكون متاحًا في الوقت المحدد بسبب نقص الخبرة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع قسم الموارد البشرية لمعالجة الأفراد الذين يفتقرون إلى المهارات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجتمع قائد فريق المشروع مع مدير المشروع قبل اجتماع الإطلاق المجدول. يشعر القائد بالقلق من أن التوقعات المتعلقة بتسليمات المشروع قد لا تكون واقعية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الحالة التجارية للمشروع ونتائج دراسة الجدوى.",
          "correct": true
        },
        {
          "text": "تيسير اجتماع بين راعي المشروع وقائد الفريق لمناقشة المخاوف.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة لمناقشة المخاوف وتسجيل استنتاجاتهم في خطة إشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد المخاطر والاستجابات المتفق عليها وتعديل سجل المخاطر وفقًا لذلك.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر مدير المشروع بالقلق من أن أعضاء الفريق يقضون وقتًا طويلاً في مساعدة موظفي العمليات والصيانة في أحد مكونات المشروع المكتملة والمسلّمة مؤخرًا. وقد راجع مدير المشروع وثائق الأصول التنظيمية للتحقق من أن المكون تم توقيعه وتم نقل الملكية.\n\nإلى أي وثائق إضافية يجب أن يشير مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "بيان عمل المشتريات وتقارير أداء العمل",
          "correct": false
        },
        {
          "text": "خطة إدارة المتطلبات وخطة إدارة التغيير",
          "correct": false
        },
        {
          "text": "خطة إدارة المشتريات وميثاق المشروع",
          "correct": false
        },
        {
          "text": "التقرير النهائي وتحديثات وثائق المشروع",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينفذ فريق المشروع تغييرًا تمت الموافقة عليه من قبل لجنة التحكم في التغيير (CCB). كان الهدف من التغيير تقليل المخاطر، لكنه أدى إلى نتيجة عكسية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذه النتيجة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من فعالية استجابة المخاطر ومتابعة التقدم.",
          "correct": true
        },
        {
          "text": "تحديث سجل الافتراضات بتفاصيل حول المخاطر.",
          "correct": false
        },
        {
          "text": "إجراء تحليل للمخاطر لتحديد مدى التعرض لمخاطر المشروع.",
          "correct": false
        },
        {
          "text": "تطوير مصفوفة الاحتمالية والأثر لتحديد أولوية المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يبلغ مورد أداة لمشروع تصنيع مدير المشروع بأن تسليم الأداة سيتأخر. يطلب مدير المشروع الأداة من مورد آخر. بعد وصول الأداة من المورد الثاني، يقوم المورد الأصلي بتسليم الأداة وتقديم فاتورة وفقًا لاتفاقية الشراء.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرجاع الأداة إلى المورد الأصلي ورفض دفع الفاتورة لأن التسليم كان متأخرًا.",
          "correct": false
        },
        {
          "text": "الاحتفاظ بالأداة الإضافية كاحتياطي، ودفع الفاتورة من الاحتياطي المالي، وتحديث سجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "مراجعة اتفاقية الشراء مع المورد الأصلي لتطبيق شروط التأخير، وإبلاغ المستشار القانوني بالمشكلة.",
          "correct": true
        },
        {
          "text": "مقارنة جودة الأداتين، واختيار الأداة ذات القيمة الأفضل، وإرجاع الأخرى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتجنب أحد الخبراء في الفريق أداء المهام التي تتطلب العمل مع مقاول أجنبي. كيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الخبير على انفراد حول تحفظاته أو تحيزاته والإصرار على تبني سلوك شامل للجميع.",
          "correct": true
        },
        {
          "text": "إصدار تحذير تأديبي للخبير وإبلاغ مديره الوظيفي لإرساله إلى تدريب على التنوع.",
          "correct": false
        },
        {
          "text": "تجنّب التأخير والنزاعات من خلال توظيف مستشار يوافق الخبير على العمل معه.",
          "correct": false
        },
        {
          "text": "تأنيب الخبير على سلوكه التمييزي خلال اجتماع الفريق لتقديم مثال يُحتذى به.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم مشروع نهجًا هجينًا وكان أداء الفريق ممتازًا باستمرار خلال المراحل التنبؤية. خلال المراحل التزايدية، بدأ الفريق يُظهر علامات تدني المعنويات، وضعف الالتزام، ووجود صراعات، وارتباك. ومع ذلك، يواصل أحد أعضاء الفريق إظهار الثقة والتفوق في الأداء خلال هذه المرحلة.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاعتراف بعضو الفريق عالي الأداء كنموذج يجب أن يحتذي به الآخرون.",
          "correct": false
        },
        {
          "text": "توفير تدريب إضافي للفريق حول العمليات الرشيقة (Agile).",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة مع راعي المشروع والعودة إلى استخدام النهج التنبؤي فقط.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق لمناقشة المشكلات وتطوير خطة لمعالجتها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع تقني. خلال اجتماع مراجعة تكرار، يدخل عدد من أصحاب المصلحة الرئيسيين في نقاش محتدم حول قدرات النموذج الأولي.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخطيط جلسة عصف ذهني مع فريق المشروع لإيجاد حل للمشكلة.",
          "correct": false
        },
        {
          "text": "تحديد مصدر الصراع بين أصحاب المصلحة ومعالجة القضية.",
          "correct": true
        },
        {
          "text": "إعداد قائمة بالإيجابيات والسلبيات لتحديد تأثير هذا الصراع.",
          "correct": false
        },
        {
          "text": "دعوة راعي المشروع للتدخل والعمل كوسيط بين أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يمتلك مشروع الخصائص التالية:\n\n- طُلب من مدير المشروع تقديم نتيجة أعمال ضمن جدول زمني مضغوط؛ حيث كان الجدول الأصلي شهرًا، وأصبح المطلوب أسبوعين.\n- خلال نشاط تخطيط الموارد، علم مدير المشروع من عضو فريق آخر بعدم توفر أي موارد تقنية، ولكنه يعرف مدير الموارد التقنية من مشروع سابق.\n\nما هو أول إجراء يجب أن يتخذه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طُلب من مدير المشروع تقديم نتيجة أعمال ضمن جدول زمني مضغوط؛ حيث كان الجدول الأصلي شهرًا، وأصبح المطلوب أسبوعين.",
          "correct": false
        },
        {
          "text": "علم مدير المشروع من عضو فريق آخر بعدم توفر أي موارد تقنية، ولكنه يعرف مدير الموارد التقنية من مشروع سابق.",
          "correct": false
        },
        {
          "text": "ضمان أن مالك المنتج على علم بوجود مشكلة في الحصول على مورد تقني.",
          "correct": true
        },
        {
          "text": "تصعيد مشكلة الموارد التقنية للإدارة العليا.",
          "correct": false
        },
        {
          "text": "التحقق من توفر الموارد من خلال الاجتماع مع مدير الموارد التقنية المعروف سابقًا.",
          "correct": false
        },
        {
          "text": "الاتصال بمورد خارجي للحصول على مورد تقني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يمتلك مشروع هجين الخصائص التالية:\n\n- في مراحله المبكرة.\n- لديه فريق جديد تمامًا.\n- سيكون مدير المشروع مشغولًا جدًا في تنفيذ مشاريع أخرى خلال الأسبوعين الأولين من المشروع.\n\nكيف يجب على مدير المشروع تطوير الفريق الجديد خلال هذه المرحلة المبكرة؟",
      "explanation": "",
      "choices": [
        {
          "text": "في مراحله المبكرة.",
          "correct": true
        },
        {
          "text": "لديه فريق جديد تمامًا.",
          "correct": false
        },
        {
          "text": "سيكون مدير المشروع مشغولًا جدًا في تنفيذ مشاريع أخرى خلال الأسبوعين الأولين.",
          "correct": false
        },
        {
          "text": "ضمان فهم الفريق لمبادئ التنظيم الذاتي.",
          "correct": false
        },
        {
          "text": "تخطيط واستضافة عدة فعاليات لبناء الفريق لتعزيز التعاون.",
          "correct": false
        },
        {
          "text": "توفير تحديثات يومية لحالة المشروع لإبقاء الفريق على اطلاع.",
          "correct": false
        },
        {
          "text": "التعرف على كل عضو من أعضاء الفريق من خلال محادثات فردية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر جميع أصحاب المصلحة الأربعة الرئيسيين في المشروع بالقلق من أن خطة الإصدار الحالية لن تفي بالاحتياجات العاجلة للأعمال. يحتاج مدير المشروع إلى ضمان أن الفريق سيوفر القيمة المطلوبة ضمن الجداول الزمنية المحددة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم هيكل تقسيم العمل (WBS) وإعادة التفاوض على النطاق مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة وأعضاء الفريق لتحديد الحد الأدنى من المنتج القابل للتسليم (MVP) اللازم للإطلاق.",
          "correct": true
        },
        {
          "text": "حساب مؤشر أداء الجدول الزمني (SPI) وتصعيد خطر الجدول الزمني إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "تعديل خط الأساس للجدول الزمني لتلبية احتياجات أصحاب المصلحة ومتابعة التقدم باستخدام مخطط الحرق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتوي المشروع على الخصائص التالية:\n\n- تم إعداد مراجعات دورية للمشروع.\n- خلال المراجعة الرابعة، طلب العميل تغيير النهج التقني للمنتج قيد التطوير.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تم إعداد مراجعات دورية للمشروع.",
          "correct": false
        },
        {
          "text": "خلال المراجعة الرابعة، طلب العميل تغيير النهج التقني للمنتج قيد التطوير.",
          "correct": true
        },
        {
          "text": "إبلاغ أعضاء الفريق بتنفيذ النهج الجديد فورًا.",
          "correct": false
        },
        {
          "text": "السماح للفريق باختيار النهج الأنسب والتحقق من النتائج مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دراسة النهج المقترح مع أصحاب المصلحة واختيار ما هو الأنسب للفريق.",
          "correct": false
        },
        {
          "text": "طلب من الفريق إجراء مقارنة معيارية للنهج للحصول على دعم الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال التكرار الرابع لتطوير المنتج، أدرك مدير المشروع أن البرنامج المستخدم لخطة إدارة المشروع لا يسمح بإجراء التحديثات المخطط لها.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختيار أحد أعضاء الفريق لتحديث قالب خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "استنادًا إلى القيمة التجارية للتكرارات القادمة، اختيار أولوية للأنشطة.",
          "correct": false
        },
        {
          "text": "حل المشكلة بشكل مستقل حتى لا يتشتت أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "إضافة المشكلة كمخاطر جديدة في سجل المخاطر واقتراح إجراءات تصحيحية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة تركز بشكل كبير على استخدام النهج التنبئي في تنفيذ المشاريع بتوظيف مدير مشروع جديد يستخدم النهج الهجين. يحتوي نطاق المشروع على عدد من المتطلبات غير الواضحة.\n\nكيف يجب أن يخطط مدير المشروع لتسليم المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد مسألة المتطلبات غير الواضحة إلى الإدارة والانتظار للحصول على التفويض النهائي.",
          "correct": false
        },
        {
          "text": "تفصيل المتطلبات وتحديد أولوياتها إلى حزم عمل تكرارية.",
          "correct": true
        },
        {
          "text": "تجاهل المتطلبات غير الواضحة والتركيز على خطة تسليم المشروع.",
          "correct": false
        },
        {
          "text": "الانتظار حتى تصبح المتطلبات أكثر وضوحًا قبل اتخاذ أي إجراء إضافي في المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مبادرة استراتيجية رئيسية تهدف إلى التكيف مع السوق والاستجابة السريعة لاتجاهاته.\n\nما النشاط الذي يجب على مدير المشروع إعطاؤه الأولوية أولاً لضمان النجاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مراجعات دورية لخطط المشروع وأهدافه وتسليماته لضمان تسجيل جميع البيانات.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي من الراعي لتوظيف موارد ماهرة وتحسين الجودة.",
          "correct": false
        },
        {
          "text": "مراجعة أهداف المشروع بشكل تعاوني مع الراعي للاتفاق على خطط وتسليمات قابلة للتحقيق.",
          "correct": true
        },
        {
          "text": "إنشاء حالة عمل بعد مراجعة السوق لتعديل التسليمات بناءً على الأهداف الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت الموافقة على طلب تغيير يضيف حافزًا إلى عقد مبلغ إجمالي إذا تمكن المقاول من الحفاظ على الجدول الزمني الحالي لخط الأساس. ما الذي يجب تحديثه الآن؟",
      "explanation": "",
      "choices": [
        {
          "text": "خط الأساس للنطاق",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "خط الأساس للتكلفة",
          "correct": true
        },
        {
          "text": "خط الأساس للجدول الزمني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم مؤسسة بتطوير منتج جديد. ما الذي يجب على مدير المشروع الخاص بهذا التطوير فعله أولاً لتحسين نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع مكتب إدارة المشاريع (PMO) لتطوير جدول زمني مفصل للمشروع.",
          "correct": false
        },
        {
          "text": "العمل مع فريق التسويق لإجراء تحليل تأثير لتحديد السوق المستهدف.",
          "correct": false
        },
        {
          "text": "العمل مع راعي المشروع لتحديد رؤية المشروع والمبادرة العامة.",
          "correct": true
        },
        {
          "text": "العمل مع أصحاب المصلحة لتحديد أعضاء الفريق المناسبين للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يتضمن العديد من أصحاب المصلحة وأولويات متضاربة. كل صاحب مصلحة يرغب في الحصول على أكبر قدر ممكن من الموارد المتاحة للوظائف المطلوبة.\n\nعلى ماذا يجب أن يركز مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تلبية المصالح الشخصية لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تلبية المصالح المشتركة لجميع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "الحفاظ على العلاقات والانسجام مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دفع أصحاب المصلحة لقبول وجهة نظر مدير المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بصفتك مدير مشروع في شركة تكنولوجيا، هناك حاجة إلى تغيير في النطاق لتنفيذ تعديل في المشروع. ما الأدوات التي يمكن استخدامها لفهم تأثير التغيير بشكل أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط باريتو",
          "correct": false
        },
        {
          "text": "مخطط هيكل السمكة",
          "correct": false
        },
        {
          "text": "دورة ديمنغ (PDCA)",
          "correct": true
        },
        {
          "text": "مخطط السبب والأثر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم إنشاء منتج جديد من قبل فريق رشيق (agile)، ولكن لدى الفريق وقت محدود لإكماله. بسبب هذه الظروف، من المهم أن يحافظ الفريق على التعاون طوال مدة المشروع.\n\nلبناء التضامن بين أعضاء الفريق، ما الذي يجب أن يفعله قائد المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء بروتوكولات للتعامل مع السبرينت (sprints) خلال اجتماع الفريق.",
          "correct": false
        },
        {
          "text": "تيسير الاجتماعات مع كل عضو في الفريق لفهم أهداف المشروع.",
          "correct": true
        },
        {
          "text": "مناقشة تقدم المنتج مع أعضاء الفريق باستخدام مخطط الحرق (burndown chart).",
          "correct": false
        },
        {
          "text": "تحليل خريطة المشروع لإصدار المنتج مع أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعضاء من فريق أجايل يتأخرون باستمرار عن حضور الاجتماعات اليومية ولا يحققون تواريخ الأهداف المحددة للمشروع. يفترض قائد المشروع أن السبب قد يكون صعوبة في إدارة المهام ذاتيًا داخل الفريق.\n\nما الإجراء الذي يجب أن يتخذه قائد المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مساعدة الفريق على صياغة اتفاقية فيما بينهم تتضمن المعايير السلوكية المرغوبة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع الفريق لمراجعة المشكلات وتفصيل الإجراءات لحلها.",
          "correct": false
        },
        {
          "text": "تولي دور قيادي أعلى وتقديم مثال للسلوك المطلوب.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب للفريق حول أجايل وإدارة الوقت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع أجايل مشروع تطوير نظام برمجي جديد، وهو الآن في مرحلة اختبار قبول المستخدم. تلقى مدير المشروع ملاحظات إيجابية من معظم أصحاب المصلحة في العمل، لكن مدير تكنولوجيا المعلومات غير راضٍ.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة حضور مدير تكنولوجيا المعلومات في الاجتماعات السابقة للمشروع.",
          "correct": false
        },
        {
          "text": "تحليل المتطلبات التي تم الموافقة عليها للمشروع مع مدير تكنولوجيا المعلومات.",
          "correct": false
        },
        {
          "text": "مناقشة مخاوف مدير تكنولوجيا المعلومات مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "جمع ملاحظات مباشرة وصريحة من مدير تكنولوجيا المعلومات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مشروع أجايل جديد، ظهرت عوائق تتعلق بالميزانية وإدارة الوقت. قدم فريق ضمان الجودة عن بُعد قائمة طويلة من العيوب بعد إكمال بضع سباقات (sprints). استنتج مدير المشروع أن المشكلات ناتجة عن سوء تفسير لغوي وليس عن جودة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعداد وتنفيذ جلسات مع الفريق الكامل لمراجعة قائمة المهام المطلوبة ووصفها.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع فريق ضمان الجودة والتعبير عن القلق بشأن ملاحظاتهم.",
          "correct": false
        },
        {
          "text": "طلب زيادة مالية من مجلس التحكم في التغيير (CCB) لتوظيف فريق ضمان جودة محلي بدلاً من الفريق عن بُعد.",
          "correct": false
        },
        {
          "text": "دمج فريق ضمان الجودة مع فريق التطوير لإجراء الاختبارات في نهاية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، اكتشف فريق المالية أنهم لم يشاركوا في إعداد دراسة الجدوى للمشروع، ورفضوا الموافقة على العائد المتوقع على الاستثمار (ROI). ما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مواصلة التطوير بناءً على خطة إدارة المشروع ومعالجة المشكلة بعد التسليم.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة النطاق وتسجيل ذلك كمخاطرة تؤثر على المشروع بأكمله.",
          "correct": false
        },
        {
          "text": "تحديد اجتماع مع مالك المنتج وفريق المالية للاتفاق على تصحيحات المسار.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة التواصل وإجراء التعديلات اللازمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قدّم مالك المنتج قائمة الأعمال للفريق، وأثار الفريق مخاوف بشأن تنفيذ بعض الميزات بسبب العديد من العوائق. ما الذي يجب أن يقترحه مدير المشروع على مالك المنتج؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقدير التأثير المالي للعوائق وطلب تمويل إضافي.",
          "correct": false
        },
        {
          "text": "تسجيل العوائق وإبلاغ الإدارة بالحاجة إلى مساعدتهم في حل هذه العوائق.",
          "correct": false
        },
        {
          "text": "التأكد من تسجيل العوائق وترتيب أولوياتها بناءً على الميزات ذات القيمة الأعلى.",
          "correct": true
        },
        {
          "text": "البدء في إزالة العوائق بدءًا من الأسهل لتعزيز شعور الإنجاز لدى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرر مالك المنتج إطلاق المنتج بعد بضع نسخ، مع العلم أن الحد الأدنى القابل للتسويق (MVP) يفتقر إلى بعض الميزات. أحد أصحاب المصلحة الرئيسيين، نائب رئيس التسويق، غير راضٍ عن النتائج وتساءل عن قرار الإطلاق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تدريب الفريق على عملية اتخاذ القرار مع افتراض استراتيجية متحفظة تجاه إطلاق المنتجات.",
          "correct": false
        },
        {
          "text": "دعم قرار مالك المنتج والعمل على تحسين التوافق مع هذا صاحب المصلحة لتجنب مثل هذه القضايا مستقبلاً.",
          "correct": true
        },
        {
          "text": "تحمل المسؤولية عن قرارات الإطلاق واتخاذ القرار النهائي بشأن موعد الإطلاق للعملاء.",
          "correct": false
        },
        {
          "text": "تصعيد المسألة إلى الراعي وطرح تساؤلات حول صلاحيات صاحب المصلحة في اتخاذ قرارات الإطلاق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة منتجات بتحويل طريقة تطويرها وإطلاقها للمنتجات في السوق. يرى التنفيذيون أن هذه مبادرة عالية المخاطر ويجب أن تنجح.\n\nما الذي يجب أن يفعله مدير المشروع في هذا السيناريو؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع خطة لإدارة الاتصالات لإبلاغ الموظفين بنموذج العمل الجديد.",
          "correct": false
        },
        {
          "text": "تطوير خطة سباقات تفصيلية بأهداف واضحة.",
          "correct": false
        },
        {
          "text": "اعتماد نهج تدريجي في التنفيذ يقدم أعلى قيمة تجارية في وقت مبكر.",
          "correct": true
        },
        {
          "text": "إعداد دراسة جدوى مع افتراضات للنموذج الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "الفريق جاهز لبدء العمل على مشروع مع عميل كان من الصعب التعامل معه في الماضي لأنه لم يكن قادرًا على وصف ما يريده بدقة. ما النهج الذي يجب أن يتبعه مدير المشروع لإزالة هذا العائق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير خطة مع مواعيد نهائية ومراقبتها لتقليل وقت إكمال المنتج.",
          "correct": false
        },
        {
          "text": "العمل مع مالك المنتج لتعريف الحد الأدنى من المنتج القابل للتسويق (MVP).",
          "correct": true
        },
        {
          "text": "اتباع نهج توقعي للحصول على قبول رسمي لكل منتج.",
          "correct": false
        },
        {
          "text": "تعزيز مهارات التفاوض والمهارات الشخصية لدى الفريق من خلال التدريب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم نقل مدير مشروع إلى قسم جديد وأصبح مسؤولًا عن مشروع قائم في مجال غير مألوف. عند محاولة فهم المخاطر في هذا المشروع الذي يستخدم المنهجية الرشيقة (Agile)، ما الأداة الأساسية التي يجب أن يستخدمها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مقابلة مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "مناقشات تعاونية.",
          "correct": true
        },
        {
          "text": "تقييمات الاحتمالات.",
          "correct": false
        },
        {
          "text": "ورش عمل لتفادي المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقترب مواعيد تسليم نتائج المشروع، ولكن أداء أحد أعضاء الفريق يؤثر سلبًا على الجدول الزمني. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعيين مورد أكثر مهارة.",
          "correct": false
        },
        {
          "text": "إزالة عضو الفريق من المشروع.",
          "correct": false
        },
        {
          "text": "توجيه عضو الفريق ومساعدته.",
          "correct": true
        },
        {
          "text": "طلب من مدير الموظف تقديم تدريب له.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يدير مشروعًا لا تزال المتطلبات فيه غير معروفة تمامًا ويوجد مستوى عالٍ من عدم اليقين. ما هي المنهجية التي يجب استخدامها لهذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "المنهجية الرشيقة (Agile)",
          "correct": true
        },
        {
          "text": "المنهجية الهجينة (Hybrid)",
          "correct": false
        },
        {
          "text": "المنهجية التنبؤية (Predictive)",
          "correct": false
        },
        {
          "text": "منهجية الشلال (Waterfall)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بدخول سوق جديد ولكن ليس لديها خبرة سابقة في هذا المجال. مدير المشروع يواجه صعوبة في تصور متطلبات المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الرجوع إلى ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "إعادة تقييم أهداف المشروع التجاري.",
          "correct": false
        },
        {
          "text": "البحث عن مدخلات محتملة من العملاء.",
          "correct": true
        },
        {
          "text": "إجراء دراسة جدوى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعتمد المشروع على موثوقية أحد المكونات. يقترح مدير المشروع تصميم التكرار في النظام لتقليل تأثير فشل هذا المكون على نجاح المشروع.\n\nما نوع استراتيجية الاستجابة للمخاطر التي يُظهرها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "النقل.",
          "correct": false
        },
        {
          "text": "التخفيف.",
          "correct": true
        },
        {
          "text": "القبول.",
          "correct": false
        },
        {
          "text": "التجنب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "شركة تقوم بتصنيع معدات قياسية للبلديات وتحتاج إلى ضمان الاتساق في المهام التي يتم تنفيذها بانتظام أثناء تجميع المنتج.\n\nما الذي يجب على مدير المشروع تطويره لتحقيق ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "عملية تقدير موارد النشاط.",
          "correct": false
        },
        {
          "text": "إرشادات التصميم من أجل الجودة (DfX).",
          "correct": false
        },
        {
          "text": "قوائم فحص الجودة.",
          "correct": true
        },
        {
          "text": "مقابلات مع خبراء المجال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإعداد ميثاق مشروع لتطوير برنامج، والذي سيتم فيه الاستعانة بمصادر خارجية لتقييم 33٪ من واجهة المستخدم (UI). يحتاج مدير المشروع إلى مطوري البرامج لتحديد الأجزاء من واجهة المستخدم التي يمكن لطرف ثالث تقييمها. ومع ذلك، يعتقد مدير قسم البرمجيات أن المشروع سيؤدي إلى تقليص الموظفين في قسم تطوير البرمجيات ويرفض التعاون.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع المدير الوظيفي لمراجعة بيان العمل (SOW).",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع شرح مبررات التقييم من طرف ثالث للمدير الوظيفي.",
          "correct": false
        },
        {
          "text": "تقديم تحليل التكلفة/الفائدة لتقييم الطرف الثالث للمدير الوظيفي.",
          "correct": false
        },
        {
          "text": "شرح هدف تقييم واجهة المستخدم للمدير الوظيفي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع انطلاق لمشروع حيوي، دخل ثلاثة أصحاب مصلحة لديهم وجهات نظر واهتمامات مختلفة في جدال حاد حول أهداف المشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مقاطعة الجدال والتأكيد بقوة على سلطته للحفاظ على النظام والتحكم في الاجتماع.",
          "correct": false
        },
        {
          "text": "تيسير مناقشة منظمة لفهم وجهة نظر كل صاحب مصلحة وإيجاد أرضية مشتركة.",
          "correct": true
        },
        {
          "text": "إنهاء الاجتماع مبكرًا للسماح لأصحاب المصلحة بتهدئة أعصابهم وإعادة جدولته لاحقًا.",
          "correct": false
        },
        {
          "text": "تجاهل الجدال والمضي قدمًا في جدول أعمال الاجتماع كما هو مخطط له، ومعالجة النزاع لاحقًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير المشروع إلى إغلاق مشروع رسميًا، لكن أحد الموردين يقول إن فاتورة تم دفعها مرتين. يعرف مدير المشروع أن الفاتورة تمت الموافقة عليها، لكنه لا يستطيع العثور على دليل على الدفع المزدوج. يحتاج مدير المشروع إلى إغلاق هذا المشروع من أجل بدء مشروع جديد.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ المورد بأنه تم الدفع مرة واحدة فقط، والبدء في عملية إغلاق المشروع، والبدء في العمل على المشروع الجديد.",
          "correct": false
        },
        {
          "text": "تأجيل إغلاق المشروع حتى تتمكن إدارة الحسابات الدائنة من توثيق أن الفاتورة تم دفعها بشكل صحيح.",
          "correct": true
        },
        {
          "text": "إكمال جميع وثائق المشروع النهائية، وتأجيل العمل على المشروع الجديد، وتحديث الوثائق بعد التحقق من الدفع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع الحالي للحصول على الموافقة لبدء المشروع الجديد قبل إغلاق المشروع الحالي.",
          "correct": false
        }
      ]
    }
  ]
}
