{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
    "type": "multiple-choice",
    "text": "يخطط فريق البحث والتطوير لبناء منشأة جديدة ستركز على تحسين المنتجات الحالية التي طورتها المؤسسة. وستكون مبادرة متعددة السنوات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة لإدارة النطاق تركز على الأهداف المتوقعة من المبادرة.",
        "correct": true
      },
      {
        "text": "إعداد وثيقة حالة عمل تغطي العائد على الاستثمار (ROI) للمبادرة.",
        "correct": false
      },
      {
        "text": "وضع خطة لإدارة الموارد لتغطية الموارد والتخطيط للطوارئ.",
        "correct": false
      },
      {
        "text": "وضع خطة لإدارة الاتصالات لتلبية احتياجات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مدير مشروع بوضع جدول زمني لمشروع يضم أقسامًا مختلفة. واجتمع مدير المشروع مع كل عضو من أعضاء الفريق لوضع هيكل تقسيم العمل (WBS). ومع ذلك، بعد الانتهاء من وضع هيكل تقسيم العمل، اكتشف مدير المشروع أن بعض المهام زائدة عن الحاجة.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستعانة بالخبراء المتخصصين (SMEs) لتقديم إرشادات الجدولة.",
        "correct": true
      },
      {
        "text": "تنظيم جلسات جماعية لجميع أعضاء الفريق لمراجعة WBS معًا.",
        "correct": false
      },
      {
        "text": "تحسين قنوات التواصل مع جميع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "إعداد مصفوفة إسناد المهام لتمثيل WBS.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع في فريق رشيق حالي ويقوم بالتحضير لمشروع قادم. كان المشروع الأخير الذي عمل عليه الفريق ناجحًا للغاية لدرجة أن أحد كبار أصحاب المصلحة طلب أن يستخدم الفريق نفس هيكل الحوكمة للمشروع الجديد.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "التشاور مع مكتب إدارة المشروع (PMO) للحصول على رؤيته حول حوكمة المشروع.",
        "correct": true
      },
      {
        "text": "التعاون مع الفريق وكبار أصحاب المصلحة لمناقشة تكييف الحوكمة الحالية.",
        "correct": false
      },
      {
        "text": "إبلاغ الإدارة العليا بإمكانية استخدام نفس حوكمة المشروع للمشروع الجديد.",
        "correct": false
      },
      {
        "text": "اطلب من صاحب المصلحة الأول مناقشة جميع المخاوف المتعلقة بالحوكمة مع مالك المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع لتحديث البنية التحتية لتكنولوجيا المعلومات في أحد البنوك. تلقى مدير المشروع مؤخرًا الموافقة على خطة إدارة التغيير في المشروع من راعي المشروع. يطلب راعي المشروع الآن أن يقوم مدير المشروع بتنفيذ جزء جديد من التكنولوجيا في الحل.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة التقنية الجديدة كمخاطر في سجل المخاطر.",
        "correct": true
      },
      {
        "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "تحديث خطوط الأساس للجدول الزمني والتكلفة مع التكنولوجيا الجديدة.",
        "correct": false
      },
      {
        "text": "اطلب من الجهة الراعية للمشروع شراء التقنية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأدرك بعض أعضاء الفريق خلال إحدى جلسات الاستعداد اليومية أنهم لم يكونوا جميعًا يحددون أولويات المتطلبات بنفس الطريقة. وقد يؤثر ذلك على أهداف التكرار الحالي.\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بجدولة جلسة مراجعة التكرار وتحديث الأولويات المتراكمة.",
        "correct": true
      },
      {
        "text": "اجتمع مع الفريق ومالك المنتج لتوضيح الأولويات.",
        "correct": false
      },
      {
        "text": "اطلب من راعي المشروع إعادة تحديد القيم ذات الأولوية.",
        "correct": false
      },
      {
        "text": "تحديد الأولويات بناءً على مدى إلحاح المتطلبات والمخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال آخر خمس جلسات عمل يومية، كان أحد أعضاء الفريق في مشروع هجين (تنبؤي-مرن) غامضاً بشأن ما أنجزوه وما يخططون لإنجازه.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتمع مع أعضاء الفريق للتأكد من أن لديهم فهم واضح لما هو متوقع منهم.",
        "correct": true
      },
      {
        "text": "قم بمراجعة المشكلة في الاجتماع الاستعراضي التالي وحدد الإجراء التصحيحي الذي ينبغي تنفيذه.",
        "correct": false
      },
      {
        "text": "قم بإثارة مسألة مساءلة المهام مع الفريق وأصحاب المصلحة في اجتماع مراجعة التكرار التالي.",
        "correct": false
      },
      {
        "text": "تسهيل عقد اجتماع مع الفريق بأكمله وأصحاب المصلحة لمراجعة المخاطر والعوائق التي يواجهها المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تبلغ تكلفة المشروع المدرجة في الميزانية 120,000 دولار أمريكي. وفقًا للجدول الزمني، يجب أن يكون قد تم إنجاز 15% من المشروع بعد شهر واحد. وبعد مرور شهر، لم يكتمل بالفعل سوى 12% من المشروع.\nما هو مؤشر الأداء المجدول (SPI)؟",
    "explanation": "",
    "choices": [
      {
        "text": "0.6",
        "correct": true
      },
      {
        "text": "0.8",
        "correct": false
      },
      {
        "text": "0.9",
        "correct": false
      },
      {
        "text": "1.25",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة التصميم، يدرك مدير المشروع أن المشروع سيستفيد من استخدام أدوات التكيف. وقد ثبتت فعالية هذا النهج في مشاريع سابقة داخل المنظمة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من قدرات الفريق قبل إدخال الأدوات والقطع الأثرية التكيفية إلى المشروع.",
        "correct": true
      },
      {
        "text": "اتصل براعي المشروع واطلب أعضاء فريق جديد على دراية بالمشاريع التكيفية.",
        "correct": false
      },
      {
        "text": "تجميد مرحلة التصميم والبحث عن مورد خارجي لتشغيل التصميم التكراري بتكلفة إضافية.",
        "correct": false
      },
      {
        "text": "تحديث وثائق المشروع لتشمل أدوات التكيف والقطع الأثرية والتخطيط للجلسة التكرارية الأولى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد الانتقال والانتهاء من مشروع كبير لتركيب المعدات، يتلقى مدير المشروع طلبًا من العميل لإضافة بعض التكاليف التشغيلية إلى ميزانية المشروع لأنشطة بناء الفريق. تم الانتهاء من المشروع في حدود الميزانية، ولم يتم إنفاق احتياطيات طوارئ المشروع، وستضمن أنشطة بناء الفريق الأداء الأمثل للفريق التشغيلي.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفض الطلب وإغلاق البيانات المالية للمشروع.",
        "correct": true
      },
      {
        "text": "تنفيذ عملية التحكم في التغيير المتكاملة.",
        "correct": false
      },
      {
        "text": "الموافقة على النفقات لضمان رضا العملاء.",
        "correct": false
      },
      {
        "text": "قم بتوثيق الطلب في مستودع الدروس المستفادة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق المشروع في المرحلة الثالثة عشرة من مشروع مكون من أربعة عشر إصداراً. وضع فريق المشروع ميزة تغيير قواعد اللعبة على الأعمال المتراكمة للإصدار التالي. تم إبلاغ مالك المنتج أن أحد المنافسين يطلق منتجًا جديدًا بميزة تشبه إلى حد كبير الميزة الموضوعة على قائمة الأعمال المتراكمة. يطالب مالك المنتج بدمج هذه الميزة التي ستغير قواعد اللعبة في الإصدار الحالي.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنظيم اجتماع مراجعة مع فريق التطوير للتعرف على حجم العمل المطلوب.",
        "correct": true
      },
      {
        "text": "اجتمع مع مالك المنتج وأصحاب المصلحة المعنيين لمناقشة التغيير وتحليل تأثيره.",
        "correct": false
      },
      {
        "text": "إجراء التقييمات المطلوبة ورفع طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "أبلغ مالك المنتج أن هذه الميزة التي ستغير قواعد اللعبة ستتم إضافتها إلى الإصدار التالي من المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشكو أحد أصحاب المصلحة من أن أحد مكونات المنتج ليس سهل الاستخدام. ما هي الخطوة التالية التي يجب أن يتخذها مدير المشروع مباشرة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق مما إذا كان المكون يفي بمواصفات التصميم والأداء.",
        "correct": true
      },
      {
        "text": "التعاون مع أصحاب المصلحة لتأكيد معايير القبول للمنتج.",
        "correct": false
      },
      {
        "text": "اطلب من خبير تجربة المستخدم مقابلة صاحب المصلحة وشرح تصميم المكون.",
        "correct": false
      },
      {
        "text": "رفع طلب تغيير وفقًا لمخاوف أصحاب المصلحة من المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع مؤخرًا لمشروع تكنولوجيا المعلومات. وكان المشروع في مرحلة البدء، ووجد الفريق مشكلة توافق في البنية التحتية التقنية التي يستخدمها البائع والمنظمة.\nما الخطوة الأولية التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة بفعالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "افحص ما إذا كان هناك حل بديل.",
        "correct": true
      },
      {
        "text": "قم بتصعيد المشكلة إلى فريق البنية التحتية التقنية.",
        "correct": false
      },
      {
        "text": "تحقق من قاعدة بيانات الدروس المستفادة.",
        "correct": false
      },
      {
        "text": "استشر راعي المشروع حول المشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستخدم المشروع المختلط عملية تصميم تكرارية لتطوير المنتج. غير أن هناك فرقاً منفصلة للتصميم والتنفيذ، وهو ما يسبب القلق.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المخاوف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء مستودع مركزي لوثائق المشروع والتحقق من صحة المنتج.",
        "correct": true
      },
      {
        "text": "اطلب أن يكون فريق التصميم مسؤولاً عن تنفيذ المشروع أيضاً.",
        "correct": false
      },
      {
        "text": "إبلاغ مكتب إدارة المشروع (PMO) بأن النهج الهجين محفوف بالمخاطر.",
        "correct": false
      },
      {
        "text": "تعزيز مهارات فريق العمل من خلال توفير التدريب على إطار عمل إدارة المشاريع التكيفية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشعر مدير المشروع بالقلق بشأن تقديم قيمة العمل المخطط لها لأن مالك المنتج غير مشارك. ما الذي يجب أن يفعله مدير المشروع لمعالجة هذا القلق؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
        "correct": true
      },
      {
        "text": "مراجعة خطة مشاركة أصحاب المصلحة وتحديثها.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة الموارد وتحديثها.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة المخاطر وتحديثها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتلقى نموذج أولي لمنتج تم إطلاقه حديثاً عدداً من شكاوى العملاء. وللحد من ردود الفعل السلبية، يتوصل الفريق إلى خطة عمل. ومع ذلك، في نهاية الربع، وجد مدير المشروع أنه لم يكن هناك انخفاض كبير في الشكاوى.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد أصحاب الأداء الرئيسيين في الفريق وتقديرهم بالشكل المناسب.",
        "correct": true
      },
      {
        "text": "حدد أعضاء الفريق الذين يفتقرون إلى المهارات المطلوبة وقم بتدريبهم.",
        "correct": false
      },
      {
        "text": "مراجعة مؤشرات الأداء الرئيسية للمشروع وإعادة تقييمها.",
        "correct": false
      },
      {
        "text": "أبلغ فريق الإدارة التنفيذية بالحالة واطلب المساعدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعاني عضو فريق موهوب للغاية وموجه نحو تحقيق النتائج من مشكلة شخصية فجأة. ونتيجة لذلك، يحدث تغيير في سلوك هذا العضو في الفريق، ويبدأ في التأثير على نواتج المشروع وكذلك على معنويات أعضاء الفريق الآخرين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتعيين عضو الفريق في نشاط لن يؤثر بشكل كبير على المخرجات.",
        "correct": true
      },
      {
        "text": "التواصل مع عضو الفريق على انفراد والعمل معًا لوضع خطة لمعالجة المشكلة.",
        "correct": false
      },
      {
        "text": "إضافة مشكلة عضو الفريق إلى سجل مشكلات المشروع وإبلاغ جميع أصحاب المصلحة الرئيسيين.",
        "correct": false
      },
      {
        "text": "اطلب من مدير الموارد البشرية (HR) التعامل مع المشكلة ومواصلة العمل كما هو مخطط له.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع تم تعيينه حديثاً لمشروع بناء مدرسة. تخدم المدرسة طلاباً من الأحياء المجاورة ويجب أن تكون المدرسة موفرة للطاقة تماماً. يجب على مدير المشروع تقديم تقرير نهائي.\nكيف يمكن لمدير المشروع تحديد ما إذا كانت قيمة العمل المخطط لها قد تم تسليمها أم لا؟",
    "explanation": "",
    "choices": [
      {
        "text": "فحص المواصفات الفنية المعتمدة للتأكد من تطابقها مع مخرجات المنتج النهائي.",
        "correct": true
      },
      {
        "text": "التشاور مع فريق العمل والتأكد من رضا العميل عن بناء المدرسة.",
        "correct": false
      },
      {
        "text": "مراجعة ميثاق المشروع وحالة العمل لتحديد ما إذا كانت المخرجات قد حققت الفوائد المرجوة.",
        "correct": false
      },
      {
        "text": "إثبات أن مشروع بناء المدرسة تم تسليمه في الموعد المحدد وفي حدود الميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتوجه أحد أعضاء فريق المشروع فجأة إلى مدير المشروع ويطلب الاستقالة من المشروع. يشعر عضو الفريق بالضيق بسبب سوء المعاملة والشكاوى المستمرة من القائد الفني. يوضح عضو الفريق أنه لم يعد مستعدًا لتحمل هذه المعاملة من القائد الفني. لم يسبق لمدير المشروع أن واجه مشاكل في الجودة مع أعضاء الفريق.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسمح لعضو الفريق بالاستقالة واستبداله بما أن هناك موارد إضافية متاحة.",
        "correct": true
      },
      {
        "text": "ناقش الموقف مع عضو الفريق لتحديد سبب سوء معاملة القائد الفني له.",
        "correct": false
      },
      {
        "text": "تحدث إلى القائد الفني لتحديد مدى ضعف أداء عضو الفريق.",
        "correct": false
      },
      {
        "text": "تحدث مع عضو الفريق والقائد الفني لتحليل النزاع وحلّه من خلال الوساطة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لم يكمل فريق المشروع الرشيق المهام ضمن التكرار الحالي. خلال أحد الاجتماعات، يعطي راعي المشروع الفريق موعداً نهائياً لإكمال المهام.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب أن يصبح المدير الوظيفي قائدًا للفريق لضمان اتباع العمليات.",
        "correct": true
      },
      {
        "text": "قم بتعيين قائد فريق لتولي مسؤولية تخطيط التكرار في الفريق وإنجازه.",
        "correct": false
      },
      {
        "text": "إبلاغ راعي المشروع بأن الفريق مسؤول عن إدارة العمل ضمن التكرارات.",
        "correct": false
      },
      {
        "text": "تقديم المشورة للفريق للالتزام بالجدول الزمني الجديد المقدم من راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تعيين مدير مشروع لمشروع جديد تبلغ تكلفته عدة ملايين من الدولارات مشابه لمشروع نفذته الشركة قبل ثلاث سنوات. ما الذي يجب أن يفعله مدير المشروع لوضع تقدير تكلفة موثوق به؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد المعلمات الحرجة وتوليد تقدير بناءً على تباين المعلمات.",
        "correct": true
      },
      {
        "text": "خذ التقدير الأصلي واضربه في عامل يحدده معيار الشركة لكل سنة.",
        "correct": false
      },
      {
        "text": "استخدم التكلفة الفعلية للمشروع السابق كمرجع واحسب التكلفة التقديرية لكل مهمة وقم بتجميعها.",
        "correct": false
      },
      {
        "text": "استخدم بورصة السلع لتكلفة المواد ومعدلات العمالة لتغير التكلفة وحساب تقدير جديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع مهم مع أصحاب المصلحة الذين لديهم توقعات مختلفة للمشروع. كما أن بعض أصحاب المصلحة لديهم درجة عالية من التأثير على المشروع.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "التحكم في درجة تأثير أصحاب المصلحة لتتماشى بشكل أفضل مع أهداف المشروع.",
        "correct": true
      },
      {
        "text": "قم بتضمين متطلبات أصحاب المصلحة المؤثرين وتأكد من توافق أصحاب المصلحة الآخرين مع أهداف المشروع.",
        "correct": false
      },
      {
        "text": "استنباط متطلبات أصحاب المصلحة والتفاوض بشأنها وفقاً لتأثير كل صاحب مصلحة.",
        "correct": false
      },
      {
        "text": "إدارة أصحاب المصلحة بعناية وتطبيق توقعات أصحاب المصلحة دون التأثير على أهداف المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مشروع تطوير البرمجيات، أدرك الفريق أن العديد من الميزات لم تتوافق مع متطلبات الجودة. بعد تلقي التعليمات لإصلاح المشكلات، أصيب أحد أعضاء الفريق بالإحباط، مدعياً أن المتطلبات غير الواضحة هي السبب في هذه المشكلات. يجادل أعضاء الفريق الآخرون بأن الإهمال في الاختبار هو السبب الحقيقي لهذه المشكلات. ويلقي المختبرون باللوم على ضعف جودة الترميز.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "دعم فريق المشروع في إجراء استعراض بأثر رجعي لتحديد السبب الجذري لمشاكل الجودة.",
        "correct": true
      },
      {
        "text": "قم بإزالة المورد الأكثر إحباطًا من الفريق لأن الارتباك يؤثر على تحفيز الفريق.",
        "correct": false
      },
      {
        "text": "إجراء مراجعة للجودة في كل مرحلة من مراحل دورة حياة التطوير لتحديد مشكلات الجودة.",
        "correct": false
      },
      {
        "text": "ناقش المشكلة مع فريق الإدارة لتحديد الحلول الممكنة لتحسين الجودة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك مدير مشروع مشروع تطوير برمجيات لمؤسسة مالية أن أعضاء الفريق يتأخرون بشكل غير عادي في المهام الموكلة إليهم. لم يواجه مدير المشروع هذا الأمر من قبل في مشاريع سابقة مماثلة. بعد إجراء مزيد من التحقيقات، قرر مدير المشروع أن التأخير مرتبط باستقالة أحد أعضاء الفريق ذوي الخبرة مؤخرًا.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ضمان وجود مسار واضح المعالم للترقية.",
        "correct": true
      },
      {
        "text": "توفير التوجيه المستمر لأعضاء فريق المشروع.",
        "correct": false
      },
      {
        "text": "تحديد مخاطر الكفاءة ووضع خطة للتخفيف من حدتها.",
        "correct": false
      },
      {
        "text": "التدريب الدوري المجدول لجميع أعضاء فريق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اكتمل المشروع في منتصف الطريق، وعلى الرغم من مؤشر الأداء الجيد للجدول الزمني (SPI)، فقد حدد العميل العديد من المشكلات البسيطة. يمكن حل معظم المشاكل بسرعة وسهولة إذا تمكن العميل من التواصل مباشرة مع فريق التطوير. يوافق مدير المشروع على ذلك، لكن بعض أعضاء الفريق يشعرون بعدم الثقة في قدرتهم على التواصل مع العميل بشكل كافٍ.\nكيف يمكن لمدير المشروع دعم مشاركة العملاء الناجحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم أساليب تواصل الأعضاء وتقديم الملاحظات حسب الحاجة لتوجيه الفريق.",
        "correct": true
      },
      {
        "text": "تأكد من فهم جميع أعضاء فريق المشروع لأدوارهم ومسؤولياتهم المحددة.",
        "correct": false
      },
      {
        "text": "تقييم المهارات التقنية لفريق المشروع وتوفير تدريب إضافي على تطوير المنتجات.",
        "correct": false
      },
      {
        "text": "تحديث مؤشر أداء الجدول الزمني (SPI) ومراجعة جميع اتصالات فريق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال أحد اجتماعات الاستعداد، يكتشف مدير المشروع أن أحد مطوري البرمجيات يعاني من صعوبة في إكمال العمل لأنه يفتقر إلى الخبرة في اختبار الأتمتة، مما قد يؤثر على هدف السباق. مهندس ضمان الجودة في الفريق لديه خبرة في اختبار الأتمتة ولكنه مشغول بإعداد عرض تقديمي للموظفين الجدد.\nما الإجراء الذي من شأنه أن يزيد من فرص تحقيق هدف السباق السريع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أعد تعيين عمل الأتمتة إلى المهندس بمجرد الانتهاء من العرض التقديمي.",
        "correct": true
      },
      {
        "text": "قم على الفور بتدريب مطور البرامج على اختبار الأتمتة ثم تابع الاختبار.",
        "correct": false
      },
      {
        "text": "اطلب من مهندس ضمان الجودة مساعدة مطور البرامج في أقرب وقت ممكن.",
        "correct": false
      },
      {
        "text": "قم بإعادة جدولة اختبار الأتمتة عندما يكون مهندس ضمان الجودة متاحًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع مؤخرًا في مشروع تحقيق. ونظراً لتعقيد المشروع، لم يكن مدير المشروع متأكداً مما إذا كانت أي لائحة تنطبق عليه.\nكيف ينبغي لمدير المشروع تحديد اللوائح التي تنطبق على المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استشر المدير الذي يتمتع بسلطة أعلى في اتخاذ هذا القرار.",
        "correct": true
      },
      {
        "text": "اتصل بمدير مكتب إدارة المشروع (PMO) لأنه المسؤول عن تحديد اللوائح المطلوبة للمشاريع الرشيقة.",
        "correct": false
      },
      {
        "text": "حدد موعدًا لعقد اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين وفريق المشروع لفهم ما إذا كانت هناك أي لوائح قابلة للتطبيق.",
        "correct": false
      },
      {
        "text": "اطلب خطابًا موقعًا من العميل لتأكيد ما إذا كانت هناك أي لوائح تنطبق على أي من مخرجات المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تُظهر الجداول متطلبات المشروع الرشيق مع العائد المتوقع على الاستثمار (ROI) ومخاطر المشروع المحددة، إلى جانب تفاصيل التحليل.\nما هو الترتيب الذي يجب أن يكون عليه ترتيب الأولويات في المنتجات المتراكمة المعدلة حسب المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "المتطلب 3، المتطلب 1، المتطلب 2، الخطر 3.",
        "correct": true
      },
      {
        "text": "المخاطر 3، والمخاطر 1، والمخاطر 2، والمتطلبات 3، والمتطلبات 1، والمتطلبات 2",
        "correct": false
      },
      {
        "text": "المطلب 3، الخطر 3، الخطر 3، المطلب 1، المطلب 2، الخطر 2",
        "correct": false
      },
      {
        "text": "المتطلب 3، المتطلب 1، المخاطر 3، المتطلب 2، المخاطر 1، المخاطر 2",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف عملية الإصدار، تم استبدال مدير المشروع. أشارت الملاحظات التي قدمها الفريق إلى مدير المشروع الجديد إلى احتكاك الفريق الناجم عن مطالب مدير المشروع السابق المستمرة بالتسليم السريع.\nما هو النهج الذي يجب على مدير المشروع الجديد اعتماده لإرساء المصداقية بسرعة مع الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "افعل ما يحتاج الفريق إلى القيام به، واحتفظ بسجل الإجراءات، وقدم الملاحظات.",
        "correct": true
      },
      {
        "text": "ساعد الفريق على النجاح من خلال تقديم خدمة ممتازة والتزامات في الوقت المحدد وميزانية كافية.",
        "correct": false
      },
      {
        "text": "قم بتقييم ثقافة الفريق وراقبهم وتفاعل معهم.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق شرح ما هو مطلوب، وإنشاء المهام، والإبلاغ عن التقدم المحرز في تلك المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة تنفيذ المشروع، يتم إعادة تعيين مدير المشروع إلى مشروع آخر. ويتولى مدير المشروع الجديد مهامه وسرعان ما يدرك أن المشروع يواجه مشاكل في جودة وجدولة بعض النواتج.\nأي مما يلي يجب على مدير المشروع الجديد القيام به أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث خطة المشروع لتعكس الجدول الزمني الجديد ومتطلبات الجودة الجديدة.",
        "correct": true
      },
      {
        "text": "مراجعة الجدول الزمني للمشروع والتركيز على تسليم المشروع في الوقت المحدد وفي حدود الميزانية.",
        "correct": false
      },
      {
        "text": "الاجتماع مع فريق المشروع لتقييم الوضع ووضع خطة لمعالجة المشاكل.",
        "correct": false
      },
      {
        "text": "قم بتقييم مهارات فريق المشروع واطلب من راعي المشروع توفير موارد إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يبدأ مشروع برمجيات مالية جديدة في بيئة تنافسية للغاية. لوائح الامتثال واضحة، ولكن المتطلبات غير واضحة. ويشدد العميل على أنه يحتاج إلى نتائج في أقرب وقت ممكن.\nما هو نهج التنفيذ الذي يجب أن يختاره مدير المشروع لهذا المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تكرار وتنقيح مراحل المشروع في تكرارات متعددة.",
        "correct": true
      },
      {
        "text": "التقدم عبر تسلسل خطي من المراحل.",
        "correct": false
      },
      {
        "text": "تبنّي التغيير والتركيز على تقديم القيمة.",
        "correct": false
      },
      {
        "text": "التركيز على تسليم المشروع على دفعات متعددة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "من أجل تقليل وقت الشراء أثناء عملية تقديم العطاءات، قرر مدير المشروع التعاقد مع مقاول حالي على العمل الإضافي. وقد اشتكى مقدمو العطاءات الآخرون من هذا القرار لأنهم يعتقدون أن العملية افتقرت إلى الشفافية والإنصاف.\nما الذي كان يجب على مدير المشروع فعله لمنع حدوث ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "دعوة جميع مقدمي العطاءات المحتملين إلى اجتماع.",
        "correct": true
      },
      {
        "text": "مُنح العقد دون تفاوض.",
        "correct": false
      },
      {
        "text": "اتبع إجراءات المناقصة الخاصة بالشركة.",
        "correct": false
      },
      {
        "text": "مشاركة أهداف المشروع مع جميع مقدمي العروض.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ينضم مدير مشروع جديد إلى منظمة لم يكن لديها عمليات رسمية لإدارة المشروع. ويرفض بعض أعضاء الفريق المشاركة في المهام الأساسية مثل تولي مسؤولية بنود العمل في الاجتماعات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإعداد اجتماع خاص مع أعضاء الفريق المحددين لمناقشة فوائد إدارة المشروع.",
        "correct": true
      },
      {
        "text": "إنشاء مستند داخلي يوضح فوائد إدارة المشاريع لجميع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "استكشف فوائد إدارة المشاريع مع المسؤولين التنفيذيين في المؤسسة.",
        "correct": false
      },
      {
        "text": "قم باستضافة اجتماع مع الفريق يركز على حل المشاكل بشكل تعاوني لوضع نهج لإنجاز مهام المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتعين على مدير المشروع الحصول على الموافقة على متطلبات المشروع قبل الانتقال إلى مرحلة التسليم. وفي أثناء تنفيذ المشروع، يدرك مدير المشروع أن التقديرات الأولية لم تكن واقعية وأن المشروع سيستغرق وقتاً أطول بكثير لإكماله. وسيتعين على مدير المشروع الحصول على موافقة على متطلبات المشروع الأكثر واقعية.\nما الذي يجب على مدير المشروع القيام به للتخفيف من حدة المشكلة والحفاظ على المشروع على المسار الصحيح أثناء انتظار الموافقة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة ترتيب أولويات نواتج المشروع لتمكين التسليم التدريجي على مراحل.",
        "correct": true
      },
      {
        "text": "قسّم فريق المشروع إلى وحدات متميزة تركز على مكونات مختلفة.",
        "correct": false
      },
      {
        "text": "قم باستطلاع رأي فريق المشروع لمعرفة ما إذا كان بإمكان أي شخص العمل لوقت إضافي للوفاء بالموعد النهائي.",
        "correct": false
      },
      {
        "text": "تحديث خط الأساس للجدول الزمني بحيث يستند إلى تقديرات واقعية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع جديد لديه فريق عمل منقسم بين المواقع في الموقع والمواقع الخارجية. ولاحظ مدير المشروع وجود تضارب متزايد بين شطري الفريق أثناء بدء المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "توصيل نطاق المشروع إلى جميع أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "تنظيم اجتماع وجهاً لوجه أثناء انطلاق المشروع.",
        "correct": false
      },
      {
        "text": "حدد هذا التعارض في سجل سجل المخاطر.",
        "correct": false
      },
      {
        "text": "قم بتسجيل هذا التعارض في سجل مشكلات المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة التخطيط للمشروع، يواجه مدير المشروع مشكلة في تحديد أصحاب المصلحة. فبدون مدخلات من أصحاب المصلحة الصحيحين، سيكون الحصول على تعليقات المستخدمين أمراً صعباً.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة مشاركة أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "إبلاغ الجهات الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "ارجع إلى ميثاق المشروع لتحديد أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "مراجعة وثيقة نطاق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنهى فريق مشروع مشتت للتو سباقاً سريعاً بمهام معقدة قبل الموعد المحدد. أثناء الاستعراض الاستعراض، يقاطع عضو جديد في الفريق ويطلب من الجميع شرح أدوارهم وما يخططون للعمل عليه في السباق القادم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عالج الموقف على الفور ورد على عضو الفريق الجديد مباشرة.",
        "correct": true
      },
      {
        "text": "أبلغ أعضاء الفريق أنه من الأفضل التعامل مع هذا الأمر في اجتماع آخر.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو في الفريق أن يشرح دوره وما سيعمل عليه في السباق التالي.",
        "correct": false
      },
      {
        "text": "قم بإعداد اجتماعات فردية مع كل عضو في الفريق والعضو الجديد في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بقيادة مشروع تنفيذ جديد مع فريق مشروع عالمي. وبما أن أعضاء الفريق موجودون في مواقع جغرافية ومناطق زمنية مختلفة، يتعين على مدير المشروع أن يقرر استراتيجية مشاركة الفريق الأكثر فعالية.\nما هو الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة لإدارة الاتصالات.",
        "correct": true
      },
      {
        "text": "قم بإعداد مكالمات جماعية يومية لمتابعة العمل.",
        "correct": false
      },
      {
        "text": "اطلب من جميع أعضاء الفريق استخدام لوحة المهام عبر الإنترنت.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق مواءمة جداول عملهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق المهمين فقد اهتمامه بالمشروع. أدى عدم اهتمام عضو الفريق إلى انخفاض الإنتاجية.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد هذه المشكلة إلى مدير الموارد البشرية (HR).",
        "correct": true
      },
      {
        "text": "استبدل عضو الفريق بعضو آخر أكثر اهتماماً بالفريق.",
        "correct": false
      },
      {
        "text": "حدد موعدًا للاجتماع مع عضو الفريق لتحديد السبب.",
        "correct": false
      },
      {
        "text": "زيادة رواتب أعضاء الفريق وفرص المكافآت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مراجعة التقدم المحرز في منتصف عملية التكرار، يشير مسؤول سكروم إلى وجود خطر كبير بسبب تبعية قصة المستخدم.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث المنتج المتراكم.",
        "correct": true
      },
      {
        "text": "تحديث ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      },
      {
        "text": "تحديث سجل المشكلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في آخر اجتماع مراجعة للسباق السريع، أعلن العميل أنه بحاجة إلى تنفيذ وحدتين من الوحدات الخمس الملتزم بها للمشروع في غضون أسابيع قليلة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع عصف ذهني.",
        "correct": true
      },
      {
        "text": "استخدام أسلوب المجموعة الاسمية.",
        "correct": false
      },
      {
        "text": "إجراء اجتماع خطة إطلاق السراح.",
        "correct": false
      },
      {
        "text": "استخدم النماذج الأولية لتحسين التصميم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nرفض أحد العملاء أحد نواتج المشروع المؤقتة. ماذا ينبغي لمدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع سبب الرفض، وراجع سبب الرفض، وتحقق من النواتج القابلة للتسليم مقابل معايير القبول.",
        "correct": true
      },
      {
        "text": "تحليل متطلبات العميل، وإعادة صياغة ما تم تسليمه بجودة مقبولة.",
        "correct": false
      },
      {
        "text": "إنشاء خطة تحسين قابلة للتنفيذ، وتنفيذها للفترة المتبقية من المشروع.",
        "correct": false
      },
      {
        "text": "توثيق رفض النواتج في سجل الدروس المستفادة ومراجعتها مع فريق تنفيذ المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم إنتاج معدات المشروع الحرجة من قبل بائع خارجي. وكشف مسح للجودة عن عدم الامتثال لبعض مواصفات المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعيين موظفي المشروع للإشراف على منشأة البائع لضمان الامتثال للمواصفات.",
        "correct": true
      },
      {
        "text": "قم بمراجعة عقد الإنتاج لتحديد ما إذا كانت المواصفات المشار إليها قد تم تضمينها.",
        "correct": false
      },
      {
        "text": "حدد موعداً لعقد ورشة عمل مع ممثلي البائعين لتقديم لمحة عامة عن مواصفات المشروع.",
        "correct": false
      },
      {
        "text": "قم بجدولة اجتماعات منتظمة مع البائع للتحكم في هذا الوضع شخصيًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يمكن أن يحقق المشروع فوائد تسويقية نهائية إذا تم تضمين معدات إضافية في نطاق المشروع. ومع ذلك، لا تزال هذه المعدات في مرحلة التطوير المبكرة ولن تكون جاهزة للوفاء بالجداول الزمنية للمشروع. ويؤيد أحد أعضاء اللجنة التوجيهية للمشروع إدراجها.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعداد طلب تغيير النطاق لتضمين المعدات الإضافية لأنها مفيدة لفريق التسويق.",
        "correct": true
      },
      {
        "text": "تقديم أساس منطقي واضح لاستبعادها بناءً على حالة العمل وتأثيرها على الجداول الزمنية للمشروع.",
        "correct": false
      },
      {
        "text": "إجراء استبيان بين أعضاء اللجنة التوجيهية لتقييم متطلبات كل مشروع على حدة من أجل اتخاذ قرار بتوافق الآراء.",
        "correct": false
      },
      {
        "text": "مطالبة راعي المشروع بتصعيد المشكلة إلى عضو اللجنة التوجيهية لتجنب تأخير الموافقة على المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف المشروع، يدرك مدير المشروع أن هناك حاجة إلى مجموعة محددة من المهارات لإكمال تطوير المشروع. ولسوء الحظ، لا يمتلك أي من أعضاء الفريق المهارات اللازمة.\nما هي الخطوة الأولى التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تنظيم فريق المشروع ليشمل الأشخاص الذين يتمتعون بالمعرفة والمهارات اللازمة.",
        "correct": true
      },
      {
        "text": "راجع الجدول الزمني والميزانية للنظر في التدريب أو الاستعانة بمصادر خارجية أو بدائل أخرى.",
        "correct": false
      },
      {
        "text": "تنظيم تدريب مناسب لفريق المشروع لسد الفجوة المعرفية.",
        "correct": false
      },
      {
        "text": "البحث عن طرق بديلة لتحقيق أهداف المشروع بدون المهارات المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروع تطوير برمجيات معقد. ولا يستطيع فريق المشروع الاتفاق على العملية التي يجب استخدامها عند حل مشكلة معينة.\nما هو النهج الذي يجب أن يتبعه مدير المشروع للمساعدة في الوصول إلى توافق في الآراء بين أعضاء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "مارس سلطة الخبراء وحدد الطريق إلى الأمام للفريق.",
        "correct": true
      },
      {
        "text": "قم بتحديث مصفوفة المسؤولية والمساءلة والتشاور والإبلاغ (RACI) وإسناد العمل إلى فريق مختلف.",
        "correct": false
      },
      {
        "text": "تعيين قائد فريق جديد لديه خبرة في حل مشاكل تطوير البرمجيات المماثلة.",
        "correct": false
      },
      {
        "text": "تسهيل عقد اجتماع وتشجيع أعضاء الفريق على التوصل إلى حلول محتملة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تعاقد عميل مع شركة لإدارة مشروع كبير في بيئة مرنة مع العديد من المقاولين من الباطن. يقوم العميل بإعطاء أوامر مباشرة للمقاولين من الباطن، بدلاً من مدير مشروع المقاول. وقد أدى ذلك إلى نشوب نزاع داخل الفريق.\nما الذي يجب أن يفعله مدير المشروع لمنع حدوث هذا الموقف مرة أخرى؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبقاء الفريق على اطلاع دائم بتوقعات العميل.",
        "correct": true
      },
      {
        "text": "قم بدعوة العميل إلى اجتماع التخطيط للفريق.",
        "correct": false
      },
      {
        "text": "أخبر الفريق بتجنب النزاعات مع العميل.",
        "correct": false
      },
      {
        "text": "اطلب من العميل عدم إعطاء أوامر مباشرة للمقاولين من الباطن.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع بتسليم مشروع معقد لعميل لديه مدير مشروع خاص به. مدير مشروع العميل هو صانع القرار الوحيد للمشروع ولكنه ليس السلطة المالية المفوضة. بالنسبة لكل قرار مالي، يجب على مدير مشروع العميل أن يسعى للحصول على موافقة سلطة أعلى. وقد تسببت هذه الخطوة الإضافية في تأثيرات كبيرة على إدارة الموارد والتكلفة ووقت تسليم المشروع.\nكيف يمكن لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإثارة هذه المشكلة في تقرير حالة المشروع ربع السنوي.",
        "correct": true
      },
      {
        "text": "إضافة المشكلة إلى تقرير الدروس المستفادة.",
        "correct": false
      },
      {
        "text": "رفع المشكلة إلى اللجنة التوجيهية للمشروع.",
        "correct": false
      },
      {
        "text": "ناقش المشكلة مع مدير مشروع العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد إرسال تقرير حالة مشروع حديث عبر البريد الإلكتروني، يعلم مدير المشروع أن عدداً من المستلمين لم يعودوا مشاركين في المشروع. يحتاج مدير المشروع إلى التحقق من قائمة التوزيع لتقارير الحالة المستقبلية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الجدول الزمني وتحديثها.",
        "correct": false
      },
      {
        "text": "مراجعة وتحديث مصفوفة توزيع المسؤوليات.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة الموارد وتحديثها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كما هو متفق عليه في بداية المشروع التنبؤي، يجب مشاركة جميع المعلومات الصادرة مسبقًا مع مدير المشروع. أثناء المشروع، كان أحد قادة الفريق يتواصل مباشرة مع الراعي متجاوزًا مدير المشروع. ونتيجة لذلك، تم نقل معلومات غير مصفاة إلى الجهة الراعية، ولم تتم مشاركة المعلومات المهمة من الفريق مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تذكير قائد الفريق بإبلاغ مدير المشروع دائمًا قبل تقديم المعلومات إلى أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تحدث إلى قائد الفريق لمعرفة ما إذا كان لديه أي مشاكل شخصية مع مدير المشروع.",
        "correct": false
      },
      {
        "text": "قم بتعديل اتفاقيات الفريق للحصول على موافقة مدير المشروع قبل إرسال أي اتصال.",
        "correct": false
      },
      {
        "text": "تحدث إلى الكفيل لمعرفة ما شاركه قائد الفريق مع الكفيل مباشرةً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه مدير مشروع مشاكل مع المدير الوظيفي لأحد أعضاء فريق المشروع. وقد أعطى المدير الوظيفي لعضو الفريق مهمة أخرى وأخبر عضو الفريق أن المشروع السابق يجب أن يكون له أولوية أقل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا.",
        "correct": true
      },
      {
        "text": "قم بتوصيل أهمية المشروع إلى الفريق.",
        "correct": false
      },
      {
        "text": "قم بإحالة المدير الوظيفي إلى ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "اطلب موارد إضافية لمشروعك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيطلب أحد رعاة المشروع الرئيسيين تقارير مرحلية شهرية ويعين شخصًا للاتصال والتواصل مع مدير المشروع. وبعد فترة وجيزة، يبدأ مسؤول الاتصال بطلب تقارير أسبوعية ويطلب أن تحتوي على تفاصيل إضافية. وعلى الرغم من تقديم هذه التقارير المتكررة والمفصلة للغاية، يكتشف مدير المشروع أن راعي المشروع يشتكي من عدم استلام التقارير المرحلية الشهرية.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتجميع جميع التقارير السابقة وتلخيصها وإرسال الملخص مباشرةً إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "حدد موعداً لعقد اجتماع مع راعي المشروع والشخص المسؤول عن الاتصال لمعالجة ثغرات التواصل.",
        "correct": false
      },
      {
        "text": "شرح محتوى وتواتر تقديم التقارير المرحلية إلى جهة الاتصال وراعي المشروع.",
        "correct": false
      },
      {
        "text": "تزويد راعي المشروع بإمكانية الوصول الكامل إلى لوحة معلومات إدارة المشروع الخاصة بالشركة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لسباق السرعة، حدد فريق رشيق ومالك المنتج أن الفريق يجب أن يكون قادراً على إنهاء خمس قصص للمستخدمين. ومع ذلك، خلال السباق السريع، عمل الفريق على أكثر من خمس قصص لكنه لم يكمل أي قصص على الإطلاق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "توضيح الأولويات مع الفريق.",
        "correct": true
      },
      {
        "text": "إنشاء قصص أصغر في المستقبل.",
        "correct": false
      },
      {
        "text": "مراجعة تعريف المنجز (DoD).",
        "correct": false
      },
      {
        "text": "تحديث خطة إصدار المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع في مشروع رشيق أن العديد من أصحاب المصلحة يتخطون اجتماعات تخطيط ومراجعة التكرار. يعترف بعض أصحاب المصلحة بأنهم لا يرون قيمة الاجتماعات ويفضلون عدم المشاركة. يواجه المشروع خطر التأخر عن الجدول الزمني بسبب عدم مشاركة أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
        "correct": true
      },
      {
        "text": "تحديد الثغرات وتوجيه أصحاب المصلحة بشأن النهج التكراري.",
        "correct": false
      },
      {
        "text": "سجل مراجعة التكرار وشاركها مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "بناء مصفوفة RACI ووضع خطة تدريب لأصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع بناء طريق سريع مدته خمس سنوات في عامه الثالث من التنفيذ عندما يتلقى مدير المشروع شكوى من مجموعة من المجتمع المحلي. المجموعة مستاءة لأنهم لاحظوا أن مسار الطريق السريع قد تغير وأصبح الآن أقرب إلى منازلهم. أدى هذا النزاع إلى تعطيل البناء وتعريض المشروع للخطر.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة طوارئ للتخفيف من تأثير المعارضة المجتمعية.",
        "correct": true
      },
      {
        "text": "إنشاء مجلس مراجعة داخلي لدمج أنشطة ضمان الجودة.",
        "correct": false
      },
      {
        "text": "عقد اجتماعات مجتمعية لإبقاء أصحاب المصلحة على علم بالتقدم المحرز والتغييرات.",
        "correct": false
      },
      {
        "text": "ضمان أن يكون تخطيط المشروع سريًا وموثقًا بشكل جيد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك مدير المشروع أن بعض أعضاء الفريق المعينين حديثًا لم يكونوا منتجين كما هو متوقع. المشروع له جدول زمني صارم للغاية، ومشكلة الإنتاجية الأقل من المتوقع تعرض المشروع للخطر.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "توفير تدريب إضافي لأعضاء الفريق الجدد.",
        "correct": true
      },
      {
        "text": "إجراء تظليل وظيفي ضمن فريق المشروع.",
        "correct": false
      },
      {
        "text": "وضع حوافز إنجاز معالم المشروع.",
        "correct": false
      },
      {
        "text": "إخطار الفريق بضرورة تحسين الإنتاجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى الشركات بإنشاء تطبيق جديد لمستخدميها. أكمل الفريق الرشيق مرحلة البدء ويقوم بإجراء عمليات التكرار لاستكمال التخطيط والتنفيذ. ومع ذلك، يريد أحد أصحاب المصلحة تغيير ترتيب المخرجات لإظهار جوانب جديدة من التطبيق لأصحاب المصلحة.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين أصحاب المصلحة في التخطيط للسباق السريع لضمان تعيين الأولويات الصحيحة.",
        "correct": true
      },
      {
        "text": "استخدم مؤشرات الأداء الرئيسية (KPIs) للتحقق من أن المشروع يسير وفق الجدول الزمني المحدد.",
        "correct": false
      },
      {
        "text": "اطلب من صاحب المصلحة تقديم طلب تغيير وتقديمه إلى مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "اشرح لصاحب المصلحة أن تعديل الجدول الزمني الآن سيزيد من مخاطر التسليم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع للتو خبرًا يفيد باعتماد لائحة تنظيمية جديدة ويتوقع أن يتم تسليم المشروع متوافقًا مع هذه اللائحة الجديدة. وقد تم توثيق ذلك في السابق كعنصر مخاطرة ذات احتمال منخفض وأثر متوسط.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة النظر في سجل المخاطر وتحديث التصنيف والاستجابة.",
        "correct": true
      },
      {
        "text": "قم بتحديث سجل المشكلات وتطبيق الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة المشروع.",
        "correct": false
      },
      {
        "text": "الشروع في طلب تغيير اللائحة المحدثة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في إطار التحضير لاجتماع مع الرئيس التنفيذي لإحدى المؤسسات، يطلب مدير المشروع من أحد أعضاء الفريق إعداد تقرير شهري للرئيس التنفيذي. قدم الرئيس التنفيذي صيغة محددة لهذه التقارير في بداية المشروع. في اليوم السابق للاجتماع، يقوم مدير المشروع بمراجعة التقرير ويكتشف أنه لم يتم تنسيقه بالشكل الذي حدده الرئيس التنفيذي.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب التقرير من عضو الفريق في وقت سابق للتأكد من أنه بالصيغة المطلوبة.",
        "correct": true
      },
      {
        "text": "طلب من المدير التنفيذي توفير متطلبات تنسيق أكثر تفصيلاً لإنشاء تقارير الحالة الشهرية.",
        "correct": false
      },
      {
        "text": "يستخدم الاتصال التفاعلي لتأكيد إقرار عضو الفريق بالصيغة المحددة.",
        "correct": false
      },
      {
        "text": "تعديل خطة إدارة الاتصالات لتشمل متطلبات تنسيق التقرير الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع متمرس بتوجيه مدير مشروع جديد تم تعيينه لمشروعه الأول. وبينما يستعد مدير المشروع الجديد للمشروع، يشعر مدير المشروع الجديد بالارتباك بسبب عدد أصحاب المصلحة الذين حددهم الفريق.\nما الذي يجب أن يطلبه مدير المشروع المتمرس من مدير المشروع الجديد أن يفعله بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإجراء تحليل لأصحاب المصلحة لتحديد الأهمية النسبية.",
        "correct": true
      },
      {
        "text": "تصنيف أصحاب المصلحة الرئيسيين باستخدام سجل المصنفات.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة الاتصالات مع تفضيلات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديد أولويات أصحاب المصلحة بناءً على سجل أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "استعرض أحد العملاء منتجًا وطلب ميزات إضافية لم تكن موجودة في وثائق المتطلبات. تم بالفعل تحسين حدود العمل الجاري (WIP) للفرق العاملة على مكونات العمل المختلفة.\nكيف يجب أن يبدأ مدير المشروع في حل متطلبات العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "بناء المنتج وفقًا لمتطلبات العميل المتفق عليها مسبقًا.",
        "correct": true
      },
      {
        "text": "ناقش جدوى الميزات الجديدة وتأثيرها مع مالك المنتج.",
        "correct": false
      },
      {
        "text": "تقسيم العمل على الميزات الإضافية مع فرق المكونات الحالية.",
        "correct": false
      },
      {
        "text": "إصدار زيادات في الميزات الإضافية للتحقق من صحة العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم أحد أعضاء فريق المشروع بإبلاغ مدير المشروع بأن جميع العناصر قد اكتملت وأن الفريق جاهز للانتقال إلى التكرار التالي. يراجع مدير المشروع لوحة التكرار ويلاحظ وجود عناصر غير مكتملة. ينتهي التكرار اليوم، ولن تكتمل العناصر الناقصة في الوقت المحدد.\nما الذي كان ينبغي على مدير المشروع القيام به لضمان اكتمال جميع العناصر المتراكمة في الوقت المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "تم التحقق من صحة العناصر المتراكمة المتراكمة التي تم التحقق من صحتها باستخدام تعريف المنجز (DoD).",
        "correct": true
      },
      {
        "text": "جداول زمنية أطول للتسليم المجدولة لدورات تكرار المشروع.",
        "correct": false
      },
      {
        "text": "طلب أن يقوم الفريق بالإبلاغ عن التقدم المحرز خلال عمليات الاستعداد اليومية.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق عرض أعمالهم بمجرد أن تصبح جاهزة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع أسبوعي للفريق، قام مدير المشروع بمراجعة التقدم المحرز في المهام، ووجد أن أحد كبار أعضاء الفريق لم يتبع الخطة. فقد أدى المهام حسب تفضيلاته الشخصية، دون التواصل مع مدير المشروع. يعتبر عضو الفريق الأقدم خبيرًا وموردًا مهمًا للمشروع.\nكيف ينبغي لمدير المشروع معالجة هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش ذلك مع المورد شخصياً، ثم قم بتحديث خطة إدارة الموارد إذا لزم الأمر.",
        "correct": true
      },
      {
        "text": "ناقش ذلك مع المدير الوظيفي، ثم قم بتحديث خطة إدارة الموارد إذا لزم الأمر.",
        "correct": false
      },
      {
        "text": "ناقش ذلك مع المدير الوظيفي، ثم قم بتحديث ميثاق الفريق إذا لزم الأمر.",
        "correct": false
      },
      {
        "text": "ناقش ذلك مع المورد شخصياً، ثم قم بتحديث ميثاق الفريق إذا لزم الأمر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء عرض المنتج، يقترح أحد أصحاب المصلحة أن المنتج لا يلبي التوقعات. ما هي الأداة التي يجب أن يستخدمها مدير المشروع لتقييم اقتراح صاحب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وصف الحد الأدنى للمنتج القابل للتطبيق (MVP)",
        "correct": true
      },
      {
        "text": "تعريف تم (DoD)",
        "correct": false
      },
      {
        "text": "تعريف الجاهزية (DoR)",
        "correct": false
      },
      {
        "text": "معايير القبول في قصة المستخدم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التنفيذ، يقدم العميل طلب تغيير للحفاظ على القيمة التجارية للمشروع، والتي كانت مهددة بسبب تغيير تنظيمي حكومي تم تنفيذه مؤخرًا. يقوم مدير المشروع بتحليل التغيير، الذي سيتطلب إعادة صياغة 50% من نواتج المشروع وسيترتب عليه تكاليف إضافية للعميل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقديم طلب التغيير إلى مجلس مراقبة السلع الاستهلاكية حيث سيكون العميل مرتاحًا لاستيعاب جميع التكاليف الإضافية.",
        "correct": true
      },
      {
        "text": "تقديم طلب التغيير إلى لجنة التغيير، وتقديم المشورة إلى اللجنة للنظر في رفض الطلب بسبب تأثيره.",
        "correct": false
      },
      {
        "text": "قم بتقديم طلب التغيير إلى مجلس مراقبة التغييرات وشرح سبب الطلب، بما في ذلك تحليل تأثير التكلفة.",
        "correct": false
      },
      {
        "text": "تقديم طلب التغيير لإظهار التغيير على أنه ليس له أي تأثير، ثم المضي قدمًا دون إخطار مجلس مراقبة السلع الأساسية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم أحد أعضاء فريق مشروع التطوير بإبلاغ مدير المشروع بأن نظام التشغيل لن يتم تثبيته في الوقت المحدد بسبب تأخر المورد في الترقية. ما الذي ينبغي لمدير المشروع أن يفعله أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد تأثير الموقف.",
        "correct": true
      },
      {
        "text": "قم بتعديل الجدول الزمني ليعكس الوضع.",
        "correct": false
      },
      {
        "text": "إبلاغ أصحاب المصلحة بالمشكلة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع إجراء عصف ذهني للحل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nصاحب مصلحة خارجي له تأثير كبير على المشروع، حيث إن لديه القدرة على الموافقة على التغييرات في نطاق المشروع والجدول الزمني والميزانية أو رفضها. ما النهج الذي يجب أن يتبعه مدير المشروع مع أصحاب المصلحة هؤلاء؟",
    "explanation": "",
    "choices": [
      {
        "text": "التواصل مع أصحاب المصلحة وفقاً لخطط إدارة مشاركة أصحاب المصلحة والاتصالات.",
        "correct": true
      },
      {
        "text": "اطلب ملاحظات من أصحاب المصلحة بحيث يلبي المشروع توقعات أصحاب المصلحة ويمكن تسليمه كما هو مخطط له.",
        "correct": false
      },
      {
        "text": "أضف صاحب المصلحة إلى سجل المخاطر وحدد مستوى التأثير الذي يمكن أن يحدثه صاحب المصلحة على أهداف المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ أصحاب المصلحة بفوائد المشروع الرئيسية وإطلاعهم على آخر المستجدات بشأن تقدم المشروع والإنجازات البارزة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تواجه إحدى الشركات حاليًا تجاوزًا في التكاليف وتحتاج إلى سيولة للتغلب على الأزمة المالية. هناك مشروع مهم قيد التنفيذ ومن المتوقع أن يحقق عائدًا نقديًا معقولاً للشركة، ومع ذلك، فإن المشروع تجاوز الميزانية. وتحتاج الإدارة العليا إلى تقييم مدى توافق المشروع مع الأهداف التنظيمية وتطلب من مدير المشروع تقديم تقرير حول هذه المسألة.\nما الذي يجب أن يفعله مدير المشروع لإعداد تقرير للإدارة؟",
    "explanation": "",
    "choices": [
      {
        "text": "فحص المستندات وتقييمها لاكتساب رؤى واستخلاص معلومات مفيدة.",
        "correct": true
      },
      {
        "text": "مقارنة النتائج الفعلية بالنتائج المخططة من خلال تحليل الفروق بين الأداء الفعلي والقيم المدرجة في الميزانية.",
        "correct": false
      },
      {
        "text": "تحديد وتحليل الأنماط أو الاتجاهات أو التغيرات في البيانات خلال فترة زمنية محددة.",
        "correct": false
      },
      {
        "text": "تقييم الجدوى الاقتصادية للمشروع، من خلال مقارنة التكاليف بالفوائد التي تتوقعها الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل مدير مشروع على تطبيق جديد لإدارة الرعاية الصحية. سيغادر أحد أعضاء الفريق المنظمة وسيتولى عضو جديد في الفريق مهامه. يشعر عضو الفريق الجديد بالقلق من أن عدة أجزاء من التطبيق الجديد لا يمكن اختبارها بعد، على الرغم من توقيع عضو الفريق المنتهية ولايته. كيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ثق بتوقيع عضو الفريق المنتهية ولايته واستمر في المشروع كما هو مخطط له.",
        "correct": true
      },
      {
        "text": "قم بإجراء مراجعة شاملة للأجزاء غير المختبرة من التطبيق قبل المتابعة.",
        "correct": false
      },
      {
        "text": "أبلغ عضو الفريق الجديد أن الاختبار سيحدث في مرحلة لاحقة من المشروع.",
        "correct": false
      },
      {
        "text": "تأكد من قيام عضو الفريق المنتهية ولايته بإنشاء وثيقة نقل المعرفة لعضو الفريق الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد لمشروع رشيق مستمر. يبدأ المشروع الآن دورة التكرار الثانية التي تستغرق 4 أسابيع. يجد مدير المشروع أن هناك اختلافات كبيرة في الرأي داخل فريق المشروع، مما يؤدي إلى انتكاسات كبيرة للمشروع.\nما الذي يجب على مدير المشروع فعله للمساعدة في التغلب على الخلافات وإعادة المشروع إلى مساره الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعزيز الحوار بين أعضاء الفريق في اجتماعات المراجعة القادمة للمساعدة في حل المشكلة.",
        "correct": true
      },
      {
        "text": "حدد موعدًا لنشاط جماعي في الخارج للسماح للأشخاص بالتعرف على بعضهم البعض بشكل أفضل والشعور بالراحة في الحديث.",
        "correct": false
      },
      {
        "text": "اسمح للفريق بالتنظيم الذاتي قبل التكرار التالي لحل المشكلة.",
        "correct": false
      },
      {
        "text": "تواصل مع مديريهم الوظيفيين حتى يتمكنوا من التحدث مع أعضاء الفريق وحل المشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه فريق المشروع، الموزع في ثلاثة بلدان مختلفة، صعوبة في ترتيب الاجتماعات. كما أن أعضاء الفريق غير واضحين بشأن متطلبات المشروع ويواجهون صعوبة في الحصول على إجابات لأسئلتهم.\nما الذي يجب القيام به لزيادة نجاح المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل بشكل مستقل حتى يصبح من الضروري دمج العمل.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات وزيادة تبادل المعلومات.",
        "correct": false
      },
      {
        "text": "زيادة وتيرة اجتماعات الفريق لمناقشة أي أسئلة.",
        "correct": false
      },
      {
        "text": "طرح الأسئلة على المدراء الوظيفيين لحل المشكلات في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تتبنى إحدى المؤسسات نهجًا رشيقًا لتلبية متطلبات عملائها. وقبل ذلك، كانت المنظمة تعمل قبل ذلك مع موارد متخصصة ومديري مشاريع متخصصين تم تعيينهم للمشروع لفترة زمنية محددة.\nما الذي يجب على المنظمة تغييره لتبني النهج الرشيق لتخطيط الموارد بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يطلب مالك المنتج تعيين متخصصين في الفريق فقط عند الحاجة إليهم.",
        "correct": true
      },
      {
        "text": "يجب أن يتكون الفريق من اختصاصيين ومتخصصين قادرين على التكيف مع المتطلبات المتغيرة.",
        "correct": false
      },
      {
        "text": "يجب أن يقرر الفريق الرشيق متطلبات العميل التي سيتم تطويرها وتسليمها.",
        "correct": false
      },
      {
        "text": "يجب تقليل مشاركة العملاء من أجل تجنب الاضطرابات والارتباك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بالإشراف على مشروع مشتريات لشركة لديها فريق مخصص لإدارة المشتريات يتولى جميع العقود. ويحدد التقرير الفصلي ستة عقود لا تتماشى مع أهداف الشركة.\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "احتفظ بالعقود الستة على الرغم من عدم توافقها.",
        "correct": true
      },
      {
        "text": "اقتراح إنهاء جميع العقود غير المتوائمة.",
        "correct": false
      },
      {
        "text": "اطلب من راعي المشروع مراجعة العقود.",
        "correct": false
      },
      {
        "text": "مطالبة العميل بمراجعة العقود.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "واجه مشروع تطوير منتج مشاكل في التصميم. ونتيجة لذلك، قرر الفريق تغيير نهج مرحلة تصميم المنتج من نهج تنبؤي إلى نهج تكراري.\nما الذي يجب أن يفعله مدير المشروع لضمان الانتقال السلس بين المناهج؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعدًا لورشة عمل مع الفريق للتخطيط للتكرارات القادمة.",
        "correct": true
      },
      {
        "text": "العمل مع الفريق لإنشاء موقع الفريق ومقتنيات المنتج.",
        "correct": false
      },
      {
        "text": "اجتمع مع مدير المنتج لتحليل قصص المستخدمين القادمة.",
        "correct": false
      },
      {
        "text": "اعمل مع مدير المنتج لتحديد عدد التكرارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع لمراجعة المشروع، أبلغ أحد المستخدمين النهائيين أن أجهزة الكمبيوتر الشخصية التي تم توفيرها للاختبار تعاني من تدهور في الأداء.\nما هي الإجراءات الثلاثة الفورية التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتسجيل المشكلة في سجل المشكلات.",
        "correct": true
      },
      {
        "text": "تغيير نطاق المشروع.",
        "correct": false
      },
      {
        "text": "تعيين ملكية المشكلة.",
        "correct": false
      },
      {
        "text": "شراء أجهزة كمبيوتر شخصية جديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "على الرغم من أن المشروع يعمل ضمن حدوده الزمنية ونطاقه وميزانيته، إلا أن مدير المشروع يعلم أن راعي المشروع غير راضٍ عن التقدم المحرز فيه.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء مراجعات وتقييمات متكررة لتحديد أي مخاطر محتملة ومعالجتها.",
        "correct": true
      },
      {
        "text": "مواءمة أهداف المشروع مع توقعات ومتطلبات الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "التواصل بانتظام مع راعي المشروع لتقديم التحديثات ومعالجة أي مخاوف.",
        "correct": false
      },
      {
        "text": "تنفيذ تدابير رقابية صارمة لضمان الوفاء بمراحل المشروع الرئيسية ونواتجه.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء إغلاق المشروع، يرى الفريق أن الاستعراض بأثر رجعي للسباق النهائي ليس ضروريًا لأنه لا توجد سباقات سريعة متبقية. ما هي النتيجة المفيدة المحتملة لعقد هذا الاستعراض بأثر رجعي للسباق السريع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحسن في السرعة إذا تم تشكيل الفريق نفسه في المستقبل",
        "correct": true
      },
      {
        "text": "فرص الترقية لأعضاء الفريق",
        "correct": false
      },
      {
        "text": "المعلومات التي يمكن أن تكون مفيدة للمشاريع المستقبلية",
        "correct": false
      },
      {
        "text": "نصائح للتكيف مع العمل معًا إذا حدث ذلك في المستقبل القريب",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أجرى مدير المشروع تحليلاً مع أصحاب المصلحة المعنيين للتحقق من توافق المشروع مع الاستراتيجية التنظيمية وقيمة الأعمال المتوقعة. وغاب العديد من أصحاب المصلحة الرئيسيين عن جلسة التحليل ولم يتم تضمين مدخلاتهم في التحليل.\nما هي النتيجة الرئيسية لعدم حضور أصحاب المصلحة جلسة التحليل؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأخرت الموافقة الرسمية على طلبات تغيير المشروع.",
        "correct": true
      },
      {
        "text": "عدم رضا أصحاب المصلحة عن مخرجات المشروع الرئيسية.",
        "correct": false
      },
      {
        "text": "قد ينتج عن ذلك تعارض في المراحل اللاحقة للمشروع.",
        "correct": false
      },
      {
        "text": "مدخلات غير متسقة بشأن الفوائد من أصحاب المصلحة الرئيسيين.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعلن أحد الأعضاء الرئيسيين في فريق المشروع علنًا أن عضوًا آخر في الفريق يتحدث عنه بشكل سلبي. ويهدد عضو الفريق بالاستقالة من وظيفته إذا لم يتخذ مدير المشروع إجراءً فورياً لمعالجة النزاع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "الدعوة إلى اجتماع للفريق لأن المشروع في خطر بدون عضو الفريق الرئيسي.",
        "correct": true
      },
      {
        "text": "الاجتماع مع عضو الفريق المتهم لفهم وجهة نظره.",
        "correct": false
      },
      {
        "text": "حدد موعدًا للاجتماع في المستقبل للسماح للمشكلة بالانتشار مع مرور الوقت.",
        "correct": false
      },
      {
        "text": "قرر إزالة أحد عضوي الفريق لمعالجة النزاع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب فريق القيادة في إحدى الشركات من مدير المشروع تحديثًا مخصصًا لحالة آخر تكرار لمشروع ما. قام مدير المشروع بتوجيه فريق القيادة إلى ملف المشروع. أبلغ فريق القيادة مدير المشروع أن بعض المعلومات مفقودة.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب من الفريق مراجعة المجلد قبل مشاركته وإضافة المعلومات الناقصة.",
        "correct": true
      },
      {
        "text": "حدد موعدًا لاجتماع الفريق لمناقشة المعلومات الناقصة مع فريق القيادة.",
        "correct": false
      },
      {
        "text": "فحص ملف المشروع بعناية قبل مشاركته مع فريق القيادة.",
        "correct": false
      },
      {
        "text": "قم بتحديث مجلد المشروع بانتظام لضمان أن تكون عناصر المشروع محدثة دائمًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يقرر راعي المشروع استبدال خبير متخصص في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تفاوض مع الجهة الراعية للمشروع للاحتفاظ بالمشروع مع الشركة الصغيرة والمتوسطة في المشروع.",
        "correct": true
      },
      {
        "text": "التأكد من وجود نقل كافٍ للمعرفة بين الشركة الصغيرة والمتوسطة ومن يحل محلها.",
        "correct": false
      },
      {
        "text": "بيّن للمؤسسة الصغيرة والمتوسطة الجديدة أن القاعدة المعرفية للمشروع تحتوي على جميع المعلومات المطلوبة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع راعي المشروع لشرح التعارضات بين فريق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع عروض أسعار من بائعين اثنين لنفس القطع. وقد أبلغ البائع \"أ\" مدير المشروع أنه نفذ طلبًا مماثلًا قبل شهرين بسعر يقل بنسبة 2% عن التكلفة الأصلية المخطط لها. البائع (ب) لديه تاريخ من التسليم في الوقت المحدد ولكنه أعلن عن زيادة في السعر.\nكيف ينبغي لمدير المشروع تقييم هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة الاتفاقيات ووثائق المشتريات الخاصة بالمورّد \"ب\" لإجباره على الاحتفاظ بالتسعير الأصلي.",
        "correct": true
      },
      {
        "text": "تقييم بنود العقد لتقليل الطلبات من البائع \"ب\"، وشرائها من البائع \"أ\" لتحسين مؤشرات المشروع.",
        "correct": false
      },
      {
        "text": "استخدم المقاييس من المورد \"أ\" لطلب تسعير أفضل من المورد \"ب\"، مع الاحتفاظ بكلا الموردين كاستراتيجية لتخفيف المخاطر.",
        "correct": false
      },
      {
        "text": "راجع معلومات أداء العمل لكلا الموردين مقابل عقودهم للعثور على المورد المفضل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتوزع فريق مشروع التكيف على مستوى العالم ويتحدث أعضاء الفريق لغات أساسية مختلفة. تُعقد الاجتماعات اليومية افتراضياً بلغة مشتركة. يدرك مدير المشروع أن هناك بعض المشاكل في التواصل. الاختلافات في النطق واللهجة والمفردات تجعل من الصعب للغاية على بعض الأعضاء فهم بعضهم البعض.\nما الذي يجب على مدير المشروع تفصيله لتحسين الاجتماع اليومي وتجنب سوء الفهم؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم المكالمة لتلخيص حالة العمل شفهياً كما أبلغ عنها أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "استخدم لوحة المهام الإلكترونية لإعطاء تمثيل مرئي لحالة العمل والتقدم المحرز.",
        "correct": false
      },
      {
        "text": "اطلب إجراء تغيير في ميزانية المشروع لتوفير إمكانية الوصول إلى خدمة الترجمة.",
        "correct": false
      },
      {
        "text": "اطلب من جميع أعضاء الفريق تقديم تقارير عن العمل المنجز والعمل القادم والمعيقات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى المؤسسات بالاستحواذ على منتج مماثل في منتصف دورة تطوير منتج محتمل. قد يؤدي ذلك إلى تداخل في حافظة المنتجات.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم جدوى المشروع وجدواه مع مالك المنتج.",
        "correct": true
      },
      {
        "text": "الاستمرار في تطوير المنتج لصالح المنظمة.",
        "correct": false
      },
      {
        "text": "ناقش التأثير المحتمل لعملية الاستحواذ مع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "أوقف المشروع حتى يظهر مسار واضح لخارطة طريق المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيدرك مدير المشروع أن رسالة بريد إلكتروني موجهة إلى عضو معين في الفريق قد تم إرسالها عن طريق الخطأ إلى فريق المشروع العالمي بأكمله. يحتوي هذا البريد الإلكتروني على ملاحظات مهمة تتعلق بحادث وقع مؤخراً. ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تجاهل الخطأ وافترض أن أعضاء الفريق سيتفهمون الموقف.",
        "correct": true
      },
      {
        "text": "اعترف بالخطأ واعتذر عن أي عواقب غير مقصودة.",
        "correct": false
      },
      {
        "text": "اطلب من مستلمي البريد الإلكتروني غير المقصودين حذف الرسالة دون قراءتها.",
        "correct": false
      },
      {
        "text": "أرسل رسالة خاصة إلى عضو الفريق تعتذر فيها عن الملاحظات الناقدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق رشيق بتطوير منتج مع قيود صارمة على الميزانية. يطلب العميل إضافة ميزة مستقلة جديدة إلى الحل قيد التطوير. يشعر مدير المشروع بالقلق من أن إضافة الميزة الجديدة ستتجاوز الميزانية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم الميزة الجديدة مع العميل.",
        "correct": true
      },
      {
        "text": "رفض إضافة الميزة الجديدة.",
        "correct": false
      },
      {
        "text": "أضف الميزة الجديدة إلى تراكمات المنتج.",
        "correct": false
      },
      {
        "text": "إعادة ترتيب أولويات المنتجات المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتطلب تنفيذ مشروع بناء في منطقة نائية أن يعيش أعضاء الفريق معًا في مهاجع الشركة عندما يُطلب منهم التواجد في الموقع. يتوجه العديد من أعضاء الفريق إلى مدير المشروع للشكوى من الطريقة التي يتصرف بها أحد أعضاء الفريق بعد العمل. وقد أعربوا عن مخاوفهم من أن هذا السلوك يؤثر سلبًا على معنويات الفريق وتماسكه.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع لمناقشة المشكلة مع الفريق.",
        "correct": true
      },
      {
        "text": "خطط لجلسة بناء الفريق لمناقشة المشكلة.",
        "correct": false
      },
      {
        "text": "انقل عضو الفريق المعني إلى مهجع جديد.",
        "correct": false
      },
      {
        "text": "مراجعة معايير الفريق ومناقشتها مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لقيادة برنامج مشروع متعدد الجنسيات مع فريق عمل موزع جغرافيًا. يتواجد أعضاء الفريق في بلدان مختلفة ولديهم آراء مختلفة حول إعداد تقارير الحالة. يفضل البعض التقارير المفصلة، بينما يفضل البعض الآخر أن تكون موجزة. يرغب بعض أعضاء الفريق في إرسال تقارير حالة يومية، بينما يرغب آخرون في إرسال تقارير حالة أسبوعية.\nكيف ينبغي لمدير المشروع حل المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق الالتزام بخطة إدارة الاتصالات.",
        "correct": true
      },
      {
        "text": "رفع مشكلة الإبلاغ إلى الجهة الراعية للمشروع للحصول على إرشادات.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق حل المشكلة فيما بينهم.",
        "correct": false
      },
      {
        "text": "تغيير القالب الحالي لإعداد تقارير الحالة لاستيعابها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء جمع المتطلبات الخاصة بنطاق المشروع، يدرك مدير المشروع أن بعض متطلبات أصحاب المصلحة تتعارض مع متطلبات المشروع.\nما الذي يجب أن يفعله مدير المشروع لتحديد نطاق واضح؟",
    "explanation": "",
    "choices": [
      {
        "text": "مساعدة أصحاب المصلحة المتأثرين في التوصل إلى توافق في الآراء.",
        "correct": true
      },
      {
        "text": "اتبع توصية الاستشاري الفني.",
        "correct": false
      },
      {
        "text": "رفع الأمر إلى راعي المشروع لاتخاذ قرار.",
        "correct": false
      },
      {
        "text": "عقد اجتماع مع الأطراف المختلفة فقط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء سير المشروع، يتعين على الفريق معالجة المشكلات غير المتوقعة التي قد تؤثر على الجدول الزمني والميزانية. وتتطلب العديد من المشكلات حلًا فوريًا قبل أن يتسنى معالجة المشكلات المترابطة الأخرى. تشير خطة إدارة الاتصالات إلى أن العميل وأصحاب المصلحة الداخليين الرئيسيين لا يحتاجون إلا إلى تقارير شهرية.\nكيف ينبغي لمدير المشروع أن ينقل تأثير هذه المشكلات؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتحديث سجل مشكلات المشروع لضمان تسجيل مشكلات التواصل داخلياً.",
        "correct": true
      },
      {
        "text": "الاحتفاظ بتقارير شهرية للعملاء وأصحاب المصلحة الداخليين كما هو موضح في خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "زيادة التواصل مع العميل وأصحاب المصلحة حسب الضرورة لإدارة المشكلات وتأثيرها.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات وطلب الموافقة على الخطة المنقحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتمتع فريق المشروع بإمكانية الوصول الكامل إلى جميع البيانات المتعلقة بالمشروع، بما في ذلك البيانات والمعلومات المرئية مثل مخطط جانت ومصفوفة تحديد الأولويات وخريطة القصة والمدخلات الأخرى. ومع ذلك، يطلب أحد أعضاء فريق المشروع مرارًا وتكرارًا تفاصيل أكثر دقة عن حزمة العمل مما يشير إليه مخطط جانت. يتم التأكد من أن مخطط جانت شامل وحديث، ويشعر أعضاء فريق المشروع الآخرون أن مخطط جانت الحالي مفصل بما فيه الكفاية.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء قناة اتصال جديدة مع تحديثات دقيقة.",
        "correct": true
      },
      {
        "text": "تأكد من فهم عضو الفريق لعملية استرجاع المعلومات التفصيلية.",
        "correct": false
      },
      {
        "text": "ذكّر عضو فريق المشروع بأن مخطط جانت هو الشكل المتفق عليه.",
        "correct": false
      },
      {
        "text": "استمر في تجاهل طلبات أعضاء فريق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء الفحص النهائي لمنتج جديد، يكتشف فريق المشروع عيبًا كبيرًا في أحد المخرجات الرئيسية. ويشكل هذا العيب خطراً أمنياً على العميل الذي يتوقع البدء في استخدام الناتج في غضون أسبوعين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تحقيق الجودة وبدء الإجراءات التصحيحية.",
        "correct": true
      },
      {
        "text": "استخدم احتياطي الطوارئ لتغطية تكلفة العيب.",
        "correct": false
      },
      {
        "text": "مقابلة العميل لشرح سبب الخلل.",
        "correct": false
      },
      {
        "text": "أرسل للعميل رسالة اعتذار عن الإزعاج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nخلال مشروع متعدد التخصصات، يكتشف مدير المشروع أن هناك العديد من الخلافات حول التصميم بين أعضاء الفريق من مختلف التخصصات. ما الذي يجب أن يفعله مدير المشروع لضمان التنفيذ السلس للمشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد المسألة باعتبارها مخاطرة والتحقق من احتياطيات الميزانية المتاحة.",
        "correct": true
      },
      {
        "text": "تأكد من أن راعي المشروع على علم بالوضع الحالي.",
        "correct": false
      },
      {
        "text": "قم بالتصعيد إلى المديرين الفنيين وابحث عن حل.",
        "correct": false
      },
      {
        "text": "تيسير مناقشات الفريق لتحقيق النتائج المرجوة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يشكك أحد أصحاب المصلحة في الغرض من المشروع ويريد إيقاف المشروع مؤقتًا لتقييم عملية جديدة قد تؤثر على الناتج النهائي.\nما هو أول شيء يجب على مدير المشروع القيام به؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم شبكة القوة/المصلحة لتحديد تأثير أصحاب المصلحة على تنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "التشاور مع راعي المشروع لتحديد الخطوات التالية والعملية الجديدة المحتملة.",
        "correct": false
      },
      {
        "text": "قم بتأجيل أي تغييرات في مشروع مستقبلي من أجل إنجاز النواتج في المشروع الحالي.",
        "correct": false
      },
      {
        "text": "إعادة النظر في معايير القبول مع أصحاب المصلحة للتأكد من أن مستوى الجودة مناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتقوم إحدى الشركات بتنفيذ نهج رشيق لمشروع جديد. ما هو الإجراء الذي ينبغي لمدير المشروع اتخاذه لضمان عمله كقائد خادم؟",
    "explanation": "",
    "choices": [
      {
        "text": "حافظ على رقابة صارمة على الفريق وأنشطته.",
        "correct": true
      },
      {
        "text": "العمل كاحتياطي في حالة مرض أحد أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تأكد من أن الفريق يتبع جميع العمليات كما هي محددة دون تشكيك.",
        "correct": false
      },
      {
        "text": "فهم الاختناقات ودعم الفريق لإزالتها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع في مرحلة رئيسية من التنفيذ ويكرس الجميع جهودهم لتحقيق النجاح. يقوم المدير الوظيفي فجأة بسحب أحد أعضاء الفريق الرئيسيين للاستجابة لحالة طارئة دون التواصل مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من تقويم الموارد للعثور على عضو آخر في الفريق.",
        "correct": true
      },
      {
        "text": "إبلاغ راعي المشروع والإدارة التنفيذية بالحالة.",
        "correct": false
      },
      {
        "text": "التواصل مع المدير الوظيفي وطلب عودة العضو الرئيسي.",
        "correct": false
      },
      {
        "text": "راجع التأثير على المشروع وحدد موعدًا للاجتماع مع المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء حضور اجتماع الحوكمة مع الإدارة العليا، يتم إبلاغ مدير المشروع شفهيًا عن تدقيق خارجي وشيك لمشاريع مختارة. وسيتيح التدقيق للمنظمة الحفاظ على شهادة الجودة الخاصة بها.\nما الذي يجب أن يفعله مدير المشروع أولاً للتحضير للتدقيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث جميع وثائق المشروع ذات الصلة بالوضع الحالي للمشروع.",
        "correct": true
      },
      {
        "text": "قم بتعليق المشروع لضمان الامتثال الكامل لعملية التدقيق.",
        "correct": false
      },
      {
        "text": "تواصل مع المدققين لفهم نطاق التدقيق ومتطلباته.",
        "correct": false
      },
      {
        "text": "اجتمع مع الفريق وأبلغهم بنطاق التدقيق ومتطلباته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى توافق التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "قابل العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى امتثال التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "قابل العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيلاحظ مدير المشروع الذي يدير فريقاً كبيراً أن أعضاء الفريق لا يتفاعلون معاً، مما يؤثر على أداء المشروع وجودة نتائج المشروع. ما الذي يجب أن يفعله مدير المشروع للمساعدة في تنمية ديناميكيات الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماعات جماعية وجهاً لوجه لفهم ماهية المشكلات.",
        "correct": true
      },
      {
        "text": "قم بإخطار المشرفين على أعضاء فريق المشروع بعدم تعاونهم.",
        "correct": false
      },
      {
        "text": "إضافة نقص التواصل الجماعي كمخاطر في سجل المخاطر ومراقبة الوضع.",
        "correct": false
      },
      {
        "text": "ارجع إلى الدروس المستفادة لفهم كيفية تعامل المشاريع الأخرى مع المشكلات المماثلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء التحقق من صحة التسليمات، يدرك مدير المشروع أن أحد أعضاء فريق المشروع استخدم نسخة قديمة من وثيقة تعريف النطاق، مما تسبب في حدوث أخطاء كبيرة. ما الذي يجب أن يفعله مدير المشروع لإدارة هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش آخر المنجزات خلال الاجتماع القادم.",
        "correct": true
      },
      {
        "text": "تحديث سجل مستندات المشروع.",
        "correct": false
      },
      {
        "text": "إجراء عملية التحكم في التغيير.",
        "correct": false
      },
      {
        "text": "مشاركة وثيقة تعريف النطاق المحدثة مع الفريق .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع لمشروع تطوير تطبيقات الهاتف المحمول. ويدرك مدير المشروع أن النهج الرشيق هو الأنسب للمشروع، ولكن معظم الفريق ليس لديه خبرة في النهج الرشيق.\nماذا يجب أن يفعل مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام نهج رشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب إعادة إسناد المشروع إلى فريق مشروع يتمتع بخبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "اطلب استبدال أعضاء الفريق الذين لم يسبق لهم استخدام الأساليب الرشيقة.",
        "correct": false
      },
      {
        "text": "ترتيب التدريب على مبادئ وعقلية العمل الرشيق لفريق المشروع الحالي.",
        "correct": false
      },
      {
        "text": "استخدم نهجًا تنبؤيًا لأن فريق المشروع على دراية بهذا النهج بالفعل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في اجتماع مشروع رشيق، يقدم أحد أعضاء الفريق تحديثًا لحالة مهمته المهمة. يقاطعه عضو جديد في الفريق عندما يسمع ذكر مهمته ويعطي تحديثًا للحالة قبل أن ينتهي عضو الفريق الأول من تحديثه.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحدث على انفراد مع عضوي الفريق بعد الاجتماع.",
        "correct": true
      },
      {
        "text": "أخبر عضو الفريق الجديد أنه يتصرف بشكل غير احترافي.",
        "correct": false
      },
      {
        "text": "وقفة لمناقشة بروتوكول الاجتماع المناسب مع الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من عضو الفريق الجديد الانتظار حتى ينتهي زميله في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يعمل في منظمة مصفوفة يدير مشروعًا من المقرر أن ينتهي خلال شهر واحد. في اجتماع المشروع اليوم، تم إبلاغ مدير المشروع أن الأخطاء التي تصادف في رمز البرنامج تتزايد باطراد. أثناء المناقشات مع قائد فريق التطوير، تم إخبار مدير المشروع أن هذا أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوت الموعد النهائي، لكن مدير المشروع يشعر بالقلق\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في الجدول الزمني للمشروع لإتاحة المزيد من الوقت للتطوير.",
        "correct": true
      },
      {
        "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أنه تم تخفيف المخاطر",
        "correct": false
      },
      {
        "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يتوافق مع متطلبات الجودة الموثقة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير من خلال عملية التحكم في التغيير لتمديد الموعد النهائي، مما يتيح المزيد من الوقت للتطوير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون أحد المشاريع متأخراً عن الجدول الزمني المحدد له عندما يتم تعيين عضو جديد في الفريق معروف بأدائه العالي في الفريق. وأثناء تقييم العضو الجديد في الفريق، يدرك مدير المشروع أن هذا الشخص يفتقر إلى التدريب اللازم للمشروع المحدد، لكنه يمتلك المهارات والخبرة ذات الصلة للانضمام إلى الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من تلقي عضو الفريق التدريب قبل الانضمام إلى الفريق.",
        "correct": true
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة الهامة تحت المراقبة الدقيقة أثناء تلقيه التدريب.",
        "correct": false
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة غير الحرجة دون مراقبة دقيقة أثناء توفير التدريب",
        "correct": false
      },
      {
        "text": "رفض إضافة عضو الفريق الجديد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بتجميع فريق يضم مزيجاً من أعضاء الفريق الجدد وذوي الخبرة. يكتشف مدير المشروع أن هناك مشاكل في تماسك الفريق. يعتقد أعضاء الفريق من ذوي الخبرة أن أعضاء الفريق الجدد يفتقرون إلى المهارات التقنية المطلوبة لأداء العمل اللازم ويتوقعون أن عليهم التعويض عن قلة خبرتهم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم مكافآت أو حوافز أخرى لأعضاء الفريق ذوي الخبرة لتوجيه أعضاء الفريق الجدد.",
        "correct": true
      },
      {
        "text": "تحليل مهارات جميع أعضاء الفريق وتحديد الثغرات ووضع خطط لمعالجتها.",
        "correct": false
      },
      {
        "text": "إعادة تعيين أعضاء الفريق الجدد في مشاريع تتوافق بشكل أفضل مع مهاراتهم وخبراتهم.",
        "correct": false
      },
      {
        "text": "اشرح أنه من المتوقع أن يقوم أعضاء فريق المشروع المحترفون بحل المشكلات دون تدخل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق المشروع الذي يعمل على مشروع ذي أولوية عالية يحركه التغيير قد فاتته مراراً وتكراراً المواعيد النهائية للإصدار. ويحدد مدير المشروع أن هذا يرجع إلى أن أحد أعضاء الفريق من ذوي الخبرة مكلف بمشاريع متعددة ولديه نطاق عمل محدود.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ الجهة الراعية للمشروع بالمشكلة.",
        "correct": true
      },
      {
        "text": "تعديل الجدول الزمني وإصدار طلب تغيير.",
        "correct": false
      },
      {
        "text": "ناقش هذه المشكلة مع فريق المشروع على الفور.",
        "correct": false
      },
      {
        "text": "تقييم عبء عمل عضو الفريق المتمرس.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين عن طريق المكالمات الهاتفية فقط، كما هو مبين في خطة إدارة الاتصالات. بعد مرور ثلاثة أسابيع على تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال المخصصة الزائدة عن الحاجة من صاحب المصلحة هذا.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "استمر في التواصل عبر المكالمات الهاتفية لأنها كانت فعالة حتى الآن.",
        "correct": true
      },
      {
        "text": "اجتمع مع أصحاب المصلحة لمناقشة احتياجاتهم وتوقعاتهم في مجال التواصل.",
        "correct": false
      },
      {
        "text": "إرسال بريد إلكتروني إلى صاحب المصلحة لطلب تغيير نهج التواصل.",
        "correct": false
      },
      {
        "text": "تعيين أحد أعضاء الفريق للعمل كحلقة وصل بين مدير المشروع وأصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المراحل الأولى من تشكيل الفريق، يكون مدير المشروع غير قادر على التركيز على المهام الرئيسية لأن أعضاء الفريق يطلبون المساعدة باستمرار لحل النزاعات المتعلقة بتفسير متطلبات العميل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تمكين الفريق من حل النزاعات فيما بينهم.",
        "correct": true
      },
      {
        "text": "اقضِ بعض الوقت في حل هذه النزاعات مع الفريق.",
        "correct": false
      },
      {
        "text": "استخدم لجنة حل النزاعات للمساعدة في حل هذه النزاعات.",
        "correct": false
      },
      {
        "text": "تصعيد النزاعات إلى مدير البرنامج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع لتكنولوجيا المعلومات (IT) بفريق جديد لمشروع تطوير برمجيات في بيئة رشيقة. يقدّر مدير المشروع أن المشروع سيستغرق عددًا معينًا من الأيام استنادًا إلى الخبرة السابقة في مؤسسة أخرى.\nكيف يجب على مدير المشروع التحقق من صحة هذا الافتراض وتخطيط وإدارة الجدول الزمني للمشروع بشكل صحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء مسح في المؤسسة وإنشاء بيانات للتحقق من صحة المطالبات.",
        "correct": true
      },
      {
        "text": "التقدير استناداً إلى اجتماعات مراجعة السباق السريع ومدخلات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دراسة اجتماعات التخطيط السابقة لسباق السرعة وثقافة المشروع في المؤسسة.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام فريق المشروع بتسليم مخرجات المشروع، ولكن مدير المشروع يرغب في تقييم ما إذا كان المشروع قد حقق القيمة المرجوة منه للجهة الراعية.\nما هو العامل الأكثر ملاءمة لمدير المشروع لتقييمه؟",
    "explanation": "",
    "choices": [
      {
        "text": "مواءمة ما تم إنجازه مع توقعات الجهة الراعية.",
        "correct": true
      },
      {
        "text": "ما إذا كانت مخرجات المشروع قد زادت من الدخل المحتمل للجهة الراعية.",
        "correct": false
      },
      {
        "text": "ما إذا كانت فروق أداء التسليم ضمن الحدود التي حددتها الجهة الراعية.",
        "correct": false
      },
      {
        "text": "التزام المشروع بشكل عام بقيود النطاق والوقت والميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعاني أعضاء الفريق الرشيق من صعوبات. في حين أن هناك ثقة بين أعضاء الفريق، فإن غالبية قرارات الفريق يتخذها عدد قليل من أعضاء الفريق الأكثر خبرة.\nما الذي يجب أن يفعله مدير المشروع من أجل تمكين فريق عمل عالي الأداء؟",
    "explanation": "",
    "choices": [
      {
        "text": "ثني أعضاء الفريق ذوي الخبرة عن التحدث أولاً، والسماح للآخرين بتقديم أفكارهم.",
        "correct": true
      },
      {
        "text": "تيسير الاجتماعات لضمان مشاركة جميع أعضاء الفريق في قرارات الفريق.",
        "correct": false
      },
      {
        "text": "تدريب الفريق لضمان تقديم جميع الأعضاء للأفكار وتحقيق توافق في الآراء بين أعضاء الفريق",
        "correct": false
      },
      {
        "text": "قم بإثارة المشكلة في جلسة استرجاعية واطلب من الفريق إضفاء الطابع الرسمي على اتفاقيات الفريق الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في أحد مشاريع تطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعرون أنه سيكون ذا فائدة كبيرة للمشروع. ومع ذلك، فإن هذا المطلب لا يتماشى مع أهداف المشروع التي وثقها صاحب العمل\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من فهم أصحاب المصلحة للغرض من المشروع.",
        "correct": true
      },
      {
        "text": "تشجيع أصحاب المصلحة على اتباع متطلبات العمل المكتوبة.",
        "correct": false
      },
      {
        "text": "تضمين المتطلبات الإضافية في المشروع وإبلاغ صاحب العمل.",
        "correct": false
      },
      {
        "text": "المسار السريع للمشروع واقتراح المتطلبات الجديدة على صاحب العمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع رشيق في البلد \"أ\" مع فريق التطوير ومحلل الأعمال في البلد \"ب\"، وفريق ضمان الجودة في البلد \"ب\" خلال السباق الثاني، يتضح أن جميع حالات الاختبار قد فشلت يتأكد الميسر الرشيق من أن محلل الأعمال قد غير معايير قبول القصص وأبلغ هذه التغييرات إلى فريقه المحلي فقط.\nما الذي يجب أن ينفذه مدير المشروع الرشيق من الآن فصاعداً لمنع تكرار ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "حماية كلمة المرور على قصص المستخدمين",
        "correct": true
      },
      {
        "text": "وثائق مراقبة التغيير الموقعة",
        "correct": false
      },
      {
        "text": "إشعارات التغيير التلقائية من أداة قصة المستخدم",
        "correct": false
      },
      {
        "text": "تهيئة التراكمات المتراكمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشارك خبير متخصص ذو مهارة عالية في مشروع حكومي حيث سيتبع ما يقرب من 30 من النواتج نهجًا رشيقًا. ويدعو مدير المشروع الخبير الصغير والمتوسط الحجم للانضمام إلى فريق العمل الرشيق للمساهمة في هذه التكرارات. لكن الشركة الصغيرة والمتوسطة مترددة لأنها تعتقد أن العمل ضمن فريق عمل محبط ومثبط للهمم ويبطئ من وتيرة العمل، كما أنها تريد تحقيق أعلى جودة ممكنة للمخرجات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة مخاوف الشركات الصغيرة والمتوسطة وتشجيعها على الانضمام إلى فريق العمل الرشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "التوصية بتطوير الذكاء العاطفي لدى الشركات الصغيرة والمتوسطة من خلال الاندماج مع الفريق.",
        "correct": true
      },
      {
        "text": "اشرح أن العمل الجماعي يعزز التحسين المستمر وحلقات التغذية الراجعة المبكرة.",
        "correct": false
      },
      {
        "text": "اطلب أن يقوم الخبير الصغير والمتوسط بإجراء الاجتماعات الاستعراضية كمراقب موضوعي.",
        "correct": false
      },
      {
        "text": "اطلب من الراعي الاجتماع مع الشركة الصغيرة والمتوسطة والمساعدة في تحسين موقفها تجاه العمل الجماعي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد مدير المشروع أن إحدى المهام في المسار الحرج متأخرة عن الجدول الزمني. يعتقد مدير المشروع أن الموارد الإضافية ستساعد، لكن الإدارة العليا رفضت طلب التمويل الإضافي اللازم لإضافة موارد إضافية. يجب على مدير المشروع العمل بالموارد والميزانية المعتمدة.\nما هي الممارسة الأنسب لمدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تسوية الموارد",
        "correct": true
      },
      {
        "text": "التحطم",
        "correct": false
      },
      {
        "text": "التتبع السريع",
        "correct": false
      },
      {
        "text": "تحليل سيناريو ماذا لو",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تجميع فريق عالمي متعدد الوظائف لتنفيذ مبادرة متعددة الجنسيات. ما الذي ينبغي لمدير المشروع أن يفعله لضمان المشاركة الكاملة للفريق في جميع مراحل المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنسيق معلومات المنطقة الزمنية والاتفاق على أوقات الاجتماعات.",
        "correct": true
      },
      {
        "text": "ضمان تقديم البرامج بلغات متعددة.",
        "correct": false
      },
      {
        "text": "ترجمة وثائق المشروع.",
        "correct": false
      },
      {
        "text": "تقديم إرشادات حول الأدوات والممارسات الشائعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تعيين مدير مشروع للتو فريق مشروع جديد ويحتاج إلى تعيين المهام لمشروع قادم بسرعة وفعالية. ولضمان إسناد المهام إلى الموارد المناسبة، ما هو النهج الذي ينبغي اتباعه؟",
    "explanation": "",
    "choices": [
      {
        "text": "وزع المهام بالتساوي لأن الفريق يجب أن يتمتع جميع أفراده بمهارات متساوية.",
        "correct": true
      },
      {
        "text": "خصص المهام الأكثر تعقيدًا للأعضاء الأقدم في فريق المشروع.",
        "correct": false
      },
      {
        "text": "قم بتقييم خلفية الفريق وخبرته وقدراته، ثم قم بتعيين المهام.",
        "correct": false
      },
      {
        "text": "تعيين أعضاء الفريق ذوي الخبرة لمساعدة أعضاء الفريق الذين يفتقرون إلى الخبرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اجتماع الانطلاق، يقوم الراعي بإبلاغ فريق المشروع بأنه لا يمكنه حضور أي اجتماعات للنصف الأول من المشروع. ويرغب الراعي في تعيين بديل له.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب أن يتمتع البديل بنفوذ كبير وسلطة اتخاذ القرار.",
        "correct": true
      },
      {
        "text": "قم بإعداد اجتماع مع الراعي البديل في أقرب وقت ممكن لمناقشة جدول الأعمال القادم",
        "correct": false
      },
      {
        "text": "طلب الاهتمام الكامل من الجهة الراعية وتصعيد هذه المشكلة إلى مكتب إدارة المشروع (PMO).",
        "correct": false
      },
      {
        "text": "تحليل أثر التغيير والعمل مع الجهة الراعية لتحديد البديل المناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع جديد. يوجد خلاف بين اثنين من موارد المشروع الرئيسية بشأن أحد المتطلبات. ويرغب مدير المشروع في فهم وجهتي النظر، لكن أحد الموردين لا يرغب في مقابلة مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "قبول منصب كبير موارد المشروع الأقدم.",
        "correct": false
      },
      {
        "text": "مراجعة أصول العمليات التنظيمية (OPAs).",
        "correct": false
      },
      {
        "text": "ارجع إلى القواعد الأساسية للفريق ورؤية المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشرف مدير مشروع على مشروع يهدف إلى تزويد العملاء بقدرات تتبع الشحنات في الوقت الفعلي. واجه فريق المشروع خلافات مستمرة تدور في المقام الأول حول التفسيرات المختلفة لكيفية مساهمة قصص المستخدمين في نجاح المشروع. يعتقد بعض أعضاء الفريق أن قصص المستخدمين يجب أن تعطي الأولوية للسرعة، في حين يؤكد آخرون على الدقة كأولوية قصوى.\nما الذي يجب أن يفعله مدير المشروع لمعالجة خلافات أعضاء الفريق حول قصص المستخدمين؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير المنتج الاجتماع مع الفريق وتوضيح متطلبات قصص المستخدمين.",
        "correct": true
      },
      {
        "text": "حدد موعدًا لعقد اجتماع مع راعي الأعمال للحصول على توضيح بشأن قصص المستخدمين.",
        "correct": false
      },
      {
        "text": "قم بمراجعة ميثاق المشروع باستمرار مع أعضاء الفريق لضمان المواءمة.",
        "correct": false
      },
      {
        "text": "تحقق من توافق قصص المستخدم مع أهداف العمل وأهداف المشروع بشكل عام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقدم مشروع بناء لمدة 8 أشهر تقريبًا، ويبلغ مؤشر أداء الجدول الزمني 0.68. ويعتزم مدير المشروع تنفيذ المشروع كما هو مخطط له دون تكلفة إضافية.\nما الذي يجب أن يفعله مدير المشروع للمشروع في الوقت المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "اصطدم بالجدول الزمني",
        "correct": true
      },
      {
        "text": "تسريع الجدول الزمني.",
        "correct": false
      },
      {
        "text": "تقليل نطاق المشروع.",
        "correct": false
      },
      {
        "text": "تقليل جودة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قامت إحدى المؤسسات مؤخرًا بتحديث خطتها الاستراتيجية وكانت بعض التغييرات جوهرية. خلال اجتماع لمشروع جاري، تساءل أحد أصحاب المصلحة المهمين عن كيفية توافق المشروع مع الخطة الاستراتيجية الجديدة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة بفعالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة ميثاق المشروع ومراجعته لضمان التوافق مع الاستراتيجية المؤسسية.",
        "correct": true
      },
      {
        "text": "حدد موعداً لعقد اجتماع متابعة مع أصحاب المصلحة لمناقشة مخاوفهم.",
        "correct": false
      },
      {
        "text": "تذكير أصحاب المصلحة بأن المشروع قد بدأ قبل تغيير الاستراتيجية.",
        "correct": false
      },
      {
        "text": "طمأنة أصحاب المصلحة بأن المشروع يتماشى مع الاستراتيجية التنظيمية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إطلاق مشروع استراتيجي وتم تعيين مدير للمشروع المشروع المشروع يتقدم المشروع ويسير الفريق بنجاح، ولكن أحد أصحاب المصلحة الرئيسيين يتصل بمدير المشروع ويشتكي من عدم تلقي تحديثات عن التقدم المحرز.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من إرسال نسخة إلى صاحب المصلحة على رسائل البريد الإلكتروني الأسبوعية الخاصة بالحالة.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة اتصالات المشروع وتحديثها.",
        "correct": false
      },
      {
        "text": "أرسل إلى صاحب المصلحة نسخة من أحدث تقرير عن حالة المشروع.",
        "correct": false
      },
      {
        "text": "قم بدعوة صاحب المصلحة الرئيسي لحضور الاجتماع التالي للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تدعو خطة إدارة الجودة (QMP) إلى إجراء اختبار الانحدار قبل كل إصدار للمنتج، ولكن لم يتم تضمين هذه الاختبارات في هيكل تقسيم العمل (WBS).\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير لإضافة حزم عمل اختبار الانحدار إلى نطاق المشروع.",
        "correct": true
      },
      {
        "text": "اطلب موارد اختبار إضافية من المدير الوظيفي لضمان الجودة.",
        "correct": false
      },
      {
        "text": "اقترح على عميل المشروع إزالة اختبار الانحدار من متطلبات الجودة.",
        "correct": false
      },
      {
        "text": "اطلب موافقة راعي المشروع على إزالة اختبار الانحدار من خطة إدارة الجودة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع جديد يتولى إدارة مشروع إنشاءات. وعند مراجعة خطة إدارة المشروع، يدرك مدير المشروع أن متطلبات الصحة والسلامة لم يتم تناولها بشكل كافٍ لدى مدير المشروع مخاوف جدية ويريد معالجة هذا القصور.\nما هو الشاغل الأساسي في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قد يؤدي الفشل في معالجة قضايا الصحة والسلامة إلى الإضرار بثقة العميل وسمعته.",
        "correct": true
      },
      {
        "text": "يجب أن يتوافق المشروع مع جميع المتطلبات والمسؤوليات القانونية والتنظيمية.",
        "correct": false
      },
      {
        "text": "قد يتعرض الجدول الزمني للمشروع للخطر من خلال تنفيذ تدابير السلامة الإضافية.",
        "correct": false
      },
      {
        "text": "يعلم مدير المشروع أنه من الضروري تلبية مقاييس الأداء المحددة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اقترح أحد أصحاب المصلحة استخدام منتج جاهز ومفتوح المصدر لتسريع عملية التطوير. وقد قام الفريق بتحليل المنتج ووجده قابلاً للتطبيق ومرغوباً فيه، ولكنه يحتاج إلى التجريب ويتطلب مهارات إضافية من المستخدمين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الشروع في طلب تغيير رسمي.",
        "correct": true
      },
      {
        "text": "طلب التدريب لفريق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة التكاليف.",
        "correct": false
      },
      {
        "text": "استشر مدير المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تبدأ شركة تعمل في القطاع المالي مشروعًا هجينًا جديدًا للامتثال للوائح الحكومية الجديدة. وقد حدد الفريق سرعة موثوقة تبلغ 65 نقطة قصة لكل تكرار. ويستغرق كل تكرار أسبوعين. يريد الراعي أن يعرف متى سينتهي المشروع إذا كان هناك 040 نقطة قصة متبقية.\nكم عدد الأشهر التي سيستغرقها المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "2 شهران",
        "correct": true
      },
      {
        "text": "4 أشهر",
        "correct": false
      },
      {
        "text": "8 أشهر",
        "correct": false
      },
      {
        "text": "6 أشهر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق رشيق بالتخطيط لتكرار لمدة أسبوعين. في منتصف التكرارات القليلة الماضية، أجرى مالك المنتج تغييرات وأعاد ترتيب أولويات الميزات، مما أثر على مخرجات الفريق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد المشكلة إلى الإدارة العليا واطلب من مالك المنتج اتخاذ إجراء بشأنها.",
        "correct": true
      },
      {
        "text": "أبلغ الفريق بتجاهل التغييرات التي طلبها مالك المنتج أثناء التكرار.",
        "correct": false
      },
      {
        "text": "اشرح الآثار المترتبة على إجراء التغييرات أثناء التكرار لمالك المنتج.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إجراء تغييرات حسب الحاجة لأن النهج الرشيق يستجيب للتغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم قبول منتج جديد من قبل العميل، ولكن بعد أسبوعين تلقى مدير المشروع شكوى من العميل تفيد بأن متطلبات وظائف المنتج لم تتحقق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "مراجعة عملية التحقق من صحة النطاق.",
        "correct": false
      },
      {
        "text": "حدد موعداً لفحص المنتج.",
        "correct": false
      },
      {
        "text": "التحقق من صحة النطاق مع العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في صناعة خاضعة للتنظيم، ويعمل الفريق على مشروع حيث يتم تحديد أولويات المتطلبات في الأعمال المتراكمة. تم تحديد الحد الأدنى من المنتج القابل للتطبيق (MVP) للإطلاق علم مدير المشروع أن الهيئة التنظيمية للمشروع تتطلب نموذجًا أوليًا للفحص قبل إطلاق هذا المنتج النموذج الأولي ليس جزءًا من تعريف MVP.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحدث مع مالك المنتج لتحديد أولويات أنشطة الامتثال في الأنشطة المتراكمة لتقديم نموذج أولي إلى الهيئة التنظيمية.",
        "correct": true
      },
      {
        "text": "حدد المتطلبات المفقودة، وحدد أولويات العمل التنظيمي المفقود مباشرةً في الأعمال التنظيمية المتراكمة وأسند العمل إلى الفريق.",
        "correct": false
      },
      {
        "text": "إعادة جدولة إطلاق المنتج حتى يتمكن الفريق من إنتاج نموذج أولي للفحص، كما هو مطلوب من قبل الهيئة التنظيمية.",
        "correct": false
      },
      {
        "text": "أنشئ تعريفًا جديدًا لـ MVP يحتوي على متطلبات النطاق للنموذج الأولي المطلوب وحدد أولويات هذا النطاق مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بسبب الافتقار إلى الموارد الماهرة محلياً، توظف الشركة فريق مشروع منتشر دولياً يعمل افتراضياً. لم يسبق لمدير المشروع أن عمل مع فريق افتراضي وهو قلق بشأن المشاركة.\nما الذي يجب أن يفعله مدير المشروع لضمان استمرار مشاركة هذا الفريق الافتراضي؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من حضور الفريق الافتراضي بأكمله اجتماع انطلاق المشروع.",
        "correct": true
      },
      {
        "text": "اعتماد خطة إدارة الاتصالات لفريق افتراضي سابق.",
        "correct": false
      },
      {
        "text": "الاعتماد على الاتصال غير المتزامن لجميع تقارير الحالة الرئيسية.",
        "correct": false
      },
      {
        "text": "قم بإجراء عمليات التحقق والاجتماعات المتكررة على فترات مجدولة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء الاستعداد، يقوم أحد أعضاء الفريق بالإبلاغ بشكل خاطئ عن اكتمال قصة ما والتي تعتبر تبعية لقصص أخرى. عندما يبدأ الفريق في العمل على القصص ذات الصلة، لا يتمكنون من مواصلة التطوير لأن القصة الأولية لم تكتمل\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع التخطيط لسباق السرعة مع الفريق بأكمله لفهم الترابط بين القصص.",
        "correct": true
      },
      {
        "text": "تحدث إلى عضو الفريق الذي أبلغ خطأً عن اكتمال القصة.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج مراجعة معايير القبول قبل دفعها إلى قائمة الأعمال المتراكمة في سباق السرعة.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق أن يشرح تفسيرهم لتعريف الإنجاز (DoD) في نهاية السباق السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد تسعة أشهر، يختتم المشروع مرحلته الأولى بإصدار منتج جديد للعميل. العميل غير راضٍ ويذكر أن العديد من الميزات الرئيسية مفقودة.\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم الميزات المفقودة مع العميل ووضع خطة لإدراجها في مرحلة المشروع التالية التي تستغرق تسعة أشهر.",
        "correct": true
      },
      {
        "text": "قم بمراجعة خطة المشروع لتحديد ما إذا كانت الميزات المفقودة جزءًا من النطاق الأصلي أو إذا تمت إضافتها لاحقًا.",
        "correct": false
      },
      {
        "text": "اطلب تمويلاً إضافياً من أجل تقليل الجدول الزمني لدورة الإصدار الحالية حتى يتمكن الفريق من تقديم القيمة في وقت أقرب.",
        "correct": false
      },
      {
        "text": "أعد تشغيل المشروع من خلال تنفيذ دورة حياة رشيقة ودمج إنشاء الحد الأدنى من المنتج القابل للتطبيق (MVP).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع في مرحلة التنفيذ. يكتشف مدير المشروع الجديد أن أعضاء الفريق ليس لديهم خبرة سابقة بالتكنولوجيا المستخدمة في المشروع. ومع ذلك، هناك العديد من المديرين الوظيفيين الذين لديهم خبرة بالتكنولوجيا.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان نجاح أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من المدراء الوظيفيين العمل كمرشدين أو مدربين للفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية استبدال أعضاء الفريق ذوي الخبرة.",
        "correct": false
      },
      {
        "text": "تحديد المخاطر المرتبطة بقلة خبرة أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تطوير تقارير الحالة لرصد مهارات الفريق وكفاءاته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تعيين مدير مشروع لمشروع طويل الأجل مدته ثلاث سنوات. ما هو النهج الذي ينبغي أن يتبعه مدير المشروع لمعالجة الأنشطة القريبة الأجل، بينما يتم تخطيط العمل الطويل الأجل على مستوى عالٍ ثم يتم تفصيله لاحقاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "ركز على اكتساب فريق عمل وتقديمه في أقرب وقت ممكن.",
        "correct": true
      },
      {
        "text": "إشراك الجهة الراعية في عمليات التحقق من الصحة وتحديد الأولويات.",
        "correct": false
      },
      {
        "text": "تنفيذ ورش عمل مع العميل لمواعيد التسليم.",
        "correct": false
      },
      {
        "text": "التحقق من صحة المتطلبات وتنفيذ تخطيط الموجة المتجددة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن أعضاء الفريق لا يتفاعلون مع بعضهم البعض ويعتقد أن عدم التفاعل يؤثر سلبًا على أداء المشروع. يحاول مدير المشروع زيادة تفاعل الفريق من خلال استضافة فعالية بعد انتهاء العمل، ولكن لم يحضر سوى عدد قليل من أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل استبيانًا للفريق لجمع أفكار لأنشطة ما بعد العمل من أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "استمر في دعوة أعضاء الفريق إلى الفعاليات وتحسين الروح المعنوية بشكل تدريجي.",
        "correct": false
      },
      {
        "text": "تقديم حوافز ومكافآت دورية لأعضاء الفريق الأعلى أداءً.",
        "correct": false
      },
      {
        "text": "استطلع آراء الفريق بشكل سري لتحديد السبب الجذري لعدم التفاعل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام راعي مشروع بملايين الدولارات باستدعاء مدير المشروع لعقد اجتماع أزمة. قدم العميل طلبًا رسميًا لضغط الجدول الزمني بشكل كبير من أجل الوفاء بالموعد النهائي القانوني.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "بدء إجراءات التعجيل بتنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "تنفيذ التغييرات المطلوبة على الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "أدوات التحليل لتعطيل أنشطة المشروع.",
        "correct": false
      },
      {
        "text": "إعداد تقرير تقييم أثر التغيير للمراجعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تكليف مدير المشروع بمعالجة مخاوف مالك المنتج بشأن تسليم الحد الأدنى من المنتج القابل للتطبيق (MVP) في السباق الرابع. أي من المقاييس التالية يجب أن يستخدمها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مؤشر الأداء المجدول (SPI)",
        "correct": true
      },
      {
        "text": "مؤشر تكلفة الجدول الزمني (SCI)",
        "correct": false
      },
      {
        "text": "معدل الاحتراق",
        "correct": false
      },
      {
        "text": "التحليل النوعي للمخاطر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في شركة تعمل في مشاريع تسليم المفتاح المعقدة. وأثناء تقييم الفريق، يجد مدير المشروع أن الأداء العام يتأثر سلباً لأن الفريق يواجه مشكلة في التكيف مع التغييرات المتكررة في متطلبات المشروع وحالته.\nما الذي يجب على مدير المشروع القيام به لضمان تجهيز الفريق بشكل أفضل للتكيف مع التغيير؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الجهة الراعية التواصل مباشرةً مع فريق المشروع.",
        "correct": true
      },
      {
        "text": "التواصل مع أصحاب المصلحة بانتظام لتجنب التغييرات المتكررة.",
        "correct": false
      },
      {
        "text": "تقديم التوجيه الفردي لكل عضو من أعضاء الفريق على أساس ثابت.",
        "correct": false
      },
      {
        "text": "إنشاء قنوات وبروتوكولات اتصال واضحة ومتسقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف الطريق خلال مشروع مدته عام كامل، يرسل أحد موردي الأجهزة إلى مدير المشروع إشعارًا بنية زيادة الأسعار بسبب تقلب أسعار الصرف. مدير المشروع غير متأكد من سلطته التفاوضية.\nما هي الوثيقة التي يجب على مدير المشروع الرجوع إليها؟",
    "explanation": "",
    "choices": [
      {
        "text": "سجل المخاطر",
        "correct": true
      },
      {
        "text": "خطة إدارة المشتريات",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": false
      },
      {
        "text": "استراتيجية التواصل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تراجع أداء فريق المشروع خلال التكرارات الثلاثة الأخيرة. يشعر بعض أعضاء الفريق بخيبة أمل، ويثيرون مخاوفهم خلال الاجتماع الاستعراضي.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد نقاط الفشل المحتملة استنادًا إلى إجراءات العمل التكرارية",
        "correct": true
      },
      {
        "text": "تحفيز الفريق على تقديم أداء أفضل.",
        "correct": false
      },
      {
        "text": "التركيز على العلاج، وليس فقط على تصحيح الأعراض.",
        "correct": false
      },
      {
        "text": "مقارنة أداء الفريق بفرق المشاريع الأخرى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك مدير المشروع الذي يعمل في بيئة رشيقة أن بعض أعضاء الفريق الجدد يواجهون صعوبة في فهم كيفية تحقيق أعضاء الفريق الأقدم نتائج معينة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ترتيب اجتماع مراجعة مع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تأكد من تركيز أعضاء الفريق على مهامهم.",
        "correct": false
      },
      {
        "text": "تقييم الحاجة إلى نقل المعرفة.",
        "correct": false
      },
      {
        "text": "تشجيع وتيسير توجيه الأقران وتسهيله.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع داخلي لمكتب إدارة المشاريع في المنظمة (PMO). وكان المشروع في البداية تحت رعاية قائد مكتب إدارة المشاريع الذي تم استبداله منذ ذلك الحين القائد الجديد لا يرى قيمة كبيرة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنظيم اجتماع انطلاق المشروع الثاني مع قائد مكتب إدارة المشاريع الجديد وفريق المشروع.",
        "correct": true
      },
      {
        "text": "استخدم البيانات السابقة للحصول على الرعاية من قائد مكتب إدارة المشاريع الجديد لأن المشروع كان فعالاً.",
        "correct": false
      },
      {
        "text": "استخدم الفوائد التي كان مدير المشروع يتتبعها طوال فترة المشروع لإثبات قيمة المشروع.",
        "correct": false
      },
      {
        "text": "استمر في المشروع كما هو مخطط له لأنه تمت الموافقة عليه بالفعل وهو قيد التنفيذ.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتم تحديد تشييد المبنى بشكل جيد من خلال المخططات والمواصفات المكتوبة. سيتم تسليم الخدمة في غضون عامين في بيئة عالية التضخم. ما نوع العقد الذي ينبغي أن يستخدمه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد التكلفة زائد الرسوم التحفيزية (CPIF)",
        "correct": true
      },
      {
        "text": "عقد السعر الثابت الثابت الثابت (FFP)",
        "correct": false
      },
      {
        "text": "عقد السعر الثابت مع تعديل السعر الاقتصادي (FPEPA)",
        "correct": false
      },
      {
        "text": "عقد الوقت والمواد (T&M)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "وضع مدير المشروع خطة لإدارة المشروع استناداً إلى منهجيات رشيقة في محاولة لتسليم المنتج بسرعة. ومع ذلك، فإن المشروع معقد والمتطلبات غير واضحة، مما يعرض الجدول الزمني للخطر.\nما الذي يجب أن يفعله مدير المشروع لإعادة المشروع إلى مساره الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة جدولة الجدول الزمني لقبول التوقعات الإضافية والتأخيرات المحتملة.",
        "correct": true
      },
      {
        "text": "قم بمراجعة الأعمال المتراكمة للمنتج مع مالك المنتج وفريق العمل لحل الحالة.",
        "correct": false
      },
      {
        "text": "زيادة عدد الاجتماعات التحضيرية وتنفيذ تحديثات الحالة اليومية.",
        "correct": false
      },
      {
        "text": "تعديل الخطة لتوظيف المزيد من ميزات دورة الحياة التكرارية والتدريجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا لتنفيذ نظام برمجيات لتحسين العمليات تم تطويره داخليًا. غير أن نسبة اعتماده في المنظمة كانت أقل من 50 في المائة بسبب عدم التوافق مع العمليات الأساسية.\nأي من الإجراءات الثلاثة التالية كان ينبغي على مدير المشروع القيام بها لتحقيق فوائد المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم كامل للاحتياجات في مرحلة التصميم.",
        "correct": true
      },
      {
        "text": "إطلاق البرنامج التجريبي في إحدى وحدات الأعمال الأساسية وجمع الملاحظات.",
        "correct": false
      },
      {
        "text": "ضمان مشاركة أصحاب المصلحة على نطاق أوسع لكسب المزيد من التأييد.",
        "correct": false
      },
      {
        "text": "إصدار تعليمات لفريق التسويق بجمع الملاحظات من العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء أحد اجتماعات الاستعداد، اعترض بعض أعضاء الفريق بشدة على كيفية توزيع المهام، فقد شعروا بالتعب والإحباط لأن توزيع المهام كان شكوى متكررة طوال المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع خطة إدارة المشروع لتحديد كيفية إدارة هذا الوضع.",
        "correct": true
      },
      {
        "text": "ناقش مع مديري المشاريع الآخرين إذا كان عليهم معالجة شكاوى مماثلة.",
        "correct": false
      },
      {
        "text": "تنظيم ورشة عمل لبناء الفريق لتحسين التعاون والتواصل.",
        "correct": false
      },
      {
        "text": "العمل مع الفريق لوضع خطة لمعالجة مخاوف توزيع المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستخدم فريق سكروم نهجًا مختلطًا مع سباقات السرعة التي تستغرق أسبوعين. يكون إصدار الحد الأدنى من المنتج القابل للتطبيق (MVP) في نهاية السباق الحالي، ويكون الفريق قد انتهى من الميزات التي يجب أن تكون موجودة ويجب أن تكون لها ميزات؛ ومع ذلك، لا تزال بعض الميزات الأخرى ذات الأولوية قيد التطوير. يقوم مدير المشروع بإعداد التقرير الشهري للجنة التوجيهية.\nما الذي يجب أن يوصي به مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة جدولة مراجعة إصدار MVP حتى يتم الانتهاء من جميع الميزات المتفق عليها",
        "correct": true
      },
      {
        "text": "قم بتحديث خطة إدارة المشروع لتضمين الإصدار الميزات فقط",
        "correct": false
      },
      {
        "text": "مراجعة السباق وإصدار MVP مع ميزات d.",
        "correct": false
      },
      {
        "text": "تقدير الجهد المطلوب وتقديم طلب تغيير لإضافة المزيد من الموارد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تطوير المنتج، يشير قسمان وظيفيان إلى أن هناك نقصًا في الموارد ولا يمكنهما بناء وتسليم جميع المنتجات في الوقت المحدد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا القلق؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع المشكلة إلى الجهة الراعية وطلب تأكيد نطاق المشروع.",
        "correct": true
      },
      {
        "text": "اطلب من المدير الوظيفي توظيف موارد إضافية لتلبية المتطلبات.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق العمل لساعات إضافية لتلبية الاحتياجات التجارية.",
        "correct": false
      },
      {
        "text": "تحليل المسار الحرج لتقديم الحد الأدنى من المنتج القابل للتطبيق (MVP).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً. تستخدم المنظمة نهجًا رشيقًا وسجلًا للمخاطر، لكن فريق التطوير يفضل نهج Scrum وينظر إلى إدارة المخاطر على أنها عملية تنبؤية.\nما الذي يجب على مدير المشروع تحديد أولوياته؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة سجل المخاطر وامتلاكه شخصيًا لأن هذا من المتطلبات التنظيمية.",
        "correct": true
      },
      {
        "text": "تفويض مسؤولية تحديث سجل المخاطر إلى فريق التطوير lea",
        "correct": false
      },
      {
        "text": "اطلب من المطورين استخدام سجل المخاطر لأن هذا مطلب تنظيمي.",
        "correct": false
      },
      {
        "text": "فكر في اتباع نهج مختلط ودمج عناصر من سجل المخاطر وعمليات Scrum.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتلقى فريق رشيق العديد من الطلبات غير المخطط لها لتحسينات المنتج في عملية التكرار. ويتسبب هذا العائق في تفويت الفريق للمهام المجدولة.\nكيف ينبغي لمدير المشروع معالجة هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق زيادة جهوده لتلبية الطلبات.",
        "correct": true
      },
      {
        "text": "اطلب من مالك المنتج تضمين التحسينات المطلوبة في التكرار الحالي.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع إعادة ترتيب أولويات جميع الأنشطة الملتزم بها.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إضافة طلبات التحسين إلى طلبات التحسينات إلى قائمة المنتجات المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجري تنفيذ مشروع تجريبي باستخدام نهج رشيق للتطوير. ويقدم المشروع الزيادات المخطط لها في الوقت المحدد، لكن الإدارة العليا تشعر بالقلق لأنها لا ترى القيمة التي يضيفها المشروع.\nكيف يجب على مدير المشروع إيصال قيمة المشروع إلى الإدارة العليا؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين الإدارة العليا في جميع المراجعات المستقبلية للسباقات السريعة لمعالجة مخاوفهم في الوقت الفعلي.",
        "correct": true
      },
      {
        "text": "أرسل تقارير حالة أسبوعية للإدارة العليا وادعهم إلى جلسات استرجاع المعلومات.",
        "correct": false
      },
      {
        "text": "توضيح كيفية توافق أهداف المشروع مع الأهداف الاستراتيجية للمؤسسة.",
        "correct": false
      },
      {
        "text": "تخصيص التقارير المرحلية لتلبية متطلبات الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الأسبوع الثاني من سباق سريع مدته أسبوعان، تعرض أحد أعضاء الفريق الأساسيين لحالة طارئة ولم يتمكن من العمل على المشروع لبقية السباق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير المنتج زيادة الجدول الزمني للمشروع.",
        "correct": true
      },
      {
        "text": "تحديد المهام التي يمكن إعادة إسنادها إلى أعضاء الفريق الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتمديد فترة السباق السريع لتعويض خسارة عضو الفريق الأساسي.",
        "correct": false
      },
      {
        "text": "احصل على موارد إضافية من الفرق الأخرى في السباق السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع قيد التنفيذ حالياً. وقد تم إخطار مدير المشروع بعملية جديدة قد تكون مفيدة إذا تم دمجها في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم كيف يمكن دمج العملية الجديدة",
        "correct": true
      },
      {
        "text": "إصدار ترتيب أولوية للتغيير.",
        "correct": false
      },
      {
        "text": "تحديد الفائدة من التغيير.",
        "correct": false
      },
      {
        "text": "تعديل وثيقة المتطلبات الخاصة بالتغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل مدير المشروع مع أعضاء الفريق عن بُعد الذين يعملون بشكل مستقل. ما الذي ينبغي أن يفعله مدير المشروع لتعزيز التعاون بين أعضاء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين أعضاء الفريق في جميع رسائل البريد الإلكتروني المتعلقة بالمشروع.",
        "correct": true
      },
      {
        "text": "اتصل بأعضاء الفريق بشكل فردي لجمع المعلومات وتقديم التحديثات أسبوعياً.",
        "correct": false
      },
      {
        "text": "تعزيز الاجتماعات المنتظمة باستخدام مؤتمرات الفيديو.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو من أعضاء الفريق ملء سجل مهام للتحديثات اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع شكوى تفيد بأن فريق المشروع لم يستجب بشكل صحيح لطلب العميل. ومع ذلك، يدرك مدير المشروع أن الفريق تلقى طلبات متعددة خارج النطاق من العميل.\nما الإجراء الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "شجع أعضاء الفريق على طرح \"الأسباب الخمسة\" أثناء تواصلهم مع العميل.",
        "correct": true
      },
      {
        "text": "اطلب من العميل شرح أفضل للطلبات والمشكلات التي شاركها مع الفريق.",
        "correct": false
      },
      {
        "text": "مراجعة النطاق مع العميل بحيث يمكن توثيق الطلبات الإضافية ومعالجتها كطلبات تغيير.",
        "correct": false
      },
      {
        "text": "طلب تضمينها في جميع الاتصالات المستقبلية بين أعضاء فريق المشروع والعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في الاجتماع الأول حول مشروع إنشاء طريق، يقوم مدير المشروع بتذكير الفريق بأهمية مراعاة جميع القواعد عند القيام بواجباتهم والتفاعل مع أصحاب المصلحة. في وقت لاحق من المشروع، يبدأ أعضاء الفريق في الحضور إلى الاجتماعات في وقت متأخر ولا يتبعون القواعد الأساسية الأخرى.\nلضمان عدم تأثر نتائج المشروع وجدوله الزمني، ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "معالجة المشكلة مع أعضاء الفريق المحددين الذين انتهكوا القواعد الأساسية.",
        "correct": true
      },
      {
        "text": "قم بإزالة أعضاء الفريق الذين انتهكوا القواعد الأساسية.",
        "correct": false
      },
      {
        "text": "قم بترقية جميع أعضاء الفريق الذين لا ينتهكون أي قواعد أساسية.",
        "correct": false
      },
      {
        "text": "السماح للفريق بالتحقيق مع أي من أعضاء الفريق الذين ينتهكون القواعد الأساسية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة التخطيط، يقوم مدير المشروع بوضع الجدول الزمني للمشروع. يقوم فريق المشروع المعين بإنهاء مشروع لا علاقة له بالمشروع، لذلك يتم تعيين موارد مؤقتة للمساعدة في التخطيط وتقدير مدة المهمة. سيقوم فريق المشروع باستبدال الموارد المؤقتة قبل بدء المشروع.\nما الذي يجب على مدير المشروع القيام به قبل الانتهاء من الجدول الزمني للمشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة التقديرات مع الفريق المعين.",
        "correct": true
      },
      {
        "text": "تحقق من مدد مهام المشاريع السابقة.",
        "correct": false
      },
      {
        "text": "تحديث تقدير المدة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "طلب الموافقة من راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يبدي كبير مسؤولي التكنولوجيا (CTO) حماسًا بشأن اعتماد المؤسسة مؤخرًا لممارسات القيادة الخادمة. ويطلب كبير مسؤولي التكنولوجيا أن يطبق جميع مديري المشاريع ممارسات القيادة الخادمة، ولكن يبدو أنه غير متأكد من التطبيقات العملية.\nما هي العبارة التالية التي تمثل أفضل طريقة يجب أن يستجيب بها مدير المشروع لطلب مدير التكنولوجيا؟",
    "explanation": "",
    "choices": [
      {
        "text": "اشرح أن القيادة الخادمة يمكن تكييفها وتطبيقها على أي حالة من حالات المشاريع.",
        "correct": true
      },
      {
        "text": "ذكّر المدير التنفيذي للتكنولوجيا بأن القيادة الخادمة هي الأنسب للمشاريع التي تستخدم أساليب رشيقة.",
        "correct": false
      },
      {
        "text": "توضيح أن ممارسات القيادة الخادمة تركز عادةً على تفضيلات العميل.",
        "correct": false
      },
      {
        "text": "التأكيد على أن القيادة الخادمة تعمل فقط في المشاريع ذات الموارد الكبيرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال جلسة تخطيط المشروع، يحاول مدير المشروع تحديد خطة إصدار لتحقيق قيمة متسقة في التسليم وقبول العميل. يقترح أحد كبار أصحاب المصلحة أن يكون هناك إصدار في نهاية المشروع للتأكد من أن العميل يرى جميع ميزات المنتج في وقت واحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من فريق المشروع اقتراح جدول زمني للإصدار بناءً على مدى تعقيد ميزات المنتج المحددة.",
        "correct": true
      },
      {
        "text": "يوصى بثلاثة إصدارات، واحد في بداية المشروع وواحد في منتصفه وواحد في نهايته.",
        "correct": false
      },
      {
        "text": "إنشاء خطط إصدار لكل مرة يتم فيها تسليم ميزة المنتج لإجراء اختبارات الجودة والمراجعات.",
        "correct": false
      },
      {
        "text": "اقترح أن يتم تسليم المنتج على مدار عدة تكرارات لجمع ملاحظات العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتكون فريق المشروع عن بُعد من أعضاء من بلدين. يتوقع أحد الفريقين الحصول على ثلاثة أيام إجازة للاحتفال بعطلة وطنية. يخبر مدير المشروع الفريق أن عليهم العمل خلال العطلة لتحقيق إنجاز رئيسي في التكرار الحالي. يشعر الفريق بالاستياء ولا يفهم سبب اضطرارهم للعمل إذا كانت العطلة عطلة وطنية.\nما الذي يجب أن يكون مدير المشروع قد حدده وأبلغه بوضوح في بداية المشروع لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتفاقيات الفريق",
        "correct": true
      },
      {
        "text": "المعالم البارزة",
        "correct": false
      },
      {
        "text": "الأدوار الفردية",
        "correct": false
      },
      {
        "text": "التسلسل الهرمي للفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتقد مدير المشروع أن فريق المشروع يمكن أن يستفيد من أنشطة التطوير لتحسين أداء المشروع ونتائجه. ويقرر مدير المشروع التخطيط لأنشطة تطوير محددة لكل عضو من أعضاء الفريق.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان نجاح هذه المبادرة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم لمهارات أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الفريق تحديد خطط التطوير الخاصة بهم.",
        "correct": false
      },
      {
        "text": "توزيع خطط تطوير واضحة على أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تطبيق نظام المكافآت على أساس الأداء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد ليحل محل مدير مشروع تم نقله مؤخراً إلى مشروع آخر. وأخبر أعضاء الفريق مدير المشروع الجديد أن المشروع متأخر عن الجدول الزمني بسبب التأخير في الحصول على الموافقات على المستندات من العميل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتمع مع العميل لمناقشة التأخير والتفاوض على موعد نهائي جديد.",
        "correct": true
      },
      {
        "text": "تحدث إلى مدير المشروع السابق لفهم الوضع بشكل أفضل.",
        "correct": false
      },
      {
        "text": "تواصل مع العميل واطلب الموافقة المعجّلة على المستندات.",
        "correct": false
      },
      {
        "text": "تقييم أثر التأخيرات على الجدول الزمني للمشروع وميزانيته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً مع فريق ذاتي التنظيم. والفريق غير قادر على الاتفاق على نطاق الزيادة التالية.\nكيف ينبغي لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تسهيل مناقشة الفريق لفهم سبب عدم قدرة الفريق على الاتفاق على نطاق الزيادة التالية.",
        "correct": true
      },
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية للمشروع بحيث تصبح المخاطر التي تشكلها الخلافات حول النطاق واضحة.",
        "correct": false
      },
      {
        "text": "تعاون مع خبير موضوعي مناسب (SME) لتحديد نطاق الزيادة التالية.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق التصويت على الخيارات وتحديد النطاق المناسب بناءً على تصويت الأغلبية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع لمراجعة الجدول الزمني للمشروع، حدد فريق المشروع أن أحد أنشطة المسار الحرج قد تراجع بسبب التبعيات الخارجية. وأصبح الجدول الزمني للمشروع الآن في خطر.\nما الذي يجب على مدير المشروع تحديد أولوياته كاستجابة أولية لمعالجة المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إصدار طلب تغيير والاجتماع مع العميل.",
        "correct": true
      },
      {
        "text": "إعادة جدولة الجدول الزمني وإخطار راعي المشروع.",
        "correct": false
      },
      {
        "text": "تحديث الوثائق وتحديد الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "قم بإخطار العميل وطلب تمديد الجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع جديد مع العديد من أصحاب المصلحة رفيعي المستوى. وقد قدم كل واحد من أصحاب المصلحة توقعاته للمشروع، وأدرك مدير المشروع أن بعض التوقعات تتعارض مع بعضها الآخر.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تيسير عقد اجتماع لمعالجة التوقعات المتضاربة وحلها.",
        "correct": true
      },
      {
        "text": "تحديد أولويات توقعات أصحاب المصلحة ذوي السلطة العليا.",
        "correct": false
      },
      {
        "text": "تحديث سجل أصحاب المصلحة بتوقعات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إنشاء تسلسل هرمي للمشروع لإدارة توقعات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في بداية المشروع الرشيق، يقوم مدير المشروع بتطوير ميثاق المشروع مع الفريق. وهم غير قادرين على الاتفاق على قيم الفريق.\nما الذي يجب على مدير المشروع مناقشته مع الفريق لمعالجة النزاع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الوتيرة المستدامة",
        "correct": true
      },
      {
        "text": "تعريف تم (DoD)",
        "correct": false
      },
      {
        "text": "احترام الإطار الزمني",
        "correct": false
      },
      {
        "text": "مراسم المشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إبلاغ مدير مشروع لأحد مشاريع البناء بأن التصريح المطلوب من الحكومة المحلية لم يتم الحصول عليه بعد سيؤدي تقديم طلب للحصول على التصريح إلى تأخير تسليم المشروع لمدة يومين بتكلفة قدرها 40,000 دولار أمريكي. تبلغ غرامة عدم الحصول على التصريح 900 دولار أمريكي في اليوم الواحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب للحصول على تصريح وتأخير تسليم المشروع لمدة يومين.",
        "correct": true
      },
      {
        "text": "تجاهل متطلبات التصريح واستمر في المشروع.",
        "correct": false
      },
      {
        "text": "محاولة التفاوض مع الحكومة المحلية للحصول على عفو.",
        "correct": false
      },
      {
        "text": "خصص مبلغ الغرامة كمصروفات إضافية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتألف التكرار الأول لمشروع رشيق من الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي تم بنجاح الآن يتوق أعضاء الفريق إلى تسليم المنتج إلى العميل.\nكيف ينبغي التأكد من أن المنتج جاهز للاستخدام من قبل العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "يحدد مسؤول سكروم الرئيسي أن جميع المتطلبات مرضية",
        "correct": true
      },
      {
        "text": "يوافق فريق المشروع على استيفاء نموذج MVP لتعريف الإنجاز (DoD).",
        "correct": false
      },
      {
        "text": "يقوم المدير الأعلى والعميل بالموافقة على المنتج وقبوله.",
        "correct": false
      },
      {
        "text": "يقرر مالك المنتج أن المنتج MVP يجتاز جميع اختبارات الجودة المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نظرًا للطبيعة المعقدة للمشروع التنبؤي، تقرر المؤسسة استخدام نهج رشيق لمرحلة المشروع. لا يفهم أحد أعضاء الفريق النهج الرشيق حقًا ويواصل تخصيص المهام لبقية أعضاء الفريق. بعد فترة، لا يتمكن الفريق من التكيف من تلقاء نفسه وتنشأ النزاعات مما يؤخر التسليمات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استبدل عضو الفريق بشخص لديه خبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "انتظر حتى يتمكن الفريق في النهاية من حل النزاع بنفسه وإعادة التنظيم.",
        "correct": false
      },
      {
        "text": "إعادة التأكيد على مبادئ وأدوار أجايل لإنشاء هياكل يمكن للفريق استخدامها.",
        "correct": false
      },
      {
        "text": "تحكّم في الأعمال المتراكمة المتراكمة في السباق السريع وقم بتعيين المهام لأعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لم يتمكن مدير المبيعات الرئيسي وفريق العمل من تقديم تقرير حالة المشروع في الوقت المحدد لمشروع دمج تقرير المبيعات الجديد. وبالإضافة إلى ذلك، لا يفي التقرير بالتوقعات التي تم تسليط الضوء عليها في اجتماعات المراجعة الجماعية.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.",
        "correct": true
      },
      {
        "text": "تأكد من توثيق الخطة ومشاركتها بين الفريق وأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "زيادة تواتر اجتماعات الفريق لتقديم تقرير الحالة.",
        "correct": false
      },
      {
        "text": "تأكد من إتاحة المزيد من الوقت لأعضاء الفريق للتداول والتخطيط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كجزء من مهمة مؤقتة، يقوم مدير مشروع بقيادة مشروع تجاري. خلال اجتماع الحالة اليومي، تم اكتشاف أن فريق التطوير لم يقم بمهمة حرجة. تؤدي هذه المشكلة إلى تأخير التكرار الحالي. القدرة على اتخاذ الإجراءات اللازمة لمعالجة هذه المشكلة تتجاوز سلطة فريق المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأجيل التكرار الحالي وإبلاغ أصحاب المصلحة بالمشكلة.",
        "correct": true
      },
      {
        "text": "ادعُ فريق المشروع إلى جلسة تجميعية لتحديد الحل.",
        "correct": false
      },
      {
        "text": "تعديل الجدول الزمني للمشروع لاستيعاب التأخير في التطوير.",
        "correct": false
      },
      {
        "text": "رفع المشكلة إلى راعي المشروع لتحديد الخطوات التالية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع بمشروع يتضمن فريقاً افتراضياً متعدد الثقافات يضم ممثلين من مختلف البلدان. يحتاج مدير المشروع إلى التحضير لاجتماع استهلالي.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع القواعد واللوائح التي يجب اتباعها أثناء المشروع.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية موارد مختلفة لتسهيل المشروع.",
        "correct": false
      },
      {
        "text": "ضع في اعتبارك مختلف المناطق الزمنية وقدرات الاتصال والقيود المحتملة.",
        "correct": false
      },
      {
        "text": "قم بإعداد لغة راعي المشروع كلغة التواصل الرسمية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تخطط شركة في صناعة تخضع لتنظيم شديد لإصدار منتج جديد لم يكن متاحًا من قبل في السوق. وقد طلب الرئيس التنفيذي من مدير المشروع أن يقترح طريقة لضمان عدم دخول المنافسين في الصناعة إلى سوق هذا المنتج قبل هذه الشركة.\nما هو نهج تسليم المشروع الذي يجب أن يستخدمه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدام نهج تنبؤي حيث أن الشركة لديها خبرة سابقة في ذلك.",
        "correct": true
      },
      {
        "text": "قم بتضمين موارد كافية في الميزانية لسرعة إنجاز المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ التكرارات في مرحلة مبكرة من عمليات تطوير المنتج، وجدولة المهام التنبؤية التي سيتم تنفيذها قبل مرحلة الطرح مباشرة.",
        "correct": false
      },
      {
        "text": "اطلب ضم مدرب رشيق إلى فريق أجايل لزيادة سرعة الإصدارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشعر راعي المشروع بقلق متزايد بشأن القيمة العائدة من الاستثمار في المشروع ويريد التأكد من الوفاء بالمواعيد الأصلية. \nما الذي ينبغي لمدير المشروع أن يفعله لإقناع الجهة الراعية بأن المشروع يسير على الطريق الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكيد على القيمة المقدمة عند بوابة المرحلة.",
        "correct": true
      },
      {
        "text": "زيادة عدد تقارير حالة المشروع.",
        "correct": false
      },
      {
        "text": "التوقعات السابقة والأداء الحالي.",
        "correct": false
      },
      {
        "text": "قم بدعوة راعي المشروع إلى الاجتماعات اليومية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع الذي يقوم فيه مزود خارجي بتنفيذ حل مخصص، يجب على مدير المشروع التأكد من أن الفريق المحلي سيكون لديه القدرة على دعم الحل.\nما الذي يجب أن يفعله مدير المشروع لضمان قدرة الفريق المحلي على دعم الحل؟",
    "explanation": "",
    "choices": [
      {
        "text": "تفويض مسؤولية دعم الحل المخصص إلى الموفر الخارجي.",
        "correct": true
      },
      {
        "text": "إجراء دورات تدريبية شاملة للفريق المحلي على الحل الجديد.",
        "correct": false
      },
      {
        "text": "تقليل مسؤوليات الفريق المحلي لتقليل الحاجة إلى الدعم.",
        "correct": false
      },
      {
        "text": "تعيين موظفين إضافيين لتوفير الدعم المستمر للفريق المحلي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الافتتاحي للمشروع، يعلن مدير المشروع أنه سيتم استخدام نهج هجين لتنفيذ المشروع. ويثير العديد من أعضاء الفريق القلق لأنهم معتادون على العمل في المشاريع التنبؤية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع المشكلة إلى راعي المشروع لضمان توافق الفريق مع نهج تنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "قم بإشراك مكتب إدارة المشروع (PMO) لأنه يحدد نهج تنفيذ المشاريع.",
        "correct": false
      },
      {
        "text": "قم بتثقيف أعضاء الفريق حول أجايل والفوائد المرتبطة باستخدام مبادئ أجايل.",
        "correct": false
      },
      {
        "text": "التغيير إلى نهج تنبؤي يتماشى مع مهارات أعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تولى مدير مشروع جديد مسؤولية مشروع جارٍ. تظهر التقارير المرحلية أن المشروع في حدود الميزانية والجدول الزمني المخصصين له. ومع ذلك، أشار أحد الموردين الرئيسيين إلى أنه لن يتمكن من توريد المواد الأساسية حسب الجدول الزمني المحدد\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
        "correct": true
      },
      {
        "text": "مراجعة الأداء مقابل خط الأساس للمشروع.",
        "correct": false
      },
      {
        "text": "بدء الإجراءات القانونية ضد المورد المتخلف عن السداد.",
        "correct": false
      },
      {
        "text": "إنهاء العقد مع المورد فوراً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع ابتكاري كبير يحظى بمكانة عالية لدى المديرين التنفيذيين في الشركة. في الآونة الأخيرة، تغير أحد متطلبات المشروع مؤخرًا ويتطلب استخدام تكنولوجيا جديدة ومبتكرة. ويتطلب التغيير إنشاء منصب جديد ليشغله شخص على دراية بالتكنولوجيا الجديدة. خلال اجتماع الحالة، يعرب أحد أعضاء الفريق الحاليين عن اهتمامه بالوظيفة الجديدة ويؤكد أنه معتمد في هذه التقنية الجديدة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تكليف عضو الفريق بالمهمة لدعم نموهم في المؤسسة، والحصول على مورد ليحل محل الدور القديم لعضو الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من عضو الفريق الاستمرار في المهمة الوظيفية الحالية مع تولي المهمة الجديدة في نفس الوقت الذي يسمح به الوقت.",
        "correct": false
      },
      {
        "text": "رفع الطلب إلى راعي المشروع لتحديد ما إذا كان يمكن تعيين عضو الفريق في المهمة الجديدة.",
        "correct": false
      },
      {
        "text": "قم بتعيين عضو جديد في الفريق واطلب من عضو الفريق الحالي توفير التدريب اللازم لعضو الفريق الجديد للحصول على الشهادة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أوشك المشروع على الانتهاء، ويرغب العميل في الاحتفال بالنجاح من خلال مشاركة حالة عمل حول الفوائد التي حققها المشروع. يشعر مدير المشروع وفريق العمل بالتخوف من مشاركة حالة العمل في هذه المرحلة.\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "التعاون مع العميل لإنشاء حالة عمل تسلط الضوء على فوائد المشروع.",
        "correct": true
      },
      {
        "text": "أقر بالطلب ولكن أكد على محدودية حالة العمل في هذه المرحلة.",
        "correct": false
      },
      {
        "text": "قم بإحالة العميل إلى فريق المشروع للحصول على تفاصيل حول الفوائد التي حققها المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ العميل بأن حالة العمل تتطلب عملاً إضافياً وموارد إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل أحد الموارد الرئيسية مع مدير المشروع بعد الاجتماع الافتتاحي ويعرب عن قلقه من عدم قدرته على إنجاز المهام الموكلة إليه بسبب أولويات أخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعدًا لاجتماع الفريق لتقييم الأولويات وإدارتها.",
        "correct": true
      },
      {
        "text": "توثيق عدم التوافر كمخاطرة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "رفع هذه المشكلة إلى راعي المشروع للحصول على الدعم التنفيذي.",
        "correct": false
      },
      {
        "text": "قم بتحديث خطة إدارة المشروع وفقًا لذلك لتعكس التأخير المحتمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتفق مزود الخدمة وعميله على حوالي 80 من نطاق عقد مشروع يعملان عليه لتسليم محتوى تسويقي. لدى العميل ميزانية ثابتة وتاريخ إنجاز مستهدف ويريد الحصول على أكبر قيمة تجارية ممكنة من المشروع من خلال زيادة النطاق على أساس تسليم أفضل جهد ممكن مع اقتراب نهاية المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء العقد بناءً على النطاق المتفق عليه وخطة التغييرات الإضافية المتفق عليها.",
        "correct": true
      },
      {
        "text": "التأكد من توثيق عملية مراقبة التغيير في العقد.",
        "correct": false
      },
      {
        "text": "اقتراح خيار عقد نطاق ديناميكي وإضافة عدد ثابت من التكرارات.",
        "correct": false
      },
      {
        "text": "زيادة عدد الموارد في العقد لتقديم المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع المختلط، لا يفهم العميل الحاجة إلى مشاركة العميل في جميع مراحل المشروع. ونتيجة لذلك، فإن إعادة العمل تتجاوز المستويات المقبولة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير للحصول على المشاركة المطلوبة من العميل.",
        "correct": true
      },
      {
        "text": "قم بإضافة مشكلة العميل هذه إلى مشكلة العميل المتراكمة لتحديد أولوياتها ومراجعتها.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل لتسليط الضوء على أهمية مشاركته في نجاح المشروع.",
        "correct": false
      },
      {
        "text": "توجيه الإدارة العليا لجعل العميل يعمل بشكل وثيق مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجد مدير المشروع المكلف بمشروع قائم أن جودة المنجز غير متسقة. ويجد مدير المشروع أن الفريق لا يلتزم بمعايير التطوير.\nما هي الممارسات التي يجب على مدير المشروع استخدامها لضمان جودة أعلى؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": true
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة والوقت لضمان الجودة.",
        "correct": false
      },
      {
        "text": "تنفيذ عملية التحسين المستمر لضمان تحقيق نتائج متسقة.",
        "correct": false
      },
      {
        "text": "إضافة وحدة عمل لفترة زمنية محددة لإثبات أن الحل قابل للتطبيق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن النزاعات بين أعضاء الفريق تحدث في كل سباق سريع. وبعد إجراء تحقيق، يكتشف مدير المشروع أن الفريق بحاجة إلى التدريب على التقنيات الرشيقة من أجل معالجة هذه النزاعات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة تدريب للفريق.",
        "correct": true
      },
      {
        "text": "جدولة الدورات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "إجراء تقييم للاحتياجات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "توجيه الفريق للبدء في استخدام التقنيات الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مرحلة التخطيط لمشروع ترقية، قام مدير المشروع بقياس المشاريع الحديثة الأخرى التي تستخدم نفس التكنولوجيا. واكتشف مدير المشروع أن الانقطاعات الأطول من المخطط لها حدثت في معظم الحالات بسبب أنشطة الصيانة المتكررة.\nماذا ستكون الخطوة التالية لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مشاريع المقارنة المعيارية باستخدام تقنيات أخرى لإنشاء خط أساس أكثر موضوعية.",
        "correct": true
      },
      {
        "text": "مقارنة التقنيات المماثلة الأخرى والتوصية بتطبيق تقنية أخرى.",
        "correct": false
      },
      {
        "text": "إنشاء عنصر مخاطر في سجل المخاطر وإدراج العتبات وفقًا للمعايير.",
        "correct": false
      },
      {
        "text": "ناقش فترة التوقف المحتملة مع الجهة الراعية واحصل على الموافقة على حالات الانقطاع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة تنفيذ أحد المشاريع، انضم مدير جديد إلى فريق الإدارة وأدخل شرط امتثال إلزامي يؤثر على جميع مهام المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إخطار الفريق بالمتطلبات الجديدة والمضي قدماً في المشروع كما هو مخطط له",
        "correct": true
      },
      {
        "text": "تحديث الجدول الزمني للمشروع والميزانية لتعكس متطلبات المتطلبات الجديدة.",
        "correct": false
      },
      {
        "text": "مراجعة المتطلبات الجديدة وتقييم تأثيرها على مهام المشروع ونواتجه.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر ليعكس المخاطر المحتملة المرتبطة بالمتطلبات الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nاعتاد مدير مشروع العمل على مشاريع تنبؤية وبدأ الآن العمل على مشروع باستخدام نهج مختلط. ما الذي ينبغي أن يفعله مدير المشروع لتمكين الفرق من التركيز على مهمتها؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ منهجية سكرم",
        "correct": true
      },
      {
        "text": "اعتماد القيادة الخادمة.",
        "correct": false
      },
      {
        "text": "تطبيق الأساليب المرنة.",
        "correct": false
      },
      {
        "text": "ابتكر عمليات جديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع جديد لمشروع جارٍ ويقرر أن الجودة ثابتة. وتوجد ميزانية كبيرة لضمان الجودة، ويمكن أن تستفيد مجالات أخرى من المشروع من هذه الأموال.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ استراتيجية تخفيض الميزانية لإعادة تخصيص الأموال.",
        "correct": true
      },
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": false
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة لضمان الجودة.",
        "correct": false
      },
      {
        "text": "حافظ على الميزانية كما هي في الوقت الحالي واستمر في المراقبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً. وقد خرج العديد من أعضاء الفريق من المشروع مؤخرًا، بما في ذلك الشخص الوحيد الذي يتمتع بمهارة حاسمة محددة. في بداية سباق سريع جديد، يحدد مدير المشروع مهمة تتطلب هذه المهارة المفقودة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "أعد تحديد نطاق المشروع لإزالة المهمة التي تتطلب المهارة المفقودة.",
        "correct": true
      },
      {
        "text": "تقييم تأثير المهارة المفقودة على المشروع.",
        "correct": false
      },
      {
        "text": "تأجيل المهمة إلى أن يتم تعيين بديل له",
        "correct": false
      },
      {
        "text": "إعادة إسناد المهمة إلى فريق مشروع آخر يتمتع بالمهارات اللازمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق على مشروع تطوير منتج جديد باستخدام نهج هجين. بعد السباق الرابع، علموا أن سعر صرف السلع المستوردة سيزداد بشكل كبير.\nما الذي يجب على مدير المشروع القيام به للتأكد من إطلاق المنتج النهائي في الوقت المحدد وكما هو محدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل مع أصحاب المصلحة لتطوير نهج الميزنة التدريجية.",
        "correct": true
      },
      {
        "text": "تقليل مواصفات المنتج لاستخدام مواد مستوردة أقل.",
        "correct": false
      },
      {
        "text": "أنفق المال الإضافي وخطط لتعويضه في السباق التالي.",
        "correct": false
      },
      {
        "text": "مراجعة الأعمال المتراكمة لمعرفة تأثير الزيادة في الميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال ورشة عمل تصميم روبوت جديد، يسأل المهندسون مدير المشروع عن بروتوكولات السلامة والبيئة لإجراءات تشغيله.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "توظيف مهندس متخصص لدعم فريق التصميم.",
        "correct": true
      },
      {
        "text": "تزويد الفريق بأصول العملية التنظيمية وميثاق المشروع.",
        "correct": false
      },
      {
        "text": "ابحث في وثائق الدروس المستفادة للمشاريع المماثلة.",
        "correct": false
      },
      {
        "text": "قم بإجراء معيار مرجعي مع مصانع مماثلة لالتقاط قيود الامتثال الخاصة بها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يطلب مدير الأعمال ومالك المنتج طريقة أكثر مرونة لدمج التغييرات في الأعمال المتراكمة للمنتج. إنهم يريدون تقليل وقت الوصول إلى السوق من أجل الاستجابة لاستراتيجية إصدار المنافسين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب مالك المنتج على تحديد أولويات عناصر المنتج المتراكمة وفقًا لأهداف العمل.",
        "correct": true
      },
      {
        "text": "مراجعة سجل الافتراضات وخطة إدارة المشروع لتحديد التغييرات المحتملة.",
        "correct": false
      },
      {
        "text": "إنشاء عملية شاملة لمراقبة التغيير واختيار مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "تفويض جميع أصحاب المصلحة الرئيسيين بإجراء تعديلات من أجل تسليم المنتج بشكل أسرع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التكرار، يعلن أحد أعضاء فريق المشروع الرئيسيين عن استقالته. يدرك مدير المشروع أن إحدى ميزات المنتج ستتأثر بالاستقالة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل طلب تغيير لتعديل تاريخ التسليم بناءً على هذا الوضع غير المتوقع.",
        "correct": true
      },
      {
        "text": "اطلب من الموارد البشرية (HR) الاحتفاظ بعضو الفريق حتى نهاية المشروع.",
        "correct": false
      },
      {
        "text": "تسريع تبادل المعرفة مع الفريق متعدد الوظائف لضمان فهم هذا الوضع",
        "correct": false
      },
      {
        "text": "ناقش الموقف مع مالك المنتج وحدد ما إذا كان ينبغي إضافة موارد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتقدم مشروع واسع النطاق باستمرار. ومع ذلك، يواجه الفريق صعوبات في إكمال بعض القصص المعقدة والحفاظ على سرعة الإنجاز. يكتشف مدير المشروع أن التعاون غير الفعال أدى إلى سوء الفهم والإحباط.\nما الذي يجب على مدير المشروع القيام به لتحسين أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "التركيز على القيادة الخادمة.",
        "correct": true
      },
      {
        "text": "إجراء تحليل السبب الجذري.",
        "correct": false
      },
      {
        "text": "اطلب البصيرة من أحد المرشدين.",
        "correct": false
      },
      {
        "text": "تحسين اتصالات الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه أحد كبار أعضاء الفريق تحديات مع عضو جديد في فريق المشروع. يطلب العضو الأقدم في الفريق من مدير المشروع المشورة بشأن كيفية التعامل مع العضو الجديد في الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من أداء عضو الفريق ومصفوفة توزيع المسؤوليات لتقييم التعارض.",
        "correct": true
      },
      {
        "text": "اطلب من عضو الفريق الأقدم مواجهة عضو الفريق الجديد في اجتماع الاستعداد اليومي التالي.",
        "correct": false
      },
      {
        "text": "تدريب عضو الفريق الأقدم على نماذج حل النزاعات وكيفية تطبيقها على هذا الموقف.",
        "correct": false
      },
      {
        "text": "اطلب عقد اجتماع فردي مع العضو الجديد في الفريق واطلب منه تجنب العضو الأقدم في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تولى مدير مشروع للتو مسؤولية مشروع جارٍ. استقال مدير المشروع السابق من المنظمة. وخلال مراجعة وثائق المشروع، أدرك مدير المشروع وجود انحرافات كبيرة في عملية الشراء التي استخدمها مدير المشروع السابق للتعاقد مع مقدمي الخدمات الذين يعملون حالياً في المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتصل بمدير المشروع السابق لفهم الأساس المنطقي لعملية الشراء غير الطبيعية.",
        "correct": true
      },
      {
        "text": "اتصل بمزوّدي الخدمة لمناقشة الانحراف ومطالبتهم بحل المشكلة.",
        "correct": false
      },
      {
        "text": "إبلاغ مقدمي الخدمة ومدير المشروع السابق إلى لجنة الأخلاقيات في المنظمة.",
        "correct": false
      },
      {
        "text": "وضع علامة على عملية الشراء غير الطبيعية كمسألة حرجة تسترعي انتباه الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مشروع مبتكر، يريد الراعي تقديم منصة معالجة بيانات مبتكرة وكبيرة لخدمة العملاء بشكل أفضل. ومع ذلك، لا يمكن وصف وظائف المنصة بوضوح في متطلبات المشروع. من أجل الحصول على استثمار مستمر، سيتم عرض كل مخرجات المشروع التي تظهر تقدمًا على الإدارة.\nما نوع نهج المشروع الذي يجب أن يوصي به مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنبؤي",
        "correct": true
      },
      {
        "text": "الشلال",
        "correct": false
      },
      {
        "text": "المرونة",
        "correct": false
      },
      {
        "text": "هجين",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اختبار قبول المنتج لمشروع برمجيات، يخبر راعي المشروع مدير المشروع أن البرنامج لن ينجح إلا إذا تم تغيير لون السمة من الأحمر إلى الأزرق. قام مدير المشروع بمراجعة وثائق التخطيط وأكد أن لون السمة يجب أن يكون إعادة أصر الراعي على تغيير اللون إلى اللون الأزرق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اقتراح أن يقدم راعي المشروع طلب تغيير رسمي لتغيير متطلبات الموضوع.",
        "correct": true
      },
      {
        "text": "أخبر راعي المشروع بقبول الموضوع لأن العقد ينص بوضوح على أنه يجب إعادة",
        "correct": false
      },
      {
        "text": "اتفق مع راعي المشروع وقم بتغيير لون السمة حسب الطلب لتجنب أي تعارض محتمل.",
        "correct": false
      },
      {
        "text": "اطلب من قسم المشتريات تغيير لون السمة إلى اللون الأزرق ليتماشى مع توقعات راعي المشروع.",
        "correct": false
        }
      ]
    }
  ]
}
