{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
    "type": "multiple-choice",
    "text": "تولى مدير المشروع للتو إدارة مشروع مدته 5 سنوات وصل إلى منتصفه. وفي اجتماع اللجنة التوجيهية، سأل المدير التنفيذي عما إذا كان المشروع يسير على الطريق الصحيح لتحقيق هدف زيادة الإنتاج بنسبة 40 في المائة. أجاب مدير المشروع أنه نظرًا لأنهم عملوا في المشروع لمدة شهر واحد فقط، فإنهم لا يعرفون حالة المشروع.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة تقرير الحالة الأخير لفهم حالة المشروع.",
        "correct": true
      },
      {
        "text": "التحقق من صحة حالة المشروع مع المطور الرئيسي.",
        "correct": false
      },
      {
        "text": "مراجعة حالة المشروع الأخيرة مع راعي المشروع.",
        "correct": false
      },
      {
        "text": "التحقق من الجدول الزمني للمشروع لفهم حالة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nخلال مرحلة تنفيذ المشروع، يحدد فريق المشروع مخاطر لم تكن متوقعة من قبل يمكن أن تؤخر المشروع لعدة أشهر. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث سجل المخاطر.",
        "correct": true
      },
      {
        "text": "إجراء تحليل نوعي للمخاطر.",
        "correct": false
      },
      {
        "text": "تحديث الجهات الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "التخطيط لميزانية إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال أحد الاجتماعات، يقدم أحد أعضاء فريق العمل في مشروع إنشائي مقترحًا إلى مدير المشروع. ينص الاقتراح على أن تقسيم المشروع إلى مرحلتين سيخفف من مخاطر التأخير. ستؤدي المرحلة الأولى إلى الحصول على الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي من شأنه أن يوفر للعميل فوائد مبكرة. ومن شأن ذلك أن يحد من حجم الأضرار والتجاوزات الأخرى في التكاليف بنسبة 90.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء دراسة جدوى لتقييم مخاطر وفوائد المقترح.",
        "correct": true
      },
      {
        "text": "رفض المقترح والاستمرار في المشروع كما كان مخططاً له في البداية",
        "correct": false
      },
      {
        "text": "توجيه الفريق بتنفيذ التغييرات المقترحة دون مزيد من المراجعة.",
        "correct": false
      },
      {
        "text": "ناقش المقترح مع العميل وأصحاب المصلحة الآخرين للحصول على آرائهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأ للتو مشروع جديد يضم أعضاء فريق من بلدين. ونظراً لاختلاف التوقيت، ينتهي أحد الموقعين من العمل بعد ساعة من بدء عمل الموقع الآخر لهذا اليوم.\nما الذي يجب على مدير المشروع القيام به لتعزيز التواصل بين الموقعين؟",
    "explanation": "",
    "choices": [
      {
        "text": "أثني على أعضاء الفريق المتاحين بعد ساعات العمل.",
        "correct": true
      },
      {
        "text": "حدد مواعيد الاجتماعات عبر الإنترنت خلال الساعات المتداخلة.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الالتزام بساعات العمل الموحدة.",
        "correct": false
      },
      {
        "text": "صياغة ميثاق الفريق لوضع منهجية لصنع القرار.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كجزء من أحد نواتج المشروع، يقوم مدير المشروع بشرح كيفية استخدام أحد المنتجات لمجموعة فرعية من موظفي العميل من خلال مكالمة جماعية افتراضية مدتها 30 دقيقة. يشتكي موظفو العميل من أن ورشة عمل لمدة يومين كانت ستكون أكثر فعالية للتدريب.\nما الذي كان ينبغي على مدير المشروع فعله لمنع هذه الشكوى؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم الاحتياجات التدريبية لموظفي العميل.",
        "correct": true
      },
      {
        "text": "إدراج هذا الخطر في خطة إدارة المخاطر.",
        "correct": false
      },
      {
        "text": "توفير احتياطي طوارئ للتدريب الإضافي.",
        "correct": false
      },
      {
        "text": "وضع خطة تدريب غير متزامنة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان أحد كبار أعضاء الفريق مؤثرًا للغاية ولعب دورًا حاسمًا في المشاريع السابقة. وفي هذا المشروع الجديد، لم يعد العضو الأقدم يلعب دورًا حاسمًا في هذا المشروع الجديد ولم يعد يلعب دورًا حاسمًا\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بترتيب اجتماع للفريق لمناقشة طرق زيادة التحفيز.",
        "correct": true
      },
      {
        "text": "توفير حوافز لزيادة التحفيز.",
        "correct": false
      },
      {
        "text": "اطلب من المدير الوظيفي التحدث مع عضو الفريق.",
        "correct": false
      },
      {
        "text": "قم بترتيب اجتماع فردي مع عضو الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "غالبًا ما يهيمن على المناقشات خلال الاجتماعات الأسبوعية لفريق المشروع أحد كبار أعضاء الفريق الذي يميل إلى التحدث على أعضاء الفريق الآخرين وانتقاد وجهة نظرهم علانية. ويتسبب ذلك في إحباط معنويات أعضاء الفريق الآخرين ويؤدي إلى عدم المشاركة خلال الاجتماعات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإزالة عضو الفريق الأقدم من الاجتماع الأسبوعي.",
        "correct": true
      },
      {
        "text": "نظّم نشاطاً لبناء الفريق يشجع على إيجاد الحلول معاً.",
        "correct": false
      },
      {
        "text": "فرض القواعد الأساسية الحالية لسلوك الفريق.",
        "correct": false
      },
      {
        "text": "تصعيد سلوك عضو الفريق الأقدم إلى المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع جديد لمشروع في مرحلة التنفيذ. وقد أنجز المشروع للتو منجزات المرحلة الأولى. خلال ورشة عمل لاستعراض نطاق المرحلة الثانية من المشروع، اشتكى اثنان من أصحاب المصلحة من عدم إبلاغهم بالمنافع التي تم تسليمها بالفعل\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى اللجنة التوجيهية لأنه يجب أن يكون الراعي قد أبلغ أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية لأن السؤال جاء من بعض كبار أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "قم بتسجيل المشكلة في سجل المشكلات، ومناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "تسجيل المشكلة في السجل، ومراجعة مصفوفة أصحاب المصلحة، وتحديث خطة إدارة المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نجح فريق مشروع رشيق في إصدار نواتج محدثة في كل سباق سريع توفر باستمرار قيمة متزايدة للمستخدمين. ومع ذلك، فإن المشروع يتجاوز الميزانية المخصصة له في البداية، ولا يزال هناك العديد من البنود في الأعمال المتراكمة للمشروع. وقد أعرب أصحاب المصلحة عن مخاوف متزايدة، ويحتاج مدير المشروع إلى اتخاذ قرار بشأن أفضل مسار عمل لمعالجة الوضع وإدارة توقعات أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قياس رضا المستخدمين وتقديم النتائج إلى اللجنة التوجيهية.",
        "correct": true
      },
      {
        "text": "قم بإزالة النواتج المتراكمة التي لم تكن جزءًا من ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "طلب ميزانية إضافية بناءً على تقدير محدث للبنود المتراكمة المتبقية.",
        "correct": false
      },
      {
        "text": "التأكيد على توقع وجوب إنهاء العمل الملتزم به في الوقت المحدد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لمشروع جديد، يجد مدير مشروع جديد أن طلب تقديم العروض (RFP) يشير إلى عدة لوائح حكومية. ومع ذلك، يكتشف مدير المشروع أن المبادئ التوجيهية للامتثال المتعلقة بلائحتين محددتين قيد الإنشاء وغير متوفرة حالياً. تنصح الإدارة العليا مدير المشروع بأن المبادئ التوجيهية ستكون متاحة عندما يتم الوصول إلى تلك المرحلة من المشروع وتوجه مدير المشروع إلى مواصلة العمل على المقترح.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأخير المشروع وشرح عواقب عدم الامتثال للإدارة العليا.",
        "correct": true
      },
      {
        "text": "توثيق التفاعلات مع الإدارة العليا كافتراضات في سجل الافتراضات.",
        "correct": false
      },
      {
        "text": "التحقق من متطلبات اللوائح الحكومية ووضع استراتيجية للامتثال لها.",
        "correct": false
      },
      {
        "text": "مواصلة العمل على الاقتراح وتحديثه كلما تم فهم المزيد من إرشادات الامتثال",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع مسؤول عن قيادة إصدار منتج له جداول زمنية صارمة للوصول إلى السوق. تم تقدير إجمالي 600 نقطة من نقاط القصة مع سرعة 60 نقطة لكل تكرار. تم تعيين فريق يصل عدد أعضائه إلى عضوين لهذا المشروع.\nما العبارة الصحيحة عن هذا السيناريو؟",
    "explanation": "",
    "choices": [
      {
        "text": "وتمثل السرعة 60 نقطة لكل تكرار الحد الأدنى للعمل الذي يجب إنجازه، ويمثل عضوان من الفريق الحد الأقصى لحجم الفريق.",
        "correct": true
      },
      {
        "text": "تعني سرعة 60 نقطة في كل تكرار أن المشروع تحت السيطرة، بينما تعني سرعة 60 نقطة في كل تكرار أن المشروع تحت السيطرة، وتعني سرعة 2 من أعضاء الفريق أن المشروع خارج السيطرة.",
        "correct": false
      },
      {
        "text": "تعني السرعة 60 نقطة لكل تكرار أن المشروع تحت السيطرة، ويمثل عضوان من الفريق الحد الأقصى لحجم الفريق.",
        "correct": false
      },
      {
        "text": "تمثل سرعة 60 نقطة في كل تكرار الحد الأدنى من العمل الذي يجب إنجازه، ويعني وجود عضوين من الفريق أن المشروع تحت السيطرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إخطار مدير مشروع في إحدى شركات التصنيع بوجود عطل في الماكينة التي تم تسليمها أثناء الاختبارات الأولية. فشلت الآلة في الامتثال لمواصفات التصميم القياسية، مما أدى إلى حدوث أعطال ومخاوف تتعلق بالسلامة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة إجراء الاختبار الأولي وتنفيذه.",
        "correct": true
      },
      {
        "text": "تقييم العوامل البيئية والفردية.",
        "correct": false
      },
      {
        "text": "تقييم الوثائق الفنية للماكينة.",
        "correct": false
      },
      {
        "text": "تحقق من الاتصالات بين أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بقيادة مشروع لتقديم منتج جديد في صناعة شديدة التنظيم ويجب عليه إعطاء الأولوية لممارسات إدارة الجودة. يفكر مدير المشروع في إدارة تحسينات الجودة.\nما الذي يجب أن يركز عليه مدير المشروع لضمان التركيز على إدارة تحسينات الجودة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد أولويات الإصدار السريع للمنتج وتحليل ملاحظات المستهلكين لتحديد التحسينات اللازمة للجودة وتنفيذها.",
        "correct": true
      },
      {
        "text": "تنفيذ استراتيجية التدقيق المتكرر للجودة وتتبع عيوب المنتج لتحديد ومعالجة أي مشكلات في الجودة.",
        "correct": false
      },
      {
        "text": "تبسيط ممارسات الجودة والامتثال من خلال تفويض مسؤولية مراقبة الجودة إلى عضو معين في الفريق.",
        "correct": false
      },
      {
        "text": "وضع مقاييس وأهداف واضحة للجودة لكل مرحلة من مراحل المشروع لضمان الامتثال لمعايير الجودة التنظيمية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بقيادة مشروع يتبع النهج التنبؤي للشركة. يكتشف مدير المشروع أن المشروع متأخر عن الجدول الزمني والميزانية لأن أحد أصحاب المصلحة الرئيسيين يقدم عددًا كبيرًا من طلبات التغيير بشكل غير عادي.\nما الذي يجب أن يفعله مدير المشروع لمساعدة الشركة على تحقيق النتائج المرجوة من المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة المخاطر لتحديد خطة تخفيف المخاطر.",
        "correct": true
      },
      {
        "text": "استخدم احتياطي الطوارئ لتنفيذ نشاط المسار السريع.",
        "correct": false
      },
      {
        "text": "مراجعة عملية التحكم في التغيير وتنفيذ التحسينات.",
        "correct": false
      },
      {
        "text": "تصعيد المشكلة مع صاحب المصلحة إلى راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتولى مدير مشروع إدارة مشاريع متعددة في خمسة بلدان مختلفة، وقد صدر له توجيه جديد بشأن الزي في مكان العمل وترتيبات المكاتب. وقد قوبل هذا الأمر بمقاومة في ثلاثة بلدان، مما أدى إلى سلسلة من سوء الفهم والاستياء والمشاكل القانونية المحتملة.\nما الذي كان ينبغي على مدير المشروع فعله للتعامل مع هذا الموقف بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب من الإدارة العليا التوضيح والاستثناءات قبل إصدار توجيه عام لجميع الدول.",
        "correct": true
      },
      {
        "text": "تقييم السمات الثقافية والشخصية في مختلف البلدان قبل إصدار توجيه عام.",
        "correct": false
      },
      {
        "text": "تحديد الحالة الاجتماعية والاقتصادية لأعضاء الفريق قبل إصدار توجيه واسع النطاق.",
        "correct": false
      },
      {
        "text": "الحصول على قائمة بالتفضيلات الشخصية من أعضاء الفريق قبل إصدار توجيهات عامة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير المشروع في مرحلة تنفيذ المشروع. يتخطى أحد أصحاب المصلحة الذين تم تحديدهم حديثًا مدير المشروع باستمرار للحصول على تعليقات من راعي المشروع مباشرة، مما يزيد من الضغط والإحباط لجميع أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "الدعوة إلى عقد اجتماع لجميع أصحاب المصلحة في المشروع لمناقشة الأمر ووضع خطة عمل مناسبة.",
        "correct": true
      },
      {
        "text": "أرسل خطة إدارة الاتصالات إلى صاحب المصلحة بالبريد الإلكتروني وأشر إلى أنه وافق على الخطة.",
        "correct": false
      },
      {
        "text": "قابل راعي المشروع وتأكد من أن مدير المشروع يجب أن يكون نقطة الاتصال الوحيدة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة لفهم احتياجاتهم وتحديث خطة إدارة التواصل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على إطلاق الحد الأدنى من المنتج القابل للتطبيق (MVP) لمنتج جديد في السوق. وقد تقدم الفريق بنجاح إلى التكرار الثالث من أصل ستة تكرارات من إجمالي ستة تكرارات مخطط لها. خلال اجتماع تخطيط التكرار القادم، يقوم العميل بإخطار الفريق بأن أحد المنافسين يعتزم التغلب عليهم في السوق وإطلاق منتج مماثل في الربع القادم.\nكيف ينبغي لمدير المشروع معالجة هذا التحدي التنافسي؟",
    "explanation": "",
    "choices": [
      {
        "text": "الإقرار بالمشكلة وتضمين تفاصيل شاملة في تقرير الحالة التالي للمشروع.",
        "correct": true
      },
      {
        "text": "زيادة حجم الفريق للإسراع في تسليم المنتج وإطلاق المنتج قبل المنافس.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل لمناقشة تقليل الأعمال المتراكمة في المشروع للمساعدة في تسريع تسليم المنتج.",
        "correct": false
      },
      {
        "text": "اعمل مع الفريق لتحديد أولويات الميزات الأساسية وإعادة تعريف MVP للتغلب على المنافسين في السوق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان فريق مشروع مشتت يعمل معًا في مشروع تطوير طويل الأجل. أنهى الفريق للتو عملية تكرار عندما انضم عضو جديد إلى فريق المشروع. خلال أول اجتماع استعراضي افتراضي لهم، يقاطع عضو الفريق المنضم حديثًا ويطلب من الجميع إعادة ذكر أدوارهم وأعمالهم السابقة في التكرارات السابقة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتوجيه عضو الفريق الجديد لمراجعة خطة إدارة المشروع بعد الاجتماع.",
        "correct": true
      },
      {
        "text": "أبلغ عضو الفريق أنه من الأفضل معالجة هذا السؤال في اجتماع آخر.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو في الفريق شرح دوره وما عمل عليه في التكرارات السابقة.",
        "correct": false
      },
      {
        "text": "اطلب من المدير الوظيفي للعضو الجديد في الفريق مراجعة عملية التأهيل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لإعادة تصميم نظام نقاط البيع في أحد المتاجر. يقوم الفريق حاليًا باختبار الوظيفة الجديدة عندما يقترح أحد أصحاب المصلحة الرئيسيين تغييرًا. يمكن أن يحقق التغيير فائدة كبيرة ويزيد من رضا العملاء، ولكنه يتطلب أيضًا المزيد من الموارد.\nما الإجراءات التي يجب أن يتخذها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أوقف الاختبار وحدد موعداً لعقد اجتماع لمراجعة التغييرات المقترحة مع الموارد.",
        "correct": true
      },
      {
        "text": "الاختبار بينما يجتمع مدير المشروع مع أصحاب المصلحة الرئيسيين لمراجعة التغييرات المقترحة.",
        "correct": false
      },
      {
        "text": "توثيق التغييرات المقترحة وتقييم أي تأثير على الوقت والتكلفة والموارد.",
        "correct": false
      },
      {
        "text": "تأجيل التغييرات المقترحة والسماح للفريق بأنشطة الاختبار والتنفيذ.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تخطط إحدى شركات تنظيم الفعاليات لحدث جديد لعميل يعقد مؤتمرات نصف سنوية. ويتولى إدارة المشروع مدير مشروع جديد قام بمراجعة سجل الدروس المستفادة من الحدث الأخير ويشعر بالقلق من احتمال تكرار مشكلة سابقة.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد السبب الجذري والتشاور مع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تعامل مع المشكلة إذا ظهرت أثناء التخطيط للحدث.",
        "correct": false
      },
      {
        "text": "التوصية بإعادة جدولة المؤتمر القادم.",
        "correct": false
      },
      {
        "text": "نفذ نفس الاستراتيجيات المستخدمة في الحدث الأخير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "توشك إحدى الشركات على بدء مشروع في مكان ناءٍ معروف بالطقس القاسي. وقد تم الاتفاق على تنفيذ المشروع باستخدام نهج متوقع متعدد المراحل. وتتألف كل مرحلة من عدة تكرارات.\nما الذي يجب أن يفعله مدير المشروع في حالة الطقس القاسي؟",
    "explanation": "",
    "choices": [
      {
        "text": "أوقف العمل مؤقتًا حتى وصول فريق متخصص لتقييم الأضرار التي لحقت بالموقع.",
        "correct": true
      },
      {
        "text": "راجع الخطط الأولية في حالة الطوارئ، ثم قم بتحديث واتباع الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "تقديم المشورة للإدارة لإعادة النظر في هذا الاستثمار واستمرارية المشروع.",
        "correct": false
      },
      {
        "text": "أوقف عملية التكرار، وقم بإجراء استعراض بأثر رجعي، وانتقل إلى المرحلة التالية من المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيلاحظ مدير المشروع أن أعضاء الفريق لا يتعاونون أو لا يتصرفون بشكل استباقي. ما الذي كان ينبغي أن يفعله مدير المشروع في بداية المشروع لتحقيق بيئة مشروع أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم لديناميكيات الفريق.",
        "correct": true
      },
      {
        "text": "تعيين جميع المهام في بداية المشروع.",
        "correct": false
      },
      {
        "text": "تيسير اجتماعات الفريق الإضافية.",
        "correct": false
      },
      {
        "text": "تقسيم المشروع إلى المزيد من التكرارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع مسؤول عن مشروع شلالي مدته شهران لإنشاء منتج جديد. وقد مضى تسعة أشهر على بدء تنفيذ المشروع عندما اقترح العميل استخدام تكنولوجيا جديدة أصبحت متاحة من شأنها أن تقلل من تكاليف المشروع بنسبة 0.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث خطة إدارة التكوين لتضمين التقنية الجديدة كجزء من التصميم.",
        "correct": true
      },
      {
        "text": "مواصلة العمل كما هو مخطط له نظرًا لأن التقنية الجديدة لم تكن جزءًا من خطة إدارة المشروع.",
        "correct": false
      },
      {
        "text": "إنشاء طلب تغيير لتقييم جدوى وتأثير استخدام التقنية الجديدة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق التطوير تنفيذ جميع المكونات المتبقية بالتقنية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع مسؤول عن مشروع شلالي مدته شهران لإنشاء منتج جديد. وقد مضى تسعة أشهر على بدء تنفيذ المشروع عندما اقترح العميل استخدام تكنولوجيا جديدة أصبحت متاحة من شأنها أن تقلل من تكاليف المشروع بنسبة 0.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث خطة إدارة التكوين لتضمين التقنية الجديدة كجزء من التصميم.",
        "correct": true
      },
      {
        "text": "مواصلة العمل كما هو مخطط له نظرًا لأن التقنية الجديدة لم تكن جزءًا من خطة إدارة المشروع.",
        "correct": false
      },
      {
        "text": "إنشاء طلب تغيير لتقييم جدوى وتأثير استخدام التقنية الجديدة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق التطوير تنفيذ جميع المكونات المتبقية بالتقنية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في أحد اجتماعات المراجعة، يكتشف مدير المشروع سوء تفاهم حول أحد النواتج المهمة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من أعضاء الفريق توضيح ما يمكن إنجازه.",
        "correct": true
      },
      {
        "text": "اطلب من العميل توضيح ما يمكن تسليمه.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج توضيح ما يمكن إنجازه.",
        "correct": false
      },
      {
        "text": "اطلب من الجهة الراعية توضيح ما يمكن إنجازه.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بوضع ميزانية المشروع. بعد تقدير تكلفة كل نشاط، يضيف المدير احتياطي طوارئ بزيادة التكلفة المقدرة لجميع الأنشطة بنفس النسبة المئوية. غير أن ذلك يؤدي إلى تجاوز التكلفة الإجمالية للميزانية المخصصة حتى قبل إضافة احتياطي الإدارة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب ميزانية إضافية للتأكد من أن جميع تقديرات التكاليف ممولة بشكل مناسب",
        "correct": true
      },
      {
        "text": "تقليل النسبة المئوية للزيادة لتقليل التكلفة الإجمالية للمشروع.",
        "correct": false
      },
      {
        "text": "إعادة حساب احتياطي الطوارئ بناءً على المخاطر المحددة واستراتيجيات الاستجابة.",
        "correct": false
      },
      {
        "text": "تخصيص جزء من احتياطي الطوارئ لاحتياطي الإدارة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع الرشيق، تشير حالة المشروع إلى أن المشروع 95 خلال مراجعة التكرار، كان أصحاب المصلحة قلقين بشأن قيمة الأعمال التي يتم تقديمها\nما الذي يجب أن يفعله مدير المشروع لضمان مواءمة المشروع بشكل صحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "التواصل مع أصحاب المصلحة للتخفيف من مخاوفهم.",
        "correct": true
      },
      {
        "text": "توجيه راعي المشروع لمراجعة أهداف المشروع والعمل على تحقيقها",
        "correct": false
      },
      {
        "text": "اجتمع مع مالك المنتج لإعادة تقييم نطاق المشروع ومخرجاته.",
        "correct": false
      },
      {
        "text": "اطلب من محلل الأعمال تعديل أهداف المشروع وفقًا لذلك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقترب موعد نهائي رئيسي من أحد أعضاء الفريق المتخصصين الذين تلقوا فجأة خبرًا مفاده أن عليهم مغادرة المكتب لمدة أسبوعين. لديهم ما يقرب من ثلاثة أيام عمل حتى مغادرتهم ولن يكونوا متاحين عبر أي قنوات اتصال.\nما الذي يجب أن يفعله مدير المشروع الرشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اضبط خطة المشروع والجدول الزمني لاستيعاب الغياب.",
        "correct": true
      },
      {
        "text": "تحديد المهام الحرجة والتبعيات التي قد تتأثر بها",
        "correct": false
      },
      {
        "text": "تقديم مورد بديل لعضو الفريق المغادر.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الإسراع قدر المستطاع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء مشروع مختلط، يقوم مدير المشروع بمراجعة أداء فريق المشروع ويدرك أن سرعة الفريق ليست سريعة بما يكفي لتحقيق هدف بوابة المراجعة التالية. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد أولويات محتويات القصص المتراكمة وقم بإزالة بعض القصص.",
        "correct": true
      },
      {
        "text": "قم بزيادة مدة السباق السريع لإتاحة المزيد من الوقت للفريق.",
        "correct": false
      },
      {
        "text": "استخدم اجتماع الاستعداد لتقييم العوائق والمشاكل.",
        "correct": false
      },
      {
        "text": "إنشاء طلب تغيير لتعديل أهداف بوابة المراجعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل فريق على مشروع جديد ويرفض الراعي الموافقة على زيادة الميزانية اللازمة للتكرار الحالي. ما الذي ينبغي أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير للحصول على موافقة رسمية على زيادة الميزانية.",
        "correct": true
      },
      {
        "text": "العمل مع أصحاب المصلحة لتطوير مناهج مرنة لوضع الميزانية.",
        "correct": false
      },
      {
        "text": "اشرح للجهة الراعية مخاطر عدم الحصول على الموافقة على الميزانية.",
        "correct": false
      },
      {
        "text": "أنفق المال الإضافي وخطط للتعويض في السباق القادم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة اختبار المشروع، يجد أحد أعضاء الفريق أن بعض المتطلبات لم يتم الوفاء بها. إذا قام المشروع الآن بإضافة عمل للوفاء بالمتطلبات، فقد يتسبب ذلك في تجاوز كبير للوقت والتكلفة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا.",
        "correct": true
      },
      {
        "text": "إجراء تحليل الأثر.",
        "correct": false
      },
      {
        "text": "الدعوة إلى اجتماع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان من المقرر الانتهاء من مشروع بناء خط أنابيب الغاز في غضون 36 شهرًا. وبعد 24 شهراً، علّقت السلطات الحكومية المحلية المشروع بعد 24 شهراً، بحجة خرق إجراءات التأثير الاجتماعي.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة طوارئ في حالة التعليق من قبل الحكومة المحلية.",
        "correct": true
      },
      {
        "text": "مراجعة اللوائح والإجراءات المحلية والتخطيط لها وفقًا لذلك.",
        "correct": false
      },
      {
        "text": "طلب موارد إضافية لتسريع عملية البناء بعد التعليق.",
        "correct": false
      },
      {
        "text": "إنشاء قناة اتصال منتظمة مع الحكومة المحلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه افتتاح مكتب جديد في الخارج تأخيراً محتملاً لأن التصريح المطلوب لم يصدر بعد من الحكومة المحلية. اجتمع فريق المشروع لتقييم مسار العمل المناسب على النحو المبين في سجل المخاطر. وبعد إجراء تقييم شامل، قرر الفريق تأجيل الافتتاح إلى موعد آخر.\nما هي الوثيقة التي يجب أن يستخدمها مدير المشروع لتحديث خطة إدارة المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "خطة إدارة المخاطر",
        "correct": true
      },
      {
        "text": "تقرير المخاطر",
        "correct": false
      },
      {
        "text": "سجل المخاطر",
        "correct": false
      },
      {
        "text": "سجل الدروس المستفادة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع متعدد السنوات قيد التنفيذ عندما يعلن أحد الموارد الرئيسية عن تقاعده. ويشعر مدير المشروع بالقلق بشأن تأثير ذلك على المشروع وقد حدد أن العديد من المهام الحرجة ستتأثر\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مطالبة باقي أعضاء الفريق بالعمل لساعات إضافية للمهام المتأثرة.",
        "correct": true
      },
      {
        "text": "إبلاغ أصحاب المصلحة بأن مهام المورد لن تكون في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "التعاون مع مدير الموارد لتحديد وتدريب بديل مناسب.",
        "correct": false
      },
      {
        "text": "شجع عضو الفريق المتقاعد على تأجيل التقاعد لتجنب تعطيل المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق رشيق بتسليم الميزات باستمرار في الوقت المحدد، لكنه اكتشف مؤخرًا فجوة كبيرة في البنية أدت إلى إعادة العمل.\nما هي الممارسة الرشيقة التي يجب أن يستخدمها مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تخطيط الزيادة",
        "correct": true
      },
      {
        "text": "فريق العمل بأثر رجعي",
        "correct": false
      },
      {
        "text": "العرض التوضيحي لأصحاب المصلحة",
        "correct": false
      },
      {
        "text": "الوقوف اليومي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "دُعي أحد كبار أصحاب المصلحة إلى اجتماع مراجعة سريع وطلب من أحد أعضاء فريق المشروع وصف المنتج النهائي الذي سيقدمه المشروع. لم يتمكن عضو الفريق من الإجابة وأرجأ السؤال إلى عضو أرفع منه في الفريق.\nما الذي كان ينبغي فعله بشكل مختلف في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يكون عضو الفريق قد نصح صاحب المصلحة بسؤال مسؤول سكروم.",
        "correct": true
      },
      {
        "text": "كان يجب على عضو الفريق أن ينصح صاحب المصلحة بسؤال مالك المنتج.",
        "correct": false
      },
      {
        "text": "كان ينبغي أن يحتفظ أصحاب المصلحة بأسئلتهم حتى اجتماع المراجعة السريع التالي.",
        "correct": false
      },
      {
        "text": "كان ينبغي على أصحاب المصلحة توجيه أسئلتهم إلى مدير المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتعمل إحدى الشركات على مشروع مختلط تعاني فيه النواتج من مشاكل في الجودة في نهاية أحد سباقات السرعة. ما الإجراء الذي ينبغي لمدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة تعريف المنجز (DoD).",
        "correct": true
      },
      {
        "text": "ابحث عن مجموعة واضحة من اتفاقيات العمل.",
        "correct": false
      },
      {
        "text": "تطبيق تخطيط تدفق القيمة.",
        "correct": false
      },
      {
        "text": "استخدم نهجاً قائماً على الخطة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تكليف مدير مشروع بمشروع معقد بمتطلبات قانونية وتنظيمية وتعاقدية كبيرة. غير أن هذه المتطلبات لم يتم تحديدها أو وضع اللمسات الأخيرة عليها بعد وهناك مخاوف من التأخير في استكمال هذه المتطلبات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ركز على نواتج المشروع بدلاً من ذلك لأن الوفاء بهذه المتطلبات ليس من مسؤولية مدير المشروع.",
        "correct": true
      },
      {
        "text": "اتصل بمالك المنتج وسلط الضوء على مخاطر المشروع المتعلقة بالتأخير في تلبية هذه المتطلبات في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "اجتمع مع مالك المنتج والقسم القانوني لمراجعة حالة المشروع والتقدم المحرز في تحديد هذه المتطلبات.",
        "correct": false
      },
      {
        "text": "تأخير وضع اللمسات الأخيرة على المتطلبات القانونية والتنظيمية والتعاقدية حتى نهاية المشروع، وقبل تاريخ بدء التشغيل .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع لشركة ناشئة ناجحة. وقد أظهرت الشركة الناشئة نمواً هائلاً مع فوائد متعددة لأعضاء الفريق، بما في ذلك ساعات العمل المرنة وسياسة العمل من المنزل. خلال آخر عملية إعادة نظر، أشار أحد أعضاء الفريق إلى أن سرعة الفريق تحسنت عندما كان الفريق مجتمعاً في غرفة المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "جمع الملاحظات وتحليل تأثير الموقع الفعلي على سرعة الفريق.",
        "correct": true
      },
      {
        "text": "تنقيح الأعمال المتراكمة لتحسين سرعة الفريق والحفاظ على السياسات الحالية.",
        "correct": false
      },
      {
        "text": "شارك الفكرة مع الإدارة العليا واقترح تحديث سياسات الشركة.",
        "correct": false
      },
      {
        "text": "قم بتحديث خطة إدارة الموارد وميثاق الفريق لتعزيز التواجد المشترك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقدر أن يكون للمشروع ما مجموعه 250 نقطة قصة. وخطط الفريق لـ 40 نقطة قصة لكل تكرار وتم تسليم 40 و0 و20 و20 و5 نقاط قصة في التكرارات الأربعة الأولى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تعيين المهام غير المنجزة إلى أعضاء الفريق خلال التكرار التالي.",
        "correct": true
      },
      {
        "text": "اعمل مع أعضاء الفريق لتعديل نقاط القصة المخططة للتكرارات التالية.",
        "correct": false
      },
      {
        "text": "قم بإزالة الميزات التي لا يمكن تسليمها من المنتج المتراكم وتحديث العميل.",
        "correct": false
      },
      {
        "text": "التفاوض مع العميل لتمديد مواعيد التسليم بسبب مواعيد العطلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يطلب العميل استبدال قطعة من الأجهزة المخطط لها بقطعة أخرى ذات ميزات أكثر وسعر أقل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم الميزات الجديدة للتأكد من توافقها مع احتياجات أعمال العميل.",
        "correct": true
      },
      {
        "text": "قم بدمج الأجهزة على الفور لأنها ستقلل من التكلفة الإجمالية للمشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق للتخطيط لتنفيذ الأجهزة الجديدة حسب الطلب",
        "correct": false
      },
      {
        "text": "اطلب الموافقة من مدير المشتريات وقم بتطوير نموذج أولي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدعو مدير المشروع إلى اجتماع لتحديد مخاطر مشروع معقد. يُدعى العديد من الخبراء المتخصصين إلى هذا الاجتماع إلى جانب فريق المشروع.\nلماذا قام مدير المشروع بدعوة الخبراء المختصين؟",
    "explanation": "",
    "choices": [
      {
        "text": "يتمتع خبراء الموضوع بخبرة متخصصة ويمكنهم المساعدة في تحديد المشكلات عالية المخاطر ومعالجتها.",
        "correct": true
      },
      {
        "text": "إن تحديد المخاطر في اجتماع مع خبراء في الموضوع يجعل الحصول على موارد أفضل للمشروع أسهل.",
        "correct": false
      },
      {
        "text": "سيكون من الأسهل قبول المخاطر إذا كان خبراء الموضوع الذين حضروا الاجتماع يعملون معاً.",
        "correct": false
      },
      {
        "text": "يمكن لمدير المشروع الاستفادة من موارد الخبراء المتخصصين لمتابعة المخاطر التي تم تحديدها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم مدير المشروع بإدارة عدة مشاريع مترابطة. وتعتمد بعض هذه المشاريع على نواتج محددة من مشاريع أخرى. لتجنب الاختناقات وتسهيل نجاح المشروع، يجب على مدير المشروع تقييم خطط المشاريع المدمجة لمعرفة التبعيات.\nما هو الإجراء الأنسب لمدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد جميع التبعيات بين المشاريع وتوثيقها.",
        "correct": true
      },
      {
        "text": "ضبط الجداول الزمنية للمشروع لإزالة التبعيات.",
        "correct": false
      },
      {
        "text": "القضاء على جميع التبعيات المحتملة بين المشاريع.",
        "correct": false
      },
      {
        "text": "التأكد من أن جميع المشاريع يمكن أن تمضي قدماً بشكل مستقل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع في مرحلة التخطيط ويتطلب وقتاً وجهداً كبيرين لجمع البيانات وتحليلها. ويطلب راعي المشروع من مدير المشروع أن يتخطى المناقشة الجماعية المركزة وجلسات العصف الذهني المخطط لها في محاولة لتسريع العملية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ اللجنة التوجيهية للمشروع بالمشكلة.",
        "correct": true
      },
      {
        "text": "الإقرار بطلب راعي المشروع وتخطي الجلسات.",
        "correct": false
      },
      {
        "text": "أخبر راعي المشروع أن تخطي الجلسات سيعرض المشروع للخطر.",
        "correct": false
      },
      {
        "text": "اجتمع مع راعي المشروع لفهم أسباب ضيق الوقت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع متوسط الحجم يهدف إلى تطوير منتج مبتكر بمتطلبات متغيرة. لا يتوفر العديد من أعضاء الفريق لمدة أسبوعين في الشهر خلال مدة المشروع. يدرك مدير المشروع أن تكلفة الجودة تزداد بشكل كبير خلال تلك الفترات. ومع ذلك، فإن سرعة الفريق مستقرة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة موارد إلى الفريق.",
        "correct": true
      },
      {
        "text": "توسيع نطاق جهود الاختبار.",
        "correct": false
      },
      {
        "text": "توفير التدريب المتبادل.",
        "correct": false
      },
      {
        "text": "زيادة مدة العدو السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشارك مدير المشروع في مشروع تتطور متطلباته باستمرار.\nما الذي يجب أن يفعله مدير المشروع لتحقيق النجاح؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم تحديثات منتظمة وطلب الموافقات المستندة إلى النواتج القابلة للتسليم من مالك المنتج.",
        "correct": true
      },
      {
        "text": "اعمل مع الفريق لضمان سيرهم على المسار الصحيح والتسليم في الموعد المحدد.",
        "correct": false
      },
      {
        "text": "الحفاظ على جو عمل مريح لتحسين تماسك الفريق.",
        "correct": false
      },
      {
        "text": "ضمان تقديم الوثائق والعمليات بشكل مناسب وتحديثها لمالك المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع رشيق مع فريق متعدد الوظائف. يتم إبلاغ مدير المشروع بأن بعض أعضاء الفريق عادةً ما يثيرون متطلبات إضافية ليست ضمن النطاق المعتمد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا السلوك المتوقع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب الفريق على إدارة النطاق باستخدام إطار العمل المناسب.",
        "correct": true
      },
      {
        "text": "رفع الأمر إلى الجهة الراعية وطلب استبدال أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "قم بإجراء اجتماعات الاستعداد اليومية مع الفريق وأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "اشرح أنه لا يمكن تغيير المتطلبات بدون موافقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مديرا مشروعين على توفير الموارد لمشروعيهما. حدد كلا مديري المشروعين نفس الخبير المتخصص (SME) باعتباره مفيدًا لمشروعهما. ويستخدم المشروع (أ) نهجًا تنبؤيًا، بينما يستخدم المشروع (ب) نهجًا مرنًا.\nما المشروع الذي ينبغي تخصيصه للمشروع الصغير والمتوسط الحجم؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب تعيين الشركة الصغيرة والمتوسطة في المشروع (أ) لأن تخطيط المشروع استند إلى دعم الشركة الصغيرة والمتوسطة.",
        "correct": true
      },
      {
        "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النجاح في مشروع رشيق يتحدد بالتميز التقني.",
        "correct": false
      },
      {
        "text": "يجب تعيين مدير مشروع صغير ومتوسط الحجم للمشروع مع مدير المشروع الأقل خبرة لتحسين احتمالية النجاح.",
        "correct": false
      },
      {
        "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النهج المرن يعطي الأولوية للمرونة والقدرة على التكيف.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيدرك مدير المشروع أن الفريق يحتاج إلى تدريب على تقنية معينة مطلوبة في المشروع. ما الذي يجب أن يفعله مدير المشروع للتخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم معرفة الفريق بالتقنية والبحث عن خيارات التدريب الموصى بها.",
        "correct": true
      },
      {
        "text": "تعاقد مع مزود خبير للقيام بالعمل الذي يستخدم تلك التقنية المحددة.",
        "correct": false
      },
      {
        "text": "إنشاء عنصر في سجل المخاطر وإخطار الجهة الراعية.",
        "correct": false
      },
      {
        "text": "قم بإصلاح أي ثغرات في التدريب عند ظهورها أثناء المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nفي نهاية مشروع كبير، يدرك أصحاب المصلحة أن الفوائد المحققة ليست هي نفسها الفوائد المتوقعة. ما هو العنصر الذي يمكن أن يكون قد أدى إلى هذه المشكلة، إذا لم يتم تحديده بشكل جيد في بداية المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وثائق المتطلبات",
        "correct": true
      },
      {
        "text": "نطاق المشروع",
        "correct": false
      },
      {
        "text": "حالة العمل",
        "correct": false
      },
      {
        "text": "مقاييس الفوائد",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء اجتماع الاستعداد اليومي، يقوم أحد أعضاء الفريق بإبلاغ الفريق بأن قصة المستخدم التي كانت في البداية جزءًا من تخطيط السباق السريع أصبحت غير صالحة بسبب تغيير في السياسة تم الإعلان عنه مؤخرًا. ما الذي يجب أن يفعله مدير المشروع استجابةً لهذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إغلاق قصة المستخدم المتعلقة بتغيير السياسة وتوضيح أنها لم تعد ذات قيمة.",
        "correct": true
      },
      {
        "text": "قم بإزالة قصة المستخدم من سباق السرعة الحالي وجدولتها لسباق السرعة التالي.",
        "correct": false
      },
      {
        "text": "إخطار أصحاب المصلحة بأنه لا يمكن تعديل قصص المستخدمين التي تم الالتزام بها في سباق السرعة.",
        "correct": false
      },
      {
        "text": "قم بإزالة قصة المستخدم من العدو السريع واطلب من الفريق الإسراع في إكمال العدو السريع الحالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأت إحدى الشركات مشروعًا لبناء محطة جديدة للطاقة الكهرومائية. تم إجراء تحليل لتحديد متطلبات الامتثال التنظيمي والسلامة والأمن. بعد التحليل، كان من الواضح أن بعض العناصر اللازمة لتحقيق الامتثال قد تكون صعبة ومكلفة في التنفيذ. يشعر أصحاب المصلحة بالقلق إزاء التكلفة والتعقيد الإضافيين ولديهم آراء مختلفة حول أهمية الامتثال وآثاره المحتملة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاجتماع مع أصحاب المصلحة والتأكيد على أهمية الامتثال وتكاليف عدم الامتثال.",
        "correct": true
      },
      {
        "text": "راجع سجل أصحاب المصلحة وحدد أصحاب المصلحة الذين يتمتعون بأعلى سلطة وتأثير.",
        "correct": false
      },
      {
        "text": "رفع مخاوف الامتثال والتباين بين آراء أصحاب المصلحة إلى الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "تحديد متطلبات الامتثال التي يمكن استبعادها من أجل التوافق مع توقعات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق المشروع الذي يستخدم نهجًا مختلطًا بإنتاج نواتج تنبؤية وتدريجية في آن واحد. وتنص خطة إدارة الاتصالات على تفضيل الاتصالات المكتوبة على الأنواع الأخرى. وتنشأ المشاكل يوميا فيما يتعلق بالمهام الإضافية؛ ومع ذلك، فإن تراكم البريد الإلكتروني المتراكم يزداد تعقيدا بشكل متزايد وغير ضروري.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اعتماد المحادثات المباشرة وجهاً لوجه خلال سباقات السرعة.",
        "correct": true
      },
      {
        "text": "اعتماد الاتصالات القضائية خلال سباقات السرعة.",
        "correct": false
      },
      {
        "text": "اعتماد الاتصالات المعطلة أثناء سباقات السرعة.",
        "correct": false
      },
      {
        "text": "اعتماد المحادثات الرسمية خلال سباقات السرعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع قيد التنفيذ مع أعضاء فريق من بلدين مختلفين وهناك شكاوى من كلا الجانبين. يعتقد أعضاء الفريق من البلد \"ألف\" أن أعضاء الفريق من البلد \"باء\" بطيئون جدًا في الاستجابة وغالبًا ما يكون لديهم أيام إجازة محددة. يؤمن أعضاء الفريق من البلد (ب) بالتوازن الجيد بين العمل والحياة ويعتقدون أن هناك حاجة إلى مزيد من التفكير قبل اتخاذ القرارات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تقييم ميثاق الفريق مع أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "إعادة النظر في خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "تذكير أعضاء الفريق بمراعاة الاختلافات الثقافية.",
        "correct": false
      },
      {
        "text": "التحقيق في السبب الجذري لسوء الفهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء توقيع الموافقة على مشروع استراتيجي أدى إلى تكاليف إضافية، لم يتمكن مدير المشروع من تبرير النفقات الإضافية فيما يتعلق بقيمة الأعمال التي تحققت مع التنفيذ الناجح. ما الذي كان ينبغي أن يفعله مدير المشروع لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم تقييم للفوائد المحتملة التي تم تحديدها في دراسة الجدوى الأولية باعتبارها كافية لتبرير تكاليف النفقات الإضافية.",
        "correct": true
      },
      {
        "text": "قياس وتتبع فوائد المشروع المحددة في دراسة الجدوى طوال دورة حياة المشروع.",
        "correct": false
      },
      {
        "text": "إجراء عملية إعادة تقييم للوضع الحالي للمنظمة بعد تنفيذ المشروع لإظهار الفوائد المحققة",
        "correct": false
      },
      {
        "text": "الفوائد غير المالية أو غير الملموسة المشتركة مثل رضا العملاء والسمعة الطيبة كمؤشرات لإظهار القيمة المحققة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في نهاية المرحلة الأولى من مشروع توسعة الاستاد، يدرك مدير المشروع أنه سيتأخر عن الجدول الزمني للمرحلة التالية من المشروع. ويرجع التأخير إلى متطلبات السلامة الجديدة التي يجب الالتزام بها. يشعر أصحاب المصلحة بالإحباط لأنهم لم يكونوا على علم بالتغييرات المحتملة في متطلبات السلامة.\nما الذي كان يجب عليك فعله لتجنب هذا الموقف وضمان أن يكون أصحاب المصلحة على دراية بالاضطرابات المحتملة؟",
    "explanation": "",
    "choices": [
      {
        "text": "زيادة احتياطي طوارئ المشروع لاستيعاب المشاكل غير المتوقعة المتعلقة بالسلامة.",
        "correct": true
      },
      {
        "text": "عقد اجتماعات تواصل منتظمة مع مشرف الموقع للبقاء على اطلاع دائم بمتطلبات السلامة.",
        "correct": false
      },
      {
        "text": "تنفيذ عملية استباقية لتقييم المخاطر أثناء بدء المشروع لتحديد التأخيرات المحتملة المتعلقة بالسلامة.",
        "correct": false
      },
      {
        "text": "اطلب موارد وموظفين إضافيين لمعالجة مخاوف السلامة عند ظهورها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تنتقل الشركة \"أ\" من نهج تنبؤي إلى نهج رشيق. بعد الإصدار التدريجي الثاني للمشروع X، يعرب مالك المنتج عن خيبة أمله من نتائج النموذج الأولي ويريد تصعيد المشروع إلى الإدارة العليا ويطلب فريقاً جديداً. وبسبب ذلك، يبدأ أعضاء الفريق بإلقاء اللوم على بعضهم البعض وعلى النهج الرشيق الجديد بسبب تصور مالك المنتج للمشروع.\nكيف يجب على مدير المشروع حل خلافات الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتبع عملية حل النزاعات الموثقة في ميثاق المشروع.",
        "correct": true
      },
      {
        "text": "استخدم الجلسات الاسترجاعية للسماح للفريق بتحديد سبب النزاع.",
        "correct": false
      },
      {
        "text": "إعادة النظر في رؤية المشروع مع الفريق للتأكد من فهم هدف المشروع",
        "correct": false
      },
      {
        "text": "مراجعة تعريف الإنجاز (DoD) مع مالك المنتج وتحديد سبب الفجوة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع في مرحلة رئيسية من التنفيذ ويكرس الجميع جهودهم لتحقيق النجاح. يقوم المدير الوظيفي فجأة بسحب أحد أعضاء الفريق الرئيسيين للاستجابة لحالة طارئة دون التواصل مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من تقويم الموارد للعثور على عضو آخر في الفريق.",
        "correct": true
      },
      {
        "text": "إبلاغ راعي المشروع والإدارة التنفيذية بالحالة.",
        "correct": false
      },
      {
        "text": "التواصل مع المدير الوظيفي وطلب عودة العضو الرئيسي.",
        "correct": false
      },
      {
        "text": "راجع التأثير على المشروع وحدد موعدًا للاجتماع مع المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء حضور اجتماع الحوكمة مع الإدارة العليا، يتم إبلاغ مدير المشروع شفهيًا عن تدقيق خارجي وشيك لمشاريع مختارة. وسيمكّن التدقيق المنظمة من الحفاظ على شهادة الجودة الخاصة بها.\nما الذي يجب أن يفعله مدير المشروع أولاً للتحضير للتدقيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث جميع وثائق المشروع ذات الصلة بالوضع الحالي للمشروع.",
        "correct": true
      },
      {
        "text": "قم بتعليق المشروع لضمان الامتثال الكامل لعملية التدقيق.",
        "correct": false
      },
      {
        "text": "تواصل مع المدققين لفهم نطاق التدقيق ومتطلباته.",
        "correct": false
      },
      {
        "text": "اجتمع مع الفريق وأبلغهم بنطاق التدقيق ومتطلباته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى امتثال التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى توافق التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيلاحظ مدير المشروع الذي يدير فريقاً كبيراً أن أعضاء الفريق لا يتفاعلون معاً، مما يؤثر على أداء المشروع وجودة نتائج المشروع. ما الذي يجب أن يفعله مدير المشروع للمساعدة في تنمية ديناميكيات الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماعات جماعية وجهاً لوجه لفهم ماهية المشكلات.",
        "correct": true
      },
      {
        "text": "قم بإخطار المشرفين على أعضاء فريق المشروع بعدم تعاونهم.",
        "correct": false
      },
      {
        "text": "إضافة نقص التواصل الجماعي كمخاطرة في سجل المخاطر ومراقبة الوضع.",
        "correct": false
      },
      {
        "text": "ارجع إلى الدروس المستفادة لفهم كيفية تعامل المشاريع الأخرى مع المشكلات المماثلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء التحقق من صحة التسليمات، يدرك مدير المشروع أن أحد أعضاء فريق المشروع استخدم نسخة قديمة من وثيقة تعريف النطاق، مما تسبب في حدوث أخطاء كبيرة. ما الذي يجب أن يفعله مدير المشروع لإدارة هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش آخر المنجزات خلال الاجتماع القادم.",
        "correct": true
      },
      {
        "text": "تحديث سجل مستندات المشروع.",
        "correct": false
      },
      {
        "text": "إجراء عملية التحكم في التغيير.",
        "correct": false
      },
      {
        "text": "مشاركة وثيقة تعريف النطاق المحدثة مع الفريق .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع لمشروع تطوير تطبيقات الهاتف المحمول. ويدرك مدير المشروع أن النهج الرشيق هو الأنسب للمشروع، ولكن معظم الفريق ليس لديه خبرة في النهج الرشيق.\nماذا يجب أن يفعل مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام نهج رشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب إعادة تعيين المشروع إلى فريق مشروع يتمتع بخبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "اطلب استبدال أعضاء الفريق الذين لم يسبق لهم استخدام الأساليب الرشيقة.",
        "correct": false
      },
      {
        "text": "ترتيب التدريب على مبادئ وعقلية العمل الرشيق لفريق المشروع الحالي.",
        "correct": false
      },
      {
        "text": "استخدم نهجًا تنبؤيًا لأن فريق المشروع على دراية بهذا النهج بالفعل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في اجتماع مشروع رشيق، يقدم أحد أعضاء الفريق تحديثًا لحالة مهمته المهمة. يقاطعه عضو جديد في الفريق عندما يسمع ذكر مهمته ويعطي تحديثًا للحالة قبل أن ينتهي عضو الفريق الأول من تحديثه.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحدث على انفراد مع عضوي الفريق بعد الاجتماع.",
        "correct": true
      },
      {
        "text": "أخبر عضو الفريق الجديد أنه يتصرف بشكل غير احترافي.",
        "correct": false
      },
      {
        "text": "وقفة لمناقشة بروتوكول الاجتماع المناسب مع الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من عضو الفريق الجديد الانتظار حتى ينتهي زميله في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يعمل في منظمة مصفوفة يدير مشروعًا من المقرر أن ينتهي خلال شهر واحد. في اجتماع المشروع اليوم، تم إبلاغ مدير المشروع أن الأخطاء التي تصادف في رمز البرنامج تتزايد باطراد. أثناء المناقشات مع قائد فريق التطوير، تم إخبار مدير المشروع أن هذا أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوت الموعد النهائي، لكن مدير المشروع يشعر بالقلق\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في الجدول الزمني للمشروع لإتاحة المزيد من الوقت للتطوير.",
        "correct": true
      },
      {
        "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أنه تم تخفيف المخاطر",
        "correct": false
      },
      {
        "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يتوافق مع متطلبات الجودة الموثقة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير من خلال عملية التحكم في التغيير لتمديد الموعد النهائي، مما يتيح المزيد من الوقت للتطوير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون أحد المشاريع متأخراً عن الجدول الزمني المحدد له عندما يتم تعيين عضو جديد في الفريق معروف بأدائه العالي في الفريق. وأثناء تقييم العضو الجديد في الفريق، يدرك مدير المشروع أن هذا الشخص يفتقر إلى التدريب اللازم للمشروع المحدد، لكنه يمتلك المهارات والخبرة ذات الصلة للانضمام إلى الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من تلقي عضو الفريق التدريب قبل الانضمام إلى الفريق.",
        "correct": true
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة الهامة تحت المراقبة الدقيقة أثناء تلقيه التدريب.",
        "correct": false
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة غير الحرجة دون مراقبة دقيقة أثناء توفير التدريب",
        "correct": false
      },
      {
        "text": "رفض إضافة عضو الفريق الجديد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بتجميع فريق يضم مزيجاً من أعضاء الفريق الجدد وذوي الخبرة. يكتشف مدير المشروع أن هناك مشاكل في تماسك الفريق. يعتقد أعضاء الفريق من ذوي الخبرة أن أعضاء الفريق الجدد يفتقرون إلى المهارات التقنية المطلوبة لأداء العمل اللازم ويتوقعون أن عليهم التعويض عن قلة خبرتهم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم مكافآت أو حوافز أخرى لأعضاء الفريق ذوي الخبرة لتوجيه أعضاء الفريق الجدد.",
        "correct": true
      },
      {
        "text": "تحليل مهارات جميع أعضاء الفريق وتحديد الثغرات ووضع خطط لمعالجتها.",
        "correct": false
      },
      {
        "text": "إعادة تعيين أعضاء الفريق الجدد في مشاريع تتوافق بشكل أفضل مع مهاراتهم وخبراتهم.",
        "correct": false
      },
      {
        "text": "اشرح أنه من المتوقع أن يقوم أعضاء فريق المشروع المحترفون بحل المشكلات دون تدخل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق المشروع الذي يعمل على مشروع ذي أولوية عالية يحركه التغيير قد فاتته مراراً وتكراراً المواعيد النهائية للإصدار. ويحدد مدير المشروع أن هذا يرجع إلى أن أحد أعضاء الفريق من ذوي الخبرة مكلف بمشاريع متعددة ولديه نطاق عمل محدود.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ الجهة الراعية للمشروع بالمشكلة.",
        "correct": true
      },
      {
        "text": "ضبط الجدول الزمني وإصدار طلب تغيير.",
        "correct": false
      },
      {
        "text": "ناقش هذه المشكلة مع فريق المشروع على الفور.",
        "correct": false
      },
      {
        "text": "تقييم عبء عمل عضو الفريق المتمرس.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين عن طريق المكالمات الهاتفية فقط، كما هو مبين في خطة إدارة الاتصالات. بعد مرور ثلاثة أسابيع على تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال المخصصة الزائدة عن الحاجة من صاحب المصلحة هذا.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "استمر في التواصل عبر المكالمات الهاتفية لأنها كانت فعالة حتى الآن.",
        "correct": true
      },
      {
        "text": "اجتمع مع أصحاب المصلحة لمناقشة احتياجاتهم وتوقعاتهم في مجال التواصل.",
        "correct": false
      },
      {
        "text": "إرسال بريد إلكتروني إلى صاحب المصلحة لطلب تغيير نهج التواصل.",
        "correct": false
      },
      {
        "text": "تعيين أحد أعضاء الفريق للعمل كحلقة وصل بين مدير المشروع وأصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المراحل الأولى من تشكيل الفريق، يكون مدير المشروع غير قادر على التركيز على المهام الرئيسية لأن أعضاء الفريق يطلبون المساعدة باستمرار لحل النزاعات المتعلقة بتفسير متطلبات العميل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تمكين الفريق من حل النزاعات فيما بينهم.",
        "correct": true
      },
      {
        "text": "اقضِ بعض الوقت في حل هذه النزاعات مع الفريق.",
        "correct": false
      },
      {
        "text": "استخدم لجنة حل النزاعات للمساعدة في حل هذه النزاعات.",
        "correct": false
      },
      {
        "text": "تصعيد النزاعات إلى مدير البرنامج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع لتكنولوجيا المعلومات (IT) بفريق جديد لمشروع تطوير برمجيات في بيئة رشيقة. يقدّر مدير المشروع أن المشروع سيستغرق عددًا معينًا من الأيام استنادًا إلى الخبرة السابقة في مؤسسة أخرى.\nكيف ينبغي لمدير المشروع التحقق من صحة هذا الافتراض وتخطيط وإدارة الجدول الزمني للمشروع بشكل صحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء مسح في المؤسسة وإنشاء بيانات للتحقق من صحة المطالبات.",
        "correct": true
      },
      {
        "text": "التقدير استناداً إلى اجتماعات مراجعة السباق السريع ومدخلات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دراسة اجتماعات التخطيط السابقة لسباق السرعة وثقافة المشروع في المؤسسة.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام فريق المشروع بتسليم مخرجات المشروع، ولكن مدير المشروع يرغب في تقييم ما إذا كان المشروع قد حقق القيمة المرجوة منه للجهة الراعية.\nما هو العامل الأكثر ملاءمة لمدير المشروع لتقييمه؟",
    "explanation": "",
    "choices": [
      {
        "text": "مواءمة ما تم إنجازه مع توقعات الجهة الراعية.",
        "correct": true
      },
      {
        "text": "ما إذا كانت مخرجات المشروع قد زادت من الدخل المحتمل للجهة الراعية.",
        "correct": false
      },
      {
        "text": "ما إذا كانت فروق أداء التسليم ضمن الحدود التي حددتها الجهة الراعية.",
        "correct": false
      },
      {
        "text": "التزام المشروع بشكل عام بقيود النطاق والوقت والميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعاني أعضاء الفريق الرشيق من صعوبات. في حين أن هناك ثقة بين أعضاء الفريق، فإن غالبية قرارات الفريق يتخذها عدد قليل من أعضاء الفريق الأكثر خبرة.\nما الذي يجب أن يفعله مدير المشروع من أجل تمكين فريق عمل عالي الأداء؟",
    "explanation": "",
    "choices": [
      {
        "text": "ثني أعضاء الفريق ذوي الخبرة عن التحدث أولاً، والسماح للآخرين بتقديم أفكارهم.",
        "correct": true
      },
      {
        "text": "تيسير الاجتماعات لضمان مشاركة جميع أعضاء الفريق في قرارات الفريق.",
        "correct": false
      },
      {
        "text": "تدريب الفريق لضمان تقديم جميع الأعضاء للأفكار وتحقيق توافق في الآراء بين أعضاء الفريق",
        "correct": false
      },
      {
        "text": "قم بإثارة المشكلة في جلسة استرجاعية واطلب من الفريق إضفاء الطابع الرسمي على اتفاقيات الفريق الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في أحد مشاريع تطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعرون أنه سيكون ذا فائدة كبيرة للمشروع. ومع ذلك، فإن هذا المطلب لا يتماشى مع أهداف المشروع التي وثقها صاحب العمل\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من فهم أصحاب المصلحة للغرض من المشروع.",
        "correct": true
      },
      {
        "text": "تشجيع أصحاب المصلحة على اتباع متطلبات العمل المكتوبة.",
        "correct": false
      },
      {
        "text": "تضمين المتطلبات الإضافية في المشروع وإبلاغ صاحب العمل.",
        "correct": false
      },
      {
        "text": "المسار السريع للمشروع واقتراح المتطلبات الجديدة على صاحب العمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع رشيق في البلد \"أ\" مع فريق التطوير ومحلل الأعمال في البلد \"ب\"، وفريق ضمان الجودة في البلد \"ب\" خلال السباق الثاني، يتضح أن جميع حالات الاختبار قد فشلت يتأكد الميسر الرشيق من أن محلل الأعمال قد غير معايير قبول القصص وأبلغ هذه التغييرات إلى فريقه المحلي فقط.\nما الذي يجب أن ينفذه مدير المشروع الرشيق من الآن فصاعداً لمنع تكرار ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "حماية كلمة المرور على قصص المستخدمين",
        "correct": true
      },
      {
        "text": "وثائق مراقبة التغيير الموقعة",
        "correct": false
      },
      {
        "text": "إشعارات التغيير التلقائية من أداة قصة المستخدم",
        "correct": false
      },
      {
        "text": "تهيئة التراكمات المتراكمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشارك خبير متخصص ذو مهارة عالية في مشروع حكومي حيث سيتبع ما يقرب من 30 من النواتج نهجًا رشيقًا. ويدعو مدير المشروع الخبير الصغير والمتوسط الحجم للانضمام إلى فريق العمل الرشيق للمساهمة في هذه التكرارات. لكن الشركة الصغيرة والمتوسطة مترددة لأنها تعتقد أن العمل ضمن فريق عمل محبط ومثبط للمعنويات ويبطئ من سرعتها، كما أنها تريد تحقيق أعلى جودة ممكنة للمخرجات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة مخاوف الشركات الصغيرة والمتوسطة وتشجيعها على الانضمام إلى فريق العمل الرشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "التوصية بتطوير الذكاء العاطفي لدى الشركات الصغيرة والمتوسطة من خلال الاندماج مع الفريق.",
        "correct": true
      },
      {
        "text": "اشرح أن العمل الجماعي يعزز التحسين المستمر وحلقات التغذية الراجعة المبكرة.",
        "correct": false
      },
      {
        "text": "اطلب أن يقوم الخبير الصغير والمتوسط بإجراء الاجتماعات الاستعراضية كمراقب موضوعي.",
        "correct": false
      },
      {
        "text": "اطلب من الجهة الراعية الاجتماع مع الشركات الصغيرة والمتوسطة والمساعدة في تحسين موقفها تجاه العمل الجماعي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد مدير المشروع أن إحدى المهام على المسار الحرج متأخرة عن الجدول الزمني. يعتقد مدير المشروع أن الموارد الإضافية ستساعد، لكن الإدارة العليا رفضت طلب التمويل الإضافي اللازم لإضافة موارد إضافية. يجب على مدير المشروع العمل بالموارد والميزانية المعتمدة.\nما هي الممارسة الأنسب لمدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تسوية الموارد",
        "correct": true
      },
      {
        "text": "التحطم",
        "correct": false
      },
      {
        "text": "التتبع السريع",
        "correct": false
      },
      {
        "text": "تحليل سيناريو ماذا لو",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تجميع فريق عالمي متعدد الوظائف لتنفيذ مبادرة متعددة الجنسيات. ما الذي ينبغي لمدير المشروع أن يفعله لضمان المشاركة الكاملة للفريق في جميع مراحل المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنسيق معلومات المنطقة الزمنية والاتفاق على أوقات الاجتماعات.",
        "correct": true
      },
      {
        "text": "ضمان تقديم البرامج بلغات متعددة.",
        "correct": false
      },
      {
        "text": "ترجمة وثائق المشروع.",
        "correct": false
      },
      {
        "text": "تقديم إرشادات حول الأدوات والممارسات الشائعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تعيين مدير مشروع للتو فريق مشروع جديد ويحتاج إلى تعيين المهام لمشروع قادم بسرعة وفعالية. ولضمان إسناد المهام إلى الموارد المناسبة، ما هو النهج الذي ينبغي اتباعه؟",
    "explanation": "",
    "choices": [
      {
        "text": "وزع المهام بالتساوي لأن الفريق يجب أن يتمتع جميع أفراده بمهارات متساوية.",
        "correct": true
      },
      {
        "text": "خصص المهام الأكثر تعقيدًا للأعضاء الأقدم في فريق المشروع.",
        "correct": false
      },
      {
        "text": "قم بتقييم خلفية الفريق وخبرته وقدراته، ثم قم بتعيين المهام.",
        "correct": false
      },
      {
        "text": "تعيين أعضاء الفريق ذوي الخبرة لمساعدة أعضاء الفريق الذين يفتقرون إلى الخبرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اجتماع الانطلاق، يقوم الراعي بإبلاغ فريق المشروع بأنه لا يمكنه حضور أي اجتماعات للنصف الأول من المشروع. ويرغب الراعي في تعيين بديل له.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب أن يتمتع البديل بنفوذ كبير وسلطة اتخاذ القرار.",
        "correct": true
      },
      {
        "text": "قم بإعداد اجتماع مع الراعي البديل في أقرب وقت ممكن لمناقشة جدول الأعمال القادم",
        "correct": false
      },
      {
        "text": "طلب الاهتمام الكامل من الجهة الراعية وتصعيد هذه المشكلة إلى مكتب إدارة المشروع (PMO).",
        "correct": false
      },
      {
        "text": "تحليل أثر التغيير والعمل مع الجهة الراعية لتحديد البديل المناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع جديد. يوجد خلاف بين اثنين من موارد المشروع الرئيسية بشأن أحد المتطلبات. ويرغب مدير المشروع في فهم وجهتي النظر، لكن أحد الموردين لا يرغب في مقابلة مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "قبول منصب كبير موارد المشروع الأقدم.",
        "correct": false
      },
      {
        "text": "مراجعة أصول العمليات التنظيمية (OPAs).",
        "correct": false
      },
      {
        "text": "ارجع إلى القواعد الأساسية للفريق ورؤية المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشرف مدير مشروع على مشروع يهدف إلى تزويد العملاء بقدرات تتبع الشحنات في الوقت الفعلي. واجه فريق المشروع خلافات مستمرة تدور في المقام الأول حول التفسيرات المختلفة لكيفية مساهمة قصص المستخدمين في نجاح المشروع. يعتقد بعض أعضاء الفريق أن قصص المستخدمين يجب أن تعطي الأولوية للسرعة، في حين يؤكد آخرون على الدقة كأولوية قصوى.\nما الذي يجب أن يفعله مدير المشروع لمعالجة خلافات أعضاء الفريق حول قصص المستخدمين؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير المنتج الاجتماع مع الفريق وتوضيح متطلبات قصص المستخدمين.",
        "correct": true
      },
      {
        "text": "حدد موعدًا لعقد اجتماع مع راعي الأعمال للحصول على توضيح بشأن قصص المستخدمين.",
        "correct": false
      },
      {
        "text": "قم بمراجعة ميثاق المشروع باستمرار مع أعضاء الفريق لضمان المواءمة.",
        "correct": false
      },
      {
        "text": "تحقق من توافق قصص المستخدم مع أهداف العمل وأهداف المشروع بشكل عام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقدم مشروع بناء لمدة 8 أشهر تقريبًا، ويبلغ مؤشر أداء الجدول الزمني 0.68. ويعتزم مدير المشروع تنفيذ المشروع كما هو مخطط له دون تكلفة إضافية.\nما الذي يجب أن يفعله مدير المشروع للمشروع في الوقت المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "اصطدم بالجدول الزمني",
        "correct": true
      },
      {
        "text": "تسريع الجدول الزمني.",
        "correct": false
      },
      {
        "text": "تقليل نطاق المشروع.",
        "correct": false
      },
      {
        "text": "تقليل جودة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قامت إحدى المؤسسات مؤخرًا بتحديث خطتها الاستراتيجية وكانت بعض التغييرات جوهرية. خلال اجتماع لمشروع جاري، تساءل أحد أصحاب المصلحة المهمين عن كيفية توافق المشروع مع الخطة الاستراتيجية الجديدة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة بفعالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة ميثاق المشروع ومراجعته لضمان التوافق مع الاستراتيجية المؤسسية.",
        "correct": true
      },
      {
        "text": "حدد موعداً لعقد اجتماع متابعة مع أصحاب المصلحة لمناقشة مخاوفهم.",
        "correct": false
      },
      {
        "text": "تذكير أصحاب المصلحة بأن المشروع قد بدأ قبل تغيير الاستراتيجية.",
        "correct": false
      },
      {
        "text": "طمأنة أصحاب المصلحة بأن المشروع يتماشى مع الاستراتيجية التنظيمية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إطلاق مشروع استراتيجي وتم تعيين مدير للمشروع المشروع المشروع يتقدم المشروع ويسير الفريق بنجاح، ولكن أحد أصحاب المصلحة الرئيسيين يتصل بمدير المشروع ويشتكي من عدم تلقي تحديثات عن التقدم المحرز.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من إرسال نسخة إلى صاحب المصلحة على رسائل البريد الإلكتروني الأسبوعية الخاصة بالحالة.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة اتصالات المشروع وتحديثها.",
        "correct": false
      },
      {
        "text": "أرسل إلى صاحب المصلحة نسخة من أحدث تقرير عن حالة المشروع.",
        "correct": false
      },
      {
        "text": "قم بدعوة صاحب المصلحة الرئيسي لحضور الاجتماع التالي للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تدعو خطة إدارة الجودة (QMP) إلى إجراء اختبار الانحدار قبل كل إصدار للمنتج، ولكن لم يتم تضمين هذه الاختبارات في هيكل تقسيم العمل (WBS).\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير لإضافة حزم عمل اختبار الانحدار إلى نطاق المشروع.",
        "correct": true
      },
      {
        "text": "اطلب موارد اختبار إضافية من المدير الوظيفي لضمان الجودة.",
        "correct": false
      },
      {
        "text": "اقترح على عميل المشروع إزالة اختبار الانحدار من متطلبات الجودة.",
        "correct": false
      },
      {
        "text": "اطلب موافقة راعي المشروع على إزالة اختبار الانحدار من خطة إدارة الجودة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع جديد يتولى إدارة مشروع إنشاءات. وعند مراجعة خطة إدارة المشروع، يدرك مدير المشروع أن متطلبات الصحة والسلامة لم يتم تناولها بشكل كافٍ لدى مدير المشروع مخاوف جدية ويريد معالجة هذا القصور.\nما هو الشاغل الأساسي في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قد يؤدي الفشل في معالجة قضايا الصحة والسلامة إلى الإضرار بثقة العميل وسمعته.",
        "correct": true
      },
      {
        "text": "يجب أن يتوافق المشروع مع جميع المتطلبات والمسؤوليات القانونية والتنظيمية.",
        "correct": false
      },
      {
        "text": "قد يتعرض الجدول الزمني للمشروع للخطر من خلال تنفيذ تدابير السلامة الإضافية.",
        "correct": false
      },
      {
        "text": "يعلم مدير المشروع أنه من الضروري تلبية مقاييس الأداء المحددة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اقترح أحد أصحاب المصلحة استخدام منتج جاهز ومفتوح المصدر لتسريع عملية التطوير. وقد قام الفريق بتحليل المنتج ووجده قابلاً للتطبيق ومرغوباً فيه، ولكنه يحتاج إلى التجريب ويتطلب مهارات إضافية من المستخدمين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الشروع في طلب تغيير رسمي.",
        "correct": true
      },
      {
        "text": "طلب التدريب لفريق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة التكاليف.",
        "correct": false
      },
      {
        "text": "استشر مدير المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تبدأ شركة تعمل في القطاع المالي مشروعًا هجينًا جديدًا للامتثال للوائح الحكومية الجديدة. وقد حدد الفريق سرعة موثوقة تبلغ 65 نقطة قصة لكل تكرار. ويستغرق كل تكرار أسبوعين. يريد الراعي أن يعرف متى سينتهي المشروع إذا كان هناك 040 نقطة قصة متبقية.\nكم عدد الأشهر التي سيستغرقها المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "2 شهران",
        "correct": true
      },
      {
        "text": "4 أشهر",
        "correct": false
      },
      {
        "text": "8 أشهر",
        "correct": false
      },
      {
        "text": "6 أشهر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق رشيق بالتخطيط لتكرار لمدة أسبوعين. في منتصف التكرارات القليلة الماضية، أجرى مالك المنتج تغييرات وأعاد ترتيب أولويات الميزات، مما أثر على مخرجات الفريق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد المشكلة إلى الإدارة العليا واطلب من مالك المنتج اتخاذ إجراء بشأنها.",
        "correct": true
      },
      {
        "text": "أبلغ الفريق بتجاهل التغييرات التي طلبها مالك المنتج أثناء التكرار.",
        "correct": false
      },
      {
        "text": "اشرح الآثار المترتبة على إجراء التغييرات أثناء التكرار لمالك المنتج.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إجراء تغييرات حسب الحاجة لأن النهج الرشيق يستجيب للتغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم قبول منتج جديد من قبل العميل، ولكن بعد أسبوعين تلقى مدير المشروع شكوى من العميل تفيد بأن متطلبات وظائف المنتج لم تتحقق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "مراجعة عملية التحقق من صحة النطاق.",
        "correct": false
      },
      {
        "text": "حدد موعداً لفحص المنتج.",
        "correct": false
      },
      {
        "text": "التحقق من صحة النطاق مع العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في صناعة خاضعة للتنظيم، ويعمل الفريق على مشروع حيث يتم تحديد أولويات المتطلبات في الأعمال المتراكمة. تم تحديد الحد الأدنى من المنتج القابل للتطبيق (MVP) للإطلاق علم مدير المشروع أن الهيئة التنظيمية للمشروع تتطلب نموذجًا أوليًا للفحص قبل إطلاق هذا المنتج النموذج الأولي ليس جزءًا من تعريف MVP.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحدث مع مالك المنتج لتحديد أولويات أنشطة الامتثال في الأنشطة المتراكمة لتقديم نموذج أولي إلى الهيئة التنظيمية.",
        "correct": true
      },
      {
        "text": "حدد المتطلبات الناقصة، وحدد أولويات العمل التنظيمي الناقص مباشرةً في الأعمال التنظيمية المتراكمة وأسند العمل إلى الفريق.",
        "correct": false
      },
      {
        "text": "إعادة جدولة إطلاق المنتج حتى يتمكن الفريق من إنتاج نموذج أولي للفحص، كما هو مطلوب من قبل الهيئة التنظيمية.",
        "correct": false
      },
      {
        "text": "أنشئ تعريفًا جديدًا لـ MVP يحتوي على متطلبات النطاق للنموذج الأولي المطلوب وحدد أولويات هذا النطاق مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نظراً لنقص الموارد الماهرة محلياً، تقوم الشركة بتوظيف فريق مشروع منتشر دولياً يعمل افتراضياً. لم يسبق لمدير المشروع أن عمل مع فريق افتراضي وهو قلق بشأن المشاركة.\nما الذي يجب أن يفعله مدير المشروع لضمان استمرار مشاركة هذا الفريق الافتراضي؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من حضور الفريق الافتراضي بأكمله اجتماع انطلاق المشروع.",
        "correct": true
      },
      {
        "text": "اعتماد خطة إدارة الاتصالات لفريق افتراضي سابق.",
        "correct": false
      },
      {
        "text": "الاعتماد على الاتصال غير المتزامن لجميع تقارير الحالة الرئيسية.",
        "correct": false
      },
      {
        "text": "قم بإجراء عمليات التحقق والاجتماعات المتكررة على فترات مجدولة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء الاستعداد، يقوم أحد أعضاء الفريق بالإبلاغ بشكل خاطئ عن اكتمال قصة ما والتي تعتبر تبعية لقصص أخرى. عندما يبدأ الفريق في العمل على القصص ذات الصلة، لا يتمكنون من مواصلة التطوير لأن القصة الأولية لم تكتمل\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع التخطيط لسباق السرعة مع الفريق بأكمله لفهم الترابط بين القصص.",
        "correct": true
      },
      {
        "text": "تحدث إلى عضو الفريق الذي أبلغ خطأً عن اكتمال القصة.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج مراجعة معايير القبول قبل دفعها إلى قائمة الأعمال المتراكمة في سباق السرعة.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق أن يشرح تفسيرهم لتعريف الإنجاز (DoD) في نهاية السباق السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد تسعة أشهر، يختتم المشروع مرحلته الأولى بإصدار منتج جديد للعميل. العميل غير راضٍ ويذكر أن العديد من الميزات الرئيسية مفقودة.\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم الميزات الناقصة مع العميل ووضع خطة لإدراجها في مرحلة المشروع التالية التي تستغرق تسعة أشهر.",
        "correct": true
      },
      {
        "text": "قم بمراجعة خطة المشروع لتحديد ما إذا كانت الميزات المفقودة جزءًا من النطاق الأصلي أو إذا تمت إضافتها لاحقًا.",
        "correct": false
      },
      {
        "text": "اطلب تمويلاً إضافياً من أجل تقليل الجدول الزمني لدورة الإصدار الحالية حتى يتمكن الفريق من تقديم القيمة في وقت أقرب.",
        "correct": false
      },
      {
        "text": "أعد تشغيل المشروع من خلال تنفيذ دورة حياة رشيقة ودمج إنشاء الحد الأدنى من المنتج القابل للتطبيق (MVP).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع في مرحلة التنفيذ. يكتشف مدير المشروع الجديد أن أعضاء الفريق ليس لديهم خبرة سابقة بالتكنولوجيا المستخدمة في المشروع. ومع ذلك، هناك العديد من المديرين الوظيفيين الذين لديهم خبرة بالتكنولوجيا.\nما الذي يجب أن يفعله مدير المشروع أولاً لضمان نجاح أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من المدراء الوظيفيين العمل كمرشدين أو مدربين للفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية استبدال أعضاء الفريق ذوي الخبرة.",
        "correct": false
      },
      {
        "text": "تحديد المخاطر المرتبطة بقلة خبرة أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تطوير تقارير الحالة لرصد مهارات الفريق وكفاءاته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تعيين مدير مشروع لمشروع طويل الأجل مدته ثلاث سنوات. ما هو النهج الذي ينبغي أن يتبعه مدير المشروع لمعالجة الأنشطة القريبة الأجل، بينما يتم تخطيط العمل الطويل الأجل على مستوى عالٍ ثم يتم تفصيله لاحقاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "ركز على اكتساب فريق عمل وتقديمه في أقرب وقت ممكن.",
        "correct": true
      },
      {
        "text": "إشراك الجهة الراعية في عمليات التحقق من الصحة وتحديد الأولويات.",
        "correct": false
      },
      {
        "text": "تنفيذ ورش عمل مع العميل لمواعيد التسليم.",
        "correct": false
      },
      {
        "text": "التحقق من صحة المتطلبات وتنفيذ تخطيط الموجة المتجددة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن أعضاء الفريق لا يتفاعلون مع بعضهم البعض ويعتقد أن عدم التفاعل يؤثر سلبًا على أداء المشروع. يحاول مدير المشروع زيادة تفاعل الفريق من خلال استضافة فعالية بعد انتهاء العمل، ولكن لم يحضر سوى عدد قليل من أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل استبيانًا للفريق لجمع أفكار لأنشطة ما بعد العمل من أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "استمر في دعوة أعضاء الفريق إلى الفعاليات وتحسين الروح المعنوية بشكل تدريجي.",
        "correct": false
      },
      {
        "text": "تقديم حوافز ومكافآت دورية لأعضاء الفريق الأعلى أداءً.",
        "correct": false
      },
      {
        "text": "استطلع آراء الفريق بشكل سري لتحديد السبب الجذري لعدم التفاعل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام راعي مشروع بملايين الدولارات باستدعاء مدير المشروع لعقد اجتماع أزمة. قدم العميل طلبًا رسميًا لضغط الجدول الزمني بشكل كبير من أجل الوفاء بالموعد النهائي القانوني.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "بدء إجراءات التعجيل بتنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "تنفيذ التغييرات المطلوبة على الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "أدوات التحليل لتعطيل أنشطة المشروع.",
        "correct": false
      },
      {
        "text": "إعداد تقرير تقييم أثر التغيير للمراجعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تكليف مدير مشروع بمعالجة مخاوف مالك المنتج بشأن تسليم الحد الأدنى من المنتج القابل للتطبيق (MVP) في السباق الرابع. أي من المقاييس التالية يجب أن يستخدمها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مؤشر الأداء المجدول (SPI)",
        "correct": true
      },
      {
        "text": "مؤشر تكلفة الجدول الزمني (SCI)",
        "correct": false
      },
      {
        "text": "معدل الاحتراق",
        "correct": false
      },
      {
        "text": "التحليل النوعي للمخاطر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في شركة تعمل في مشاريع تسليم المفتاح المعقدة. وأثناء تقييم الفريق، يجد مدير المشروع أن الأداء العام يتأثر سلباً لأن الفريق يواجه مشكلة في التكيف مع التغييرات المتكررة في متطلبات المشروع وحالته.\nما الذي يجب أن يفعله مدير المشروع لضمان أن يكون الفريق مجهزاً بشكل أفضل للتكيف مع التغيير؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الجهة الراعية التواصل مباشرةً مع فريق المشروع.",
        "correct": true
      },
      {
        "text": "التواصل مع أصحاب المصلحة بانتظام لتجنب التغييرات المتكررة.",
        "correct": false
      },
      {
        "text": "تقديم التوجيه الفردي لكل عضو من أعضاء الفريق على أساس ثابت.",
        "correct": false
      },
      {
        "text": "إنشاء قنوات وبروتوكولات اتصال واضحة ومتسقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف الطريق خلال مشروع مدته عام، يرسل أحد موردي الأجهزة إلى مدير المشروع إشعارًا بنية زيادة الأسعار بسبب تقلب أسعار الصرف. مدير المشروع غير متأكد من سلطته التفاوضية.\nما هي الوثيقة التي يجب على مدير المشروع الرجوع إليها؟",
    "explanation": "",
    "choices": [
      {
        "text": "سجل المخاطر",
        "correct": true
      },
      {
        "text": "خطة إدارة المشتريات",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": false
      },
      {
        "text": "استراتيجية التواصل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تراجع أداء فريق المشروع خلال التكرارات الثلاثة الأخيرة. يشعر بعض أعضاء الفريق بخيبة أمل، ويثيرون مخاوفهم خلال الاجتماع الاستعراضي.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد نقاط الفشل المحتملة استناداً إلى إجراءات العمل التكرارية",
        "correct": true
      },
      {
        "text": "تحفيز الفريق على تقديم أداء أفضل.",
        "correct": false
      },
      {
        "text": "التركيز على العلاج، وليس فقط على تصحيح الأعراض.",
        "correct": false
      },
      {
        "text": "مقارنة أداء الفريق بفرق المشاريع الأخرى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك مدير المشروع الذي يعمل في بيئة رشيقة أن بعض أعضاء الفريق الجدد يواجهون صعوبة في فهم كيفية تحقيق أعضاء الفريق الأقدم نتائج معينة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ترتيب اجتماع مراجعة مع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تأكد من تركيز أعضاء الفريق على مهامهم.",
        "correct": false
      },
      {
        "text": "تقييم الحاجة إلى نقل المعرفة.",
        "correct": false
      },
      {
        "text": "تشجيع وتيسير توجيه الأقران وتسهيله.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع داخلي لمكتب إدارة المشاريع في المنظمة (PMO). وكان المشروع في البداية تحت رعاية مدير مكتب إدارة المشاريع الذي تم استبداله منذ ذلك الحين ولا يرى المدير الجديد قيمة كبيرة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنظيم اجتماع انطلاق المشروع الثاني مع قائد مكتب إدارة المشاريع الجديد وفريق المشروع.",
        "correct": true
      },
      {
        "text": "استخدم البيانات السابقة للحصول على الرعاية من قائد مكتب إدارة المشاريع الجديد لأن المشروع كان فعالاً.",
        "correct": false
      },
      {
        "text": "استخدم الفوائد التي كان مدير المشروع يتتبعها طوال فترة المشروع لإثبات قيمة المشروع.",
        "correct": false
      },
      {
        "text": "استمر في المشروع كما هو مخطط له لأنه تمت الموافقة عليه بالفعل وهو قيد التنفيذ.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتم تحديد تشييد المبنى بشكل جيد من خلال المخططات والمواصفات المكتوبة. سيتم تسليم الخدمة في غضون عامين في بيئة عالية التضخم. ما نوع العقد الذي ينبغي أن يستخدمه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد التكلفة زائد الرسوم التحفيزية (CPIF)",
        "correct": true
      },
      {
        "text": "عقد السعر الثابت الثابت الثابت (FFP)",
        "correct": false
      },
      {
        "text": "عقد السعر الثابت مع تعديل السعر الاقتصادي (FPEPA)",
        "correct": false
      },
      {
        "text": "عقد الوقت والمواد (T&M)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "وضع مدير المشروع خطة لإدارة المشروع استنادًا إلى منهجيات رشيقة في محاولة لتسليم المنتج بسرعة. ومع ذلك، فإن المشروع معقد والمتطلبات غير واضحة، مما يعرض الجدول الزمني للخطر.\nما الذي يجب أن يفعله مدير المشروع لإعادة المشروع إلى مساره الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة جدولة الجدول الزمني لقبول التوقعات الإضافية والتأخيرات المحتملة.",
        "correct": true
      },
      {
        "text": "قم بمراجعة الأعمال المتراكمة للمنتج مع مالك المنتج والفريق لحل الحالة.",
        "correct": false
      },
      {
        "text": "زيادة عدد الاجتماعات التحضيرية وتنفيذ تحديثات الحالة اليومية.",
        "correct": false
      },
      {
        "text": "تعديل الخطة لتوظيف المزيد من ميزات دورة الحياة التكرارية والتدريجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا لتنفيذ نظام برمجيات لتحسين العمليات تم تطويره داخليًا. غير أن نسبة اعتماده في المنظمة كانت أقل من 50 في المائة بسبب عدم التوافق مع العمليات الأساسية.\nأي من الإجراءات الثلاثة التالية كان ينبغي على مدير المشروع القيام بها لتحقيق فوائد المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم كامل للاحتياجات في مرحلة التصميم.",
        "correct": true
      },
      {
        "text": "إطلاق البرنامج التجريبي في إحدى وحدات الأعمال الأساسية وجمع الملاحظات.",
        "correct": false
      },
      {
        "text": "ضمان مشاركة أصحاب المصلحة على نطاق أوسع لكسب المزيد من التأييد.",
        "correct": false
      },
      {
        "text": "إصدار تعليمات لفريق التسويق بجمع الملاحظات من العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء أحد اجتماعات الاستعداد، اعترض بعض أعضاء الفريق بشدة على كيفية توزيع المهام، فقد شعروا بالتعب والإحباط لأن توزيع المهام كان شكوى متكررة طوال المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع خطة إدارة المشروع لتحديد كيفية إدارة هذا الوضع.",
        "correct": true
      },
      {
        "text": "ناقش مع مديري المشاريع الآخرين إذا كان عليهم معالجة شكاوى مماثلة.",
        "correct": false
      },
      {
        "text": "تنظيم ورشة عمل لبناء الفريق لتحسين التعاون والتواصل.",
        "correct": false
      },
      {
        "text": "العمل مع الفريق لوضع خطة لمعالجة مخاوف توزيع المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستخدم فريق سكروم نهجًا مختلطًا مع سباقات السرعة التي تستغرق أسبوعين. يكون إصدار الحد الأدنى من المنتج القابل للتطبيق (MVP) في نهاية السباق الحالي، ويكون الفريق قد انتهى من الميزات التي يجب أن تكون موجودة ويجب أن تكون لها ميزات؛ ومع ذلك، لا تزال بعض الميزات الأخرى ذات الأولوية قيد التطوير. يقوم مدير المشروع بإعداد التقرير الشهري للجنة التوجيهية.\nما الذي يجب أن يوصي به مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة جدولة مراجعة إصدار MVP حتى يتم الانتهاء من جميع الميزات المتفق عليها",
        "correct": true
      },
      {
        "text": "قم بتحديث خطة إدارة المشروع لتضمين الإصدار الميزات فقط",
        "correct": false
      },
      {
        "text": "مراجعة السباق وإصدار MVP مع ميزات d.",
        "correct": false
      },
      {
        "text": "تقدير الجهد المطلوب وتقديم طلب تغيير لإضافة المزيد من الموارد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تطوير المنتج، يشير قسمان وظيفيان إلى أن هناك نقصًا في الموارد ولا يمكنهما بناء وتسليم جميع المنتجات في الوقت المحدد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا القلق؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع المشكلة إلى الجهة الراعية وطلب تأكيد نطاق المشروع.",
        "correct": true
      },
      {
        "text": "اطلب من المدير الوظيفي توظيف موارد إضافية لتلبية المتطلبات.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق العمل لساعات إضافية لتلبية الاحتياجات التجارية.",
        "correct": false
      },
      {
        "text": "تحليل المسار الحرج لتقديم الحد الأدنى من المنتج القابل للتطبيق (MVP).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً. تستخدم المنظمة نهجًا رشيقًا وسجلًا للمخاطر، لكن فريق التطوير يفضل نهج Scrum وينظر إلى إدارة المخاطر على أنها عملية تنبؤية.\nما الذي يجب على مدير المشروع تحديد أولوياته؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة سجل المخاطر وامتلاكه شخصيًا لأن هذا من المتطلبات التنظيمية.",
        "correct": true
      },
      {
        "text": "تفويض مسؤولية تحديث سجل المخاطر إلى فريق التطوير lea",
        "correct": false
      },
      {
        "text": "اطلب من المطورين استخدام سجل المخاطر لأن هذا مطلب تنظيمي.",
        "correct": false
      },
      {
        "text": "فكر في اتباع نهج مختلط ودمج عناصر من سجل المخاطر وعمليات Scrum.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتلقى فريق رشيق العديد من الطلبات غير المخطط لها لتحسينات المنتج في عملية التكرار. ويتسبب هذا العائق في تفويت الفريق للمهام المجدولة.\nكيف ينبغي لمدير المشروع معالجة هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق زيادة جهوده لتلبية الطلبات.",
        "correct": true
      },
      {
        "text": "اطلب من مالك المنتج تضمين التحسينات المطلوبة في التكرار الحالي.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع إعادة ترتيب أولويات جميع الأنشطة الملتزم بها.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إضافة طلبات التحسين إلى طلبات التحسينات إلى قائمة المنتجات المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجري تنفيذ مشروع تجريبي باستخدام نهج رشيق للتطوير. ويقدم المشروع الزيادات المخطط لها في الوقت المحدد، لكن الإدارة العليا تشعر بالقلق لأنها لا ترى القيمة التي يضيفها المشروع.\nكيف يجب على مدير المشروع إيصال قيمة المشروع إلى الإدارة العليا؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين الإدارة العليا في جميع المراجعات المستقبلية للسباقات السريعة لمعالجة مخاوفهم في الوقت الفعلي.",
        "correct": true
      },
      {
        "text": "إرسال تقارير الحالة الأسبوعية للإدارة العليا ودعوتهم إلى جلسات استرجاع المعلومات.",
        "correct": false
      },
      {
        "text": "توضيح كيفية توافق أهداف المشروع مع الأهداف الاستراتيجية للمؤسسة.",
        "correct": false
      },
      {
        "text": "تخصيص التقارير المرحلية لتلبية متطلبات الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الأسبوع الثاني من سباق سريع مدته أسبوعان، تعرض أحد أعضاء الفريق الأساسيين لحالة طارئة ولم يتمكن من العمل على المشروع لبقية السباق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير المنتج زيادة الجدول الزمني للمشروع.",
        "correct": true
      },
      {
        "text": "تحديد المهام التي يمكن إعادة إسنادها إلى أعضاء الفريق الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتمديد فترة السباق السريع لتعويض خسارة عضو الفريق الأساسي.",
        "correct": false
      },
      {
        "text": "احصل على موارد إضافية من الفرق الأخرى في السباق السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع قيد التنفيذ حالياً. وقد تم إخطار مدير المشروع بعملية جديدة قد تكون مفيدة إذا تم دمجها في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم كيف يمكن دمج العملية الجديدة",
        "correct": true
      },
      {
        "text": "إصدار ترتيب أولوية للتغيير.",
        "correct": false
      },
      {
        "text": "تحديد الفائدة من التغيير.",
        "correct": false
      },
      {
        "text": "تعديل وثيقة المتطلبات الخاصة بالتغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل مدير المشروع مع أعضاء الفريق عن بُعد الذين يعملون بشكل مستقل. ما الذي ينبغي أن يفعله مدير المشروع لتعزيز التعاون بين أعضاء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين أعضاء الفريق في جميع رسائل البريد الإلكتروني المتعلقة بالمشروع.",
        "correct": true
      },
      {
        "text": "اتصل بأعضاء الفريق بشكل فردي لجمع المعلومات وتقديم التحديثات أسبوعياً.",
        "correct": false
      },
      {
        "text": "تعزيز الاجتماعات المنتظمة باستخدام مؤتمرات الفيديو.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو من أعضاء الفريق ملء سجل مهام للتحديثات اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع شكوى تفيد بأن فريق المشروع لم يستجب بشكل صحيح لطلب العميل. ومع ذلك، يدرك مدير المشروع أن الفريق تلقى طلبات متعددة خارج النطاق من العميل.\nما الإجراء الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "شجع أعضاء الفريق على طرح \"الأسباب الخمسة\" أثناء تواصلهم مع العميل.",
        "correct": true
      },
      {
        "text": "اطلب من العميل شرح أفضل للطلبات والمشكلات التي شاركها مع الفريق.",
        "correct": false
      },
      {
        "text": "مراجعة النطاق مع العميل بحيث يمكن توثيق الطلبات الإضافية ومعالجتها كطلبات تغيير.",
        "correct": false
      },
      {
        "text": "طلب تضمينها في جميع الاتصالات المستقبلية بين أعضاء فريق المشروع والعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في الاجتماع الأول حول مشروع إنشاء طريق، يقوم مدير المشروع بتذكير الفريق بأهمية مراعاة جميع القواعد عند القيام بواجباتهم والتفاعل مع أصحاب المصلحة. في وقت لاحق من المشروع، يبدأ أعضاء الفريق في الحضور إلى الاجتماعات في وقت متأخر ولا يتبعون القواعد الأساسية الأخرى.\nلضمان عدم تأثر نتائج المشروع وجدوله الزمني، ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "معالجة المشكلة مع أعضاء الفريق المحددين الذين انتهكوا القواعد الأساسية.",
        "correct": true
      },
      {
        "text": "قم بإزالة أعضاء الفريق الذين انتهكوا القواعد الأساسية.",
        "correct": false
      },
      {
        "text": "قم بترقية جميع أعضاء الفريق الذين لا ينتهكون أي قواعد أساسية.",
        "correct": false
      },
      {
        "text": "السماح للفريق بالتحقيق مع أي من أعضاء الفريق الذين ينتهكون القواعد الأساسية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة التخطيط، يقوم مدير المشروع بوضع الجدول الزمني للمشروع. يقوم فريق المشروع المعين بإنهاء مشروع لا علاقة له بالمشروع، لذلك يتم تعيين موارد مؤقتة للمساعدة في التخطيط وتقدير مدة المهمة. سيقوم فريق المشروع باستبدال الموارد المؤقتة قبل بدء المشروع.\nما الذي يجب على مدير المشروع القيام به قبل الانتهاء من الجدول الزمني للمشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة التقديرات مع الفريق المعين.",
        "correct": true
      },
      {
        "text": "تحقق من مدد مهام المشاريع السابقة.",
        "correct": false
      },
      {
        "text": "تحديث تقدير المدة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "طلب الموافقة من راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يبدي كبير مسؤولي التكنولوجيا (CTO) حماسًا بشأن اعتماد المؤسسة مؤخرًا لممارسات القيادة الخادمة. ويطلب كبير مسؤولي التكنولوجيا أن يطبق جميع مديري المشاريع ممارسات القيادة الخادمة ولكن يبدو أنه غير متأكد من التطبيقات العملية.\nما هي العبارة التالية التي تمثل أفضل طريقة يجب أن يستجيب بها مدير المشروع لطلب مدير التكنولوجيا؟",
    "explanation": "",
    "choices": [
      {
        "text": "اشرح أن القيادة الخادمة يمكن تكييفها وتطبيقها على أي حالة من حالات المشاريع.",
        "correct": true
      },
      {
        "text": "ذكّر المدير التنفيذي للتكنولوجيا بأن القيادة الخادمة هي الأنسب للمشاريع التي تستخدم أساليب رشيقة.",
        "correct": false
      },
      {
        "text": "توضيح أن ممارسات القيادة الخادمة تركز عادةً على تفضيلات العميل.",
        "correct": false
      },
      {
        "text": "التأكيد على أن القيادة الخادمة تعمل فقط في المشاريع ذات الموارد الكبيرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال جلسة تخطيط المشروع، يحاول مدير المشروع تحديد خطة إصدار لتحقيق قيمة متسقة في التسليم وقبول العميل. يقترح أحد كبار أصحاب المصلحة أن يكون هناك إصدار في نهاية المشروع للتأكد من أن العميل يرى جميع ميزات المنتج في وقت واحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من فريق المشروع اقتراح جدول زمني للإصدار بناءً على مدى تعقيد ميزات المنتج المحددة.",
        "correct": true
      },
      {
        "text": "يوصى بثلاثة إصدارات، واحد في بداية المشروع وواحد في منتصفه وواحد في نهايته.",
        "correct": false
      },
      {
        "text": "إنشاء خطط إصدار لكل مرة يتم فيها تسليم ميزة المنتج لإجراء اختبارات الجودة والمراجعات.",
        "correct": false
      },
      {
        "text": "اقترح أن يتم تسليم المنتج على مدار عدة تكرارات لجمع ملاحظات العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتكون فريق المشروع عن بُعد من أعضاء من بلدين. يتوقع أحد الفريقين الحصول على ثلاثة أيام إجازة للاحتفال بعطلة وطنية. يخبر مدير المشروع الفريق أن عليهم العمل خلال العطلة لتحقيق إنجاز رئيسي في التكرار الحالي. يشعر الفريق بالاستياء ولا يفهم سبب اضطرارهم للعمل إذا كانت العطلة عطلة وطنية.\nما الذي يجب أن يكون مدير المشروع قد حدده وأبلغه بوضوح في بداية المشروع لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتفاقيات الفريق",
        "correct": true
      },
      {
        "text": "المعالم البارزة",
        "correct": false
      },
      {
        "text": "الأدوار الفردية",
        "correct": false
      },
      {
        "text": "التسلسل الهرمي للفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتقد مدير المشروع أن فريق المشروع يمكن أن يستفيد من أنشطة التطوير لتحسين أداء المشروع ونتائجه. ويقرر مدير المشروع التخطيط لأنشطة تطوير محددة لكل عضو من أعضاء الفريق.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان نجاح هذه المبادرة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم لمهارات أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الفريق تحديد خطط التطوير الخاصة بهم.",
        "correct": false
      },
      {
        "text": "توزيع خطط تطوير واضحة على أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تطبيق نظام المكافآت على أساس الأداء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد ليحل محل مدير مشروع تم نقله مؤخراً إلى مشروع آخر. وأخبر أعضاء الفريق مدير المشروع الجديد أن المشروع متأخر عن الجدول الزمني بسبب التأخير في الحصول على الموافقات على المستندات من العميل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتمع مع العميل لمناقشة التأخير والتفاوض على موعد نهائي جديد.",
        "correct": true
      },
      {
        "text": "تحدث إلى مدير المشروع السابق لفهم الوضع بشكل أفضل.",
        "correct": false
      },
      {
        "text": "تواصل مع العميل واطلب الموافقة المعجّلة على المستندات.",
        "correct": false
      },
      {
        "text": "تقييم أثر التأخيرات على الجدول الزمني للمشروع وميزانيته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً مع فريق ذاتي التنظيم. والفريق غير قادر على الاتفاق على نطاق الزيادة التالية.\nكيف ينبغي لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تسهيل مناقشة الفريق لفهم سبب عدم قدرة الفريق على الاتفاق على نطاق الزيادة التالية.",
        "correct": true
      },
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية للمشروع بحيث تصبح المخاطر التي تشكلها الخلافات حول النطاق واضحة.",
        "correct": false
      },
      {
        "text": "تعاون مع خبير موضوعي مناسب (SME) لتحديد نطاق الزيادة التالية.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق التصويت على الخيارات وتحديد النطاق المناسب بناءً على تصويت الأغلبية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع لمراجعة الجدول الزمني للمشروع، حدد فريق المشروع أن أحد أنشطة المسار الحرج قد تراجع بسبب التبعيات الخارجية. وأصبح الجدول الزمني للمشروع الآن في خطر.\nما الذي يجب على مدير المشروع تحديد أولوياته كاستجابة أولية لمعالجة المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إصدار طلب تغيير والاجتماع مع العميل.",
        "correct": true
      },
      {
        "text": "إعادة جدولة الجدول الزمني وإخطار راعي المشروع.",
        "correct": false
      },
      {
        "text": "تحديث الوثائق وتحديد الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "قم بإخطار العميل وطلب تمديد الجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع جديد مع العديد من أصحاب المصلحة رفيعي المستوى. وقد قدم كل واحد من أصحاب المصلحة توقعاته للمشروع، وأدرك مدير المشروع أن بعض التوقعات تتعارض مع بعضها الآخر.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تيسير عقد اجتماع لمعالجة التوقعات المتضاربة وحلها.",
        "correct": true
      },
      {
        "text": "تحديد أولويات توقعات أصحاب المصلحة ذوي السلطة العليا.",
        "correct": false
      },
      {
        "text": "تحديث سجل أصحاب المصلحة بتوقعات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إنشاء تسلسل هرمي للمشروع لإدارة توقعات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في بداية المشروع الرشيق، يقوم مدير المشروع بتطوير ميثاق المشروع مع الفريق. وهم غير قادرين على الاتفاق على قيم الفريق.\nما الذي يجب على مدير المشروع مناقشته مع الفريق لمعالجة النزاع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الوتيرة المستدامة",
        "correct": true
      },
      {
        "text": "تعريف تم (DoD)",
        "correct": false
      },
      {
        "text": "احترام الإطار الزمني",
        "correct": false
      },
      {
        "text": "مراسم المشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إبلاغ مدير مشروع لأحد مشاريع البناء بأن التصريح المطلوب من الحكومة المحلية لم يتم الحصول عليه بعد سيؤدي تقديم طلب الحصول على التصريح إلى تأخير تسليم المشروع لمدة يومين بتكلفة قدرها 40,000 دولار أمريكي. تبلغ غرامة عدم الحصول على التصريح 900 دولار أمريكي في اليوم الواحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب للحصول على تصريح وتأخير تسليم المشروع لمدة يومين.",
        "correct": true
      },
      {
        "text": "تجاهل متطلبات التصريح واستمر في المشروع.",
        "correct": false
      },
      {
        "text": "محاولة التفاوض مع الحكومة المحلية للحصول على عفو.",
        "correct": false
      },
      {
        "text": "خصص مبلغ الغرامة كمصروفات إضافية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتألف التكرار الأول لمشروع رشيق من الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي تم بنجاح الآن يتوق أعضاء الفريق إلى تسليم المنتج إلى العميل.\nكيف ينبغي التأكد من أن المنتج جاهز للاستخدام من قبل العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "يحدد مسؤول سكروم الرئيسي أن جميع المتطلبات مرضية",
        "correct": true
      },
      {
        "text": "يوافق فريق المشروع على استيفاء نموذج MVP لتعريف الإنجاز (DoD).",
        "correct": false
      },
      {
        "text": "يقوم المدير الأعلى والعميل بالموافقة على المنتج وقبوله.",
        "correct": false
      },
      {
        "text": "يقرر مالك المنتج أن المنتج MVP يجتاز جميع اختبارات الجودة المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نظرًا للطبيعة المعقدة للمشروع التنبؤي، تقرر المنظمة استخدام نهج رشيق لمرحلة المشروع. لا يفهم أحد أعضاء الفريق النهج الرشيق حقًا ويواصل تخصيص المهام لبقية أعضاء الفريق. بعد فترة، لا يتمكن الفريق من التكيف من تلقاء نفسه وتنشأ النزاعات مما يؤخر التسليمات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استبدل عضو الفريق بشخص لديه خبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "انتظر حتى يتمكن الفريق في النهاية من حل النزاع بنفسه وإعادة التنظيم.",
        "correct": false
      },
      {
        "text": "إعادة التأكيد على مبادئ وأدوار أجايل لإنشاء هياكل يمكن للفريق استخدامها.",
        "correct": false
      },
      {
        "text": "تحكّم في الأعمال المتراكمة المتراكمة في السباق السريع وقم بتعيين المهام لأعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لم يتمكن مدير المبيعات الرئيسي وفريق العمل من تقديم تقرير حالة المشروع في الوقت المحدد لمشروع دمج تقرير المبيعات الجديد. وبالإضافة إلى ذلك، لا يفي التقرير بالتوقعات التي تم تسليط الضوء عليها في اجتماعات المراجعة الجماعية.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.",
        "correct": true
      },
      {
        "text": "تأكد من توثيق الخطة ومشاركتها بين الفريق وأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "زيادة تواتر اجتماعات الفريق لتقديم تقرير الحالة.",
        "correct": false
      },
      {
        "text": "تأكد من إتاحة المزيد من الوقت لأعضاء الفريق للتداول والتخطيط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كجزء من مهمة مؤقتة، يقوم مدير مشروع بقيادة مشروع تجاري. خلال اجتماع الحالة اليومي، تم اكتشاف أن فريق التطوير لم يقم بمهمة حرجة. تؤدي هذه المشكلة إلى تأخير التكرار الحالي. القدرة على اتخاذ الإجراءات اللازمة لمعالجة هذه المشكلة تتجاوز سلطة فريق المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأجيل التكرار الحالي وإبلاغ أصحاب المصلحة بالمشكلة.",
        "correct": true
      },
      {
        "text": "ادعُ فريق المشروع إلى جلسة تجميعية لتحديد الحل.",
        "correct": false
      },
      {
        "text": "تعديل الجدول الزمني للمشروع لاستيعاب التأخير في التطوير.",
        "correct": false
      },
      {
        "text": "رفع المشكلة إلى راعي المشروع لتحديد الخطوات التالية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع بمشروع يتضمن فريقاً افتراضياً متعدد الثقافات يضم ممثلين من مختلف البلدان. يحتاج مدير المشروع إلى التحضير لاجتماع استهلالي.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع القواعد واللوائح التي يجب اتباعها أثناء المشروع.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية موارد مختلفة لتسهيل المشروع.",
        "correct": false
      },
      {
        "text": "ضع في اعتبارك مختلف المناطق الزمنية وقدرات الاتصال والقيود المحتملة.",
        "correct": false
      },
      {
        "text": "قم بإعداد لغة راعي المشروع كلغة التواصل الرسمية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تخطط شركة في صناعة تخضع لتنظيم شديد لإصدار منتج جديد لم يكن متاحًا من قبل في السوق. وقد طلب الرئيس التنفيذي من مدير المشروع أن يقترح طريقة لضمان عدم دخول المنافسين في الصناعة إلى سوق هذا المنتج قبل هذه الشركة.\nما هو نهج تسليم المشروع الذي يجب أن يستخدمه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدام نهج تنبؤي حيث أن الشركة لديها خبرة سابقة في ذلك.",
        "correct": true
      },
      {
        "text": "قم بتضمين موارد كافية في الميزانية لسرعة إنجاز المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ التكرارات في مرحلة مبكرة من عمليات تطوير المنتج، وجدولة المهام التنبؤية التي سيتم تنفيذها قبل مرحلة الطرح مباشرة.",
        "correct": false
      },
      {
        "text": "اطلب ضم مدرب رشيق إلى فريق أجايل لزيادة سرعة الإصدارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشعر راعي المشروع بقلق متزايد بشأن القيمة العائدة من الاستثمار في المشروع ويريد التأكد من الوفاء بالمواعيد الأصلية. \nما الذي ينبغي لمدير المشروع أن يفعله لإقناع الجهة الراعية بأن المشروع يسير على الطريق الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكيد على القيمة المقدمة عند بوابة المرحلة.",
        "correct": true
      },
      {
        "text": "زيادة عدد تقارير حالة المشروع.",
        "correct": false
      },
      {
        "text": "التوقعات السابقة والأداء الحالي.",
        "correct": false
      },
      {
        "text": "قم بدعوة راعي المشروع إلى الاجتماعات اليومية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع الذي يقوم فيه مزود خارجي بتنفيذ حل مخصص، يجب على مدير المشروع التأكد من أن الفريق المحلي سيكون لديه القدرة على دعم الحل.\nما الذي يجب أن يفعله مدير المشروع لضمان قدرة الفريق المحلي على دعم الحل؟",
    "explanation": "",
    "choices": [
      {
        "text": "تفويض مسؤولية دعم الحل المخصص إلى الموفر الخارجي.",
        "correct": true
      },
      {
        "text": "إجراء دورات تدريبية شاملة للفريق المحلي على الحل الجديد.",
        "correct": false
      },
      {
        "text": "تقليل مسؤوليات الفريق المحلي لتقليل الحاجة إلى الدعم.",
        "correct": false
      },
      {
        "text": "تعيين موظفين إضافيين لتوفير الدعم المستمر للفريق المحلي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الافتتاحي للمشروع، يعلن مدير المشروع أنه سيتم استخدام نهج هجين لتنفيذ المشروع. ويثير العديد من أعضاء الفريق القلق لأنهم معتادون على العمل في المشاريع التنبؤية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع المشكلة إلى راعي المشروع لضمان توافق الفريق مع نهج تنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "قم بإشراك مكتب إدارة المشروع (PMO) لأنه يحدد نهج تنفيذ المشاريع.",
        "correct": false
      },
      {
        "text": "قم بتثقيف أعضاء الفريق حول أجايل والفوائد المرتبطة باستخدام مبادئ أجايل.",
        "correct": false
      },
      {
        "text": "التغيير إلى نهج تنبؤي يتماشى مع مهارات أعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تولى مدير مشروع جديد مسؤولية مشروع جارٍ. وتظهر التقارير المرحلية أن المشروع في حدود الميزانية والجدول الزمني المخصص له. ومع ذلك، أشار أحد الموردين الرئيسيين إلى أنه لن يتمكن من توريد المواد الأساسية حسب الجدول الزمني المحدد\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
        "correct": true
      },
      {
        "text": "مراجعة الأداء مقابل خط الأساس للمشروع.",
        "correct": false
      },
      {
        "text": "بدء الإجراءات القانونية ضد المورد المتخلف عن السداد.",
        "correct": false
      },
      {
        "text": "إنهاء العقد مع المورد فوراً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع ابتكاري كبير يحظى بمكانة عالية لدى المديرين التنفيذيين في الشركة. في الآونة الأخيرة، تغير أحد متطلبات المشروع مؤخرًا ويتطلب استخدام تكنولوجيا جديدة ومبتكرة. ويتطلب التغيير إنشاء منصب جديد ليشغله شخص على دراية بالتكنولوجيا الجديدة. خلال اجتماع الحالة، يعرب أحد أعضاء الفريق الحاليين عن اهتمامه بالوظيفة الجديدة ويؤكد أنه معتمد في هذه التقنية الجديدة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تكليف عضو الفريق بالمهمة لدعم نموهم في المؤسسة، والحصول على مورد ليحل محل الدور القديم لعضو الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من عضو الفريق الاستمرار في المهمة الوظيفية الحالية مع تولي المهمة الجديدة في نفس الوقت الذي يسمح به الوقت.",
        "correct": false
      },
      {
        "text": "رفع الطلب إلى راعي المشروع لتحديد ما إذا كان يمكن تعيين عضو الفريق في المهمة الجديدة.",
        "correct": false
      },
      {
        "text": "قم بتعيين عضو جديد في الفريق واطلب من عضو الفريق الحالي توفير التدريب اللازم لعضو الفريق الجديد للحصول على الشهادة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أوشك المشروع على الانتهاء، ويرغب العميل في الاحتفال بالنجاح من خلال مشاركة حالة عمل حول الفوائد التي حققها المشروع. يشعر مدير المشروع وفريق العمل بالتخوف من مشاركة حالة العمل في هذه المرحلة.\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "التعاون مع العميل لإنشاء حالة عمل تسلط الضوء على فوائد المشروع.",
        "correct": true
      },
      {
        "text": "أقر بالطلب ولكن أكد على محدودية حالة العمل في هذه المرحلة.",
        "correct": false
      },
      {
        "text": "قم بإحالة العميل إلى فريق المشروع للحصول على تفاصيل حول الفوائد التي حققها المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ العميل بأن حالة العمل تتطلب عملاً إضافياً وموارد إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل أحد الموارد الرئيسية مع مدير المشروع بعد الاجتماع الافتتاحي ويعرب عن قلقه من عدم قدرته على إنجاز المهام الموكلة إليه بسبب أولويات أخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعدًا لاجتماع الفريق لتقييم الأولويات وإدارتها.",
        "correct": true
      },
      {
        "text": "توثيق عدم التوافر كمخاطرة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "رفع هذه المشكلة إلى راعي المشروع للحصول على الدعم التنفيذي.",
        "correct": false
      },
      {
        "text": "قم بتحديث خطة إدارة المشروع وفقًا لذلك لتعكس التأخير المحتمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتفق مزود الخدمة وعميله على حوالي 80 من نطاق عقد مشروع يعملان عليه لتسليم محتوى تسويقي. لدى العميل ميزانية ثابتة وتاريخ إنجاز مستهدف ويريد الحصول على أكبر قيمة تجارية ممكنة من المشروع من خلال زيادة النطاق على أساس تسليم أفضل جهد ممكن مع اقتراب نهاية المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء العقد بناءً على النطاق المتفق عليه وخطة التغييرات الإضافية المتفق عليها.",
        "correct": true
      },
      {
        "text": "التأكد من توثيق عملية مراقبة التغيير في العقد.",
        "correct": false
      },
      {
        "text": "اقتراح خيار عقد نطاق ديناميكي وإضافة عدد ثابت من التكرارات.",
        "correct": false
      },
      {
        "text": "زيادة عدد الموارد في العقد لتقديم المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع المختلط، لا يفهم العميل الحاجة إلى مشاركة العميل في جميع مراحل المشروع. ونتيجة لذلك، فإن إعادة العمل تتجاوز المستويات المقبولة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير للحصول على المشاركة المطلوبة من العميل.",
        "correct": true
      },
      {
        "text": "قم بإضافة مشكلة العميل هذه إلى مشكلة العميل المتراكمة لتحديد أولوياتها ومراجعتها.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل لتسليط الضوء على أهمية مشاركته في نجاح المشروع.",
        "correct": false
      },
      {
        "text": "توجيه الإدارة العليا لجعل العميل يعمل بشكل وثيق مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجد مدير المشروع المكلف بمشروع قائم أن جودة المنجز غير متسقة. ويجد مدير المشروع أن الفريق لا يلتزم بمعايير التطوير.\nما هي الممارسات التي يجب على مدير المشروع استخدامها لضمان جودة أعلى؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": true
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة والوقت لضمان الجودة.",
        "correct": false
      },
      {
        "text": "تنفيذ عملية التحسين المستمر لضمان تحقيق نتائج متسقة.",
        "correct": false
      },
      {
        "text": "أضف وحدة عمل لفترة زمنية محددة لإثبات أن الحل قابل للتطبيق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن النزاعات بين أعضاء الفريق تحدث في كل سباق سريع. وبعد إجراء تحقيق، يكتشف مدير المشروع أن الفريق يحتاج إلى تدريب على تقنيات المرونة من أجل معالجة هذه النزاعات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة تدريب للفريق.",
        "correct": true
      },
      {
        "text": "جدولة الدورات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "إجراء تقييم للاحتياجات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "توجيه الفريق للبدء في استخدام التقنيات الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مرحلة التخطيط لمشروع ترقية، قام مدير المشروع بقياس المشاريع الحديثة الأخرى التي تستخدم نفس التكنولوجيا. واكتشف مدير المشروع أن الانقطاعات الأطول من المخطط لها حدثت في معظم الحالات بسبب أنشطة الصيانة المتكررة.\nماذا ستكون الخطوة التالية لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مشاريع المقارنة المعيارية باستخدام تقنيات أخرى لإنشاء خط أساس أكثر موضوعية.",
        "correct": true
      },
      {
        "text": "مقارنة التقنيات المماثلة الأخرى والتوصية بتطبيق تقنية أخرى.",
        "correct": false
      },
      {
        "text": "إنشاء عنصر مخاطر في سجل المخاطر وإدراج العتبات وفقًا للمعايير.",
        "correct": false
      },
      {
        "text": "ناقش فترة التوقف المحتملة مع الجهة الراعية واحصل على الموافقة على حالات الانقطاع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة تنفيذ أحد المشاريع، انضم مدير جديد إلى فريق الإدارة وأدخل شرط امتثال إلزامي يؤثر على جميع مهام المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إخطار الفريق بالمتطلبات الجديدة والمضي قدماً في المشروع كما هو مخطط له",
        "correct": true
      },
      {
        "text": "تحديث الجدول الزمني للمشروع وميزانيته ليعكس متطلبات المتطلبات الجديدة.",
        "correct": false
      },
      {
        "text": "مراجعة المتطلبات الجديدة وتقييم تأثيرها على مهام المشروع ونواتجه.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر ليعكس المخاطر المحتملة المرتبطة بالمتطلبات الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nاعتاد مدير مشروع العمل على مشاريع تنبؤية وبدأ الآن العمل على مشروع باستخدام نهج مختلط. ما الذي ينبغي أن يفعله مدير المشروع لتمكين الفرق من التركيز على مهمتها؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ منهجية سكرم",
        "correct": true
      },
      {
        "text": "اعتماد القيادة الخادمة.",
        "correct": false
      },
      {
        "text": "تطبيق الأساليب المرنة.",
        "correct": false
      },
      {
        "text": "ابتكر عمليات جديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع جديد لمشروع جارٍ ويقرر أن الجودة ثابتة. وتوجد ميزانية كبيرة لضمان الجودة، ويمكن أن تستفيد مجالات أخرى من المشروع من هذه الأموال.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ استراتيجية تخفيض الميزانية لإعادة تخصيص الأموال.",
        "correct": true
      },
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": false
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة لضمان الجودة.",
        "correct": false
      },
      {
        "text": "حافظ على الميزانية كما هي في الوقت الحالي واستمر في المراقبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً. وقد خرج العديد من أعضاء الفريق من المشروع مؤخرًا، بما في ذلك الشخص الوحيد الذي يتمتع بمهارة حاسمة محددة. في بداية سباق سريع جديد، يحدد مدير المشروع مهمة تتطلب هذه المهارة المفقودة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "أعد تحديد نطاق المشروع لإزالة المهمة التي تتطلب المهارة المفقودة.",
        "correct": true
      },
      {
        "text": "تقييم تأثير المهارة المفقودة على المشروع.",
        "correct": false
      },
      {
        "text": "تأجيل المهمة إلى أن يتم تعيين بديل له",
        "correct": false
      },
      {
        "text": "إعادة إسناد المهمة إلى فريق مشروع آخر يتمتع بالمهارات اللازمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق على مشروع تطوير منتج جديد باستخدام نهج هجين. بعد السباق الرابع، علموا أن سعر صرف السلع المستوردة سيزداد بشكل كبير.\nما الذي يجب على مدير المشروع القيام به للتأكد من إطلاق المنتج النهائي في الوقت المحدد وكما هو محدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل مع أصحاب المصلحة لتطوير نهج الميزنة التدريجية.",
        "correct": true
      },
      {
        "text": "تقليل مواصفات المنتج لاستخدام مواد مستوردة أقل.",
        "correct": false
      },
      {
        "text": "أنفق المال الإضافي وخطط لتعويضه في السباق التالي.",
        "correct": false
      },
      {
        "text": "مراجعة الأعمال المتراكمة لمعرفة تأثير الزيادة في الميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال ورشة عمل تصميم روبوت جديد، يسأل المهندسون مدير المشروع عن بروتوكولات السلامة والبيئة لإجراءات تشغيله.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "توظيف مهندس متخصص لدعم فريق التصميم.",
        "correct": true
      },
      {
        "text": "تزويد الفريق بأصول العملية التنظيمية وميثاق المشروع.",
        "correct": false
      },
      {
        "text": "ابحث في وثائق الدروس المستفادة للمشاريع المماثلة.",
        "correct": false
      },
      {
        "text": "قم بإجراء معيار مرجعي مع مصانع مماثلة لالتقاط قيود الامتثال الخاصة بها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يطلب مدير الأعمال ومالك المنتج طريقة أكثر مرونة لدمج التغييرات في الأعمال المتراكمة للمنتج. إنهم يريدون تقليل وقت الوصول إلى السوق من أجل الاستجابة لاستراتيجية إصدار المنافسين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب مالك المنتج على تحديد أولويات عناصر المنتج المتراكمة وفقًا لأهداف العمل.",
        "correct": true
      },
      {
        "text": "مراجعة سجل الافتراضات وخطة إدارة المشروع لتحديد التغييرات المحتملة.",
        "correct": false
      },
      {
        "text": "إنشاء عملية شاملة لمراقبة التغيير واختيار مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "تفويض جميع أصحاب المصلحة الرئيسيين بإجراء تعديلات من أجل تسليم المنتج بشكل أسرع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التكرار، يعلن أحد أعضاء فريق المشروع الرئيسيين عن استقالته. يدرك مدير المشروع أن إحدى ميزات المنتج ستتأثر بالاستقالة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل طلب تغيير لتعديل تاريخ التسليم بناءً على هذا الوضع غير المتوقع.",
        "correct": true
      },
      {
        "text": "اطلب من الموارد البشرية (HR) الاحتفاظ بعضو الفريق حتى نهاية المشروع.",
        "correct": false
      },
      {
        "text": "تسريع تبادل المعرفة مع الفريق متعدد الوظائف لضمان فهم هذا الوضع",
        "correct": false
      },
      {
        "text": "ناقش الموقف مع مالك المنتج وحدد ما إذا كان ينبغي إضافة موارد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتقدم مشروع واسع النطاق باستمرار. ومع ذلك، يواجه الفريق صعوبات في إكمال بعض القصص المعقدة والحفاظ على سرعة الإنجاز. يكتشف مدير المشروع أن التعاون غير الفعال أدى إلى سوء الفهم والإحباط.\nما الذي يجب على مدير المشروع القيام به لتحسين أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "التركيز على القيادة الخادمة.",
        "correct": true
      },
      {
        "text": "إجراء تحليل السبب الجذري.",
        "correct": false
      },
      {
        "text": "اطلب البصيرة من أحد المرشدين.",
        "correct": false
      },
      {
        "text": "تحسين اتصالات الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه أحد كبار أعضاء الفريق تحديات مع عضو جديد في فريق المشروع. يطلب العضو الأقدم في الفريق من مدير المشروع المشورة بشأن كيفية التعامل مع العضو الجديد في الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من أداء عضو الفريق ومصفوفة توزيع المسؤوليات لتقييم التعارض.",
        "correct": true
      },
      {
        "text": "اطلب من عضو الفريق الأقدم مواجهة عضو الفريق الجديد في اجتماع الاستعداد اليومي التالي.",
        "correct": false
      },
      {
        "text": "تدريب عضو الفريق الأقدم على نماذج حل النزاعات وكيفية تطبيقها على هذا الموقف.",
        "correct": false
      },
      {
        "text": "اطلب عقد اجتماع فردي مع العضو الجديد في الفريق واطلب منه تجنب العضو الأقدم في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "استلم مدير مشروع للتو مشروعاً جارياً. استقال مدير المشروع السابق من المنظمة. وأثناء مراجعة وثائق المشروع، أدرك مدير المشروع وجود انحرافات كبيرة في عملية الشراء التي استخدمها مدير المشروع السابق لإشراك مقدمي الخدمات الذين يعملون حاليًا في المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتصل بمدير المشروع السابق لفهم الأساس المنطقي لعملية الشراء غير الطبيعية.",
        "correct": true
      },
      {
        "text": "اتصل بمزوّدي الخدمة لمناقشة الانحراف ومطالبتهم بحل المشكلة.",
        "correct": false
      },
      {
        "text": "إبلاغ مقدمي الخدمة ومدير المشروع السابق إلى لجنة الأخلاقيات في المنظمة.",
        "correct": false
      },
      {
        "text": "وضع علامة على عملية الشراء غير الطبيعية كمسألة حرجة تسترعي انتباه الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مشروع مبتكر، يريد الراعي تقديم منصة معالجة بيانات مبتكرة وكبيرة لخدمة العملاء بشكل أفضل. ومع ذلك، لا يمكن وصف وظائف المنصة بوضوح في متطلبات المشروع. من أجل الحصول على استثمار مستمر، سيتم عرض كل مخرجات المشروع التي تظهر تقدمًا على الإدارة.\nما نوع نهج المشروع الذي يجب أن يوصي به مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنبؤي",
        "correct": true
      },
      {
        "text": "الشلال",
        "correct": false
      },
      {
        "text": "المرونة",
        "correct": false
      },
      {
        "text": "هجين",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اختبار قبول المنتج لمشروع برمجيات، يخبر راعي المشروع مدير المشروع أن البرنامج لن ينجح إلا إذا تم تغيير لون السمة من الأحمر إلى الأزرق. قام مدير المشروع بمراجعة وثائق التخطيط وأكد أن لون السمة يجب أن يكون إعادة أصر الراعي على تغيير اللون إلى اللون الأزرق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اقتراح أن يقدم راعي المشروع طلب تغيير رسمي لتغيير متطلبات الموضوع.",
        "correct": true
      },
      {
        "text": "أخبر راعي المشروع بقبول الموضوع لأن العقد ينص بوضوح على أنه يجب إعادة",
        "correct": false
      },
      {
        "text": "اتفق مع راعي المشروع وقم بتغيير لون السمة حسب الطلب لتجنب أي تعارض محتمل.",
        "correct": false
      },
      {
        "text": "اطلب من قسم المشتريات تغيير لون السمة إلى اللون الأزرق ليتماشى مع توقعات راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تولى مدير مشروع للتو إدارة مشروع مدته 5 سنوات وصل إلى منتصفه. وفي اجتماع اللجنة التوجيهية، سأل المدير التنفيذي عما إذا كان المشروع يسير على الطريق الصحيح لتحقيق هدف زيادة الإنتاج بنسبة 40 في المائة. أجاب مدير المشروع أنه نظرًا لأنهم عملوا في المشروع لمدة شهر واحد فقط، فإنهم لا يعرفون حالة المشروع.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة تقرير الحالة الأخير لفهم حالة المشروع.",
        "correct": true
      },
      {
        "text": "التحقق من صحة حالة المشروع مع المطور الرئيسي.",
        "correct": false
      },
      {
        "text": "مراجعة حالة المشروع الأخيرة مع راعي المشروع.",
        "correct": false
      },
      {
        "text": "التحقق من الجدول الزمني للمشروع لفهم حالة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nخلال مرحلة تنفيذ المشروع، يحدد فريق المشروع مخاطر لم تكن متوقعة من قبل يمكن أن تؤخر المشروع لعدة أشهر. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث سجل المخاطر.",
        "correct": true
      },
      {
        "text": "إجراء تحليل نوعي للمخاطر.",
        "correct": false
      },
      {
        "text": "تحديث الجهات الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "التخطيط لميزانية إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال أحد الاجتماعات، يقدم أحد أعضاء فريق العمل في مشروع إنشائي مقترحًا إلى مدير المشروع. ينص الاقتراح على أن تقسيم المشروع إلى مرحلتين سيخفف من مخاطر التأخير. ستؤدي المرحلة الأولى إلى الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي سيوفر للعميل فوائد مبكرة. ومن شأن ذلك أن يحد من حجم الأضرار والتجاوزات الأخرى في التكاليف بنسبة 90.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء دراسة جدوى لتقييم مخاطر وفوائد المقترح.",
        "correct": true
      },
      {
        "text": "رفض المقترح والاستمرار في المشروع كما كان مخططاً له في البداية",
        "correct": false
      },
      {
        "text": "توجيه الفريق بتنفيذ التغييرات المقترحة دون مزيد من المراجعة.",
        "correct": false
      },
      {
        "text": "ناقش المقترح مع العميل وأصحاب المصلحة الآخرين للحصول على آرائهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأ للتو مشروع جديد يضم أعضاء فريق من بلدين. ونظراً لاختلاف التوقيت، ينتهي أحد الموقعين من العمل بعد ساعة من بدء عمل الموقع الآخر لهذا اليوم.\nما الذي يجب على مدير المشروع القيام به لتعزيز التواصل بين الموقعين؟",
    "explanation": "",
    "choices": [
      {
        "text": "أثني على أعضاء الفريق المتاحين بعد ساعات العمل.",
        "correct": true
      },
      {
        "text": "حدد مواعيد الاجتماعات عبر الإنترنت خلال الساعات المتداخلة.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الالتزام بساعات العمل الموحدة.",
        "correct": false
      },
      {
        "text": "صياغة ميثاق الفريق لوضع منهجية لصنع القرار.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كجزء من أحد نواتج المشروع، يقوم مدير المشروع بشرح كيفية استخدام أحد المنتجات لمجموعة فرعية من موظفي العميل من خلال مكالمة جماعية افتراضية مدتها 30 دقيقة. يشتكي موظفو العميل من أن ورشة عمل لمدة يومين كانت ستكون أكثر فعالية للتدريب.\nما الذي كان ينبغي على مدير المشروع فعله لمنع هذه الشكوى؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم الاحتياجات التدريبية لموظفي العميل.",
        "correct": true
      },
      {
        "text": "إدراج هذا الخطر في خطة إدارة المخاطر.",
        "correct": false
      },
      {
        "text": "توفير احتياطي طوارئ للتدريب الإضافي.",
        "correct": false
      },
      {
        "text": "وضع خطة تدريب غير متزامنة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان أحد كبار أعضاء الفريق مؤثرًا للغاية ولعب دورًا حاسمًا في المشاريع السابقة. وفي هذا المشروع الجديد، لم يعد العضو الأقدم يلعب دورًا حاسمًا في هذا المشروع الجديد ولم يعد يلعب دورًا حاسمًا\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بترتيب اجتماع للفريق لمناقشة طرق زيادة التحفيز.",
        "correct": true
      },
      {
        "text": "توفير حوافز لزيادة التحفيز.",
        "correct": false
      },
      {
        "text": "اطلب من المدير الوظيفي التحدث مع عضو الفريق.",
        "correct": false
      },
      {
        "text": "قم بترتيب اجتماع فردي مع عضو الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "غالبًا ما يهيمن على المناقشات خلال الاجتماعات الأسبوعية لفريق المشروع أحد كبار أعضاء الفريق الذي يميل إلى التحدث على أعضاء الفريق الآخرين وانتقاد وجهة نظرهم علانية. ويتسبب ذلك في إحباط معنويات أعضاء الفريق الآخرين ويؤدي إلى عدم المشاركة خلال الاجتماعات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإزالة عضو الفريق الأقدم من الاجتماع الأسبوعي.",
        "correct": true
      },
      {
        "text": "نظّم نشاطاً لبناء الفريق يشجع على إيجاد الحلول معاً.",
        "correct": false
      },
      {
        "text": "فرض القواعد الأساسية الحالية لسلوك الفريق.",
        "correct": false
      },
      {
        "text": "تصعيد سلوك عضو الفريق الأقدم إلى المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع جديد لمشروع في مرحلة التنفيذ. وقد أنجز المشروع للتو منجزات المرحلة الأولى. خلال ورشة عمل لمراجعة نطاق المرحلة الثانية من المشروع، اشتكى اثنان من أصحاب المصلحة من عدم إبلاغهم بالمنافع التي تم تسليمها بالفعل\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى اللجنة التوجيهية لأنه يجب أن يكون الراعي قد أبلغ أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية لأن السؤال جاء من بعض كبار أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "قم بتسجيل المشكلة في سجل المشكلات، ومناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "تسجيل المشكلة في السجل، ومراجعة مصفوفة أصحاب المصلحة، وتحديث خطة إدارة المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نجح فريق مشروع رشيق في إصدار نواتج محدثة في كل سباق سريع توفر باستمرار قيمة متزايدة للمستخدمين. ومع ذلك، فإن المشروع يتجاوز الميزانية المخصصة له في البداية، ولا يزال هناك العديد من البنود في الأعمال المتراكمة للمشروع. وقد أعرب أصحاب المصلحة عن مخاوف متزايدة، ويحتاج مدير المشروع إلى اتخاذ قرار بشأن أفضل مسار عمل لمعالجة الوضع وإدارة توقعات أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قياس رضا المستخدمين وتقديم النتائج إلى اللجنة التوجيهية.",
        "correct": true
      },
      {
        "text": "قم بإزالة النواتج المتراكمة التي لم تكن جزءًا من ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "طلب ميزانية إضافية بناءً على تقدير محدث للبنود المتراكمة المتبقية.",
        "correct": false
      },
      {
        "text": "التأكيد على توقع وجوب إنهاء العمل الملتزم به في الوقت المحدد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لمشروع جديد، يجد مدير مشروع جديد أن طلب تقديم العروض (RFP) يشير إلى عدة لوائح حكومية. ومع ذلك، يكتشف مدير المشروع أن المبادئ التوجيهية للامتثال المتعلقة بلائحتين محددتين قيد الإنشاء وغير متوفرة حالياً. تنصح الإدارة العليا مدير المشروع بأن المبادئ التوجيهية ستكون متاحة عندما يتم الوصول إلى تلك المرحلة من المشروع وتوجه مدير المشروع إلى مواصلة العمل على المقترح.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأخير المشروع وشرح عواقب عدم الامتثال للإدارة العليا.",
        "correct": true
      },
      {
        "text": "توثيق التفاعلات مع الإدارة العليا كافتراضات في سجل الافتراضات.",
        "correct": false
      },
      {
        "text": "التحقق من متطلبات اللوائح الحكومية ووضع استراتيجية للامتثال لها.",
        "correct": false
      },
      {
        "text": "مواصلة العمل على الاقتراح وتحديثه كلما تم فهم المزيد من إرشادات الامتثال",
        "correct": false
          }
      ]
    }
  ]
}
    
