{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
{
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع هجين (تنبؤي-مرن). أثناء اجتماع الاستعداد، يذكر أحد أعضاء الفريق أنه بسبب الخبرة في مشروع سابق، يعتقد أن أحد المخرجات القادمة قد يحتاج إلى الامتثال للوائح الحكومية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد المشكلة إلى مكتب إدارة المشروع (PMO) حتى يتمكنوا من تحديد ما إذا كان هناك حاجة إلى أي امتثال",
        "correct": true
      },
      {
        "text": "أوقف المشروع حتى يتم التأكد من خضوع المنجز لأي لوائح.",
        "correct": false
      },
      {
        "text": "مراجعة الدروس المستفادة من المشروع السابق لتحديد ما إذا كان هناك حاجة إلى أي امتثال",
        "correct": false
      },
      {
        "text": "قم بإزالة المهمة من المسار الحرج وتعيين المورد للعمل على متطلب آخر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشرف مدير مشروع على مشروع معقد يكون فيه أحد البائعين مسؤولاً عن تسليم عدة مكونات أساسية. يقع مدير المشروع وفريق البائع في منطقتين زمنيتين مختلفتين، وقد أصبح هذا الاختلاف في التوقيت تحدياً كبيراً، مما يؤدي إلى مشاكل في الإنتاجية داخل المشروع. غالبًا ما يواجه أعضاء الفريق من كلا الجانبين صعوبة في تنسيق الاجتماعات ومشاركة التحديثات والتواصل بفعالية بسبب تباين المناطق الزمنية.\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "راقب الجدول الزمني للمشروع عن كثب واتخذ الإجراءات اللازمة في حالة حدوث خطأ في المراحل الرئيسية",
        "correct": true
      },
      {
        "text": "اطلب من كلا الفريقين تغيير ساعات عملهما إلى منطقة زمنية مشتركة.",
        "correct": false
      },
      {
        "text": "ابحث عن مساحة مشتركة وانقل فريق البائعين مع فريق المشروع.",
        "correct": false
      },
      {
        "text": "قم بإنهاء الارتباط وابحث عن بائع جديد في المنطقة الزمنية المحلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتم تكليف مدير مشروع بمشروع يضمن امتثال المؤسسة للتشريعات الجديدة من الناحية التنظيمية. في أي مرحلة من مراحل المشروع ينبغي لمدير المشروع أن يوثق أهداف الامتثال؟",
    "explanation": "",
    "choices": [
      {
        "text": "مرحلة البدء",
        "correct": true
      },
      {
        "text": "مرحلة التخطيط",
        "correct": false
      },
      {
        "text": "مرحلة التنفيذ",
        "correct": false
      },
      {
        "text": "مرحلة الإغلاق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان مشروع تطوير برمجيات هام قيد التطوير خلال سباقات السرعة الستة الماضية. وقد تم إجراء عرض توضيحي لأصحاب المصلحة قبل يومين من السباق النهائي، حيث أعرب أحد أصحاب المصلحة الجدد عن أن المنتج لن يلبي توقعات السوق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش الأمر مع راعي المشروع وأصحاب المصلحة الجدد واطلب منهم إصلاح المشكلة المتوقعة.",
        "correct": true
      },
      {
        "text": "مراجعة نطاق وخطة المشروع مع صاحب المصلحة الجديد.",
        "correct": false
      },
      {
        "text": "مراجعة قائمة المهام المطلوبة مع فريق التطوير وأصحاب المصلحة الجدد.",
        "correct": false
      },
      {
        "text": "اتباع خطة إدارة التغيير ومراجعة النطاق والخطة بناءً على طلب أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيضغط أحد كبار أصحاب المصلحة في مجال الأعمال الذي يتمتع بسنوات عديدة من الخبرة على فريق العمل الرشيق لتسليم معظم الوظائف الموعودة للعميل بعد 8 أشهر في المستقبل بدلاً من عمليات التسليم التدريجية المتعددة على مدار الأشهر الثمانية. ما الذي يجب أن يفعله قائد المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اعمل مع فريق أجايل لجدولة عمليات التسليم التدريجية لتمكين تسليم قيمة الأعمال في وقت أقرب إلى العميل.",
        "correct": true
      },
      {
        "text": "جدولة اجتماعات مع العميل لتحديد قدرته على دعم عمليات التسليم الإضافية المتعددة.",
        "correct": false
      },
      {
        "text": "تقديم تفاصيل عن المشكلة إلى فريق أجايل وتعديل أهدافهم وخطط الإصدار لتتوافق مع طلب أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "اعمل مع أصحاب المصلحة لفهم ما هي المخاوف وفي الوقت نفسه نقل فوائد عمليات التسليم التدريجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع مع أصحاب المصلحة الداخليين فقط وتم تحذيره من قبل راعي المشروع بأن بعض أصحاب المصلحة يحتاجون إلى اهتمام خاص. المنظمة هرمية للغاية.\nأي من النماذج التالية يجب استخدامه في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "شبكة الطاقة-الفائدة",
        "correct": true
      },
      {
        "text": "شبكة تأثير الطاقة-التأثير",
        "correct": false
      },
      {
        "text": "شبكة المصالح-التأثير",
        "correct": false
      },
      {
        "text": "شبكة الفائدة-التأثير",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nمشروع تجريبي على وشك الانتهاء ويريد فريق المشروع تسجيل التحديات التي تم التغلب عليها والفرص المتاحة للعمل المستقبلي. أين سيوثقون هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديثات أصول العملية التنظيمية",
        "correct": true
      },
      {
        "text": "تقرير أداء العمل",
        "correct": false
      },
      {
        "text": "خطة إدارة المشروع",
        "correct": false
      },
      {
        "text": "سجل الدروس المستفادة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع تقني معقد في مرحلة التنفيذ. تتم إضافة تقنيات جديدة إلى الأعمال المتراكمة بناءً على متطلبات العملاء، مما ينطوي على تغييرات كبيرة في النواتج.\nما الذي يجب أن يفعله مدير المشروع لإرضاء العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "أعد تخطيط سباقات السرعة والإصدارات لتلبية كل توقعات العميل.",
        "correct": true
      },
      {
        "text": "إدارة توقعات العملاء بناءً على احتياجات أعمال المؤسسة.",
        "correct": false
      },
      {
        "text": "قبول المتطلبات الجديدة، وجدولة الاجتماعات للتخطيط لجدول زمني جديد للإصدار.",
        "correct": false
      },
      {
        "text": "دفع فريق المشروع إلى زيادة المرونة وقبول التحدي الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتعد إدارة الجودة جانبًا حيويًا في أي مشروع. أي من جوانب مراقبة الجودة التالية هو أحد مكونات نظام القياس العالي الأداء؟",
    "explanation": "",
    "choices": [
      {
        "text": "الدقة",
        "correct": true
      },
      {
        "text": "عدم الدقة",
        "correct": false
      },
      {
        "text": "عدم التكرار",
        "correct": false
      },
      {
        "text": "المدة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء تنفيذ المشروع، ارتكب أحد أعضاء الفريق خطأً أدى إلى تأخير الجدول الزمني للمشروع لمدة أسبوع. ما الذي ينبغي لمدير المشروع أن يفعله فيما يتعلق بهذا الخطأ والتأخير؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش المشكلة مع الفريق، وابحث عن حلول لها، واعرض المساعدة والدعم للفريق.",
        "correct": true
      },
      {
        "text": "تأكد من فهم تأثير هذا الخطأ من قبل عضو الفريق الذي ارتكب الخطأ.",
        "correct": false
      },
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا للتأكد من عدم حدوث خطأ مماثل مرة أخرى.",
        "correct": false
      },
      {
        "text": "ابحث عن حل، وقم بإيصاله إلى الفريق، وعزز أنه يجب تنفيذه الآن.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتألف فريق المشروع الافتراضي من أعضاء من مختلف البلدان مع وجود اختلافات ثقافية. ويشعر مدير المشروع بالقلق من أن الاختلافات الثقافية قد تؤدي إلى سوء التواصل والنزاع.\nما الذي يجب على مدير المشروع القيام به للتخفيف من حدة النزاعات المحتملة بشكل فعال؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتحديد القواعد الأساسية الخاصة بالمشروع بشكل تعاوني وتعميمها.",
        "correct": true
      },
      {
        "text": "اشتراط أن تكون جميع الاتصالات داخل فريق المشروع في شكل مكتوب.",
        "correct": false
      },
      {
        "text": "تعيين العضو الأقدم في فريق إحدى الدول للعمل كمحكم في حالة نشوب نزاع.",
        "correct": false
      },
      {
        "text": "اتخاذ جميع قرارات حل النزاعات ثم إبلاغ الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تعتبر مساهمة أصحاب المصلحة الرئيسيين ضرورية لنجاح المشروع. ومع ذلك، فإن أصحاب المصلحة يتأخرون دائماً في اتخاذ القرارات الحاسمة للمشروع.\nما الذي يمكن لمدير المشروع فعله لإعادة إشراك أصحاب المصلحة هؤلاء؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتمع مع صاحب المصلحة لفهم سبب التأخير.",
        "correct": true
      },
      {
        "text": "إزالة صاحب المصلحة من المشروع.",
        "correct": false
      },
      {
        "text": "أطلع اللجنة التوجيهية على تأخيرات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إضافة تأخير صاحب المصلحة إلى سجل المشكلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أبلغ الفريق قائد المشروع أنهم ليسوا متأكدين من احتياجات أصحاب المصلحة، على الرغم من جهود جمع المتطلبات المتعددة والمشاركة في اجتماعات الحالة.\nكيف ينبغي لمدير المشروع التعامل مع هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الطلب من الفريق العمل مع أصحاب المصلحة لتحليل متطلباتهم التفصيلية والتوقيع على المواصفات",
        "correct": true
      },
      {
        "text": "ناقش مع الفريق خيار إلغاء المشروع نظرًا لأن المخاطرة كبيرة جدًا بحيث لا يمكن الاستمرار فيه",
        "correct": false
      },
      {
        "text": "اطلب من الفريق كتابة مجموعة من قصص المستخدمين لالتقاط الاحتياجات وتحديد الأولويات وإدارة القصص",
        "correct": false
      },
      {
        "text": "توثيق ما يعتقد الفريق أن أصحاب المصلحة يحتاجون إليه، وعرضه على أصحاب المصلحة، وطلب ملاحظاتهم لمشاركتها مع الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nخلال أحد الاجتماعات اليومية، أثار فريق المشروع مشكلة تتمثل في أن أحد خبراء الموضوع في مجال الأعمال يغير تعريف \"تم\" بشكل متكرر، وأعربوا عن خشيتهم من أن يكون ذلك علامة على عدم الثقة. ما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تذكير الفريق بالتركيز على عملهم، والالتزام بالتحدث مع الشركة الصغيرة والمتوسطة",
        "correct": true
      },
      {
        "text": "قم بتذكير مالك المنتج بدعم الفريق والتحدث مع الشركة الصغيرة والمتوسطة",
        "correct": false
      },
      {
        "text": "تذكير الشركة الصغيرة والمتوسطة بالحفاظ على تعريف الإنجاز الذي تم الاتفاق عليه في البداية",
        "correct": false
      },
      {
        "text": "ذكّر الفريق بأن التغذية الراجعة المستمرة مهمة للنجاح",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nمدير مشروع يدير مشروعًا سأل راعيه عن سبب تطوير بعض مكونات المشروع داخليًا. أين يمكن العثور على هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "في خطة إدارة المشتريات، تحت بند قرارات البناء مقابل الشراء",
        "correct": true
      },
      {
        "text": "في ميثاق المشروع، ضمن قسم الافتراضات والقيود",
        "correct": false
      },
      {
        "text": "في وثيقة البنية التقنية، تحت حدود الحل، تحت حدود الحل",
        "correct": false
      },
      {
        "text": "في وثيقة بنية الحل، تحت الغرض من المشروع ومبرراته",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن المشروع متأخر عن الجدول الزمني بسبب تأخر تسليم المواديبلغ فريق المشتريات مدير المشروع أن القواعد الجديدة التي فرضتها الحكومة لشراء هذه المواد هي السبب في هذا التأخير.\nفي أي خطة يجب توثيق هذه القواعد الجديدة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة المشتريات",
        "correct": true
      },
      {
        "text": "إدارة الاتصالات",
        "correct": false
      },
      {
        "text": "مشاركة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "إدارة الجداول الزمنية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتوي المشروع المعقد على مشاركين متعددين. ويتفق مدير المشروع مع الفريق على ضرورة فهم أفضل لوجهة نظر جميع المشاركين في المشروع لتحقيق النجاح الأمثل للمشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة تحليل أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "وضع خطة تواصل.",
        "correct": false
      },
      {
        "text": "إجراء تحليل SWOT.",
        "correct": false
      },
      {
        "text": "إجراء تحليل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأصبحت بيئة العمل غير مستقرة بسبب قيام أحد أصحاب المصلحة بتغيير مخرجات المشروع ونتائجه في منتصف مرحلة التنفيذ. ومع أخذ صاحب المصلحة في الاعتبار، كيف ينبغي لمدير المشروع أن يضمن تحقيق فوائد المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من موافقة فريق المشروع على خطة إدارة المشروع وتزويد أصحاب المصلحة بتحديثات مستمرة.",
        "correct": true
      },
      {
        "text": "الجمع بين النهجين الرشيق والتنبؤي وإدارة التغييرات في النطاق العام بأقل قدر من الانحرافات.",
        "correct": false
      },
      {
        "text": "تأكد من أن مخرجات المشروع وأهدافه مصممة خصيصاً لتلبية المتطلبات الأولية.",
        "correct": false
      },
      {
        "text": "إشراك أصحاب المصلحة على أساس مستوى التأثير والتأكد من تسجيل متطلباتهم بشكل كافٍ وفقًا لعملية إدارة التغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنظمة المكافآت\nكان أداء الإصدار الأول الذي تم تسليمه إلى فريق مراقبة الجودة ضعيفًا، ويشكو المختبرون من عدم قدرتهم على إكمال جميع حالات الاختبار كما هو مخطط له ما هي الأداة التي تساعد على مراقبة الأداء؟",
    "explanation": "",
    "choices": [
      {
        "text": "رسم بياني للتشغيل",
        "correct": true
      },
      {
        "text": "مخطط تدفق البيانات",
        "correct": false
      },
      {
        "text": "مخطط التدفق",
        "correct": false
      },
      {
        "text": "مخطط غير متحكم فيه",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروع معالجة مياه الصرف الصحي لمصنع. أثناء تنفيذ المشروع، أصدرت الحكومة بشكل غير متوقع معايير جديدة لحماية البيئة أكثر صرامة من المعايير السابقة.\nلضمان الامتثال لهذه اللوائح المحدثة، ماذا ينبغي أن يكون مسار العمل الأولي لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاجتماع مع فريق المشروع لتقييم آثار اللوائح الحكومية الجديدة على متطلبات المشروع.",
        "correct": true
      },
      {
        "text": "راجع سجل المخاطر الخاص بالمشروع لتحديد ما إذا كان هذا التغيير قد تم توثيقه مسبقًا كمخاطر محتملة للمشروع.",
        "correct": false
      },
      {
        "text": "قم بصياغة طلب تغيير رسمي يوضح بالتفصيل التعديلات وتقديمه إلى مجلس مراقبة التغيير (CCB) لتقييمه.",
        "correct": false
      },
      {
        "text": "بدء مناقشات مع الوكالة الحكومية للتفاوض على جدول زمني منقح لاعتماد المعايير البيئية الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الاستعراضي، يُظهر أعضاء الفريق عدم ارتباطهم بالفريق، مشيرين إلى أنهم يكررون نفس الأفكار مرارًا وتكرارًا.\nكيف يمكن لمدير المشروع التعامل مع هذا الموقف على أفضل وجه؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من أعضاء الفريق إيلاء المزيد من الاهتمام للجلسة حتى لو كانوا يعتقدون أنهم يعرفون ما هو قادم.",
        "correct": true
      },
      {
        "text": "اطلب من أعضاء الفريق إبداء ملاحظاتهم حتى لو كانت مماثلة لملاحظات أعضاء الفريق الآخرين للتأكيد على نقاطهم.",
        "correct": false
      },
      {
        "text": "شجع أعضاء الفريق على تقديم ملاحظات أفضل لأنهم يعرفون الأسئلة بالفعل.",
        "correct": false
      },
      {
        "text": "شجع الفريق على تقديم أفكار لتحسين العملية ودعم التغييرات بناءً على الملاحظات التي يتلقاها",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأ مشروع لتطوير تطبيق برمجيات جديد سيستخدمه فريق مبيعات الشركة. ومن المتوقع أن يستغرق المشروع ستة أشهر لإكماله وتبلغ ميزانيته ٠٠٠ ٠٠٠ دوﻻر. قام مدير المشروع بتحديد أدوات تطوير البرمجيات والأجهزة والتدريب التي سيتم شراؤها\nما هو أهم شيء يجب على مدير المشروع القيام به أثناء وضع خطة المشتريات؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكد من شراء جميع الموارد في حدود الميزانية.",
        "correct": true
      },
      {
        "text": "تأكد من أن المشروع يسير وفق الجدول الزمني المحدد دون أي تأخير.",
        "correct": false
      },
      {
        "text": "التأكد من أن جميع الموارد المشتراة ذات جودة عالية.",
        "correct": false
      },
      {
        "text": "التأكد من شراء جميع الموارد في الموعد المحدد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم مؤخراً بيع جزء كبير من شركة محلية إلى شركة دولية. وتفرض الشركة الأم الجديدة تطبيق لوائح الصحة والسلامة والبيئة (HSE) على جميع المشاريع في الشركة المحلية.\nما الذي يجب على مديري المشاريع القيام به للحفاظ على الامتثال؟",
    "explanation": "",
    "choices": [
      {
        "text": "انتظر حتى يقوم القسم الوظيفي المسؤول عن لوائح الصحة والسلامة والبيئة بالإبلاغ عن تغيير العملية.",
        "correct": true
      },
      {
        "text": "اطلب من القسم الوظيفي المسؤول عن لوائح الصحة والسلامة والبيئة تعيين عضو جديد في الفريق.",
        "correct": false
      },
      {
        "text": "تحدث مع الجهة الراعية للمشروع للحصول على توضيح حول لوائح الصحة والسلامة والبيئة الجديدة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع فريق الصحة والسلامة والبيئة لفهم تأثير اللوائح الجديدة على المشاريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيساعد مدير مشروع مؤسسته على الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الرشيقة. يسأل أحد أعضاء الفريق متى يجب القيام بأنشطة تحديد المتطلبات عالية المستوى وتصميم الحلول في منهجية رشيقة.\nكيف ينبغي لمدير المشروع الإجابة على هذا السؤال؟",
    "explanation": "",
    "choices": [
      {
        "text": "في نظام أجايل، يجب أن تبدأ هذه الأنشطة بمجرد تجميع فريق المشروع، ويفضل أن يكون ذلك في السباق الأول.",
        "correct": true
      },
      {
        "text": "في أجايل، يجب أن يخطط الفريق لتنفيذ بعض هذه الأنشطة كجزء من السباق السريع صفر قبل بدء التطوير.",
        "correct": false
      },
      {
        "text": "في أجايل، يجب على الفريق تجنب الهدر، لذلك يجب القيام بهذه الأنشطة كجزء من التطوير.",
        "correct": false
      },
      {
        "text": "في أجايل، يتبع الفريق استراتيجية اللحظة الأخيرة المسؤولة ويجب أن يؤجل تلك الأنشطة قدر الإمكان.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع بمشروع لتنفيذ نظام إدارة سلامة الأصول. وقد أشار راعي الأعمال التنفيذي إلى أنه من المتوقع أن يحسن النظام جودة العمليات ويطيل العمر الافتراضي للأصول.\nما الذي يجب أن يفعله مدير المشروع لإثبات قيمة العمل بمجرد دخول النظام مرحلة الإنتاج؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع معايير النجاح الحرجة، والوفورات المحتملة في التكاليف، ومقاييس الأداء المستمرة للمشروع.",
        "correct": true
      },
      {
        "text": "اكتب حالات الاختبار لتتماشى مع قيم العمل وتأكد من وضوح معايير القبول أثناء اختبار قبول المستخدم (UAT).",
        "correct": false
      },
      {
        "text": "تحقق من أن جميع المتطلبات ومعايير القبول تتماشى مع قيمة العمل وتوقعاته.",
        "correct": false
      },
      {
        "text": "التحقق من صحة العائد على الاستثمار (ROI)، ومراجعة أداء الأصول الحالي، واستخدامه كمعيار للقياسات المستقبلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع رشيق في التكرار الأخير. خلال الاجتماع اليومي، يدرك الفريق أنهم لن يكونوا قادرين على إكمال جميع الأنشطة التي تم التخطيط لها في هذا السباق. يضع أعضاء الفريق خطة طوارئ.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش خطة الطوارئ مع مالك المنتج.",
        "correct": true
      },
      {
        "text": "ناقش خطة الطوارئ مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "ناقش خطة الطوارئ مع الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ خطة الطوارئ على الفور.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قرر فريق مشروع في منتصف مشروع تسليم تدريجي أنه بحاجة إلى مساعدة خبير في الموضوع (SME) يعمل في قسم مختلف. فطلب فريق المشروع من الخبير الصغير والمتوسط الانضمام إلى فريقهم والمساعدة في مهمة محددة وأبلغوا قائد المشروع بهذا الإجراء.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من ميزانية المشروع وقم بتقييم أثر وجدوى إضافة مورد إضافي",
        "correct": true
      },
      {
        "text": "التحدث مع راعي المشروع والحصول على الموافقة، مع توضيح أن هذا المورد مهم وحاسم",
        "correct": false
      },
      {
        "text": "تحدث إلى المدير الوظيفي لهذا المورد المطلوب وتحقق من توفره ونطاقه الترددي",
        "correct": false
      },
      {
        "text": "تيسير تنسيق الموارد مع الموارد اللازمة بناءً على اتفاقية عمل الفرق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم مدير مشروع بإنهاء مشروع ما ويطلب الراعي رؤى حول تحقيق الفوائد. كيف يمكن لمدير المشروع حساب قيمة نتائج المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم فوائد المشروع النوعية والكمية.",
        "correct": true
      },
      {
        "text": "قم بتسعير الفوائد الملموسة وقسمها على النفقات.",
        "correct": false
      },
      {
        "text": "إجراء تقييم مالي بأثر رجعي.",
        "correct": false
      },
      {
        "text": "تقييم النتائج ومقارنتها بالميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع استعراضي بأثر رجعي، أكد فريق المشروع أن جميع النواتج قد اكتملت وفقًا للمواصفات الواردة في المواصفات المتراكمة للمنتج. ومع ذلك، ازداد عدد الأخطاء التي تم العثور عليها أثناء الاختبار بشكل كبير.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاجتماع مع أخصائيي ضمان الجودة لتوضيح المشكلة والبحث عن حلول لها.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة المخاطر لتحديد استراتيجية التخفيف من المخاطر.",
        "correct": false
      },
      {
        "text": "إجراء تحليل مونت كارلو لتحديد السيناريوهات والإجراءات المحتملة.",
        "correct": false
      },
      {
        "text": "قم بتسجيل المخاطر في سجل المخاطر ورصدها أثناء التكرار التالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً رشيقاً. يشكو مالك المنتج من أن فريق المشروع يكمل باستمرار عددًا أقل من نقاط القصة مقارنة بفريق سكروم الذي يعمل على مشروع آخر.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق معالجة هذه المشكلة كجزء من الاستعراض بأثر رجعي لتحسين سرعته في السباق التالي.",
        "correct": true
      },
      {
        "text": "أخبر مالك المنتج أنه من غير الصحيح مقارنة السرعة بين الفرق لأن نقاط القصة خاصة بكل فريق.",
        "correct": false
      },
      {
        "text": "احصل على موافقة من مالك المنتج لإضافة مخزن مؤقت للطوارئ إلى سباق السرعة، وتغيير المدة لزيادة السرعة.",
        "correct": false
      },
      {
        "text": "تحمل المسؤولية الكاملة عن الأداء المتدني للفريق مقارنة بالفريق الآخر والاعتذار.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في بيئة العمل الرشيقة، يجب على قائد المشروع أن يفكر دائمًا في تخصيص وقت للمناقشات المفتوحة والحرة بين أعضاء الفريق حول كيفية تحسين أداء الفريق.\nما أهمية هذه الممارسة بالنسبة للفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب على الفرق اتخاذ إجراءات لزيادة الإنتاجية باستمرار",
        "correct": true
      },
      {
        "text": "يجب على الفرق أن تختبر باستمرار طرقاً جديدة للقيام بالأشياء",
        "correct": false
      },
      {
        "text": "يجب أن تسعى فرق العمل باستمرار إلى تحسين عملياتها",
        "correct": false
      },
      {
        "text": "يجب على الفرق أن تدفع أعضاءها باستمرار إلى العمل بجدية أكبر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقدمت مؤسسة تعليمية بشكوى بعد تقديم طلب شراء وحدة برمجيات من شركة تستخدم ممارسات رشيقة. وتدّعي الشكوى أن فوترة الدفع مقابل التسليم الجزئي تنتهك بيان أجايل إذا لم يشارك العميل في اجتماعات سير العمل.\nأي من القيم الأربع للبيان الرشيق تدعمها مطالبة العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "عمليات تحافظ على وتيرة ثابتة إلى أجل غير مسمى",
        "correct": true
      },
      {
        "text": "تسليم البرامج بشكل متكرر وفي فترات قصيرة",
        "correct": false
      },
      {
        "text": "تعاون العملاء على التفاوض على العقود",
        "correct": false
      },
      {
        "text": "برنامج العمل كمقياس أساسي للتقدم المحرز",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يسير مشروع الدعم التشغيلي بسلاسة، لكن العميل يشكو باستمرار من عدم وضوح الرؤية في جودة أعمال الدعم.\nكيف ينبغي لمدير المشروع معالجة مخاوف العميل هذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإعداد التقارير ذات الصلة، وأرسلها إلى العميل يوميًا، وانشرها في مجلد مشترك للمراجعة المستقبلية.",
        "correct": true
      },
      {
        "text": "اطلب من العميل تعيين مدير من منطقته لمراجعة الأنشطة اليومية والاتفاقيات التي تم التوصل إليها خلال جميع المناقشات.",
        "correct": false
      },
      {
        "text": "خطط لاجتماع حوكمة متكرر مع العميل لعرض التقدم المحرز ونشر البيانات في مجلد مشترك للمراجعة المستقبلية.",
        "correct": false
      },
      {
        "text": "أبلغ العميل أن أحد أعضاء الفريق سيشرف على تحديثها كل يوم بعد إجراء أهم المناقشات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nبعد إجراء مراجعة سنوية للموظفين، ومناقشة إدارة المشاريع ومعرفة المهارات الشخصية، اتخذت الشركة قراراً بتدريب جميع الموظفين لمواجهة التحديات الجديدة. ستكون طريقة تدريب جميع الموظفين على موقع إلكتروني تتوفر فيه جميع المحتويات والامتحانات والنماذج والأصول التنظيمية الأخرى.\nما هي الطريقة المستخدمة لأغراض التدريب؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسحب",
        "correct": true
      },
      {
        "text": "ادفع",
        "correct": false
      },
      {
        "text": "تفاعلية",
        "correct": false
      },
      {
        "text": "العلاقات بين الأشخاص",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يعلم مدير المشروع أن المدير الوظيفي لأحد أعضاء الفريق يريد إبعاده من المشروع لأنه يعتقد أنه لا ينبغي له تنفيذ مهمة معينة بسبب تضارب الأولويات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من مصفوفة إسناد المسؤولية (RAM).",
        "correct": true
      },
      {
        "text": "تحقق من هيكل تقسيم العمل (WBS).",
        "correct": false
      },
      {
        "text": "تحقق من المخطط التنظيمي.",
        "correct": false
      },
      {
        "text": "تحقق من خطة إدارة الموارد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتوجه أحد أعضاء الفريق إلى مدير المشروع مباشرة بعد انتهاء اجتماع المشروع بشأن حاجته إلى المساعدة لإكمال مهمة متأخرة عن موعدها.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تجاهل طلب عضو الفريق، واطلب مضاعفة الجهود لإكمال المهمة",
        "correct": true
      },
      {
        "text": "ناقش المشكلة خلال الاجتماع اليومي، وقرر مسار العمل مع الفريق",
        "correct": false
      },
      {
        "text": "اطلب من عضو الفريق الخروج من المهمة وإعادة تخصيص المهمة لشخص آخر",
        "correct": false
      },
      {
        "text": "اطلب من أحد أعضاء الفريق المبتدئين المساعدة في إكمال المهمة في تاريخ الاستحقاق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف عملية التسليم التدريجي للمشروع، وبسبب تغيير في التكنولوجيا، أبلغ أحد أعضاء الفريق قائد المشروع أنه بسبب نقص المعرفة في التكنولوجيا سيتأخر التسليم واقترح الاستعانة بمصادر خارجية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ المستخدم النهائي بتأخير التسليم المحدد بسبب التقنية الجديدة",
        "correct": true
      },
      {
        "text": "ابحث عن خدمة الاستعانة بمصادر خارجية تتمتع بالخبرة المطلوبة",
        "correct": false
      },
      {
        "text": "إبلاغ الكفيل بالتأخير وطلب دعمه وموافقته",
        "correct": false
      },
      {
        "text": "مناقشة تأثير التكنولوجيا الجديدة مع الفريق واتخاذ قرار العمل بشكل مشترك",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد مع العديد من أصحاب المصلحة الذين لديهم أولويات متضاربة. وطلبت الإدارة العليا من مدير المشروع أن يتجنب \"الضجيج\" لأن هذا المشروع سياسي للغاية. اختار مدير المشروع الاستعانة بآراء خبراء من شخصيات معروفة في هذا المجال.\nماذا فعل مدير المشروع لتلبية طلب الإدارة العليا؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستجابة بطريقة ودية للإدارة العليا",
        "correct": true
      },
      {
        "text": "يبدو أنه كان متسقًا في استخدام الكلمات والأفعال",
        "correct": false
      },
      {
        "text": "التعاون مع الإدارة العليا لتحقيق الأهداف المشتركة",
        "correct": false
      },
      {
        "text": "اتخذ إجراءً بناءً على سلطة الإدارة العليا في التصرف",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع رشيق. ينضم إلى المشروع عضو جديد لم يسبق له العمل في فريق رشيق. يطلب العضو الجديد من مدير المشروع أن يشرح لمدير المشروع سبب استخدام النهج الرشيق\nماذا يجب أن تكون استجابة مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "لإزالة المخاطر وزيادة القدرة على التنبؤ والرؤية",
        "correct": true
      },
      {
        "text": "تقديم القيمة بشكل أسرع وتغيير النطاق بناءً على الملاحظات والتعليقات",
        "correct": false
      },
      {
        "text": "لتقليل التكاليف وزيادة جودة المخرجات النهائية",
        "correct": false
      },
      {
        "text": "الاستغناء عن الحاجة إلى التوثيق من خلال تقديم منتجات عاملة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nتقوم مجموعة من أصحاب المصلحة في إحدى المؤسسات المالية بإجراء مراجعة لإغلاق المشروع. ويشعر بعض أصحاب المصلحة بالقلق من أن نواتج المشروع لا تفي بمعايير الإغلاق المحددة ما هو أول شيء ينبغي لمدير المشروع القيام به لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكد من أن الجهات المعنية تفي مخرجات المشروع بجميع معايير الإغلاق المحددة",
        "correct": true
      },
      {
        "text": "اقتراح تعديل معايير الإغلاق بحذف المعايير التي لم يتم استيفاؤها.",
        "correct": false
      },
      {
        "text": "اتخاذ تدابير تصحيحية من خلال تكييف معايير الإغلاق وتمديد الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "قم بإجراء تحليل شامل لتحديد سبب عدم استيفاء معايير الإغلاق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع متمرس يدير مشروعًا رشيقًا بملايين الدولارات. يقوم مدير المشروع بإبلاغ الفريق بالقواعد الأساسية، ولكن بعد 12 تكرار، يبدأ مدير المشروع في ملاحظة أن بعض أعضاء الفريق لا يتبعون القواعد الأساسية.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان التزام الفريق بالقواعد الأساسية؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتصل بالموارد البشرية لطلب إرسال رسالة تحذير مكتوبة لأعضاء الفريق الذين لا يتبعون القواعد الأساسية.",
        "correct": true
      },
      {
        "text": "اطلب من المدير الوظيفي استبدال أعضاء الفريق الذين لا يتبعون القواعد الأساسية.",
        "correct": false
      },
      {
        "text": "حدد موعداً لعقد اجتماع مع فريق المشروع لتعزيز القواعد الأساسية.",
        "correct": false
      },
      {
        "text": "قم بإخطار راعي المشروع بهذا السلوك واطلب من الراعي اتخاذ إجراءات تأديبية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام أحد موردي المشروع بإبلاغ مدير المشروع بأن أحد نواتج المشروع التي تم الاستعانة بمصادر خارجية لإنجازها سيكون متاحًا بعد 6 أشهر من الجدول الزمني المتفق عليه للمشروع. وذكر البائع أنه يركز على نواتج المشروع الأخرى ذات الأولوية في التبعية، وأن هذا الناتج بالذات ليس له تبعيات معلنة.\nما الذي يجب أن يفعله مدير المشروع لتجنب التأخير في الجدول الزمني في المستقبل؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراقبة التبعيات والاستجابة للتحديات.",
        "correct": true
      },
      {
        "text": "تأكد من انتهاء جميع التبعيات الجديدة لبدء التشغيل",
        "correct": false
      },
      {
        "text": "حدد أي تبعيات إذا كانت موجودة.",
        "correct": false
      },
      {
        "text": "عقد اجتماع لإبلاغ العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه مدير مشروع تأخيرًا في أحد المشاريع بسبب قرار اتخذه المدير الوظيفي بتقديم الدعم في الموقع لمشروع آخر دون استشارة الأطراف الأخرى المتأثرة بهذا القرار.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من تأثير التأخير على الجدول الزمني والتكلفة.",
        "correct": true
      },
      {
        "text": "شارك جدول العمل مع المدير الوظيفي.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة للاتفاق على خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "أبلغ العميل بالتأخير وحدد موعدًا جديدًا للتسليم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكشف تقييم الأثر أن أحد النواتج يمكن أن يتأخر إنجازه لمدة أسبوعين. لم يكن أحد الموارد الرئيسية متاحاً للعمل في نشاط غير حاسم بسبب أولويات أخرى. وقد يتسبب ذلك في زيادة عبء العمل على الموارد الأخرى المتبقية.\nبما أن التكلفة هي العائق الرئيسي لهذا المشروع، ما الذي يجب أن يفعله مدير المشروع على الفور؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد ما إذا كانت المهمة لديها تعويم متاح للوفاء بتاريخ انتهاء المشروع.",
        "correct": true
      },
      {
        "text": "استئجار مورد مؤقت للقيام بالوظيفة",
        "correct": false
      },
      {
        "text": "استشارة الفريق وتقليل النطاق.",
        "correct": false
      },
      {
        "text": "تغيير تقويم الموارد لتجنب التأخيرات الكبيرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدرب أجايل بتقديم المشورة لمؤسسة برمجيات كبيرة كانت تستخدم منهجية الشلال وتخطط الآن للبدء في استخدام منهجية أجايل أو المنهجية الهجينة.\nما هو اقتراح مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستمرار في استخدام الشلال، لأن النظام الهجين لا يتناسب مع الهيكل التنظيمي.",
        "correct": true
      },
      {
        "text": "ابدأ بالأجايل ثم انتقل إلى الهجين، على الرغم من أن تطبيق الأجايل يستغرق وقتاً طويلاً.",
        "correct": false
      },
      {
        "text": "ابدأ باستخدام المنهجيات الهجينة لأن المعرفة بالشلال قابلة للنقل.",
        "correct": false
      },
      {
        "text": "البدء في استخدام المنهجية الهجينة، وهي المنهجية الأكثر ملاءمة لمؤسسات البرمجيات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستخدم فريق المنتج نهج النماذج الأولية لتقديم مبادرة أعمال متعددة السنوات. يلاحظ مدير المشروع أن بعض قصص المستخدمين تستغرق وقتًا أطول في التسليم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة الجدول الزمني للمشروع وإعادة تخصيص الموارد.",
        "correct": true
      },
      {
        "text": "قم بإجراء استعراض بأثر رجعي مع الفريق لتحديد الاختناقات.",
        "correct": false
      },
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا للتدخل.",
        "correct": false
      },
      {
        "text": "قم بتعديل نطاق المشروع لإزالة قصص المستخدمين المتأخرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مشروع رشيق بتكراره الخامس من أصل 1. بعد آخر استعراض بأثر رجعي، أدرك أعضاء الفريق أنهم اضطروا إلى العمل لساعات إضافية لتسليم العمل الملتزم به.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق أن يكون لديه التزام أقل للتكرار التالي.",
        "correct": true
      },
      {
        "text": "اطلب أعضاء فريق إضافيين للحفاظ على السرعة.",
        "correct": false
      },
      {
        "text": "قم بإجراء استرجاع مركّز لمساعدة الفريق على اكتشاف السبب الجذري.",
        "correct": false
      },
      {
        "text": "تنفيذ نقطة تحقق في التكرار للتحقق مما إذا كان الفريق يسير على المسار الصحيح.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع يتضمن عدداً قليلاً من البائعين. يسأل راعي المشروع عن كيفية حصول المشروع على السلع والخدمات الخارجية.\nأين يجب توثيق هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "في خطة إدارة المشتريات",
        "correct": true
      },
      {
        "text": "في اتفاقية الخدمة الرئيسية",
        "correct": false
      },
      {
        "text": "في عقد فاتورة المواد",
        "correct": false
      },
      {
        "text": "في اتفاقية مستوى الخدمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء إعداد ميثاق مشروع لمشروع جديد، يستعرض مدير المشروع الدروس المستفادة من المشاريع السابقة. وتُظهر وثائق الدروس المستفادة مشاكل متكررة تتعلق بانخفاض مستويات المشاركة وعدم توافق أصحاب المصلحة على أهداف المشروع.\nما الذي يجب أن يفعله مدير المشروع لتجنب تكرار هذه المشكلة في المشروع الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "السماح لأي صاحب مصلحة بالانضمام إلى مجلس التحكم في التغيير (CCB) في أي وقت في المشروع.",
        "correct": true
      },
      {
        "text": "قم بتضمين جميع أصحاب المصلحة في مصفوفة إسناد المسؤولية (RAM) لقبول النواتج.",
        "correct": false
      },
      {
        "text": "اجمع كل المتطلبات المقدمة من كل صاحب مصلحة على حدة وأدرجها في هيكل تقسيم العمل (WBS).",
        "correct": false
      },
      {
        "text": "بناء فهم مشترك بين أصحاب المصلحة حول المخرجات الرئيسية الموضحة في ميثاق المشروع المعتمد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nخلال اجتماع للفريق، طلب أعضاء الفريق من مدير المشروع تقديم المشورة لهم بشأن التبعيات الداخلية للمشروع. ما الذي يجب أن يطلبه مدير المشروع من الفريق بشأن التبعيات الداخلية؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعرّف على أحدث التغييرات التنظيمية.",
        "correct": true
      },
      {
        "text": "اقرأ عن الاندماج مع منظمة منافسة.",
        "correct": false
      },
      {
        "text": "تحقق من التغييرات المتعلقة بسياسة العمل من المنزل.",
        "correct": false
      },
      {
        "text": "تعرّف على ترقية مزود الإنترنت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام الراعي بإخطار مالك المنتج بأنه تمت الموافقة على ميزانية المشروع. ومع ذلك، فإن أي استثمار إضافي للمشروع يجب أن ينتظر حتى السنة المالية التالية. ويشعر مالك المنتج بالقلق من أن يؤدي ذلك إلى تعطيل المشروع.\nما الذي يجب أن يفعله مالك المنتج؟",
    "explanation": "",
    "choices": [
      {
        "text": "تتبع الميزانية استنادًا إلى خطة الإصدار وإظهار القيمة للأعمال.",
        "correct": true
      },
      {
        "text": "اشرح أن المشروع قد بدأ للتو وأن الميزانية ستحتاج إلى تعديلها",
        "correct": false
      },
      {
        "text": "تتبع الميزانية بناءً على كل سباق سريع وقم بإزالة النواتج التي لا يمكن تحقيقها.",
        "correct": false
      },
      {
        "text": "تأكد من أن مدير المشروع يراقب كل فاتورة من المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "15\nما هي المهارات الشخصية التي يحتاجها مديرو المشاريع أو فرق العمل لمراقبة العلاقات مع أصحاب المصلحة، وتقييم استراتيجيات المشاركة، وتعديل هذه الأساليب حسب الحاجة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستماع الفعال والقيادة والوعي الثقافي والسياسي",
        "correct": true
      },
      {
        "text": "التدريب وصنع القرار والوعي الثقافي والسياسي",
        "correct": false
      },
      {
        "text": "الاستماع الفعال وبناء الفريق والقيادة والتواصل الشبكي",
        "correct": false
      },
      {
        "text": "التواصل والتأثير والوعي الثقافي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "16\nمشروع جديد ينطوي على درجة عالية من عدم اليقين في التكلفة المطلوبة لإنجازه. ما هو النهج الذي ينبغي أن يستخدمه مدير المشروع لتحديد التكاليف المتوقعة؟",
    "explanation": "",
    "choices": [
      {
        "text": "التقدير التناظري",
        "correct": true
      },
      {
        "text": "التقنيات الإحصائية التي تقدر",
        "correct": false
      },
      {
        "text": "التقدير البارامترية",
        "correct": false
      },
      {
        "text": "تقدير ثلاثي النقاط",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام أحد مطوّري التطبيقات بأخذ بطاقة قصة للعمل مكتوب عليها \"يمكن للعميل الدفع باستخدام بطاقة الائتمان\". بعد التنفيذ، تم رفض الوظيفة لأن التطبيق لا يمكن أن يقبل بطاقات الائتمان الأجنبية.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وصف قصة المستخدم بمزيد من التفصيل.",
        "correct": true
      },
      {
        "text": "جدولة قصة المستخدم للتكرار التالي.",
        "correct": false
      },
      {
        "text": "إجراء تهيئة متراكمة متكررة مع الفريق.",
        "correct": false
      },
      {
        "text": "جمع مواصفات متطلبات أكثر تفصيلاً من المستخدمين النهائيين.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "17\nفي أحد البرامج، تقوم عدة مجموعات بتحديد تقنيات حل المشكلات وتقدم كل مجموعة مقترحًا. من بين تلك المقترحات، أي منها صالح؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء فحوصات سلامة المشروع",
        "correct": true
      },
      {
        "text": "قراءة المؤلفات المتعلقة بمجال عملك",
        "correct": false
      },
      {
        "text": "إنشاء صندوق اقتراحات المشاريع",
        "correct": false
      },
      {
        "text": "كل ما سبق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع امتثال جديد يختلف عن المشاريع العادية لأنه سيشمل شركاء متعددي الجنسيات والعديد من الإدارات الحكومية. وسيسفر المشروع عن اعتماد معايير وإجراءات جديدة.\nما الذي يجب أن يفعله مدير المشروع منذ البداية؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكد من تحديد متطلبات العمل والوفاء بها",
        "correct": true
      },
      {
        "text": "التأكد من توفر تصميم الحل منذ بداية المشروع",
        "correct": false
      },
      {
        "text": "ضمان التنفيذ والتسليم بفعالية",
        "correct": false
      },
      {
        "text": "التأكد من تفسير إرشادات الامتثال والتحقق من صحتها",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nيعمل فريق المشروع على تحديد التبعيات لأنشطة مشروع جارٍ. ما الإجراء الذي ينبغي أن يتخذه فريق المشروع أولاً لإدارة التبعيات بنجاح؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراقبة التبعيات وتتبعها.",
        "correct": true
      },
      {
        "text": "توصيل التبعيات إلى الراعي.",
        "correct": false
      },
      {
        "text": "تقييم التبعيات وتوثيقها.",
        "correct": false
      },
      {
        "text": "تعيين مجدولين للمشروع لجميع المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "منشأة مستودع جديد قيد الإنشاء. يقوم مدير المشروع بتنفيذ جهود تطوير الفريق مثل التدريب الذي سيؤدي إلى انخفاض نسبة العيوب.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم برنامج تدريبي.",
        "correct": true
      },
      {
        "text": "تحديث خطة إدارة الموارد.",
        "correct": false
      },
      {
        "text": "زيادة مراجعات مراقبة الجودة.",
        "correct": false
      },
      {
        "text": "إضافة تكاليف التدريب إلى الميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "واجه فريق المشروع مؤخرًا تأخيرات بسبب عدم الامتثال مما جعل الجدول الزمني للمشروع أقل مرونة وزاد من مخاطر التكلفة وسوء الجودة. ويقوم الفريق بتبادل الأفكار حول سبل تجنب ذلك في المستقبل.\nما هي الآثار البعيدة المدى المترتبة على المنظمة إذا لم يتم حل مشكلة عدم الامتثال هذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "بقاء الأعمال واستمراريتها",
        "correct": true
      },
      {
        "text": "عملاء غير راضين أو مستخدمين نهائيين غير راضين",
        "correct": false
      },
      {
        "text": "استجابة أبطأ للنظام",
        "correct": false
      },
      {
        "text": "الغرامات والعقوبات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير المشروع في مشروع الذكاء الاصطناعي بكياسة وثقة. فهم يقدمون الدعم، ويستمعون بانتباه، ويسمحون لأعضاء فريقهم بالعمل تحت إشراف قليل.\nما هو نموذج سلوك العامل الذي يظهره مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "نظرية التوقع",
        "correct": true
      },
      {
        "text": "النظرية X",
        "correct": false
      },
      {
        "text": "النظرية Y",
        "correct": false
      },
      {
        "text": "نظرية Z",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "2\nقرر مدير المشروع إشراك طرف ثالث لإدارة مخاطر المشروع نظرًا لأن لديه خبرة أكبر من فريق المشروع الحالي. ما هو نوع استراتيجية الاستجابة التي طبقها مدير المشروع لمعالجة مخاطر المشروع بشكل عام؟",
    "explanation": "",
    "choices": [
      {
        "text": "تجنب",
        "correct": true
      },
      {
        "text": "الاستغلال",
        "correct": false
      },
      {
        "text": "التحويل",
        "correct": false
      },
      {
        "text": "تقليل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع تم تعيينه حديثاً يدير مشروعاً للمرة الأولى ويشعر بالقلق من تزايد التوترات. فأعضاء فريق المشروع يتجادلون خلال مرحلة تتطلب جهداً مكثفاً وقد أعرب أصحاب المصلحة عن بعض الشكوك حول أداء المشروع. في مناقشة مع مدير المشروع الأقدم، يعترف مدير المشروع الجديد بأن لديه خوفاً من النزاع ويسأل مدير المشروع الأقدم عن كيفية تصوره للنزاع.\nكيف ينبغي لمدير المشروع الأقدم أن يستجيب؟",
    "explanation": "",
    "choices": [
      {
        "text": "الصراع في المشاريع أمر لا مفر منه - ركز على إدارته.",
        "correct": true
      },
      {
        "text": "يمكن منع حدوث تضارب في المشاريع - إعادة تخطيط التخفيف من حدة المشكلة.",
        "correct": false
      },
      {
        "text": "التعارض في المشاريع كارثي - قم بإعداد خطة للتعافي.",
        "correct": false
      },
      {
        "text": "الصراع في المشاريع أمر صحي - امتنع عن التدخل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "21\nيقوم مدير مشروع بتقييم فرصتين استثماريتين. من المتوقع أن يولد المشروع (أ) تدفقات نقدية قدرها دولار واحد في السنة لمدة خمس سنوات باستثمار أولي قدره 35 دولاراً. من المتوقع أن يولد المشروع (ب) تدفقات نقدية بقيمة دولار أمريكي سنويًا لمدة خمس سنوات باستثمار مبدئي قدره 25 دولارًا أمريكيًا. معدل العائد المطلوب للشركة هو 1%. ما هو صافي القيمة الحالية (NPV) لكل مشروع، وأيهما يجب أن يوصي به مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) - 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) - 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بالمشروع (ب) لأن صافي القيمة الصافية قبل خصم القيمة العادلة.",
        "correct": true
      },
      {
        "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بأي من المشروعين لأن صافي القيمة الحالية للمشروع (أ) متشابهة.",
        "correct": false
      },
      {
        "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) - 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) - 1,5.3 دولار أمريكي. وينبغي لمدير المشروع ألا يوصي بأي من المشروعين لأن كلاهما له قيمة صافي ربحية سلبية.",
        "correct": false
      },
      {
        "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بالمشروع (أ) لأن صافي القيمة الصافية قبل خصم القيمة الحالية أعلى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "22\nأعرب بعض أعضاء الفريق المكلفين بمشروع تكنولوجي جديد عن عدم معرفتهم بالتكنولوجيا والتحديات التي سيواجهونها أثناء التنفيذ. ماذا يجب على مدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "نظرًا لتواريخ استحقاق المشروع، استبدل الأعضاء بموظفين أكثر دراية.",
        "correct": true
      },
      {
        "text": "اطلب من أعضاء الفريق القيام ببعض الأبحاث وجهود التعلم الذاتي حول التكنولوجيا.",
        "correct": false
      },
      {
        "text": "إعادة توزيع الأعضاء للعمل على المهام المختلفة التي لديهم خبرة فيها وإتمامها.",
        "correct": false
      },
      {
        "text": "طمأنة أعضاء الفريق بوجود مسار تدريبي لتعلم التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا رشيقًا. بالنسبة للتكرارات من الأول إلى الخامس، يعرض مخطط سرعة الفريق نقطة قصة واحدة، و3 نقاط قصة، و22 نقطة قصة، و23 نقطة قصة، و22 نقطة قصة.\nما الذي توضحه هذه المعلومات عن أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "لا يتبع الفريق الممارسات الرشيقة بشكل صحيح.",
        "correct": true
      },
      {
        "text": "تستقر سرعة الفريق بمرور الوقت.",
        "correct": false
      },
      {
        "text": "الفريق متأخر عن الجدول الزمني.",
        "correct": false
      },
      {
        "text": "يحتاج الفريق إلى تغيير منهجيته الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تنفيذ المشروع يتم تنفيذ دورة حياة المشروع على أنها تنبؤية؛ ومع ذلك، سيتم تسليم النواتج الرئيسية بشكل تدريجي إلى العميل. تكون الموارد المعينة من ذوي الخبرة والموثوقية ومستعدة لاتخاذ القرارات التي اعتاد مدير المشروع على اتخاذها بعد كل تسليم تدريجي في مشاريع أخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أبلغ الفريق أنه على الرغم من أن هذه بيئة مختلطة، يجب أن يظل مدير المشروع مسؤولاً عن اتخاذ القرارات.",
        "correct": true
      },
      {
        "text": "استشر مالك المنتج حول السماح للموارد باتخاذ القرارات.",
        "correct": false
      },
      {
        "text": "دعم قرارات الفريق ونقل مسؤولية اتخاذ القرارات إليهم.",
        "correct": false
      },
      {
        "text": "حدد موعدًا لاجتماع اللجنة التوجيهية واحصل على موافقتها على الطلب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "25\nيكتشف مدير مشروع وجود عيب كبير في أحد نواتج المشروع الرئيسية. ما هي عملية إدارة المشروع التي يتم إجراؤها؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة الجودة",
        "correct": true
      },
      {
        "text": "مراقبة الجودة",
        "correct": false
      },
      {
        "text": "إدارة جودة الخطة",
        "correct": false
      },
      {
        "text": "أخذ العينات الإحصائية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "26\nيصر أحد أصحاب المصلحة في المشروع على إضافة ميزة إضافية إلى منتج المشروع دون تغيير النطاق أو الميزانية أو الجدول الزمني. يسمح مدير المشروع بتضمين هذه الميزة لأنها تضيف قيمة كبيرة للمنتج النهائي. ومع ذلك، يكتشف مدير المشروع أن إضافة هذه الميزة قد أدت إلى إطالة الجدول الزمني للمشروع وزيادة تكاليف المشروع.\nما العملية التي كان ينبغي على مدير المشروع اتباعها قبل تضمين ميزة المنتج الإضافية؟",
    "explanation": "",
    "choices": [
      {
        "text": "التحكم في التغيير",
        "correct": true
      },
      {
        "text": "تخطيط الجدول الزمني",
        "correct": false
      },
      {
        "text": "تخطيط المشتريات",
        "correct": false
      },
      {
        "text": "تدقيق الجودة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه فريق المشروع اتخاذ قرار بشأن الخطوات التالية التي يجب اتخاذها من أجل معالجة التأخيرات في الجدول الزمني للمهام التي تم تحديدها مؤخرًا. ويتوقع مدير المشروع من أعضاء الفريق اتخاذ القرارات المناسبة للمهام الموكلة إليهم على التوالي والمضي في تنفيذها.\nما نوع أسلوب القيادة الذي يستخدمه مدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "ديمقراطية",
        "correct": true
      },
      {
        "text": "استبدادي",
        "correct": false
      },
      {
        "text": "إطلاق العنان",
        "correct": false
      },
      {
        "text": "التنعيم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "27\nأي من أدوات المشروع التالية لا تستخدم نظام WBS كمدخلات؟",
    "explanation": "",
    "choices": [
      {
        "text": "الجدول الزمني للمشروع",
        "correct": true
      },
      {
        "text": "نطاق المشروع",
        "correct": false
      },
      {
        "text": "خطة إدارة المخاطر",
        "correct": false
      },
      {
        "text": "خطة الجودة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تستخدم إحدى الشركات منهجية Lean Six Sigma في أحد المشاريع. في منتصف المشروع، دُعي استشاري خارجي في منهجية اللين الستة سيجما لإجراء تدقيق للتأكد من تطبيق المنهجية بشكل صحيح\nما العملية التي يتم استخدامها؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة الجودة",
        "correct": true
      },
      {
        "text": "مراقبة الجودة",
        "correct": false
      },
      {
        "text": "إجراء تحليل نوعي للمخاطر",
        "correct": false
      },
      {
        "text": "إدارة جودة الخطة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "2\nبعد أن قامت إحدى المنظمات بتدريب وتنفيذ تطبيق برمجيات جديدة إلزامية لإدارة المشاريع لجميع موظفي المشروع، لاحظ مدير المشروع أن العديد من أعضاء الفريق أظهروا مستويات منخفضة من الالتزام بالبرنامج الجديد. ما سبب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "الخوف من المجهول",
        "correct": true
      },
      {
        "text": "نقص المهارات المطلوبة",
        "correct": false
      },
      {
        "text": "عدم وجود رؤية واضحة للمشروع",
        "correct": false
      },
      {
        "text": "الكثير من التواصل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء إقفال المشروع، يجد مدير المشروع صعوبة في الحصول على ردود فعل ناجحة لإنجاز المشروع. فبعض أصحاب المصلحة لا يوافقون على معايير نجاح المشروع ويشعرون بالإحباط من المشروع منذ البداية.\nإلى ماذا يجب أن يشير مدير المشروع لمعالجة هذه المخاوف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ميثاق المشروع",
        "correct": true
      },
      {
        "text": "خطة إدارة الجودة",
        "correct": false
      },
      {
        "text": "بيان النطاق",
        "correct": false
      },
      {
        "text": "وثائق المتطلبات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير المشروع (ب): يتمتع بخبرة معتدلة خاصة في مشاريع البناء، متاح في اليوم التالي لمدة أسبوع واحد\nأي مدير مشروع يجب أن يختاره مدير مكتب إدارة المشاريع وعلى أي أساس؟",
    "explanation": "",
    "choices": [
      {
        "text": "أ متاح على الفور ولديه خبرة أكبر للتخطيط بسرعة وبشكل صحيح.",
        "correct": true
      },
      {
        "text": "ب يفهم بشكل أفضل تعقيدات التخطيط التنبؤي ويستعين بشبكة من الخبراء المتخصصين (SMEs).",
        "correct": false
      },
      {
        "text": "أ أكثر حداثة وإلمامًا بأحدث اتجاهات ومنهجيات تخطيط المشاريع.",
        "correct": false
      },
      {
        "text": "ب سيكون متاحًا للعمل لفترة أطول في حالة الخطأ في الموعد النهائي للتقديم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nحدد فريق مدير المشروع عدم وجود توقعات مناسبة لنقل المعرفة في المشروع. أي من العقبات لا تنطبق في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة منهجية للمشروع المنجز",
        "correct": true
      },
      {
        "text": "التعامل مع الإخفاقات والأخطاء الشخصية",
        "correct": false
      },
      {
        "text": "عدم كفاية الدافع الفردي لتوثيق الدروس المستفادة",
        "correct": false
      },
      {
        "text": "مشاركة القيادة المتفرقة لتعزيز نقل المعرفة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع مع فريق لتطوير حزم العمل. لاحظ مدير المشروع وجود فجوة في عملية جمع المتطلبات حيث كانت هناك نقاط مهمة مفقودة، مما يؤثر على الجدول الزمني للمشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاجتماع مع راعي المشروع لمناقشة إلغاء المشروع.",
        "correct": true
      },
      {
        "text": "الاجتماع مع راعي المشروع وأصحاب المصلحة لطلب زيادة الميزانية.",
        "correct": false
      },
      {
        "text": "اجتمع مع مدير المنتج لإنشاء عمل متراكم بالمتطلبات الناقصة.",
        "correct": false
      },
      {
        "text": "قم بتقييم الأثر وتحديث سجل المخاطر وعرضه على أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "32\nأي مما يلي ليس قوة قائمة على الموارد فيما يتعلق بالمشاريع الضخمة؟",
    "explanation": "",
    "choices": [
      {
        "text": "التوظيف على أساس تعاقدي",
        "correct": true
      },
      {
        "text": "توظيف المواهب الخبيرة",
        "correct": false
      },
      {
        "text": "التوظيف على أساس الإعارة",
        "correct": false
      },
      {
        "text": "التوظيف عن طريق التحكم المباشر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تفكر إحدى الشركات في اعتماد المنهجية الرشيقة للمشاريع المستقبلية. يقود مدير المشروع مناقشة تركز على الفوائد المرتبطة بالمنهجية الرشيقة.\nأي من النقاط التالية يجب على مدير المشروع تسليط الضوء عليها؟",
    "explanation": "",
    "choices": [
      {
        "text": "الشفافية أمر أساسي، والتسليم المبكر والموثوق به، والمنهجية تتبنى التغيير",
        "correct": true
      },
      {
        "text": "طريقة تعتمد على المنتج، وتقسم المشاريع إلى مراحل قيمة، وتركز على مبررات العمل",
        "correct": false
      },
      {
        "text": "توجد وثائق واضحة، ونقطة مسؤولية واحدة، وتعاون فعال",
        "correct": false
      },
      {
        "text": "عدم العمل لوقت إضافي إن أمكن، والتواصل وجهاً لوجه والنظر باستمرار إلى الوراء للمضي قدماً",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nيعمل الفريق منذ شهرين وقد فاتته باستمرار قصص المستخدمين المخطط لها. كيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعزيز تغيير مدة التكرار من أجل الالتزام بما هو مخطط له",
        "correct": true
      },
      {
        "text": "تأكد من أن حجم العدو السريع مناسب لمدة التكرار.",
        "correct": false
      },
      {
        "text": "الانخراط في توظيف مورد من ذوي المهارات العالية لتعزيز المهارات.",
        "correct": false
      },
      {
        "text": "فكر في استخدام نظام المكافآت لتشجيع التسليم في الوقت المناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nيسعى مدير المشروع إلى التخفيف من عبء العمل في قسم تكنولوجيا المعلومات مع تمكين الأعمال من بدء عمليات التنفيذ الجديدة وإرساء الأساس للحلول المستقبلية. كيف ينبغي لمدير المشروع تسهيل هذا الانتقال؟",
    "explanation": "",
    "choices": [
      {
        "text": "فرض سياسات حوكمة صارمة لتكنولوجيا المعلومات مركزية داخل قسم تكنولوجيا المعلومات، مما يضمن التوحيد والسيطرة على جميع مساعي تكنولوجيا المعلومات.",
        "correct": true
      },
      {
        "text": "تفويض مقترحات مشاريع تكنولوجيا المعلومات الشاملة إلى قسم تكنولوجيا المعلومات لتقييمها والموافقة عليها قبل البدء في أي مشروع.",
        "correct": false
      },
      {
        "text": "تمكين وحدات الأعمال من استخدام منصة مبسطة لإدارة مشاريع تكنولوجيا المعلومات لبدء المشاريع ومراقبتها بشكل مستقل.",
        "correct": false
      },
      {
        "text": "التعاون مع فرق عمل تكنولوجيا المعلومات متعددة الوظائف لتخطيط وتنفيذ مشاريع تكنولوجيا المعلومات بشكل مشترك، وتعزيز التعاون بين أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "35\nيعمل مدير مشروع على إدارة المتطلبات في شركة أدوية. ما هو التحسين الذي ينبغي أن تتوقعه مؤسسة مدير المشروع كنتيجة للمشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "جودة منخفضة",
        "correct": true
      },
      {
        "text": "زيادة التكاليف",
        "correct": false
      },
      {
        "text": "تقليل المخاطر",
        "correct": false
      },
      {
        "text": "زيادة الجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء وضع خطة إدارة أصحاب المصلحة لمشروع كبير، ينظم مدير المشروع ورشة عمل لتحديد وتقييم قوة أصحاب المصلحة وتأثيرهم. نظرًا لضيق الوقت، يمكن أن تستغرق ورشة العمل يومًا واحدًا فقط.\nما الذي يجب على مدير المشروع فعله لتحقيق هذا الهدف ضمن الإطار الزمني لورشة العمل؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدام مصفوفة القوة-المصلحة",
        "correct": true
      },
      {
        "text": "استخدام تقنية المجموعة الاسمية",
        "correct": false
      },
      {
        "text": "استخدام نموذج مكعب أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "استخدم مخطط باريتو البياني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مدير المشروع بالتواصل مع الجهة الراعية ومناقشة المخاوف المتعلقة بعدم الامتثال. ويدرك مدير المشروع أن هذا يمكن أن يكون حالة تدقيق محتملة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "لا تفعل شيئًا واستمر في العمل كما في السابق، على افتراض أنه سيكون هناك تدقيق.",
        "correct": true
      },
      {
        "text": "فك ارتباط القسم غير الملتزم، حيث أن هذا الأمر يمثل مشكلة",
        "correct": false
      },
      {
        "text": "افصح عن مصدر المشكلة للمراجعين ودعهم يتخذون القرار.",
        "correct": false
      },
      {
        "text": "الحصول على الالتزام والموافقة من القيادة على عدم الامتثال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "المشروع (أ) = 5%، المشروع (ب) = 5%، المشروع (ج) = 3%، المشروع (د) = 1%.\nأي من هذه المشاريع يجب اختياره بناءً على أرقام معدل العائد الداخلي المقدمة؟",
    "explanation": "",
    "choices": [
      {
        "text": "المشروع أ",
        "correct": true
      },
      {
        "text": "المشروع ب",
        "correct": false
      },
      {
        "text": "المشروع ج",
        "correct": false
      },
      {
        "text": "المشروع دال",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع بإدارة مشروع رشيق. مدير مكتب إدارة المشاريع ليس على دراية بالتسليم الرشيق.\nأي من العبارات التالية تصف النهج الرشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستجابة للتغيير على اتباع خطة",
        "correct": true
      },
      {
        "text": "تعاون العملاء على اتباع خطة",
        "correct": false
      },
      {
        "text": "الاستجابة للتغيير على العمليات والأدوات",
        "correct": false
      },
      {
        "text": "تعاون العملاء على الاختبار الشامل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اجتماع الفريق، يتجادل اثنان من أعضاء الفريق الذين عملوا على نفس المهام حول من هو المخطئ في تأخر المهمة. لا يريد أي منهما أن يُنظر إليه على أنه المتسبب في التأخير.\nما هو السبب الأرجح لهذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الأولويات المتضاربة",
        "correct": true
      },
      {
        "text": "مسؤوليات غير واضحة",
        "correct": false
      },
      {
        "text": "المنافسة الشخصية",
        "correct": false
      },
      {
        "text": "اختيار الموظفين",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nيجب أن يكون مديرو المشاريع قادرين على تحديد العيوب التي تسبب أخطاء في اتخاذ القرارات. ما هو الخيار الذي من شأنه أن يساعد مدير المشروع على اتخاذ القرارات المثلى؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستفادة من التحيزات",
        "correct": true
      },
      {
        "text": "استخدام افتراضات خاطئة",
        "correct": false
      },
      {
        "text": "التحقق مع الآخرين",
        "correct": false
      },
      {
        "text": "تطبيق الأخطاء المنطقية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لمشروع ما مع عمليات التسليم التدريجي، يدرك الفريق أنه سيحتاج إلى خبرة محددة لأحد المخرجات في نهاية المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإلحاق الفريق بالتدريب حتى يتمكنوا من التزود بالخبرات اللازمة.",
        "correct": true
      },
      {
        "text": "طلب توافر الموارد اللازمة ذات الخبرة من الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق اكتساب الخبرة من خلال التعلم الذاتي.",
        "correct": false
      },
      {
        "text": "تحديد اتفاقية العمل ومشاركتها مع الفريق لتنسيق الأنشطة لاكتساب الخبرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع في شركة سيارات ناجحة ذات معايير جودة عالية. ويحتاج مدير المشروع إلى التأكد من أنه ينشئ شبكة WBS عالية الجودة.\nأي مما يلي ليس من الخصائص الرئيسية لنمط مخطط الشبكة WBS عالي الجودة؟",
    "explanation": "",
    "choices": [
      {
        "text": "موجه نحو التسليم",
        "correct": true
      },
      {
        "text": "التسلسل الهرمي",
        "correct": false
      },
      {
        "text": "قاعدة 1%",
        "correct": false
      },
      {
        "text": "التركيز على العملاء",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل فريق المشروع للتو مسحًا بيئيًا واكتشفوا الكثير من العوائق ذات الصلة التي يمكن أن تؤثر سلبًا على تنفيذ المشروع. يعمل مدير المشروع مع الفريق لفهم تفاصيل كل عائق تم تحديده وكيفية ارتباط العوائق ببعضها البعض، من أجل فهم التعقيد الكلي للمشروع. سيمكن ذلك الفريق من التوصل إلى خطة تعالج التحديات التي تم تحديدها\nأي من الأساليب التالية استخدمها مدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل باريتو",
        "correct": true
      },
      {
        "text": "التحليل النقدي",
        "correct": false
      },
      {
        "text": "التفكير النُظُمي",
        "correct": false
      },
      {
        "text": "إدارة الجودة الشاملة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل فريق المشروع مشروع بنجاح مشروعاً. بدأ نفس الفريق وثلاثة أشخاص جدد مشروعًا آخر بقيادة مدير جديد في سكروم.\nكيف سيقود مدير سكروم الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "عالية التوجيه، عالية الدعم",
        "correct": true
      },
      {
        "text": "منخفضة التوجيه، عالية الدعم",
        "correct": false
      },
      {
        "text": "عالية التوجيه، منخفضة الدعم",
        "correct": false
      },
      {
        "text": "منخفضة التوجيه، منخفضة الدعم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود فريقاً في مشروع تطوير جديد. يتكون الفريق من مجموعة متنوعة من الأشخاص ذوي الشخصيات وأساليب العمل المختلفة. ويلتزم مدير المشروع بإنشاء فريق متماسك ومنتج، لذلك قرر تقديم نموذج سلوك DISC لمساعدة أعضاء الفريق على فهم بعضهم البعض بشكل أفضل.\nاستنادًا إلى نموذج سلوك DISC، أي من الخصائص التالية أفضل وصف لأسلوب التأثير؟",
    "explanation": "",
    "choices": [
      {
        "text": "مباشر وموجه نحو تحقيق النتائج وحازم",
        "correct": true
      },
      {
        "text": "منفتح ومتحمس ومتفائل",
        "correct": false
      },
      {
        "text": "متعاون، صبور، متواضع، لبق، متواضع، لبق",
        "correct": false
      },
      {
        "text": "تحليلية ومتحفظة ودقيقة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "شركة لديها عقد قائم لصيانة وتحسين قاعدة بيانات عميل أحد العملاء. يقوم القسم القانوني للشركة بإبلاغ مدير المشروع بأن تشريعًا جديدًا يتطلب حماية أكثر صرامة لمعلومات العملاء قد يتم توقيعه قريبًا ليصبح قانونًا. وسيتطلب القانون تطبيق ميزات أمنية إضافية في قاعدة البيانات التي يقوم مدير المشروع بصيانتها. لم يتم تضمين هذه الميزات في نطاق العقد الحالي.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب دعم راعي المشروع للتأثير على العميل لتعديل العقد على الفور.",
        "correct": true
      },
      {
        "text": "اطلب من القسم القانوني إثارة المسألة في مفاوضات العقد التالي مع العميل.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر مع المشكلة وتخطيط الاستجابة للمخاطر مع راعي المشروع والعميل.",
        "correct": false
      },
      {
        "text": "انتظر حتى يتم الانتهاء من المتطلبات القانونية حتى يمكن تحديد التغيير في النطاق بشكل ملموس",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "3\nما هو العنصر الأساسي للحفاظ على دعم والتزام جميع أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الصدق",
        "correct": true
      },
      {
        "text": "التواصل الفعال",
        "correct": false
      },
      {
        "text": "الشفافية",
        "correct": false
      },
      {
        "text": "الموثوقية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في نهاية المشروع للسماح بتهدئة النزاع وتسجيله في الدروس المستفادة\nأثناء تنفيذ المشروع، تنشأ مشكلة تتطلب تنفيذ خطة الطوارئ الخاصة بالمشروع، مما يؤثر على الجدول الزمني للمشروع. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الشروع في تدقيق المخاطر.",
        "correct": true
      },
      {
        "text": "إصدار طلب تغيير.",
        "correct": false
      },
      {
        "text": "مراجعة تأثير التكلفة.",
        "correct": false
      },
      {
        "text": "تحديث خطة الطوارئ.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يفكر مدير مشروع في إحدى المؤسسات في تنفيذ مشروع رشيق في التنفيذ. ولدى المنظمة مكتب قوي لإدارة المشاريع (PMO) وعملية واضحة المعالم للتحكم في التغيير.\nما هو الجانب الرئيسي في تنفيذ المشاريع الرشيقة الذي يجب على مدير المشروع التأكيد عليه باعتباره الحجة الأكثر إقناعاً لاعتماده؟",
    "explanation": "",
    "choices": [
      {
        "text": "يمكن للتسليم الرشيق تحسين الجودة من خلال التسليم التدريجي وإصلاح العيوب بكفاءة.",
        "correct": true
      },
      {
        "text": "توفر فرق العمل الرشيقة المرونة في استيعاب التغييرات المخطط لها مع تبسيط عملية الموافقة.",
        "correct": false
      },
      {
        "text": "يستخدم مالك المنتج قائمة تعرف باسم قائمة الأعمال المتراكمة لتحديد أولويات عناصر العمل، بما في ذلك التغييرات المخطط لها.",
        "correct": false
      },
      {
        "text": "إن التسليم الرشيق مناسب تمامًا للتعامل مع التغييرات غير المتوقعة وتوقعات الأعمال المتغيرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتطلب أحد المشاريع خدمات بائع متخصص لتركيب قطعة معقدة ومكلفة للغاية من المعدات. أرسل مدير المشروع بريدًا إلكترونيًا قبل أسبوع إلى أحد الشركاء لطلب حضور أحد المتخصصين إلى الموقع. لسوء الحظ، لم يرد البائع للتأكيد.\nما هي طريقة التواصل المستخدمة في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسحب",
        "correct": true
      },
      {
        "text": "تفاعلية",
        "correct": false
      },
      {
        "text": "ادفع",
        "correct": false
      },
      {
        "text": "العلاقات بين الأشخاص",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا يتم تنفيذه في وقت واحد في بلدين بفارق 11 ساعة في التوقيت. ويحتاج مدير المشروع إلى تحديد وقت مناسب للطرفين لتزويد أصحاب المصلحة بمعلومات عن الجدول الزمني للمشروع وتكلفته والتقدم المحرز في الأداء.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم الساعة العالمية لتحديد بعض الأوقات المحتملة التي تناسب جميع الأطراف المعنية.",
        "correct": true
      },
      {
        "text": "أرسل استبياناً إلى أصحاب المصلحة تسألهم فيه عن مدى تفرغهم خلال الأسبوع.",
        "correct": false
      },
      {
        "text": "جدولة اجتماعين منفصلين، واحد لأصحاب المصلحة في كل بلد.",
        "correct": false
      },
      {
        "text": "سجل الاجتماع وأرسله إلى أصحاب المصلحة لمشاهدته في وقتهم الخاص.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق المشروع بعملية تحديد الفوائد المرتبطة بمشروعين من أجل اختيار المشروع الذي سيحقق قيمة أكبر للأعمال. وتتضمن المهمة تحليل المشروع الذي يساعد الشركة على أفضل وجه في تلبية متطلبات الامتثال والمتطلبات التنظيمية، فضلاً عن تحسين رضا العملاء.\nأي مما يلي أفضل وصف لفئة الفوائد التي يتم تحليلها في هذه المهمة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الفائدة الكمية",
        "correct": true
      },
      {
        "text": "الفائدة النوعية",
        "correct": false
      },
      {
        "text": "مزايا الجودة",
        "correct": false
      },
      {
        "text": "فائدة حقيقية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nأثناء تخطيط الإصدار، ينشأ تعارض بين أصحاب المصلحة فيما يتعلق بتحديد أولويات بعض الاحتياجات، مما يؤدي إلى فقدان فريق التطوير للتركيز. لمواءمة جميع أصحاب المصلحة وحل هذا النزاع، ما هو أسلوب حل النزاعات الذي ينبغي لمدير المشروع أن يستخدمه؟",
    "explanation": "",
    "choices": [
      {
        "text": "الإجبار",
        "correct": true
      },
      {
        "text": "التعاون",
        "correct": false
      },
      {
        "text": "الانسحاب",
        "correct": false
      },
      {
        "text": "التنعيم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع فريق مشروع يتألف من أعضاء من أقسام مختلفة، بما في ذلك الهندسة والتسويق والمبيعات. أثناء عملية التطوير، ينشأ تعارض بين فريقي الهندسة والتسويق. يركز الفريق الهندسي على تسليم المنتج في الوقت المحدد وفي حدود الميزانية، بينما يركز فريق التسويق على ضمان تلبية المنتج لاحتياجات السوق المستهدفة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اقترح أن يتنازل كل من فريقي الهندسة والتسويق عن شيء ما للتوصل إلى اتفاق.",
        "correct": true
      },
      {
        "text": "اقترح أن يعمل فريقا الهندسة والتسويق معًا لإيجاد حل يناسب كلا الفريقين.",
        "correct": false
      },
      {
        "text": "اقترح أن يكون الفريق الهندسي على صواب وضمان تسليم المنتج في الوقت المحدد وفي حدود الميزانية.",
        "correct": false
      },
      {
        "text": "اقترح أن تتنافس فرق الهندسة والتسويق لمعرفة من يمكنه التوصل إلى أفضل الحلول.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتاج العميل إلى معرفة حالة المنتج والمشروع ككل والخطوات التالية المخطط لها في الشهر التالي كل شهر.\nكيف يجب على مدير المشروع التواصل مع هذا العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إرسال رسالة بريد إلكتروني أسبوعية عن الحالة الأسبوعية، بما في ذلك تقييم كامل للقيمة المكتسبة.",
        "correct": true
      },
      {
        "text": "إنشاء تقرير حالة شهري وإدراج المشكلات الفنية كمرفق.",
        "correct": false
      },
      {
        "text": "قم بإجراء مكالمة شهرية مع العميل لتلخيص ما حدث مؤخرًا وتقديم مراجعة عامة للمنتج.",
        "correct": false
      },
      {
        "text": "عرض التقدم المحرز في المشروع على دفعات شهرية مع التحقق من صحة الحالة بشكل رسمي وشامل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "متطلبات الامتثال لا يمكن اعتبارها من أصول المنظمة ويجب تضمينها في تقرير فترة السنتين\nيتلقى فريق ما نواتج تمت الاستعانة بمصادر خارجية ويقرر أنها لا تفي بمعايير القبول المتفق عليها ما الذي يجب على مدير المشروع الرجوع إليه للتحقق من ذلك مع البائع؟",
    "explanation": "",
    "choices": [
      {
        "text": "خطة إدارة المشتريات",
        "correct": true
      },
      {
        "text": "طلب تقديم العروض (RFP)",
        "correct": false
      },
      {
        "text": "بيان العمل (SOW)",
        "correct": false
      },
      {
        "text": "عمليات التفتيش",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "5\nيحتاج مدير المشروع في مؤسسة متعددة الوظائف إلى إبلاغ مدير المشروع مدير الإدارة بعدد ونوع الموارد المطلوبة، والمدة الزمنية التي سيحتاجها مدير المشروع ما الذي يجب أن يستخدمه مدير المشروع لتقديم معلومات الموارد هذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعيينات الموارد",
        "correct": true
      },
      {
        "text": "الرسم البياني للموارد",
        "correct": false
      },
      {
        "text": "مصفوفة إسناد المسؤولية (RAM)",
        "correct": false
      },
      {
        "text": "المخطط التنظيمي للمشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "انضم مدير مشروع مؤخرًا إلى مؤسسة جديدة. راعي المشروع هو خبير في الموضوع ويريد إدارة النطاق من خلال تقديم زيادات صغيرة وتغيير النطاق بناءً على الملاحظات.\nأي من الطرق التالية ينبغي أن يكون الخيار الموصى به؟",
    "explanation": "",
    "choices": [
      {
        "text": "سكروم",
        "correct": true
      },
      {
        "text": "الشلال",
        "correct": false
      },
      {
        "text": "كانبان",
        "correct": false
      },
      {
        "text": "تنبؤي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يريد مدير المشروع تحفيز أعضاء فريقه وتحسين أداء المشروع.\nما النهج الذي من المرجح أن يكون أكثر فعالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "كافئ جميع أعضاء الفريق على قدم المساواة بمنحهم جوائز رسمية للاعتراف بإنجازاتهم علنًا.",
        "correct": true
      },
      {
        "text": "تنفيذ المبادرات بناءً على فهم مدير المشروع لما يحفز الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتفويض التحفيز لأعضاء الفريق، على افتراض أنهم محترفون يتمتعون بالتحفيز الذاتي.",
        "correct": false
      },
      {
        "text": "تقديم مجموعة متنوعة من الحوافز التحفيزية المصممة خصيصًا لتلبية احتياجات أعضاء الفريق الفردية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنت مدير المشروع في مؤسسة تطبق التسليم الرشيق. لديك خبرة كمدير سكروم وستؤدي هذا الدور بالإضافة إلى مسؤوليات إدارة المشروع. يريد أحد أعضاء الفريق معرفة ما هو التركيز الرئيسي للقائد الخادم.\nماذا سيكون ردك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إرضاء العميل وإثبات القيمة المقدمة.",
        "correct": true
      },
      {
        "text": "نمو ورفاهية الأشخاص والمجتمعات التي ينتمون إليها.",
        "correct": false
      },
      {
        "text": "إدارة توقعات أصحاب المصلحة والتواصل معهم.",
        "correct": false
      },
      {
        "text": "الإنتاجية والكفاءة لتحقيق الالتزامات التي تم التعهد بها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير المشروع (ب) لاستلام المشروع من مدير المشروع (أ) مدير المشروع (ب) يبلغ مدير المشروع (ب) أن المشروع يسير وفق الجدول الزمني المحدد، فقط لأن مدير المشروع (أ) يدفع الفريق باستمرار إلى الأداء.\nما هو أول إجراء يجب أن يتخذه مدير المشروع (ب) بصفته مدير المشروع الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من حالة المخاطر.",
        "correct": true
      },
      {
        "text": "تحقق من أداء التكلفة.",
        "correct": false
      },
      {
        "text": "تحديد استراتيجية الإدارة.",
        "correct": false
      },
      {
        "text": "أخبر الفريق بالأهداف الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع مختلط. اتصل أحد أصحاب المصلحة مباشرة بأحد أعضاء الفريق وطلب إجراء تغيير. وبسبب هذا الطلب، تم تشتيت انتباه عضو الفريق عن عمله، مما تسبب في خسارة في الإنتاجية.\nما الذي يجب أن يفعله عضو الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "أبلغ صاحب المصلحة أن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى مدير المشروع.",
        "correct": true
      },
      {
        "text": "أبلغ صاحب المصلحة أن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "قم بإبلاغ مسؤول سكروم بطلب أصحاب المصلحة للتغيير وتأثير ذلك على الإنتاجية.",
        "correct": false
      },
      {
        "text": "أبلغ مسؤول سكروم الرئيسي حتى يمكن مناقشة التغيير مباشرة مع صاحب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "5\nتم تكليف فريق مشروع ببناء منتج جديد. يبني الفريق العرض التوضيحي أولاً ثم يضيف ميزات إلى المنتج الأولي. هذا مثال على أي ممارسة تقنية؟",
    "explanation": "",
    "choices": [
      {
        "text": "التطوير القائم على الاختبار (TDD)",
        "correct": true
      },
      {
        "text": "التسليم المستمر",
        "correct": false
      },
      {
        "text": "التطوير القائم على السلوك",
        "correct": false
      },
      {
        "text": "المسامير",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "55\nفي أي مرحلة من مراحل نموذج توكمان لتطوير الفريق يجب أن يركز مدير المشروع على زيادة تحفيز الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "التشكيل",
        "correct": true
      },
      {
        "text": "اقتحام",
        "correct": false
      },
      {
        "text": "المعيار",
        "correct": false
      },
      {
        "text": "الأداء",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مدير المشروع بإجراء تغييرات متعلقة بالامتثال من خلال اعتماد نهج جديد لتنفيذ المشروع. وأثناء المراجعة الخارجية للحسابات، كشفت مراجعة الحسابات أن بعض الأعمال المكونة للمشروع لم تكن مطابقة لمعايير المنظمة.\nماذا كان ينبغي لمدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ المنجزات المتوافقة فقط.",
        "correct": true
      },
      {
        "text": "تفسير واضح لإرشادات الامتثال.",
        "correct": false
      },
      {
        "text": "ترجمة متطلبات العمل المترجمة إلى تصميم.",
        "correct": false
      },
      {
        "text": "بحث اللوائح التنظيمية في القطاع العام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "56\nأي مما يلي يختلف عن الخيارات الأخرى لإدارة أصحاب المصلحة الخارجيين في المشاريع الضخمة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الإقناع",
        "correct": true
      },
      {
        "text": "الإنابة",
        "correct": false
      },
      {
        "text": "الأخذ والعطاء",
        "correct": false
      },
      {
        "text": "أوامر صارمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين قائد فريق لمشروع مستمر. يعمل أعضاء الفريق معاً منذ فترة.\nكيف يجب على قائد الفريق البدء في بناء العلاقات؟",
    "explanation": "",
    "choices": [
      {
        "text": "توزيع المهام ومراقبة جودة المخرجات.",
        "correct": true
      },
      {
        "text": "تحدث عن تفضيلاتك الشخصية وتأكد من أن الفريق يتفهم نهجك.",
        "correct": false
      },
      {
        "text": "اطلب من بعض أعضاء الفريق مشاركة معلومات عن الأعضاء الآخرين للتعرف على الفريق.",
        "correct": false
      },
      {
        "text": "اسأل أعضاء الفريق مباشرةً عن الأمور الشخصية والمتعلقة بالعمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد فريق المشروع عددًا من العيوب في بعض النواتج ويعتزم حلها في أقرب وقت ممكن. سيحتاج مدير المشروع إلى تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).\nما الذي يجب على مدير المشروع القيام به قبل تقديم الطلب؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ التغييرات على الفور بسبب ضيق الوقت.",
        "correct": true
      },
      {
        "text": "إرسال طلب التغيير إلى العميل للموافقة عليه.",
        "correct": false
      },
      {
        "text": "أكمل تحليل الأثر لكل تغيير مطلوب.",
        "correct": false
      },
      {
        "text": "إرسال طلبات التغيير إلى الراعي للموافقة عليها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع متمرس بالتحضير لاجتماع استهلالي لتقييم خدمة جديدة. وقد تم تقديم وصف رفيع المستوى للخدمة\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع ميثاق المشروع.",
        "correct": true
      },
      {
        "text": "تطوير مصفوفة المسؤولية، والمساءلة، والاستشارة، والإبلاغ (RACI).",
        "correct": false
      },
      {
        "text": "تحديد بيان نطاق المشروع.",
        "correct": false
      },
      {
        "text": "إنشاء هيكل تقسيم العمل (WBS).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مكتب إدارة المشاريع (PMO) في إحدى الشركات بدمج المزيد من التقنيات التكيفية وتعيين مدير مشروع جديد يتمتع بخبرة في إدارة المشاريع المختلطة. ويتسم الفريق بالبطء في اعتماد المنهجية الجديدة ولم يقم بتحديث أدوات المشروع في الوقت المناسب.\nما الإجراء الذي ينبغي على مدير المشروع اتخاذه لتحسين أداء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل رسالة بريد إلكتروني تطلب من جميع أعضاء فريق المشروع إكمال التحديثات في نهاية اليوم.",
        "correct": true
      },
      {
        "text": "قم بإعداد دورة تدريبية لجميع أعضاء فريق المشروع.",
        "correct": false
      },
      {
        "text": "تواصل مع المديرين الوظيفيين للحصول على الدعم.",
        "correct": false
      },
      {
        "text": "تحدث مع كل عضو من أعضاء فريق المشروع بشكل فردي حول إجراء التحديثات اللازمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "5\nيقوم مدير مشروع يعمل على تنفيذ مشروع عالمي بتعيين فريق المشروع. بعد تشكيل الفريق، ماذا ينبغي لمدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل بريدًا إلكترونيًا ترحيبيًا واستضف حدثًا تعريفيًا بالفريق مع أعضاء الفريق حتى يتعرفوا على بعضهم البعض.",
        "correct": true
      },
      {
        "text": "إرسال خطة وميثاق إدارة المشروع إلى أعضاء الفريق لتعريفهم بأهداف المشروع وإجراءاته.",
        "correct": false
      },
      {
        "text": "قم بترتيب اجتماع لأعضاء الفريق لمناقشة أي مخاوف تتعلق بالمتطلبات ونطاق المشروع.",
        "correct": false
      },
      {
        "text": "أرسل لأعضاء الفريق استبياناً لمعرفة المزيد عن كل عضو، وشارك النتائج عبر البريد الإلكتروني.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مشروع لتركيب ثلاث وحدات للتصوير بالرنين المغناطيسي في أحد المستشفيات؛ وقد اجتازت وحدة واحدة اختبار القبول ووحدتان قيد الإنشاء. يطلب العميل أمر تغيير لإضافة وحدة رابعة بمتطلبات مختلفة قليلاً.\nما الذي يجب أن يفعله مدير المشروع لتقدير تسليم الوحدة الإضافية بدقة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاعتماد على البيانات التاريخية من المشاريع المماثلة.",
        "correct": true
      },
      {
        "text": "قسّم العمل إلى مهام أصغر وقدّر كل مهمة على حدة.",
        "correct": false
      },
      {
        "text": "استخدام الصيغ أو النماذج الصناعية بناءً على خصائص المشروع.",
        "correct": false
      },
      {
        "text": "قارن الوحدة الجديدة بالوحدات الحالية وقم بتعديل التقديرات الحالية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع طويل ومستمر يرهق فريق المشروع. ولا يستطيع مدير المشروع تمديد الجدول الزمني للمشروع بسبب مشاكل تتعلق بالموعد النهائي.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة ميثاق المشروع.",
        "correct": true
      },
      {
        "text": "تقديم المزيد من التقدير لأعضاء الفريق.",
        "correct": false
      },
      {
        "text": "ناقش الوضع مع الفريق.",
        "correct": false
      },
      {
        "text": "طلب موارد إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "61\nأي من الخطوات التالية تعطي اهتماماً خاصاً لعمليات اتخاذ القرارات الجماعية؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعريف المشكلة",
        "correct": true
      },
      {
        "text": "توليد حلول المشكلات",
        "correct": false
      },
      {
        "text": "من الأفكار إلى العمل",
        "correct": false
      },
      {
        "text": "تخطيط إجراءات الحل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "62\nمن المحتمل أن يتأثر مشروع صيدلاني في مرحلة البدء باللوائح التنظيمية الجديدة للسوق. ما هي فئات أصحاب المصلحة التي يجب على مدير المشروع تعيينها للهيئة التنظيمية ذات الصلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "خارجي ذو قوة/تأثير عالٍ",
        "correct": true
      },
      {
        "text": "داخلية ذات قوة/تأثير عالٍ",
        "correct": false
      },
      {
        "text": "داخلي مع مستوى دعم معادٍ/مقاوم/مستوى دعم مقاوم",
        "correct": false
      },
      {
        "text": "خارجي مع مستوى دعم معادٍ/مقاوم/مستوى دعم مقاوم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكافح مدير مشروع لمعرفة أداء فرق المشروع في بيئة رشيقة. بالنسبة لنطاق العمل نفسه، قام الفريق \"أ\" بحساب وتسليم نقطة قصة واحدة وقام الفريق \"ب\" بحساب وتسليم 125 نقطة قصة.\nما الفريق الذي يؤدي بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "الفريق (أ) حيث احتسبوا نقاط قصة أقل من الفريق",
        "correct": true
      },
      {
        "text": "الفريق B لأنه احتسب نقاط قصة أكثر من الفريق",
        "correct": false
      },
      {
        "text": "الفريق الذي يكمل أكبر عدد من القصص المختارة من الأعمال المتراكمة في سباق السرعة.",
        "correct": false
      },
      {
        "text": "الفريق الذي لديه أقل قدر من العيوب في مخرجاته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى مؤسسات البنية التحتية الكبيرة بمراجعة وتوحيد أدوات وتقنيات المشروع.\nفيما يتعلق بـ \"متى يجب اتخاذ قرار اتخاذ إجراء تصحيحي؟\"، من أي مجموعة عملية يمكن أن يأتي هذا؟",
    "explanation": "",
    "choices": [
      {
        "text": "مجموعة عملية البدء في العملية",
        "correct": true
      },
      {
        "text": "مجموعة عمليات التخطيط",
        "correct": false
      },
      {
        "text": "مجموعة العمليات المنفذة",
        "correct": false
      },
      {
        "text": "مجموعة عمليات المراقبة والتحكم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع باستخدام نهج مختلط وطلب من أحد كبار أعضاء الفريق إجراء تحليل كمي للمخاطر. ورد عضو الفريق بأنه لا يملك المعرفة اللازمة لإجراء مثل هذا التحليل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد المشكلة إلى المدير الوظيفي.",
        "correct": true
      },
      {
        "text": "اتصل بمكتب إدارة المشروع (PMO) واطلب منهم تعيين عضو آخر في الفريق لديه المعرفة اللازمة لأداء هذه المهمة للفريق.",
        "correct": false
      },
      {
        "text": "مساعدة عضو الفريق على إجراء التحليل الكمي للمخاطر من خلال التدريب والتوجيه والإرشاد والتدريب.",
        "correct": false
      },
      {
        "text": "إجراء التحليل الكمي للمخاطر لعضو الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "65\nيقوم مدير المشروع بمساعدة المؤسسة على الانتقال من الأساليب التقليدية إلى الأساليب الرشيقة. تعمل فرق البنية التحتية وتخزين البيانات والهندسة المعمارية للمؤسسة بشكل مختلف تمامًا عن فرق تطوير التطبيقات.\nكيف ينبغي لمدير المشروع أن يطبق أجايل في هذه المؤسسة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من كل فريق في المؤسسة تطبيق نفس المنهجية الرشيقة بحيث يمكن أن يوفر حل واحد يناسب الجميع الاتساق بين جميع الفرق.",
        "correct": true
      },
      {
        "text": "تكييف التنفيذ من خلال تكييف النهج بشكل متعمد لجعله أكثر ملاءمة للبيئة المعينة والعمل في هان",
        "correct": false
      },
      {
        "text": "فرض نهج الانتقال من الأعلى إلى الأسفل من خلال مطالبة الرئيس التنفيذي بتقديم الدعم لتطبيق أجايل في كل فريق في المؤسسة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق واحد تطبيق سكروم كتجربة حتى تتمكن جميع الفرق الأخرى في المؤسسة من تطبيق سكروم أيضًا من خلال التعلم من هذا الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "66\nفي بيئة تطوير رشيقة، متى يجب إجراء تحليل للمخاطر في بيئة تطوير رشيقة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قبل بدء كل تكرار",
        "correct": true
      },
      {
        "text": "خلال اجتماع الاستعداد اليومي",
        "correct": false
      },
      {
        "text": "في الاجتماع الاستعراضي",
        "correct": false
      },
      {
        "text": "بعد كل اجتماع سكروم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "66\nيجري تدقيق أحد المشاريع لضمان الامتثال للسياسات التنظيمية. ما هي العملية التي يتم إجراؤها؟",
    "explanation": "",
    "choices": [
      {
        "text": "جدول المراجعة",
        "correct": true
      },
      {
        "text": "إدارة جودة الخطة",
        "correct": false
      },
      {
        "text": "مراقبة الجودة",
        "correct": false
      },
      {
        "text": "إدارة الجودة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اكتمال مشروع لإنشاء منتج جديد وطرحه في السوق، ولكن المبيعات أقل بكثير مما كان متوقعًايحدد التحليل أن المنتج غير متوافق مع الكفاءات الأساسية للمؤسسة.\nخلال أي نشاط كان ينبغي اكتشاف هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل سيناريو ماذا لو",
        "correct": true
      },
      {
        "text": "مراجعة حالة العمل",
        "correct": false
      },
      {
        "text": "تقييم الأداء الاستراتيجي",
        "correct": false
      },
      {
        "text": "تعريف النطاق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "وصل مشروع رشيق طويل الأجل إلى منتصف الطريق وتم تعيين مدير مشروع جديد لتولي المسؤولية. بالإضافة إلى مدير المشروع، تم استبدال أحد أصحاب المصلحة الحاليين بآخر لديه خبرة أكبر فيما يتعلق بتكنولوجيا المشروع.\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مناقشة توقعات أصحاب المصلحة ومراجعة خطة المشاركة وفقاً لذلك.",
        "correct": true
      },
      {
        "text": "شجع صاحب المصلحة الجديد على الاجتماع مع مالك المنتج لمراجعة المعلومات ذات الصلة.",
        "correct": false
      },
      {
        "text": "إبلاغ جميع أصحاب المصلحة بعد مراجعة خطة المشروع بالمحتويات الجديدة المضافة",
        "correct": false
      },
      {
        "text": "عقد جميع اجتماعات المراجعة السريعة القادمة بحضور أصحاب المصلحة الجدد ومراجعة خطة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "6\nيقوم أحد كبار المديرين بإبلاغ مدير المشروع بأن أداء المشروع لا يرقى إلى مستوى أداء المشاريع الأخرى. ما الذي يمكن أن يستخدمه مدير المشروع لتحسين الأداء في السلسلة التالية من التكرارات؟",
    "explanation": "",
    "choices": [
      {
        "text": "جلسة استرجاع بأثر رجعي",
        "correct": true
      },
      {
        "text": "تحليل الأعمال المتراكمة",
        "correct": false
      },
      {
        "text": "بناء الفريق",
        "correct": false
      },
      {
        "text": "تحفيز الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع في مشروع صناعي ضخم. يتوزع فريق المشروع على ستة بلدان ومناطق زمنية مختلفة. وخلال اجتماع مراجعة، لوحظ أن هناك خطأ في تواريخ المراحل الأساسية الهامة المحددة\nما هو السبب الأكثر احتمالاً لفوات المواعيد النهائية؟",
    "explanation": "",
    "choices": [
      {
        "text": "عدم الالتزام بالشراء",
        "correct": true
      },
      {
        "text": "ضعف التواصل بين الفريق الواحد",
        "correct": false
      },
      {
        "text": "سوء فهم توقعات أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "توقعات أصحاب المصلحة مرتفعة للغاية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nيتمتع صاحب المصلحة التنفيذي بسلطة اتخاذ القرار الحاسم في تنفيذ المشروع ونجاحه. كيف ينبغي أن تنعكس أهمية أصحاب المصلحة هؤلاء في خطة إشراك أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وصف مستوى دعم المدير التنفيذي وتوقعاته وعتبة المخاطر والاتصالات المناسبة لاحتياجات المشروع المختلفة.",
        "correct": true
      },
      {
        "text": "ترتيب المسؤول التنفيذي في مخطط تنظيمي وتوضيح أي تقارب أو عداء مع أصحاب المصلحة الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتسمية المدير التنفيذي على أنه \"داعم\" وتأكد من تحديث البريد الإلكتروني وأرقام الهواتف وأوقات الغياب/الإجازات.",
        "correct": false
      },
      {
        "text": "وصف مشاركة المدير التنفيذي في مشاريع سابقة مماثلة من أجل تحديد مستوى المشاركة المناسب على أساس كل حالة على حدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nيريد مدير المشروع وضع استراتيجية للحوافز والمكافآت لفريق المشروع. ما هو النهج الذي ينبغي اتباعه؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسأل قسم الموارد البشرية عن الحوافز التي يجب تقديمها",
        "correct": true
      },
      {
        "text": "تحقق من توفر الميزانية من أجل تحديد مبالغ المكافآت المحددة.",
        "correct": false
      },
      {
        "text": "توفير فرصة لعرض النتائج بشكل علني.",
        "correct": false
      },
      {
        "text": "تحديد الاحتياجات المحددة لكل عضو من أعضاء الفريق لتحديد الحوافز.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتبر مدير المشروع أن الامتثال جزء من أصول عمليات المنظمة. ومع ذلك، قرر فريق المشروع إدراج الامتثال كمدخلات للعمليات ذات الصلة بدلاً من توثيق هذه القواعد كمتطلبات.\nما هي مسؤولية مدير المشروع عن الامتثال؟",
    "explanation": "",
    "choices": [
      {
        "text": "يعمل كمنسق للموارد والأنشطة",
        "correct": true
      },
      {
        "text": "إجراء عمليات التدقيق لمتطلبات الامتثال",
        "correct": false
      },
      {
        "text": "إجراء تحليلات المخاطر الخاصة بمخاطر الامتثال",
        "correct": false
      },
      {
        "text": "تغيير أصول عملية التغييرات في المنظمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة نقل بتحويل عملياتها التشغيلية والنظام الرئيسي الذي تستخدمه هذه الشركة لنقل البضائع. تم وضع بيان النطاق. تم الاتفاق على نهج تسليم متكرر من قبل جميع أصحاب المصلحة.\nما الذي يحتاج مدير المشروع إلى القيام به بعد ذلك لمساعدة الفريق على فهم العمل الذي يجب القيام به؟",
    "explanation": "",
    "choices": [
      {
        "text": "ابدأ العمل على خطة إدارة المشروع مع حزم العمل وجدول زمني مفصل ومهام العمل لأعضاء الفريق.",
        "correct": true
      },
      {
        "text": "العمل مباشرةً مع أصحاب المصلحة على هيكل تقسيم العمل (WBS) وتعيين المهام مع الجدول الزمني المطلوب لكل عضو من أعضاء الفريق لبدء العمل.",
        "correct": false
      },
      {
        "text": "اعمل مع فريق العمل على تحليل النطاق إلى WBS وحزم عمل من أجل إنشاء المخرجات والجداول الزمنية المطلوبة.",
        "correct": false
      },
      {
        "text": "قم بإنشاء خطة إدارة المتطلبات لتحديد كيفية جمع متطلبات المشروع وتحليلها وتوثيقها، ثم تعيين المتطلبات لأعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد التشاور مع أصحاب المصلحة التنفيذيين، تقرر أن يحل مدير المشروع محل أحد البائعين بينما يكون المشروع في مرحلة التنفيذ. والبائع الجديد ببساطة لديه معرفة أكبر بالمجال ولم يتم تحديده في وقت سابق، ولكن من المحتمل أن يكون البائع الجديد هو المرشح المناسب الآن.\nأي من المستندات التالية تحتوي على أفضل المعلومات للبائع الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب المعلومات (RFI)",
        "correct": true
      },
      {
        "text": "طلب عرض الأسعار (RFQ)",
        "correct": false
      },
      {
        "text": "طلب تقديم العروض (RFP)",
        "correct": false
      },
      {
        "text": "طلب التعاقد (RFC)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "73\nيحاول مدير مشروع جديد تمكين القيادة المشتركة داخل فريقه الافتراضي. أي من الخيارات التالية يجب أن يتجنبها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "احترام كفاءات أعضاء الفريق",
        "correct": true
      },
      {
        "text": "أرخِ الزمام وتجنب \"فخ المسؤولية\"",
        "correct": false
      },
      {
        "text": "تشجيع السلوكيات القيادية",
        "correct": false
      },
      {
        "text": "الحفاظ على \"مسافة طبيعية\" مع الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة متعددة الجنسيات بتطوير منتج رقمي محلياً باستخدام منصة تكنولوجية جديدة. الخبير الوحيد في هذه المنصة موجود في المقر الرئيسي للشركة، وهو مسؤول عن تقديم الدعم لمختلف البلدان.\nكيف يمكن لمدير المشروع المحلي ضمان مشاركة هذا الخبير؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصميم جدول زمني للسفر بحيث يمكن تقديم المساعدة في الوقت المناسب وفي الموقع",
        "correct": true
      },
      {
        "text": "ضم الخبير إلى الفريق باستخدام بيئة افتراضية.",
        "correct": false
      },
      {
        "text": "اطلب من راعي المشروع تعيين الخبير كعضو متفرغ في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الاتصال بالخبير كمصدر خبرة خارجي حسب الحاجة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنت تدير مشروعًا معقدًا يضم عددًا كبيرًا من أصحاب المصلحة. وقد قررت استخدام نموذج الأهمية لتحديد أصحاب المصلحة الأكثر أهمية وتجميعهم بناءً على قوتهم وإلحاحهم وشرعيتهم.\nأي من الجوانب التالية هو الأكثر أهمية في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "المهيمن",
        "correct": true
      },
      {
        "text": "معتمد",
        "correct": false
      },
      {
        "text": "متطلب",
        "correct": false
      },
      {
        "text": "نهائي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الأسبوعي، يقوم أعضاء الفريق بمراجعة المهام التي كلف بها مدير المشروع. ويشكو بعض أعضاء الفريق من عدم وجود معلومات كافية لتقدير المدة التي سيستغرقها إكمال العمل.\nما هو السبب الأرجح لهذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "أهداف المشروع غير محددة بوضوح",
        "correct": true
      },
      {
        "text": "بيئة الأعمال ديناميكية للغاية",
        "correct": false
      },
      {
        "text": "المنافسة الداخلية بين أعضاء الفريق",
        "correct": false
      },
      {
        "text": "الأدوار والمسؤوليات غير محددة بوضوح",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تتم الموافقة على تغيير التصميم المطلوب من العميل من قبل مجلس مراقبة التغيير (CCB). ثم يكتشف مدير المشروع أن التغيير سيتسبب في تأخير المشروع لمدة ثلاثة أشهر.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "زيادة الميزانية المأذون بها، وطلب موارد إضافية",
        "correct": true
      },
      {
        "text": "إعادة تحديد نطاق المشروع ليشمل التصميم الجديد",
        "correct": false
      },
      {
        "text": "المسار السريع وتعطل الجدول الزمني",
        "correct": false
      },
      {
        "text": "إجراء تقييم دقيق للطلب وفقًا لخطة إدارة المخاطر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "76\nما هي الأداة التي ينبغي لمدير المشروع أن يدمجها لتحديد مقاومة أصحاب المصلحة الشائعة لتحديات التغيير والاستجابة لها بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة التغيير",
        "correct": true
      },
      {
        "text": "إدارة المخاطر",
        "correct": false
      },
      {
        "text": "إدارة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "إدارة الاتصالات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "77\nخلال أحد اجتماعات اللجنة التوجيهية للمشروع، أبلغ مدير المشروع أن أحد أعضاء الفريق الرئيسيين الذي كان داعماً في السابق أصبح مقاوماً للتغييرات وسلبياً تجاهها. أين ينبغي تسجيل هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "مصفوفة المسؤولية والمساءلة والتشاور والإبلاغ (RACI)",
        "correct": true
      },
      {
        "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "سجل المخاطر وسجل المشكلات",
        "correct": false
      },
      {
        "text": "تقارير أداء العمل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا بنطاق يتم تسليمه جزئيًا من قبل أحد البائعين. تختلف عمليات البائع وأدواته عن عمليات وأدوات فريق المشروع، مما قد يشكل خطراً.\nكيف ينبغي لمدير المشروع التخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب فريق المشروع الداخلي على استخدام عمليات البائع وأدواته.",
        "correct": true
      },
      {
        "text": "تدريب البائع على استخدام نفس العمليات والأدوات التي يستخدمها الفريق الداخلي.",
        "correct": false
      },
      {
        "text": "وضع استراتيجية لمواءمة العمليات والأدوات الداخلية وعمليات البائعين والموردين.",
        "correct": false
      },
      {
        "text": "التوصية بإشراك بائع جديد يستخدم العمليات والأدوات الداخلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل مدير المشروع للتو مرحلة بدء المشروع ويحتاج إلى تحديد وتحليل أصحاب المصلحة. ويركز ميثاق المشروع على نطاق المشروع والموافقة على الميزانية فقط.\nما الذي يجب أن يفعله مدير المشروع لتحديد أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة الدروس المستفادة من المشاريع السابقة.",
        "correct": true
      },
      {
        "text": "مراجعة ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "قم بإجراء جلسة عصف ذهني مع فريق المشروع.",
        "correct": false
      },
      {
        "text": "راجع المخطط التنظيمي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب مالك المنتج دمج وظيفة مدمجة لبوابة المرضى في السباق القادم. وقرر الفريق إجراء جلسة تقدير التقارب لتحديد مقدار القيمة التي سيتم تقديمها\nما الدور المسؤول عن تيسير الجلسة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مالك المنتج",
        "correct": true
      },
      {
        "text": "سكروم ماستر",
        "correct": false
      },
      {
        "text": "المطور",
        "correct": false
      },
      {
        "text": "أصحاب المصلحة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل فريق مشروع مؤخرًا مشروعًا طويل الأجل باستخدام نهج تنبؤي. ثم بدأ الفريق بعد ذلك مشروعًا جديدًا مع نفس مدير المشروع، لكنهم الآن يستخدمون نهجًا رشيقًا. بعد سباق السرعة الأولي، ينتظر الفريق أن يتخذ مدير المشروع القرارات نيابة عن الفريق، كما حدث في المشاريع السابقة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك المنتج اتخاذ قرارات للفريق.",
        "correct": true
      },
      {
        "text": "تقديم ملاحظات إيجابية مستمرة لجميع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "ذكّر الفريق بأنهم يستخدمون نهجًا رشيقًا.",
        "correct": false
      },
      {
        "text": "تدريب الفريق على توجيه ودعم قراراتهم الخاصة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد اكتمال جمع بيانات ومعلومات أصحاب المصلحة، يبدأ تحليل البيانات التي تم جمعها. يتم رسم درجات القوة/المصلحة لكل صاحب مصلحة على مجموعة من المحاور لتوفير تصور لقوة واهتمام أصحاب المصلحة. هناك ثلاثة أصحاب مصلحة لديهم قوة منخفضة واهتمام منخفض.\nما هي الإجراءات الخاصة بهم؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب الحفاظ على رضاهم من خلال ضمان معالجة مخاوفهم ومخاوفهم بشكل مناسب.",
        "correct": true
      },
      {
        "text": "تتطلب الحد الأدنى من الجهد الإداري.",
        "correct": false
      },
      {
        "text": "يجب إطلاعهم على آخر المستجدات المتعلقة بالمشروع.",
        "correct": false
      },
      {
        "text": "يجب أن يظلوا راضين، ولكن يجب أيضاً أن يتم إشراكهم واستشارتهم في المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nحصلت مديرة مشروع للتو على مشروع جديد للتعامل معه. وهي تعمل على وثائق المشروع، وبعد قراءة ميثاق المشروع، تقوم بتجميع المخاطر كما تراها. بمجرد أن تكمل القائمة، متى يجب مراجعتها؟",
    "explanation": "",
    "choices": [
      {
        "text": "عند بدء المشروع وكلما اقترب موعد بدء المشروع وكلما اقتربت كل مخاطر",
        "correct": true
      },
      {
        "text": "أثناء تنظيم العمل وإعداده وتنفيذه.",
        "correct": false
      },
      {
        "text": "أثناء الاجتماعات الأسبوعية حيث يتم تحديد المخاطر الجديدة وإضافة",
        "correct": false
      },
      {
        "text": "بانتظام وطوال فترة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم اجتياز جميع ضوابط الجودة، وأصبح المشروع القابل للتسليم جاهزًا لإصداره للعميل. ومع ذلك، تمت الموافقة على طلب تغيير لإضافة معايير جودة جديدة\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث خطة إدارة المشروع.",
        "correct": true
      },
      {
        "text": "أوقف إصدار المنتج القابل للتسليم إلى العميل.",
        "correct": false
      },
      {
        "text": "استخدم معايير الجودة الجديدة للتسليمات المستقبلية.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مصنع صناعي، قرر المالك إضافة المزيد من السعة إلى المصنع من خلال تركيب آلة جديدة وتحديث البرامج المستخدمة في الإنتاج. ستحدث هذه الزيادة في السعة بينما لا يزال المصنع يعمل وينتج. سيتم إنجاز تحديث البرمجيات باستخدام نهج رشيق من أجل تقليل المخاطر. سيتم إنجاز عملية شراء الماكينة وتركيبها ودمجها باستخدام نهج تنبؤي.\nما هي أنواع الاتصالات التي سيتعين على مدير المشروع تصميمها في خطة إدارة الجدول الزمني لضمان التزام المشروع بالجدول الزمني المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتماعات أسبوعية مشتركة مع أصحاب المصلحة المعنيين",
        "correct": true
      },
      {
        "text": "تقارير حالة مكتوبة كل أسبوعين من الجهات المعنية ذات الصلة",
        "correct": false
      },
      {
        "text": "اجتماعات فردية أسبوعية مع كل من أصحاب المصلحة المعنيين",
        "correct": false
      },
      {
        "text": "مكالمات جماعية كل أسبوعين مع أصحاب المصلحة المعنيين",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في مشروع يعد جزءًا من مبادرة تحويل الأعمال التي تؤثر على معظم الموظفين في الشركة البالغ عددهم 1، 1 موظف. ويتمثل نطاق المشروع في تحسين التعاون بين الفرق من خلال تنفيذ منصة سحابية جديدة ستحل محل أداة اتصال عمرها عامين.\nما هو عامل النجاح الأكثر أهمية؟",
    "explanation": "",
    "choices": [
      {
        "text": "جودة جيدة، يجب ألا تحتوي عملية الإطلاق على أي عيوب حرجة.",
        "correct": true
      },
      {
        "text": "واجهة مستخدم جيدة تم تطويرها بواسطة فنانين رسامين موهوبين",
        "correct": false
      },
      {
        "text": "التخطيط الجيد لإدارة التغيير وتنفيذها",
        "correct": false
      },
      {
        "text": "عملية جيدة للتحكم في التغيير مع موافقات سريعة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مشروع معقد، يقوم أحد أصحاب المصلحة بإبلاغ مدير المشروع عن أحد المتطلبات ويقترح عقد اجتماع لإبلاغ أعضاء الفريق في منتصف المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعداً لعقد اجتماع مع صاحب المصلحة وأحد أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من صاحب المصلحة شرح المتطلبات وتنفيذها على الفور.",
        "correct": false
      },
      {
        "text": "عقد اجتماع مع جميع أعضاء الفريق لمناقشة المتطلبات.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج الإضافة إلى تراكمات المنتج ليتم معالجتها في التكرار التالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ أحد المشاريع المهمة، يشتكي أحد المقاولين من صعوبة التعامل مع عملية الموافقة وقد تؤخر الجدول الزمني للمشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "توظيف موارد إضافية للفريق للتخفيف من هذه المخاطر.",
        "correct": true
      },
      {
        "text": "ناقش مع الفريق لإيجاد خيارات للتخفيف من المخاطر.",
        "correct": false
      },
      {
        "text": "تصعيد الخطر إلى الإدارة العليا باعتباره أمرًا بالغ الأهمية للتسليم في الوقت المناسب.",
        "correct": false
      },
      {
        "text": "إضافة المخاطر إلى سجل المخاطر ليتم رصدها ومراجعتها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بوضع خطة إدارة الجودة لمشروع برمجيات. وأثناء استعراض الدروس المستفادة من مشاريع سابقة مشابهة، يكتشف مدير المشروع أن إعادة العمل بسبب مشاكل الجودة أدت إلى تجاوزات في التكاليف.\nما الذي يجب أن يفعله مدير المشروع لضمان معالجة الجودة طوال دورة حياة تطوير البرمجيات؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء عمليات مراجعة متكررة للتحقق بانتظام من فعالية عمليات الجودة.",
        "correct": true
      },
      {
        "text": "تعيين مورد للتركيز فقط على جودة المشروع.",
        "correct": false
      },
      {
        "text": "التأكد من ربط الجودة بمراجعات الأداء.",
        "correct": false
      },
      {
        "text": "تحديد سياسات وإجراءات الجودة الجديدة للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد وسياسي مع العديد من أصحاب المصلحة الذين لديهم أولويات متضاربة. طلبت الإدارة العليا من مدير المشروع التأكد من عدم وجود \"ضوضاء\" فيما يتعلق بالمشروع. خلال اجتماع لأصحاب المصلحة، طلب مدير المشروع من مدير المشروع سلسلة من الأسئلة لتأكيد قبول كل ناتج قبل أن يطلب قبول المشروع بأكمله.\nما الذي فعله مدير المشروع لإرضاء أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستجابة للإجراءات الإيجابية من أصحاب المصلحة لمكافأة الإجراءات",
        "correct": true
      },
      {
        "text": "تصرفت بطريقة متسقة في استخدام الكلمات والأفعال.",
        "correct": false
      },
      {
        "text": "الانخراط مع أصحاب المصلحة من خلال التعاون من أجل تحقيق الأهداف المشتركة",
        "correct": false
      },
      {
        "text": "التصرف بناءً على السلطة المخولة من الإدارة العليا",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nطلبت اللجنة التوجيهية من أحد مديري المشاريع من ذوي الخبرة في مجال العمل الرشيق تقديم مؤشر للوقت المتبقي على مشروع متوسط الحجم. ما هي الأدوات التي يمكن استخدامها لتوفير هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل وثيقة متطلبات العمل",
        "correct": true
      },
      {
        "text": "مخطط تفصيلي للإصدار",
        "correct": false
      },
      {
        "text": "نقاط القصة لقصص المستخدمين المتبقية",
        "correct": false
      },
      {
        "text": "القياسات البديلة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "انضم خريج جديد مؤخرًا إلى فريق بحث وتطوير ناضج. يشعر المرشد، الذي تم تعيينه للعمل مع الخريج، بالإرهاق بسبب العمل الإضافي الذي يقوم به الفريق وأداء الفريق وتحفيزه في انخفاض.\nكيف يمكن لمدير المشروع المساعدة في هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "حافظ على أسلوب القيادة المتساهل مع الفريق، ولكن استخدم أسلوب المعاملات لإعطاء توجيهات حازمة للخريج.",
        "correct": true
      },
      {
        "text": "اطلب من المرشد استخدام نهج القائد الخادم التعاوني لأداء الواجبات المعتادة إلى جانب دور المرشد.",
        "correct": false
      },
      {
        "text": "إلغاء خطة الموجه والتركيز على الحفاظ على تحفيز الخريج من خلال التعلم من خلال الانغماس المكثف.",
        "correct": false
      },
      {
        "text": "اطلب من ثلاثة أعضاء آخرين في الفريق مشاركة دور المرشد من أجل تقليل عبء عمل المرشد الفردي بنسبة 75%.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشارك مدير المشروع في مجموعة تركيز تنفذ تغييرات في إدارة المشروع في جميع أنحاء المنظمة. والهدف من ذلك هو تحسين فعالية المشروع ونجاحه.\nما هي العملية التي يجب أن يقترحها مدير المشروع للتغيير الدائم والناجح في المشاريع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييمات للمهارات الفردية وتوفير تدريب موجه لكل عضو من أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "مراقبة اللوائح الخارجية وتكييف ممارسات إدارة المشاريع وفقًا لذلك.",
        "correct": false
      },
      {
        "text": "تسهيل التواصل المفتوح وبناء التأييد من جميع أصحاب المصلحة في المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ خطة لإدارة التغيير في إدارة المشروع تتماشى مع أفضل الممارسات في هذا المجال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستضيف أحد أعضاء الفريق فعالية ويدعو العديد من الزملاء من خلال تقويمات العمل الخاصة بهم. عضو آخر في الفريق، الذي لم تتم دعوته إلى الحدث، مشتت الذهن بشكل ملحوظ خلال عدة اجتماعات في الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الشخص الذي يستضيف الفعالية أن يضع علامة خاصة عليها.",
        "correct": true
      },
      {
        "text": "قم بإعداد اجتماع مع عضو الفريق المشتت لمناقشة أي مشاكل.",
        "correct": false
      },
      {
        "text": "اطلب من الشخص الذي يستضيف الفعالية استخدام وسائل الاتصال الخاصة.",
        "correct": false
      },
      {
        "text": "أضف قسم المناسبات الاجتماعية إلى الميثاق للتعامل مع هذه الحالات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اعتاد فريق تم تشكيله حديثاً على الممارسات الرشيقة. وقد لاحظ قائد المشروع أنه على الرغم من أن أداء الفريق يتوافق مع التوقعات، إلا أن هناك ملل من ممارسات الفريق اليومية بين العديد من أعضاء الفريق.\nما الذي يجب أن يفعله قائد المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسمح للفريق بالتنظيم الذاتي واجعلهم يحللون الموقف في جلسة المراجعة والتصحيح الذاتي.",
        "correct": true
      },
      {
        "text": "تحدي الفريق لإيجاد طرق جديدة لتحقيق مستويات أعلى من الأداء لتحسين الوضع.",
        "correct": false
      },
      {
        "text": "تحدث مع أعضاء الفريق كل على حدة لتحديد ما يودون القيام به لتحسين الوضع في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق إبلاغ الإدارة العليا بالوضع واطلب منهم تقديم توصيات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nما هي أنماط القيادة الأربعة لبناء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "البصيرة والانتسابية والتوجيه والمشاركة",
        "correct": true
      },
      {
        "text": "الرؤية، والانتساب، والتدريب، وتحديد الوتيرة",
        "correct": false
      },
      {
        "text": "البصيرة والانتساب والتوجيه والإرشاد والتوجيه",
        "correct": false
      },
      {
        "text": "البصيرة والانتسابية والتدريب والمياه العالية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء العمل على مشروع ما، يدرك فريق المشروع أن التحديثات الأخيرة لمركز البيانات قد تؤثر على نتائج المشروع. وحدات معينة من مخرجات المشروع غير متوافقة مع البيئة الجديدة. يحدد الفريق الخطوات المناسبة لمعالجة المشكلة.\nما هي الخطوة التالية لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب زيادة في الميزانية.",
        "correct": true
      },
      {
        "text": "إرسال طلب تغيير.",
        "correct": false
      },
      {
        "text": "تغيير الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "تحديث وثيقة المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق على مشروع تطوير منتج جديد معقد وسريع التغير. بعد تقييم حديث للعملية، قرر الفريق إضافة مجموعة أدوات رشيقة إلى النهج التنبؤي الذي يستخدمونه. تهدف هذه الإضافة إلى تحسين إنجاز المشروع ونجاحه وإنتاجيته بشكل عام.\nأي مما يلي يصف كيف يهدف هذا التغيير إلى إضافة قيمة مضافة إلى عملية التسليم والنجاح والإنتاجية بشكل عام؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم مجموعة الأدوات الرشيقة للاستفادة من قدرة الأساليب الرشيقة على الاستجابة بفعالية للتغيير، مع الحفاظ على فوائد النهج التنبؤي لإدارة المشاريع.",
        "correct": true
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة لاستبدال جميع الأساليب التنبؤية بأساليب رشيقة جديدة، وبذلك تقلل من ضعف الإنتاجية.",
        "correct": false
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة لمقارنة الأساليب الرشيقة مع الأساليب التنبؤية، ثم اختر النهج الأفضل للمشاريع المستقبلية.",
        "correct": false
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة واطلب من أعضاء الفريق الاختيار بين الأساليب الرشيقة والتنبؤية حتى يعملوا بشكل أكثر فعالية وإنتاجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف الطريق من المشروع، تم إبلاغ مدير المشروع بحركة السوق التي من شأنها أن تجعل نتائج المشروع غير مجدية للعميل. وقد تتسبب هذه المعلومة في إلغاء المشروع أو على الأقل إحداث تغيير كبير في نطاق المشروع والنتيجة المرجوة منه.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإعداد جميع تقارير الحالة والعروض التوضيحية للحفاظ على تركيز العميل على تنفيذ المشروع الذي تم بنجاح.",
        "correct": true
      },
      {
        "text": "إجراء مناقشة شفافة مع راعي المشروع، وتقديم الدعم بشأن تقييم الاستراتيجية إذا لزم الأمر",
        "correct": false
      },
      {
        "text": "مواصلة العمل على تنفيذ المشروع، حيث إن استراتيجية العمل ليست مسؤولية مدير المشروع.",
        "correct": false
      },
      {
        "text": "أوقف المشروع على الفور، حيث يعلم مدير المشروع أنه سيكون عديم الفائدة للعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع مع فريق Scrum الذي يتخلف باستمرار عن المواعيد النهائية. تشعر اللجنة التوجيهية بالقلق بشأن المشروع لأنه ليس من الواضح أنه سيحقق القيمة المتوقعة. بعد إجراء بعض التحليلات، يكتشف مدير المشروع وجود عدم تطابق في الكفاءات في أحد الفرق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقبّل مخاطر فقدان المشروع للمواعيد النهائية بسبب عدم التطابق.",
        "correct": true
      },
      {
        "text": "توفير التدريب المناسب للتعويض عن عدم التطابق.",
        "correct": false
      },
      {
        "text": "تحديث الجدول الزمني للمشروع ليعكس التأخير.",
        "correct": false
      },
      {
        "text": "التأكيد للفرق على أهمية الالتزام بالمواعيد النهائية المتفق عليها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد له تأثير بيئي كبير جداً. تمت الموافقة على المشروع من قبل مكتب إدارة المشاريع في المنظمة وهو الآن في مرحلة التخطيط. وقد زود راعي المشروع مدير المشروع بقائمة بجميع أصحاب المصلحة في المشروع.\nما هو النشاط التالي في خطة إدارة أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل",
        "correct": true
      },
      {
        "text": "المراقبة",
        "correct": false
      },
      {
        "text": "إشراك",
        "correct": false
      },
      {
        "text": "تحديد",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة كبيرة بالتحول من النهج التنبؤي إلى النهج الرشيق. ويواجه فريق المشروع الذي لديه معرفة بالممارسات الرشيقة صراعات كبيرة مع المديرين التنفيذيين فيما يتعلق بالعمليات التي يجب اتباعها\nكيف ينبغي حل هذه التعارضات؟",
    "explanation": "",
    "choices": [
      {
        "text": "التفاوض مع المديرين التنفيذيين والاتفاق على عملية.",
        "correct": true
      },
      {
        "text": "تدريب المديرين التنفيذيين على الممارسات الرشيقة.",
        "correct": false
      },
      {
        "text": "قم بتضمين المديرين التنفيذيين في عمليات إعادة النظر في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من المديرين التنفيذيين استخدام الممارسات الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مدير المشروع بتحديد أصحاب المصلحة في مشروع تطوير البرمجيات: فريق المبيعات سيكون المستخدم الرئيسي لتطبيق البرمجيات الجديد؛ وسيكون قسم تكنولوجيا المعلومات مسؤولاً عن نشر وصيانة تطبيق البرمجيات الجديد؛ وراعي المشروع هو المسؤول التنفيذي المسؤول عن الموافقة على المشروع وتوفير التمويل. مدير المشروع في مرحلة التخطيط للمشروع، ويجب عليه إشراك أصحاب المصلحة.\nما هو أهم شيء يجب على مدير المشروع القيام به لبناء تفاهم مشترك؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع استهلالي مع جميع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "إنشاء سجل أصحاب المصلحة وخطة التواصل.",
        "correct": false
      },
      {
        "text": "تحديد احتياجات أصحاب المصلحة وتوقعاتهم.",
        "correct": false
      },
      {
        "text": "توثيق مخاوف ومخاطر أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نص ميثاق المشروع المعتمد على ضرورة استخدام نهج رشيق خلال جلسة الدروس المستفادة، أشار العميل إلى أن الفريق لم يتمكن من تقديم تقديرات تكلفة موثوقة للمشروع، وأنه يجب تخصيص المزيد من الوقت لتحديد النطاق خلال التكرار الأول.\nما هي الدروس التي يجب تسجيلها في مستودع الدروس المستفادة؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يتعرف العميل على النهج الرشيق مسبقاً لفهم عملية تقدير التكاليف.",
        "correct": true
      },
      {
        "text": "لا ينبغي استخدام النهج الرشيق إذا كان العميل يحتاج إلى تقديرات تكلفة موثوقة.",
        "correct": false
      },
      {
        "text": "خلال التكرار الأول للمشروع، ينبغي تخصيص وقت لتحديد النطاق وضمان إجراء تقديرات موثوقة للتكلفة أثناء التكرار الأول للمشروع",
        "correct": false
      },
      {
        "text": "يجب تضمين اتصالات العملاء في عمليات الوقوف اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع على مشروع طويل الأجل في بيئة معقدة. وينصب تركيز مدير المشروع على الحفاظ على سلامة عمل الفريق والتعاون.\nما هي استراتيجية حل النزاعات التي يجب استخدامها داخل فريق المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حل المشكلات",
        "correct": true
      },
      {
        "text": "المساومة",
        "correct": false
      },
      {
        "text": "استيعاب",
        "correct": false
      },
      {
        "text": "الاستشارة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع مشروع مشروعًا حيويًا بالنسبة لمؤسستهم وهيئة البيئة والطاقة المحلية. وخلال اجتماع للفريق لمناقشة مخاطر المشروع، أثار الفريق مخاطرة كبيرة تتمثل في أن أحد كبار المديرين المهمين لا يشارك حاليًا في المشروع.\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ تقارير الحالة المنتظمة.",
        "correct": true
      },
      {
        "text": "رفع هذا الخطر إلى الإدارة العليا.",
        "correct": false
      },
      {
        "text": "وضع خطة مفصلة للغاية لإدارة المشروع",
        "correct": false
      },
      {
        "text": "قم بدعوة المدير الأقدم إلى اجتماعات المشروع اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nأثناء مرحلة بدء المشروع، يقوم مدير المشروع بمراجعة حالة العمل ويجد أن المعلومات غير مكتملة. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة فجوة معلومات إلى سجل المخاطر.",
        "correct": true
      },
      {
        "text": "مراجعة بيان عمل المشروع (SOW) لإنشاء ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة دراسة الجدوى لتضييق نطاق المشروع وإنشاء ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة حالة العمل مع المؤسسة الراعية للتأكد من توافق المشروع مع احتياجات العمل.",
        "correct": false
        }
      ]
    }
  ]
}
