{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
     {
    "type": "multiple-choice",
    "text": "خطط لعقد اجتماع مع أعضاء الفريق الجدد لشرح القواعد المتضمنة في العقد الاجتماعي.\nيكون المشروع في مرحلة التنفيذ عندما يتم إلحاق أعضاء جدد بالفريق. قبل إلحاق أعضاء الفريق الجدد، ما الذي ينبغي لمدير المشروع أن يفعله للحد من تأثير هذا الإجراء على أداء المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد جلسة لتحديث الاتفاقية الاجتماعية الحالية حول كيفية عمل الفريق بشكل تعاوني.",
        "correct": true
      },
      {
        "text": "حدد جلسة للسماح لأعضاء الفريق الحاليين بشرح العقد الاجتماعي الحالي للأعضاء الجدد.",
        "correct": false
      },
      {
        "text": "قم بتنظيم اجتماع مع جميع أعضاء الفريق لإبلاغهم بالاتفاق الاجتماعي الحالي.",
        "correct": false
      },
      {
        "text": "خطط لعقد اجتماع مع أعضاء الفريق الجدد لشرح القواعد المتضمنة في العقد الاجتماعي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق مشروع بتركيب نظام قياس مالي لمحطة نفط خام. وقد طلب مدير المشروع نظام قياس، وأجرى اختبار قبول المصنع، وقام بتسليم العدادات إلى المحطة لتركيبها. أثناء التواجد في الموقع، شارك المنظمون المحليون في اختبارات قبول المصنع ورفضوا الموافقة على العدادات بسبب خرق الإجراءات القانونية. أدى ذلك إلى تأخير في استكمال الاختبار وكان له تأثير عام على تكلفة المشروع وجدوله الزمني.\nكيف كان يمكن لمدير المشروع أن يمنع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "الرجوع إلى الدروس المستفادة من المشاريع السابقة.",
        "correct": true
      },
      {
        "text": "إخطار أصحاب المصلحة باختبارات قبول المصنع للعدادات.",
        "correct": false
      },
      {
        "text": "ضمان الامتثال لمتطلبات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تنقيح خطة إشراك أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "شارك نموذجًا لميثاق عام لفريق المشروع مع الفريق وادعهم إلى تعديله حسب الحاجة ليناسب المشروع.\nتأخر أحد موردي المشروع في توفير حل منتج ذي صلة، مما يؤثر على مواعيد الإصدار. ما الذي يجب أن يفعله مدير المشروع لمساعدة فريق العمل الرشيق على إدارة هذا العائق؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل مع البائع لفهم البدائل.",
        "correct": true
      },
      {
        "text": "مراجعة تاريخ الإصدار وتحديثه مع الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من المسؤول التقني تصعيد المشكلة إلى المدير الوظيفي.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق والخبراء العمل معاً لإيجاد حل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع لديه فريق تم تشكيله حديثاً يضم أعضاء مبتدئين لم يعملوا في مشاريع رشيقة من قبل. يريد مالك المنتج التأكد من أداء الفريق كما هو متوقع في سباق السرعة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "خصص وقتًا لتوجيه أعضاء الفريق حول العمليات الرشيقة.",
        "correct": true
      },
      {
        "text": "التأكيد على أهمية تحديد أولويات الأعمال المتراكمة في سباق السرعة.",
        "correct": false
      },
      {
        "text": "تحسين الإنتاجية من خلال استخدام تقنيات Scrum.",
        "correct": false
      },
      {
        "text": "توصيل معلومات المشروع وتحديثاته بفعالية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إطلاق مشروع تطوير منتج جديد. وقد استعرض راعي المشروع نتائج تحليل المخاطر كما هو موثق في سجل المخاطر وهو واثق من نجاح المشروع. ومع ذلك، فإن المستثمرين الرئيسيين ليسوا على نفس القدر من الثقة ويريدون المزيد من المعلومات حول المشروع والمخاطر قبل الاستثمار.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم تحليل مفصل للسوق وخطة العمل وخطة إدارة المخاطر للمستثمرين.",
        "correct": true
      },
      {
        "text": "إعداد تحليل التكلفة والعائد وتقديمه للمستثمرين.",
        "correct": false
      },
      {
        "text": "قم بتقييم ووصف جميع المخاطر المرتبطة بتطوير المنتج وإطلاقه لأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تخطيط أنشطة التطوير لإشراك أصحاب المصلحة في مختلف مراحل المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق المشروع في مرحلة التخطيط لمشروع معقد. ولدى المشروع قيد تاريخ انتهاء المشروع لإطلاق منتج جديد ليس لديهم خبرة سابقة فيه. ويطلب راعي المشروع جدولاً زمنياً مفصلاً، لكن الفريق غير قادر على التنبؤ بموعد إنجاز المهام طوال دورة حياة المشروع، خاصة وأن بعضها يعتمد على نواتج وحدات العمل الأخرى.\nما هي منهجية دورة الحياة التي يجب أن يستخدمها مدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "دورة حياة مختلطة تتضمن تراكمات المنتجات ذات الأولوية المعتمدة من الجهة الراعية",
        "correct": true
      },
      {
        "text": "دورة حياة تنبؤية تتضمن جدولاً زمنياً بالاتفاق مع جميع وحدات العمل",
        "correct": false
      },
      {
        "text": "دورة حياة رشيقة تتضمن جدولاً زمنياً مفصلاً بالاتفاق مع جميع وحدات العمل.",
        "correct": false
      },
      {
        "text": "دورة حياة متكررة تتضمن مدد المهام والميزانية المعتمدة من الجهة الراعية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع لمشروع في بلد لم تقم الشركة بأعمال تجارية فيه من قبل. وفي بداية المشروع، يدرك مدير المشروع أن هناك بعض المتطلبات التنظيمية التي ليس لدى فريق المشروع خبرة فيها.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تخصيص ميزانية كافية في حالة ضرورة تلبية هذه المتطلبات.",
        "correct": true
      },
      {
        "text": "استشر خبيرًا في الموضوع حول كيفية تجنب مثل هذه المتطلبات.",
        "correct": false
      },
      {
        "text": "إشراك خبير في الموضوع للتحقق مما إذا كانت المتطلبات ذات صلة بالمشروع.",
        "correct": false
      },
      {
        "text": "رفع المخاوف بشأن المتطلبات إلى الجهة الراعية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "عند بدء المشروع، طُلب عرض أسعار للخدمات المطلوبة من أحد البائعين، وقُدرت تكلفة العمل بمبلغ 100,000 دولار أمريكي. ومع تقدم المشروع، تم تحديث المتطلبات بعد عملية الشراء التي قامت بها الشركة، وتم استلام عرض أسعار معدل بمبلغ يزيد على 000 250 دولار أمريكي. ولم تكن أموال الطوارئ المخصصة كافية لتغطية الفرق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تشغيل عملية الشراء واختيار بائع جديد.",
        "correct": true
      },
      {
        "text": "راجع نوع العقد الذي سيتم منحه للبائع.",
        "correct": false
      },
      {
        "text": "تقدم بأفضل عرض حسب عملية الشراء.",
        "correct": false
      },
      {
        "text": "إشراك اللجنة التوجيهية وتصعيد المشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قبل اجتماع تقييم المشروع، يشتكي أحد أصحاب المصلحة الرئيسيين من أن المشروع لا يحقق الفوائد المتوقعة من المشروع. يحتاج مدير المشروع إلى التحضير للاجتماع لمعالجة الشكوى بفعالية.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة سجل التحكم في التغيير لمعرفة الفروق المعتمدة في نواتج المشروع القابلة للتسليم.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات وخطة مشاركة أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "مراجعة مقاييس أداء المشروع ونتائج اختبار القبول.",
        "correct": false
      },
      {
        "text": "مراجعة أهداف المشروع ومعايير النجاح.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتبع المشروع خطة استراتيجية تتضمن معالم رئيسية تم تنسيقها مع أصحاب المصلحة. أثناء تنفيذ العمل، تنشأ مهام جديدة إلى جانب التبعيات المهمة التي تحول دون تقدم العمل كما هو مخطط له. يعجز الفريق عن تحديد من يجب أن يتخذ القرارات ويتخذ الإجراءات بشأن المهام والتبعيات الجديدة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم مخطط RACI لتيسير المساءلة عن مهام الفريق.",
        "correct": true
      },
      {
        "text": "استخدم مخطط جانت لضمان إنجاز المعالم الرئيسية.",
        "correct": false
      },
      {
        "text": "اسأل الرعاة الذين يتحملون المسؤولية.",
        "correct": false
      },
      {
        "text": "استخدم هيكل تقسيم العمل (WBS) لضمان تغطية المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق على مشروع ابتكاري باستخدام نهج تدريجي. بعد كل اجتماع حالة، يشتكي بعض أصحاب المصلحة الرئيسيين من عدم إطلاعهم على ما تم إنجازه للتحضير للاجتماع.\nما الذي يجب أن يفعله مدير المشروع لمنع حدوث ذلك مرة أخرى؟",
    "explanation": "",
    "choices": [
      {
        "text": "أرسل المعلومات المحدثة إلى أصحاب المصلحة الرئيسيين قبل يوم واحد من الاجتماع.",
        "correct": true
      },
      {
        "text": "حدد جدول أعمال الاجتماع مع أصحاب المصلحة الرئيسيين، وشاركه مسبقاً.",
        "correct": false
      },
      {
        "text": "اجتمع مع أصحاب المصلحة الرئيسيين بشكل منفصل مسبقاً قبل كل اجتماع حالة.",
        "correct": false
      },
      {
        "text": "اطلب من الجهة الراعية مواءمة أصحاب المصلحة الرئيسيين مع إيقاع الاجتماع الحالي للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في منظمة تشجع ثقافتها الفرق الافتراضية. وتنشأ تحديات جديدة بشكل دوري في هذه البيئة، ومدير المشروع حالياً في المراحل الأولى من مشروع جديد رشيق.\nما الذي يجب أن يفعله مدير المشروع لمساعدة الفريق في التغلب على هذه التحديات؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تحليل لنقاط القوة والضعف والفرص والتهديدات (SWOT) لتحديد حالة الفريق بسرعة واتخاذ الإجراءات المناسبة.",
        "correct": true
      },
      {
        "text": "قم بتعليق جميع الأنشطة واجمع الفريق في اجتماع لمناقشة التحديات الجديدة التي تم تحديدها حتى يمكن معالجتها على الفور.",
        "correct": false
      },
      {
        "text": "انتظر حتى الاجتماع اليومي التالي لسكروم لمعالجة التحديات حتى يعرف الفريق بأكمله ما يجري ويمكن مناقشة المشكلات.",
        "correct": false
      },
      {
        "text": "اعمل مع مالك المنتج لتحديد أفضل مسار عمل للفريق لإزالة أي عوائق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشرف مدير مشروع حاليًا على مشروع هجين له نطاق محدد ومتطلبات جودة محددة. ومع ذلك، وبسبب التغييرات الأخيرة في منتج أحد المنافسين، هناك قلق متزايد من أن نواتج المشروع قد تصبح متقادمة بحلول وقت اكتمال المشروع.\nما الذي يجب على مدير المشروع القيام به لمعالجة التقادم المحتمل للنواتج؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تحليل شامل للأثر على الأعمال واستكشاف خيارات استخدام مواد أو موارد بديلة.",
        "correct": true
      },
      {
        "text": "تقييم تأثير تغييرات منتجات المنافسين والسعي للحصول على موافقة مجلس مراقبة التغيير (CCB) لمعالجتها.",
        "correct": false
      },
      {
        "text": "مواصلة المشروع كما هو مخطط له، مع الالتزام بالجدول الزمني الحالي للمشروع وتجنب أي تغييرات في النطاق أو الجودة.",
        "correct": false
      },
      {
        "text": "إغلاق المشروع الحالي وبدء مشروع جديد يتماشى بشكل أفضل مع المشهد التنافسي المتغير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع في مشروع يقوم بتحويل المنظمة إلى تبني مبادئ أجايل. ويكون تعريف نطاق المشروع قيد التنفيذ، لكن فريق المشروع يريد أن يكون التعريف أقل رسمية.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة النطاق وتحديد المخرجات المطلوبة ووضع خطط طوارئ للمخاطر التي تم تحديدها.",
        "correct": true
      },
      {
        "text": "نظّم ورشة عمل مع مالك المنتج وفريق المشروع لإنشاء تراكمات المنتج ومعايير القبول.",
        "correct": false
      },
      {
        "text": "إنشاء موقع إلكتروني للاتصالات لمشاركة تعريف النطاق وتراكم المنتجات مع فريق المشروع.",
        "correct": false
      },
      {
        "text": "اجتمع مع فريق المشروع لتحديد المتطلبات الإلزامية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتم نقل أعضاء الفريق من مشروع تنبؤي إلى فريق رشيق تم تشكيله حديثاً. يعرب أعضاء الفريق الجدد عن عدم رضاهم عن التدريب الإضافي المطلوب منهم إكماله في قناة الدردشة الداخلية لفريق المشروع. كيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تجاهل الشكاوى وافترض أن أعضاء الفريق الجدد سيتأقلمون مع مرور الوقت.",
        "correct": true
      },
      {
        "text": "حدد موعداً لعقد اجتماع لمناقشة المخاوف وتوضيح أهمية التدريب.",
        "correct": false
      },
      {
        "text": "إزالة شرط التدريب الإضافي للتخفيف من استياء أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "إرسال مذكرة توضح التدريب الإلزامي وعواقب عدم الامتثال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم أحد العملاء بزيارة أسبوعية إلى موقع المشروع لفحص المرحلة النهائية من تطوير المنتج. ينبه مدير الجودة مدير المشروع إلى أن العميل كان غير مهني للغاية وقام بتوبيخ أعضاء الفريق خلال الزيارات الأسبوعية السابقة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه الحادثة؟",
    "explanation": "",
    "choices": [
      {
        "text": "صياغة خطاب شكوى بشأن سلوك مفتش العملاء.",
        "correct": true
      },
      {
        "text": "اسمح بمرور الأسبوع، ثم أرسل شكوى إلى العميل.",
        "correct": false
      },
      {
        "text": "ناقش الأمر مع فريق الإدارة العليا لمدير المشروع.",
        "correct": false
      },
      {
        "text": "فهم الموقف من خلال التحدث مع أعضاء الفريق والعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع مصفاة نفط في منتصف مرحلة التنفيذ. وقد وجد فريق المشروع أن المشروع قد تأخر بسبب تغيير في اللوائح البيئية، وتأخير في المشتريات، وتغيير في الحكومة. ومع ذلك، لا تزال هناك حاجة ماسة إلى إنجاز المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنهاء المشروع على الفور، وتجنب المزيد من الخسارة من خلال المزيد من النفقات، واستيعاب الخسارة الحالية.",
        "correct": true
      },
      {
        "text": "راجع تأثير التغييرات، وامتثل للوائح الجديدة، ثم اقترح خطة واقعية.",
        "correct": false
      },
      {
        "text": "اتخاذ الترتيبات اللازمة لشراء المواد، ومواصلة المشروع كما هو مخطط له.",
        "correct": false
      },
      {
        "text": "أوقف المشروع وتفاوض مع الحكومة الجديدة لدفع فواتير العمل المنجز حتى تلك اللحظة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء العمل على مشروع طويل مع العديد من التغييرات، يتم إبلاغ مدير المشروع من قبل أحد أعضاء الفريق بأن بعض المستخدمين غير مرتاحين لبعض وظائف المنتج التي تم إصدارها في التكرار السابق.\nما الإجراء الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من أن مهام الفريق واضحة.",
        "correct": true
      },
      {
        "text": "الحصول على ملاحظات أصحاب المصلحة ورؤى الفريق.",
        "correct": false
      },
      {
        "text": "قم بإبلاغ الفريق بالتغييرات.",
        "correct": false
      },
      {
        "text": "تحديث سجل التغيير وسجل المشكلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تشكيل فريق رشيق جديد ويلاحظ مدير المشروع أن الفريق يعاني في العديد من المجالات. ويعاني الفريق من عدم القدرة على الوفاء بالتزامات التكرار وصراعات أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إشراك الإدارة للمساعدة في حل النزاعات.",
        "correct": true
      },
      {
        "text": "إبلاغ الإدارة بأن الالتزامات لن يتم الوفاء بها.",
        "correct": false
      },
      {
        "text": "طرح المشاكل في الاستعراض بأثر رجعي واقتراح الحلول.",
        "correct": false
      },
      {
        "text": "تدريب الفريق ككل وبشكل فردي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط الأولي للمشروع، تم إبلاغ مدير المشروع بأن أحد أعضاء الفريق قد تم تخصيصه حصريًا للمشروع. وفي منتصف المشروع، تم تخصيص عضو الفريق لمشروع آخر.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش الآثار المترتبة على تنفيذ المشروع مع المدير الوظيفي ووضع مسار عمل مناسب.",
        "correct": true
      },
      {
        "text": "تسجيل ذلك كمخاطر في سجل المخاطر وتنفيذ الاستجابة المناسبة.",
        "correct": false
      },
      {
        "text": "تأكد من تدريب أعضاء الفريق على جميع مهام المشروع لزيادة القيمة المحتملة لنتائج المشروع.",
        "correct": false
      },
      {
        "text": "رفع هذه المشكلة إلى راعي المشروع لوضع مسار عمل مناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة إنشاءات بتنفيذ مشروع استراتيجي جديد بميزانية ثابتة. أثناء مراقبة المشروع، تم اكتشاف أن التكلفة الإجمالية للمشروع تتزايد. علم مدير المشروع أن هذا يرجع إلى أن الفريق يستخدم مواد أكثر مما هو مفصل في النطاق الأصلي. والسبب في هذا التباين هو أن اثنين من أعضاء الفريق جديدان في المنظمة ولم يتم الإبلاغ عن اقتناء مواد جديدة.\nما الذي كان ينبغي على مدير المشروع فعله لمنع هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "توثيق مخاطر انحراف تكلفة المواد في مصفوفة مخاطر المشروع.",
        "correct": true
      },
      {
        "text": "توفير التدريب على عملية الحصول على المواد ومتطلبات إعداد التقارير.",
        "correct": false
      },
      {
        "text": "إنشاء احتياطي للطوارئ لتغطية الزيادات في التكاليف المرتبطة بالمواد.",
        "correct": false
      },
      {
        "text": "تجنب إدراج مهندسين جدد في مشروع استراتيجي بميزانية ثابتة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك فريق المشروع أن بنية المنتج لن تدعم العدد المتزايد من المستخدمين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتعيين أحد أعضاء الفريق لتنفيذ اختبار الأداء والتأكد من أن أداء المنتج مقبول.",
        "correct": true
      },
      {
        "text": "استعن بخبراء خارجيين لتقييم بنية المنتج والتوصل إلى خطة حل.",
        "correct": false
      },
      {
        "text": "انخرط مع مالك المنتج في التطوير الجديد وحدد أولويات الحل في الأعمال المتراكمة للمنتج.",
        "correct": false
      },
      {
        "text": "التفاوض مع أصحاب المصلحة لإبطاء تطوير المنتج حتى يتوفر حل قابل للتطبيق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مشروع مدته عام واحد، قام الفريق بتسليم كل ما طلبه وحدده مالك المنتج وحقق جميع أهداف السباق السريع. كان المشروع على المسار الصحيح فيما يتعلق بالجدول الزمني والنطاق والميزانية. وبعد مرور بضعة أشهر على إطلاق المشروع، أظهرت استطلاعات الرأي الخاصة برضا المنتج أن مستوى رضا العميل كان منخفضًا بشكل مدهش.\nما الذي يجب أن يفعله مدير المشروع لمنع حدوث هذا الموقف في المستقبل؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع استهلالي في بداية المشروع.",
        "correct": true
      },
      {
        "text": "تحسين تطبيق تقنيات أتمتة الاختبار.",
        "correct": false
      },
      {
        "text": "زيادة مشاركة مكتب إدارة المشروع (PMO).",
        "correct": false
      },
      {
        "text": "إجراء مراجعات دورية بمشاركة العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم التعاقد مع مدير مشروع من قبل مدير إداري لتحويل مكتب إدارة المشروع (PMO) من هيكلية الشلال التي تركز على تطوير البرمجيات إلى مكتب إدارة مشروع رشيق. كان مدير مكتب إدارة المشاريع مقاومًا بشكل خاص للتغيير. عند التحقيق، يدرك مدير المشروع أن مقاومة المدير بسبب نقص المعرفة الرشيقة قد تجعله يبدو غير كفء.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من المدير الإداري التدخل لدى مدير مكتب إدارة المشاريع لشرح سبب ضرورة ذلك.",
        "correct": true
      },
      {
        "text": "اطلب من فريق المشروع دعم التحول بغض النظر عن سلبية مدير مكتب إدارة المشاريع.",
        "correct": false
      },
      {
        "text": "تنفيذ استراتيجية إدارة التغيير لضمان استيفاء العملية لمتطلبات الحوكمة.",
        "correct": false
      },
      {
        "text": "تنفيذ برنامج تدريبي على الرشاقة لجميع الموظفين لضمان وجود تطابق في التعلم للجميع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف الطريق إلى التنفيذ، يقوم المشارك في رعاية المشروع، الذي يساهم بمبلغ كبير من رأس المال في المشروع، بإبلاغ فريق المشروع بميزة إضافية إلى مخرجات المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم أثر المتطلبات الجديدة وتحديث سجل المخاطر.",
        "correct": true
      },
      {
        "text": "أكمل المشروع الحالي كما هو مخطط له وقم بتحديثه لاحقاً بالمتطلبات الجديدة.",
        "correct": false
      },
      {
        "text": "جمع متطلبات الراعي المشارك وتنفيذ عملية مراقبة التغيير المتكاملة.",
        "correct": false
      },
      {
        "text": "إقناع الراعي المشارك بالحفاظ على النطاق الحالي وإكمال المشروع كما هو مخطط له.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nكجزء من مراجعة المشروع السريع، يبدو أن أصحاب المصلحة غير مطلعين وغير قادرين على الاتفاق على كيفية المضي قدماً في المشروع. ما الذي ينبغي لمدير المشروع أن يفعله أولاً لضمان موافقة أصحاب المصلحة على مخرجات المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من خطة إدارة الاتصالات",
        "correct": true
      },
      {
        "text": "إجراء تحليل منهجي لأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "قم بتضمين أصحاب المصلحة في اجتماعات الاستعداد اليومية.",
        "correct": false
      },
      {
        "text": "قم بتجميع الفريق لضمان عمل جماعي أفضل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل أحد المطورين النواتج القابلة للتسليم لميزة ما. مالك المنتج غير متأكد من كيفية تقييم جودة الناتج.\nبالنظر إلى أن المشروع يستخدم نهجًا رشيقًا، ما نوع الأداة أو التقنية التي يجب أن يستخدمها مالك المنتج؟",
    "explanation": "",
    "choices": [
      {
        "text": "حكم الخبراء",
        "correct": true
      },
      {
        "text": "اتخاذ القرار",
        "correct": false
      },
      {
        "text": "عروض توضيحية/مراجعات",
        "correct": false
      },
      {
        "text": "قوائم المراجعة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع مرحلي، يعلم فريق المشروع أن أحد المخاطر المحددة قد تحقق. ويقرر مدير المشروع تنفيذ خطة الاستجابة للمخاطر، ولكن احتياطي الطوارئ لا يغطي الميزانية الإجمالية لتلك الخطة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من راعي المشروع تطبيق احتياطي الإدارة لتغطية التكلفة المتبقية للاستجابة.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية للمشروع توفير ميزانية إضافية لتعويض التكلفة الزائدة.",
        "correct": false
      },
      {
        "text": "إصدار طلب تغيير لتعديل خطوط الأساس للنطاق والتكلفة والجدول الزمني لدعم الخطة الجديدة.",
        "correct": false
      },
      {
        "text": "استخدام احتياطي الطوارئ وتقييم خيارات خفض الميزانية لتغطية الأعمال المتبقية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تأخر وضع الجدول الزمني النهائي للمشروع بسبب عدم القدرة على التفاوض على اتفاق مع أحد البائعين اللازمين لإنجاز المشروع بنجاح.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعميم محاضر الاجتماعات ومناقشة البنود المتفق عليها والمعلقة مع فريق المشروع والعميل.",
        "correct": true
      },
      {
        "text": "الاجتماع مع البائع لمناقشة المسار المستقبلي وتحديد بائع بديل إذا لزم الأمر.",
        "correct": false
      },
      {
        "text": "الاجتماع مع راعي المشروع والسعي للحصول على دعمه في استبدال البائع بسبب عدم القدرة على التفاوض على اتفاق.",
        "correct": false
      },
      {
        "text": "قم بتوصيل احتياجات المشروع والتأثير على البائع لقبول الشروط في أقرب وقت ممكن لإنجاح تسليم المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع لديه مشروع جديد. تم تحديد هيكل تقسيم العمل (WBS) وتسلسل الأنشطة، ولكن الفريق يواجه صعوبة في تقدير مدة كل نشاط.\nما النهج الذي يجب أن يتبعه مدير المشروع لضمان موثوقية التقديرات؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من كل عضو في الفريق تقدير مدة كل نشاط.",
        "correct": true
      },
      {
        "text": "النظر في قيود الجدول الزمني للمشروع وتقدير الأنشطة وفقًا لذلك.",
        "correct": false
      },
      {
        "text": "الوصول إلى سجلات أداء المشاريع السابقة المماثلة واستخدامها كمرجع.",
        "correct": false
      },
      {
        "text": "استشر مديري المشاريع الآخرين لتقدير مدة كل نشاط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة الاختبار في مشروع تقني، يكتشف مدير المشروع بعض المشاكل في المنتج النهائي، ثم يكتشف بعد ذلك أنه بعد المفاوضات، تم استبعاد ميزات مهمة للمنتج من نطاق العقد في محاولة لتقليل التكاليف على العميل.\nما الذي يجب أن يفعله مدير المشروع لحل المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية لاتخاذ قرار بإعادة تحديد النطاق وحل المشكلة.",
        "correct": true
      },
      {
        "text": "العمل مع العميل للتفاوض وضمان إدراج الميزات الأساسية المفقودة في المشروع.",
        "correct": false
      },
      {
        "text": "استمر في المشروع كما هو مخطط له وسجل مشكلة نطاق العقد في سجل المشكلات.",
        "correct": false
      },
      {
        "text": "مراجعة الدروس المستفادة لإيجاد حل لمشاكل التفاوض على العقود ونطاقها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع لمشروع جديد. لا تزال المتطلبات تتطور، ولكن هناك حاجة إلى تقديم قيمة العمل بسرعة.\nما هو النهج الذي يجب أن يتبعه مدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تطوير استراتيجيات التخفيف من المخاطر لمعالجة مخاطر المتطلبات المتطورة.",
        "correct": true
      },
      {
        "text": "استخدم تراكم المنتجات وأكمل المتطلبات ذات الأولوية القصوى أولاً.",
        "correct": false
      },
      {
        "text": "تأكد من توثيق تغييرات النطاق في مصفوفة تتبع المتطلبات.",
        "correct": false
      },
      {
        "text": "قم بتطوير مخطط تفصيلي للميزات وإظهار التقدم المحرز في المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء تنفيذ المشروع، يتم إبلاغ مدير المشروع بأن بعض الموارد سيتم إزالتها قريباً من المشروع. ما الذي ينبغي أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعداً لعقد اجتماع لإبقاء أصحاب المصلحة على اطلاع.",
        "correct": true
      },
      {
        "text": "إبلاغ أصحاب المصلحة في اجتماع المراجعة التالي المقرر عقده.",
        "correct": false
      },
      {
        "text": "قم بتحديث سجل المخاطر مع هذه المخاطر على موارد المشروع.",
        "correct": false
      },
      {
        "text": "طلب تسوية الموارد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشعر فريق تسليم البرمجيات في أحد البنوك الكبيرة بالإحباط بسبب متطلبات التوثيق التي يضعها قسم الحوكمة المسؤول عن مجلس مراقبة التغيير (CCB). يتواصل مدير المشروع مع قسم الحوكمة ويطلب منهم العمل معًا لتقليل كمية الأعمال الورقية المطلوبة من فريق التسليم، موضحًا أن ذلك يبطئهم ويضيف تكاليف عامة.\nهذا مثال على أي نوع من القيادة؟",
    "explanation": "",
    "choices": [
      {
        "text": "القيادة الخادمة",
        "correct": true
      },
      {
        "text": "قيادة المعاملات",
        "correct": false
      },
      {
        "text": "القيادة التوجيهية",
        "correct": false
      },
      {
        "text": "القيادة البناءة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتوي مشروع التحول التنظيمي على مساري عمل يعملان بالتوازي بين المقر الرئيسي للشركة ومكتب خارجي. وقبل بدء المشروع، من المقرر أن يلتقي مدير المشروع بقائد المكتب الخارجي.\nماذا يجب أن يكون محور الاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ رئيس المكتب الخارجي بالقيمة الاستراتيجية للمشروع والمنجزات الرئيسية ومشاركته المتوقعة.",
        "correct": true
      },
      {
        "text": "التوصل إلى اتفاق بشأن اختيار استراتيجيات الشراء التي سيستخدمها المكتب الخارجي.",
        "correct": false
      },
      {
        "text": "مساعدة رئيس المكتب الخارجي في التواصل مع موظفي المقر الرئيسي للشركة بشأن المشروع.",
        "correct": false
      },
      {
        "text": "تحديد وتعيين خبير في الموضوع (SME) لتمثيل المشروع في المكتب الخارجي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكملت مجموعة من أعضاء فريق أجايل للتو تدريباً شخصياً على عدد من العمليات التنظيمية الهامة والمعقدة. في اليوم التالي، أعرب العديد من أعضاء الفريق عن مخاوفهم وقالوا إنهم يواجهون مشكلة في تذكر ما تعلموه. وهناك جلسة تدريب أخرى متاحة الأسبوع المقبل، لكن الفريق متأخر بالفعل عن الجدول الزمني لبعض المهام الحرجة، ويستغرق التدريب يوم عمل كامل.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا القلق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من أعضاء الفريق المشاركة مع بعضهم البعض لمشاركة المعلومات التي تعلموها.",
        "correct": true
      },
      {
        "text": "أنشئ ملفاً معلوماتياً يحتوي على النقاط الرئيسية المستخلصة من التدريب.",
        "correct": false
      },
      {
        "text": "قم بدعوة أعضاء الفريق لإعادة حضور التدريب إذا كانوا بحاجة إلى تجديد المعلومات.",
        "correct": false
      },
      {
        "text": "قم بإحالة أعضاء الفريق إلى ملاحظات مراجعة التدريب للعثور على المعلومات التي يحتاجون إليها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل أحد مديري المشروع على مشروع نشر لاستبدال بعض المعدات التي ستصبح متقادمة قريبًا. وكشف استعراض للجدول الزمني والتكلفة عن احتمال حدوث تأخير لمدة 5 أشهر.\nكيف ينبغي لمدير المشروع معالجة المخاطر الناجمة عن التأخير؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل تأثير الأعمال من أجل إعادة ترتيب أولويات المخرجات.",
        "correct": true
      },
      {
        "text": "طلب التفاوض مع البائعين للحصول على فترة دعم أطول.",
        "correct": false
      },
      {
        "text": "اطلب طلب معدات جديدة على الفور حتى لا تكون هناك مشكلة في الدعم.",
        "correct": false
      },
      {
        "text": "اعترف بهذه القيود وضعها في الاعتبار عند التخطيط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في الليلة السابقة لاجتماع الاستعداد، أدرك أحد مديري المشروع أنه لن يتمكن من حضور الاجتماع اليومي للاستعداد شخصيًا ولكنه سينضم عبر الهاتف. أرسل مدير المشروع رسالة بريد إلكتروني إلى فريق المشروع لإعلامهم بذلك. يشعر أحد أعضاء الفريق بالضيق لأنه من المتوقع أن يحضر الاجتماع شخصيًا على الرغم من أنه الأطول في التنقل.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتعديل سياسة الحضور الحالية للسماح لجميع أعضاء الفريق بحضور الاجتماعات التحضيرية عن بُعد.",
        "correct": true
      },
      {
        "text": "قم بتدوير موقع الاجتماعات التحضيرية لضمان حصول الجميع على فرصة متساوية للحضور شخصيًا.",
        "correct": false
      },
      {
        "text": "راجع المبادئ التوجيهية لحضور الاجتماعات بما في ذلك متى يُسمح بالحضور عن بُعد وتحت أي ظروف.",
        "correct": false
      },
      {
        "text": "قم بتوصيل أسباب حضور الاجتماعات التحضيرية شخصيًا وفوائد القيام بذلك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الأيام القليلة الأولى من تنفيذ مشروع مدته ستة أسابيع، اكتشف فريق المشروع عائقًا. عمل مدير المشروع مع الفريق لتطوير وتنفيذ استراتيجية لحل المشكلة. بعد ذلك، يكتشف مدير المشروع أنه نتيجة لذلك، يمكن الآن إكمال المشروع في ثلاثة أسابيع فقط.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل مع أصحاب المصلحة لتحديد أفضل مسار للعمل.",
        "correct": true
      },
      {
        "text": "تغيير نطاق المشروع ليشمل مخرجات إضافية.",
        "correct": false
      },
      {
        "text": "حافظ على الجدول الزمني الأصلي الذي مدته ستة أسابيع والجدول الزمني للمراحل الرئيسية.",
        "correct": false
      },
      {
        "text": "إعادة تخصيص الفريق لمشاريع أخرى لتحقيق أقصى قدر من الكفاءة.",
        "correct": false
        }
      ]
    }
  ]
}
