{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
      {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع رشيق في مرحلة التكرار الثالثة. أثناء التكرار الجاري، يتصل العميل بمدير المشروع طالباً ميزات إضافية. تعتبر هذه الميزات الإضافية مهمة ويمكن استيعابها دون الحاجة إلى موارد إضافية كبيرة. ويطلب العميل إجراء تغييرات فورية على التكرار الحالي لدمج الميزات الإضافية.\nكيف يجب أن يستجيب مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ذكّر العميل بأنه لا يُسمح بإجراء أي تغييرات وفقاً للعقد.",
        "correct": true
      },
      {
        "text": "قم بتغيير التكرار الحالي ليشمل الميزات الإضافية.",
        "correct": false
      },
      {
        "text": "حدد أولويات الميزات الإضافية لبداية التكرار التالي.",
        "correct": false
      },
      {
        "text": "أخبر العميل أنه ستتم إضافة ميزات جديدة في مرحلة لاحقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "استلم مدير مشروع مؤخراً مشروعاً من مدير مشروع غادر الشركة. ويدرك مدير المشروع الجديد أن مدير المشروع السابق كان لديه أسلوب إدارة استبدادي للغاية ويتخذ جميع القرارات المتعلقة بالمشروع. لاحظ مدير المشروع الجديد أن معنويات أحد كبار المشرفين منخفضة.\nما الذي يجب أن يفعله مدير المشروع الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع مستوى سلطة المشرف.",
        "correct": true
      },
      {
        "text": "تحديد سبب المشكلة المعنوية.",
        "correct": false
      },
      {
        "text": "تعديل دور المشرف في المشروع.",
        "correct": false
      },
      {
        "text": "التحدث مع المشرف وتحديث سجل مشكلات المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع مستمر منذ بعض الوقت ووصلت نسبة إنجازه حاليًا إلى 70%. يتبع فريق التطوير بجدية خطة إدارة المشروع والنطاق المحدد في ميثاق المشروع. خلال اجتماع مراجعة المنتج، يشتكي أحد أصحاب المصلحة من ضرورة تضمين ميزات إضافية. لم تكن هذه الميزات في البداية جزءًا من نطاق المشروع ولكنها أصبحت الآن مصدر قلق ملحّ لأصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتحليل التغييرات مع الفريق واجتياز عملية التحكم في التغيير الرسمية.",
        "correct": true
      },
      {
        "text": "أبلغ صاحب المصلحة أن التغييرات سيتم تطبيقها لاحقاً كإصلاحات للمنتج.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة المشروع بالتغييرات المطلوبة وإبلاغ أصحاب المصلحة المعنيين.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير وإبلاغ الجهة الراعية بالتغييرات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قم بإعداد تاريخ إصدار جديد لهذا الناتج القابل للتسليم مع مالك المنتج.\nعلى الرغم من أن العميل يتلقى تقارير سرعة العمل والنتائج من مدير المشروع عن طريق البريد الإلكتروني، إلا أن حالات التصعيد إلى راعي المشروع التي يشكو فيها من أداء المشروع شائعة. ما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإشراك العميل في جلسات تخطيط ومراجعة سباقات السرعة للاتفاق على تواريخ الإصدار.",
        "correct": true
      },
      {
        "text": "قم بجدولة جلسات منتظمة مع العميل لشرح التقارير ومعالجة الملاحظات.",
        "correct": false
      },
      {
        "text": "إرسال مستند يوضح بالتفصيل سعة الفريق وتوزيع الأدوار إلى العميل.",
        "correct": false
      },
      {
        "text": "اطلب من القائد الفني الاتصال بالعميل لشرح التفاصيل الفنية حول مشاكل المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق مشروع رشيق ببناء موقع إلكتروني لأحد العملاء. يقوم العميل بإبلاغ مالك المنتج بأن شركته قررت إطلاق الموقع الإلكتروني قبل شهر من الموعد المحدد، وذلك للاستفادة من فرصة عمل.\nما الذي يجب أن يطلب مدير المشروع من الفريق القيام به؟",
    "explanation": "",
    "choices": [
      {
        "text": "الالتزام بموارد إضافية لإكمال العمل قبل شهر من موعده.",
        "correct": true
      },
      {
        "text": "اجتمعوا كمجموعة لتقييم ما يمكن إكماله حسب الجداول الزمنية الجديدة.",
        "correct": false
      },
      {
        "text": "أخبر العميل أنه من غير الممكن إطلاق الموقع الإلكتروني في هذا الوقت المبكر.",
        "correct": false
      },
      {
        "text": "عقد اجتماع بأثر رجعي لفهم كيف كان بإمكانهم العمل بسرعة ص.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع الرشيق في أول تكرار من 12 تكراراً، ويستمر كل تكرار أسبوعين. في مراجعة التكرار الأول، يطلب أصحاب المصلحة تقارير شهرية للمضي قدماً.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من أعضاء الفريق إنشاء تقارير شهرية عن التكرار.",
        "correct": true
      },
      {
        "text": "إنشاء تقارير شهرية وإرسالها إلى أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تدريب وتوجيه أصحاب المصلحة على المنهجيات الرشيقة.",
        "correct": false
      },
      {
        "text": "اطلب من أصحاب المصلحة المشاركة في مراجعات التكرار الشهرية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق يتغيب بشكل متكرر عن اجتماعات فريق المشروع. فبدلاً من العمل على المشروع الحالي، كان عضو الفريق يعمل على مهمة كلفه بها مديره الوظيفي.\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش تخصيص الموارد مع المدير الوظيفي لعضو الفريق.",
        "correct": true
      },
      {
        "text": "إزالة عضو الفريق من فريق المشروع بسبب غيابه المستمر.",
        "correct": false
      },
      {
        "text": "تسجيل حالات الغياب في تقييم أداء عضو الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من عضو آخر في الفريق الإدلاء برأيه فيما يتعلق بالمشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب مالك المنتج من مدير المشروع وفريق العمل الرشيق عرض الوظائف المكتملة على أصحاب المصلحة الرئيسيين في المشروع. لا يزال المشروع في أيامه الأولى ولم يكمل سوى ثلاث تكرارات للوظائف. هذه هي المرة الأولى التي يتعرض فيها أصحاب المصلحة لمشروع رشيق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عزز مع مالك المنتج أن دوره هو التواصل مع مجموعات أصحاب المصلحة وإدارتها بشكل مباشر.",
        "correct": true
      },
      {
        "text": "حدد التوقعات مع أصحاب المصلحة فيما يتعلق بماهية أجايل والنهج المتبع، وأنهم سيشاهدون قدرًا ضئيلًا من الوظائف.",
        "correct": false
      },
      {
        "text": "اعرض الوظائف المكتملة على أصحاب المصلحة، إلى جانب متطلبات المستخدم والنماذج الأولية للحلول المتاحة.",
        "correct": false
      },
      {
        "text": "قم بحماية الفريق من التشتت من خلال توفير رابط لبيئة اختبار قبول المستخدم (UAT) حتى يتمكن أصحاب المصلحة من عرض الوظيفة مباشرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أطلقت إحدى الشركات مشروعًا استراتيجيًا جديدًا. تم تحديد هدف المشروع ونطاقه بشكل فضفاض في اجتماع اللجنة التنفيذية، وتم تعيين أصحاب المصلحة. يحتاج مدير المشروع إلى عقد اجتماع انطلاق المشروع. ومع ذلك، فإن معظم أصحاب المصلحة في مواقع مختلفة وبعضهم في إجازة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد الاجتماع الافتتاحي مع أصحاب المصلحة المتاحين وإطلاع الآخرين على آخر المستجدات لاحقاً.",
        "correct": true
      },
      {
        "text": "تأجيل الاجتماع الافتتاحي حتى عودة أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "قم بجدولة جلسات فردية مع أصحاب المصلحة قبل مغادرتهم.",
        "correct": false
      },
      {
        "text": "رتب اجتماعاً افتراضياً افتراضياً للفريق مع أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع على وشك البدء وفرضت لائحة جديدة موعداً نهائياً سيؤثر سلباً على المشروع. سيؤدي عدم الامتثال للوائح إلى فرض غرامات باهظة على المنظمة. المشروع هو المفتاح لتحقيق الأهداف السنوية للمنظمة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل المسار الحرج وتحديد أولويات الموارد نحو المهام الأساسية.",
        "correct": true
      },
      {
        "text": "تفويض المهام المرتبطة بمستويات مخاطر أعلى إلى طرف ثالث.",
        "correct": false
      },
      {
        "text": "الحصول على تمويل إضافي لتخفيف الحاجة إلى الخدمات الخارجية.",
        "correct": false
      },
      {
        "text": "بناء نماذج ومحاكاة لتحديد المشكلات المحتملة في وقت مبكر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم استبدال عضو رئيسي في فريق رشيق بعضو أقل خبرة. يشعر أحد أصحاب المصلحة بالقلق من عدم تسليم المشروع في الوقت المحدد بسبب العضو الجديد في الفريق.\nما الذي يجب أن يفعله مدير المشروع لضمان نجاح تسليم المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "أضف هذا القلق كمخاطرة في سجل المخاطر وقم بتصعيده إلى مكتب إدارة المشروع (PMO).",
        "correct": true
      },
      {
        "text": "الاجتماع مع مديرهم الوظيفي لتقييم الوضع، والحصول على إرشادات حول كيفية المضي قدمًا.",
        "correct": false
      },
      {
        "text": "عكس قرار الاستبدال وإعادة العضو الأساسي السابق إلى الفريق.",
        "correct": false
      },
      {
        "text": "تقييم أثر الاستبدال وإجراء المزيد من التعديلات على الموارد عند الضرورة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اعتمد فريق المشروع ممارسات رشيقة لتلبية حاجة العمل لتطوير تطبيق. يحضر أحد أعضاء الفريق الأقدم بشكل غير متسق اجتماعات الفريق، حتى اجتماعات الاستعداد اليومية. ثم يطلب هذا العضو الأقدم في الفريق من أعضاء الفريق الآخرين تقديم تحديثات الحالة نيابة عن العضو الأقدم في الفريق.\nما الذي يجب أن يفعله مدير المشروع للتعامل مع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب إزالة عضو الفريق الأقدم بسبب مشاكل المشاركة.",
        "correct": true
      },
      {
        "text": "تذكير عضو الفريق الأقدم بالالتزام باتفاقية عمل الفريق.",
        "correct": false
      },
      {
        "text": "تصعيد مشاركة عضو الفريق الأقدم إلى الإدارة العليا.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الآخرين تغطية المهام الموكلة إلى عضو الفريق الأقدم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قرر أحد أعضاء فريق المشروع الذي تم تعيينه لمدة ستة أشهر لإكمال مهمة محددة ترك المشروع في الشهر الخامس للبحث عن فرصة عمل أخرى.\nما الإجراء الفوري الذي يجب أن يتخذه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعديل العقد للتأكد من أن عضو الفريق سيكمل الحزم في الشهر الخامس.",
        "correct": true
      },
      {
        "text": "تحديد الحزم المتبقية التي قد تتأثر والتأكد من توفر الموارد الكافية.",
        "correct": false
      },
      {
        "text": "تأكيد شروط عقد عضو الفريق لإنهاء مشاركته بشكل مناسب.",
        "correct": false
      },
      {
        "text": "تحقق من احتياطي الطوارئ للحصول على موارد إضافية لتوظيف عضو جديد لإنهاء هذه الحزم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع بالتخطيط للإصدار التالي لفريق تطوير البرمجيات. وقد أكمل الفريق إصدارين حتى الآن، وتم تأكيد تراكم المنتجات للإصدار التالي.\nأي من الأدوات التالية يجب أن يستخدمها مدير المشروع لتخطيط مدة الإصدار التالي؟",
    "explanation": "",
    "choices": [
      {
        "text": "خارطة طريق المنتج",
        "correct": true
      },
      {
        "text": "تقويم الموارد",
        "correct": false
      },
      {
        "text": "هيكل تقسيم العمل (WBS)",
        "correct": false
      },
      {
        "text": "مخطط الشحذ",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ينص عقد تكنولوجيا المعلومات لأحد المشاريع على ضرورة أن يكون جميع أعضاء الفريق معتمدين في أمن تكنولوجيا المعلومات. يكتشف مدير المشروع أن أحد أعضاء الفريق قدم شهادة مزورة.\nما الذي يجب أن يفعله مدير المشروع أولاً للتعامل مع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتحديث خطة إدارة المشروع لتشمل الموارد اللازمة للحصول على شهادة عضو الفريق.",
        "correct": true
      },
      {
        "text": "قم بتحديث سجل المشكلات وإزالة عضو الفريق من المشروع.",
        "correct": false
      },
      {
        "text": "تأكد من حصول باقي أعضاء الفريق على شهادات سارية المفعول.",
        "correct": false
      },
      {
        "text": "تحقق من سبب عدم اكتشاف هذا الوضع في وقت سابق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء إقفال المشروع، يطلب راعي المشروع نقل أحد النواتج التي أعدها المتعاقد إلى منظمة غير ربحية دون أي تكلفة. وتنص وثائق الشراء على أن تعود ملكية الناتج إلى المتعاقد بمجرد انتهاء عقد الشراء.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة \"تجنب الاتفاقات الخارجة عن النطاق أثناء عملية الإغلاق\" إلى سجل الدروس المستفادة.",
        "correct": true
      },
      {
        "text": "بدء طلب التغيير وتنفيذ عملية التحكم في التغيير المتكاملة.",
        "correct": false
      },
      {
        "text": "اعتبر هذا التحويل مسألة مفتوحة لقسم العقود واستمر في إغلاق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة اتفاقية العقد مع المقاول لتعديل خاصية التسليم القابل للتسليم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ينضم مدير مشروع جديد إلى فريق قائم. ويدرك مدير المشروع أن هناك شخصيات قوية في الفريق، مما أدى إلى تدخل الإدارة لحل مشاكل أداء الفريق.\nما الذي يجب أن يفعله مدير المشروع الجديد عند انضمامه لأول مرة إلى هذا الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ الخطة التي وضعتها الإدارة العليا لحل النزاعات في الفريق.",
        "correct": true
      },
      {
        "text": "مراجعة سجلات سرعة الفريق ومراقبة الفريق والتفاعلات بين أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "اتبع نصيحة أكثر أعضاء الفريق صوتًا حول كيفية تحسين ديناميكيات الفريق.",
        "correct": false
      },
      {
        "text": "مراقبة الفريق وتحديد من يجب إبعاده من الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مراجعة مجلس إدارة Scrum لمشروع مختلط، يقترح أحد أعضاء الفريق إضافة مهمة خارج النطاق الأساسي. يمكن أن تقلل هذه المهمة من المخاطر على المشروع. يثيرها عضو الفريق في المراجعة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم جدوى وأثر إدراج المهمة وإدراجها في سباقات السرعة المستقبلية إذا كان ذلك مناسبًا.",
        "correct": true
      },
      {
        "text": "توجيه مالك المنتج لتقييم فائدة النشاط نحو تلبية المتطلبات الأولية للمشروع.",
        "correct": false
      },
      {
        "text": "وجّه الفريق نحو نشاط المسار الحرج وأدرج المهمة في عمود الأعمال المتراكمة لمراجعتها لاحقًا.",
        "correct": false
      },
      {
        "text": "قم بتوثيق المهمة في وثائق المشروع، مع الإشارة إلى أن الإشارة قد تقلل من المخاطر ولكنها خارج النطاق الأساسي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع تطوير منتج معقد بملايين الدولارات ومتعدد السنوات يتطلب معرفة فريدة من نوعها اكتمل بنسبة 70%. إنهاء العقد أمر محتمل بسبب عدم قبول مخرجات المشروع وتنفيذه. على الرغم من العلاقة المتوترة، فإن البائع مستعد لإعادة العمل دون أي غرامة.\nما الذي يجب أن يفعله مدير المشروع لإدارة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من العميل السماح بإعادة العمل لأن البائع لديه معرفة فريدة بالمنتج.",
        "correct": true
      },
      {
        "text": "وضع اللمسات الأخيرة على التعريف الجديد للإنجاز (DoD) مع العميل وجعل البائع يتحمل تكلفة إعادة العمل.",
        "correct": false
      },
      {
        "text": "تسهيل التفاوض بشأن معايير القبول بين العميل والبائع.",
        "correct": false
      },
      {
        "text": "توجيه البائع إلى إعادة العمل على ما تم تسليمه لأنه لم يستوفِ المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدير مدير مشروع ترقية من نظام قديم إلى إصدار جديد. وفي منتصف عملية الترقية، فشل النظام القديم في الترقية وتعذرت استعادته.\nما الذي يجب أن يفعله مدير المشروع لإدارة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تخلَّ عن النظام القديم واطلب من الفريق تسريع العمل على المنجزات الأخرى.",
        "correct": true
      },
      {
        "text": "اطلب المزيد من الوقت لاستعادة النظام القديم مع الاستمرار في المشروع.",
        "correct": false
      },
      {
        "text": "تقييم آثار الفشل وإبلاغ أصحاب المصلحة المعنيين بها.",
        "correct": false
      },
      {
        "text": "أخبر الفريق بمواصلة العمل لأنهم ليسوا مسؤولين عن النظام القديم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم توسيع نطاق مشروع رشيق من مرحلة دراسة الجدوى إلى مرحلة التنفيذ. بسبب ضيق الوقت، تم تعيين نفس الفريق للمشروع، باستثناء عضو واحد في الفريق تم استبداله بعضو جديد في الفريق. لا ينسجم العديد من أعضاء الفريق مع عضو الفريق الجديد ولا يرغبون في العمل في المرحلة التالية.\nكيف يجب على مدير المشروع التأكد من جاهزية الفريق للمرحلة التالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم التسليم التدريجي.",
        "correct": true
      },
      {
        "text": "إجبار الفريق على البقاء معًا.",
        "correct": false
      },
      {
        "text": "طلب التزام رسمي من الفريق.",
        "correct": false
      },
      {
        "text": "قم بإزالة عضو الفريق الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع مبتكر يستفيد من الذكاء الاصطناعي (AI) لتحديد المركبات الكيميائية لتطوير منتجات جديدة. وتتفاوت مدة مرحلة المعالجة بالذكاء الاصطناعي من ثلاثة أيام إلى أسبوعين، ولا يمكن التنبؤ بالنتائج. ويتمثل الهدف الأساسي للمشروع في تقديم مواصفات منتج واحد على الأقل خلال إطار زمني محدد بشهرين مع الالتزام بميزانية صارمة لا يمكن زيادتها.\nما الإجراء الذي يجب على مدير المشروع اتخاذه لتحسين استخدام الميزانية الثابتة وتقديم أعلى قيمة تجارية ممكنة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من أن تقتصر عمليات تكرار المواصفات على 50% من المدة الإجمالية للمشروع.",
        "correct": true
      },
      {
        "text": "ضمان أن تقتصر معالجة الذكاء الاصطناعي على 25% من الميزانية الإجمالية للمشروع.",
        "correct": false
      },
      {
        "text": "خطط لتكرار العملية مباشرةً بعد معالجة الذكاء الاصطناعي لتحليل أهداف التطوير وتحديد أولوياتها.",
        "correct": false
      },
      {
        "text": "تخطيط عمل المواصفات كمهمة تنبؤية ذات مدة محددة لضمان القيمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء المرحلة النهائية للمشروع، يطلب أحد أصحاب المصلحة الرئيسيين من مدير المشروع إطلاع المجلس التنفيذي على العائد على الاستثمار وأي قيمة تجارية جديدة ذات صلة تم تحديدها أثناء تنفيذ المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "عرض تحليل التكلفة والعائد.",
        "correct": true
      },
      {
        "text": "عرض الفوائد المحققة.",
        "correct": false
      },
      {
        "text": "تقديم خطة إدارة التكاليف.",
        "correct": false
      },
      {
        "text": "تقديم عوامل النجاح المالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتلقى مدير المشروع بريدًا إلكترونيًا بعد فترة وجيزة من بداية سباق السرعة. وهي من أحد أصحاب المصلحة الرئيسيين غير المعتادين على المنهجيات الرشيقة ولديه شكوى خطيرة بشأن العمل الذي بدأ للتو. يصر صاحب المصلحة على ضرورة تغيير أحد النواتج القابلة للتسليم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تناول الطلب في اجتماع سكروم اليومي واطلب رأي فريق المشروع.",
        "correct": true
      },
      {
        "text": "قم بتعديل الأعمال المتراكمة لاستيعاب التغيير، وأخبر الفريق ببدء التسليم المطلوب على الفور.",
        "correct": false
      },
      {
        "text": "حدد موعداً لعقد اجتماع مع صاحب المصلحة ومالك المنتج لمناقشة الطلب.",
        "correct": false
      },
      {
        "text": "قم بإلغاء سباق السرعة الحالي، وحدد موعدًا لاستعراض الأولويات بأثر رجعي، وقم بدعوة صاحب المصلحة لمناقشة الطلب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يثير أحد أعضاء الفريق قلقاً من أن بعض النواتج قد لا تكون متوافقة مع بعض اللوائح.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإعداد اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين للحصول على توضيحات حول اللوائح التي قد تؤثر على مخرجات المشروع.",
        "correct": true
      },
      {
        "text": "اطلب خطابًا رسميًا من العميل لتأكيد ما إذا كانت اللوائح تنطبق على مخرجات المشروع.",
        "correct": false
      },
      {
        "text": "اسأل مكتب إدارة المشروع (PMO) عما إذا كانت نواتج المشروع خاضعة للوائح، وإذا كان الأمر كذلك، كيف يمكن المضي قدمًا من أجل الامتثال.",
        "correct": false
      },
      {
        "text": "اتصل بمدير عضو الفريق الذي أثار القلق لتحديد المهام المطلوبة للحفاظ على الامتثال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى الشركات بتنفيذ نظام محوسب جديد. أثناء تنفيذ المشروع، يثير قائد أحد الأقسام التي تعتبر حاسمة لإنجاز المشروع قلقًا من أن متطلبات القسم مفقودة تمامًا من خطة إدارة المشروع المعتمدة.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة توقعات جميع أصحاب المصلحة المعنيين.",
        "correct": true
      },
      {
        "text": "التمس حكم الخبراء في تصميم نطاق المشروع.",
        "correct": false
      },
      {
        "text": "إشراك جميع أصحاب المصلحة المعنيين في تخطيط المشروع.",
        "correct": false
      },
      {
        "text": "وضع خطة إدارة التغيير للموافقة على التغييرات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع متكامل يشمل تطوير الأجهزة والبرمجيات على حد سواء، مع مخطط جانت المعتمد من العميل وتوقعات مشاركة العميل. يقترح فريق تطوير البرمجيات منهجيات رشيقة للتطوير.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم أفضل منهجيات المشاريع من أجل استمرار قيمة الأعمال.",
        "correct": true
      },
      {
        "text": "اعتماد سباقات السرعة الرشيقة لتطوير المشروع ضمن الإطار الزمني المحدد.",
        "correct": false
      },
      {
        "text": "انصح الفريق باتباع مخطط جانت المعتمد من العميل بدقة.",
        "correct": false
      },
      {
        "text": "تقييم أدوار العملاء مع مكتب إدارة المشروع (PMO).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع باستخدام نهج رشيق. يقترب المشروع من مراحله النهائية، ويقوم الفريق بمراجعة مخرجات المشروع. وخلال هذه المراجعة، يتضح أن هناك ميزة مهمة مفقودة من مخرجات المشروع. هذه الميزة ضرورية لكي يتوافق النظام مع لائحة حكومية جديدة.\nكيف ينبغي لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك المنتج إنشاء قصة مستخدم لسباق السرعة التالي.",
        "correct": true
      },
      {
        "text": "اجتمع مع فريق المشروع لإعادة تقييم خارطة طريق المنتج.",
        "correct": false
      },
      {
        "text": "صياغة تقرير إنهاء المشروع وتسجيل الدروس المستفادة.",
        "correct": false
      },
      {
        "text": "الاستمرار في التسليم وتحديث تعريف المنجز (DoD).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في إحدى الشركات التي اعتمدت مؤخراً الممارسات الهجينة، يواجه أحد المشاريع صعوبة في الأداء كما هو متوقع. لا مدير المشروع ولا أعضاء الفريق لديهم خبرة سابقة في هذا النهج الجديد لإدارة المشروع. يريد مدير المشروع التأكد من أن الانتقال إلى الممارسات الهجينة يحقق النتائج المرجوة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "القيام بدور فعال في إسناد المهام لأعضاء الفريق ومتابعة نتائجها.",
        "correct": true
      },
      {
        "text": "قم بالترتيب للتدريب الأساسي المختلط لأعضاء الفريق وتأكد من قيام الفريق بإجراء اجتماعات تنسيقية.",
        "correct": false
      },
      {
        "text": "إصدار تقارير الأداء لجميع أعضاء الفريق حتى يتمكنوا من مراجعتها والتصرف بناءً عليها.",
        "correct": false
      },
      {
        "text": "قم ببناء مخطط WBS ومخطط RACI لضمان امتلاك جميع جوانب المشروع ووضوح المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قرر مدير المشروع أن استخدام نهج رشيق لمشروع جديد سيحقق أفضل النتائج. وكان بعض أعضاء الفريق يقاومون استخدام الأساليب الرشيقة وقرروا استخدام نهج تنبؤي لتنفيذ عملهم.\nما الذي كان ينبغي على مدير المشروع القيام به في بداية المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم لمهارات الفريق",
        "correct": true
      },
      {
        "text": "الدعوة إلى استخدام التقنيات الرشيقة",
        "correct": false
      },
      {
        "text": "إشراك الموارد التي كانت تشعر بالراحة في استخدام \"أجايل\" فقط",
        "correct": false
      },
      {
        "text": "تعيين مستشارين رشيقين لقيادة الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع رشيق في منتصف دورات التكرار العشر. خلال التكرار الأخير، اضطر الفريق إلى العمل لوقت إضافي لإنجاز الهدف. وفي استعراض التكرار بأثر رجعي، اتفق الفريق على أنهم استغرقوا وقتًا أطول مما كان مخططًا له لأنهم لم يكن لديهم الخبرة المطلوبة عند تنفيذ المهام الموكلة إليهم للمرة الأولى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسأل راعي المشروع عن تدريب إضافي للفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية الموافقة على طلب التغيير لمزيد من الوقت في التكرارات المستقبلية.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق إعادة تقييم تقديرات جهدهم في جلسة تخطيط التكرار.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إعادة ترتيب أولويات المنتج المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة فرق متعددة التخصصات. وخلال الاجتماع الأخير لمراجعة المشروع، أدرك مدير المشروع أن هناك احتكاكاً بين بعض أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد أعضاء الفريق وراجع أداءهم في المشروع.",
        "correct": true
      },
      {
        "text": "التشاور مع الراعي لإيجاد بدائل لأعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تقييم المشكلة وتطبيق تقنيات حل النزاعات.",
        "correct": false
      },
      {
        "text": "الإبلاغ عن المشكلة في الملخص التنفيذي الشهري للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجري العمل على مشروع رشيق لتنفيذ عملية أتمتة جديدة في أحد المصانع. يحتاج مدير المشروع إلى بائع للمساعدة في التثبيت.\nما الذي يجب أن يفعله مدير المشروع قبل أن يأتي البائع للعمل مع الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتفويض جميع القرارات الرئيسية إلى فريق البائع حتى لا يتحمل مدير المشروع أي مخاطر.",
        "correct": true
      },
      {
        "text": "عقد لقاء توجيهي لضمان مشاركة الطرفين في نفس الفهم لأهداف المشروع ومتطلباته.",
        "correct": false
      },
      {
        "text": "تقديم مصفوفة التواصل بحيث يكون جميع أعضاء الفريق والبائعين معروفين.",
        "correct": false
      },
      {
        "text": "ذكّر الفريق بأن البائع يعمل لصالحهم وأن الفريق يمكنه اتخاذ القرارات النهائية .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مالك المنتج المعين حديثًا غير متأكد من كيفية تحديد أولويات مواصفات المنتج ويذكر هذا التحدي لمدير المشروع.\nما الذي يجب أن يفعله مدير المشروع لمساعدة مالك المنتج؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد أولويات المنتج المتراكمة لمالك المنتج.",
        "correct": true
      },
      {
        "text": "تدريب مالك المنتج على كيفية تحديد أولويات مواصفات المنتج.",
        "correct": false
      },
      {
        "text": "اطلب تدريب مالك المنتج على الأساليب الرشيقة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع تحديد أولويات المنتجات المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع فريق مشروع في مشروع ما. وهدف هذا المشروع هو تعزيز قدرة المنتج في السوق.\nما الذي يجب أن يكون في مقدمة الاعتبارات عند تحديد مؤشرات الأداء الرئيسية للفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "المواءمة مع نمو الفرد وتطوره",
        "correct": true
      },
      {
        "text": "المواءمة مع احتياجات العميل",
        "correct": false
      },
      {
        "text": "المواءمة مع أهداف مدير المشروع",
        "correct": false
      },
      {
        "text": "المواءمة مع أهداف أعمال الجهة الراعية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مشروع متعدد التخصصات، يقوم مدير المشروع بتفويض بعض أنشطة إدارة المشروع إلى العديد من أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة لإدارة اتصالات المشروع وتوزيعها على أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "وضع خطة إرشادية وتضمينها في تقرير حالة المشروع.",
        "correct": false
      },
      {
        "text": "تطوير هيكل تفصيلي تنظيمي (OBS) وهيكل تفصيلي للعمل (WBS).",
        "correct": false
      },
      {
        "text": "وضع مخطط للمسؤولية والمساءلة والتشاور والإبلاغ (RACI).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروع تطوير منتج رئيسي. المشروع حاليًا في منتصف المرحلة الخامسة من المشروع، ومن المقرر إطلاق المنتج في الربع القادم. يتلقى مدير المشروع أخبارًا غير متوقعة تفيد بأن الشركة قد تم الاستحواذ عليها رسميًا من قبل منافس رئيسي. هذا المنافس لديه بالفعل منتج مماثل في محفظته.\nما الإجراء الفوري الذي يجب على مدير المشروع اتخاذه لمعالجة الموقف بفعالية؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تحليل مقارن للمنتجات لتحديد أوجه التشابه بين المنتجات.",
        "correct": true
      },
      {
        "text": "التعاون مع مدير المشروع المشرف على المنتج المنافس لمواءمة أنشطة المشروع.",
        "correct": false
      },
      {
        "text": "اطلب الدعم من راعي المشروع وابدأ إجراءات إدارة التغيير المناسبة.",
        "correct": false
      },
      {
        "text": "إعداد تقرير إنهاء المشروع وتوثيق الدروس المستفادة من المشروع الجاري.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع ببناء فريق المشروع. وقد عمل جميع أعضاء فريق المشروع معاً في مشاريع سابقة. أحد أعضاء الفريق معروف بتحدي معظم الإجراءات والعمليات التنظيمية.\nما الذي يجب أن يفعله مدير المشروع أولاً لضمان بدء المشروع بسلاسة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة أصول العملية التنظيمية (OPAs) مع جميع أعضاء الفريق ووضع القواعد الأساسية.",
        "correct": true
      },
      {
        "text": "اطلب من راعي المشروع تحديد القواعد الأساسية ومشاركتها مع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من الجهة الراعية للمشروع استبدال عضو الفريق المضطرب أو إزالته.",
        "correct": false
      },
      {
        "text": "قم بإعداد اجتماع مع أعضاء الفريق لمراجعة خطة إدارة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مؤسسة كبيرة، يواجه المشروع صعوبات في التواصل. ويعبّر أعضاء الفريق والقادة الوظيفيون عن أنهم يتم إبلاغهم في وقت متأخر جدًا أو لا يتم إشراكهم في مناقشات المشروع، أو أنهم ببساطة غير مدركين لمعلومات مهمة عن تسليم المشروع.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ضمان الالتزام بالعملية المتفق عليها كما هو مذكور في خطة الاتصالات.",
        "correct": true
      },
      {
        "text": "أرسل تحديثًا منتظمًا عبر البريد الإلكتروني إلى كل مدير وظيفي بشأن حالة المشروع والخطوات التالية.",
        "correct": false
      },
      {
        "text": "قم بتنسيق اجتماع مع قادة الفريق لإيجاد حل.",
        "correct": false
      },
      {
        "text": "ارجع إلى مخطط RACI حول من يحتاج إلى معرفة ماذا ومتى، وتأكد من الامتثال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لتسليم برنامج جديد لطلاب الجامعة. في هذا المشروع، يتم تسليم البرنامج إلى فئة محددة من الناس. ولفهم هذه الفئة على نحو أفضل، يحتاج مدير المشروع إلى تطوير نموذج مستخدم أصلي.\nكيف ينبغي لمدير المشروع القيام بذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء شخصية شخصية.",
        "correct": true
      },
      {
        "text": "التعاقد مع شركة هندسة معمارية.",
        "correct": false
      },
      {
        "text": "إرسال استبيان عام.",
        "correct": false
      },
      {
        "text": "نشر خطة تسويقية.",
        "correct": false
        }
      ]
    }
  ]
}
