 {
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
      {
    "type": "multiple-choice",
    "text": "أثناء مرحلة اختبار المشروع، يجد أحد أعضاء الفريق أن بعض المتطلبات لم يتم الوفاء بها. إذا قام المشروع الآن بإضافة عمل للوفاء بالمتطلبات، فقد يتسبب ذلك في تجاوز كبير للوقت والتكلفة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا.",
        "correct": true
      },
      {
        "text": "إجراء تحليل الأثر.",
        "correct": false
      },
      {
        "text": "الدعوة إلى اجتماع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كان من المقرر الانتهاء من مشروع بناء خط أنابيب الغاز في غضون 36 شهرًا. وبعد 24 شهراً، علّقت السلطات الحكومية المحلية المشروع بعد 24 شهراً، بحجة خرق إجراءات التأثير الاجتماعي.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة طوارئ في حالة التعليق من قبل الحكومة المحلية.",
        "correct": true
      },
      {
        "text": "مراجعة اللوائح والإجراءات المحلية والتخطيط لها وفقًا لذلك.",
        "correct": false
      },
      {
        "text": "طلب موارد إضافية لتسريع عملية البناء بعد التعليق.",
        "correct": false
      },
      {
        "text": "إنشاء قناة اتصال منتظمة مع الحكومة المحلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه افتتاح مكتب جديد في الخارج تأخيراً محتملاً لأن التصريح المطلوب لم يصدر بعد من الحكومة المحلية. اجتمع فريق المشروع لتقييم مسار العمل المناسب على النحو المبين في سجل المخاطر. وبعد إجراء تقييم شامل، قرر الفريق تأجيل الافتتاح إلى موعد آخر.\nما هي الوثيقة التي يجب أن يستخدمها مدير المشروع لتحديث خطة إدارة المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "خطة إدارة المخاطر",
        "correct": true
      },
      {
        "text": "تقرير المخاطر",
        "correct": false
      },
      {
        "text": "سجل المخاطر",
        "correct": false
      },
      {
        "text": "سجل الدروس المستفادة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع متعدد السنوات قيد التنفيذ عندما يعلن أحد الموارد الرئيسية عن تقاعده. ويشعر مدير المشروع بالقلق بشأن تأثير ذلك على المشروع وقد حدد أن العديد من المهام الحرجة ستتأثر\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مطالبة باقي أعضاء الفريق بالعمل لساعات إضافية للمهام المتأثرة.",
        "correct": true
      },
      {
        "text": "إبلاغ أصحاب المصلحة بأن مهام المورد لن تكون في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "التعاون مع مدير الموارد لتحديد وتدريب بديل مناسب.",
        "correct": false
      },
      {
        "text": "شجع عضو الفريق المتقاعد على تأجيل التقاعد لتجنب تعطيل المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق رشيق بتسليم الميزات باستمرار في الوقت المحدد، لكنه اكتشف مؤخرًا فجوة كبيرة في البنية أدت إلى إعادة العمل.\nما هي الممارسة الرشيقة التي يجب أن يستخدمها مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تخطيط الزيادة",
        "correct": true
      },
      {
        "text": "فريق العمل بأثر رجعي",
        "correct": false
      },
      {
        "text": "العرض التوضيحي لأصحاب المصلحة",
        "correct": false
      },
      {
        "text": "الوقوف اليومي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "دُعي أحد كبار أصحاب المصلحة إلى اجتماع مراجعة سريع وطلب من أحد أعضاء فريق المشروع وصف المنتج النهائي الذي سيقدمه المشروع. لم يتمكن عضو الفريق من الإجابة وأرجأ السؤال إلى عضو أرفع منه في الفريق.\nما الذي كان ينبغي فعله بشكل مختلف في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يكون عضو الفريق قد نصح صاحب المصلحة بسؤال مسؤول سكروم.",
        "correct": true
      },
      {
        "text": "كان يجب على عضو الفريق أن ينصح صاحب المصلحة بسؤال مالك المنتج.",
        "correct": false
      },
      {
        "text": "كان ينبغي أن يحتفظ أصحاب المصلحة بأسئلتهم حتى اجتماع المراجعة السريع التالي.",
        "correct": false
      },
      {
        "text": "كان ينبغي على أصحاب المصلحة توجيه أسئلتهم إلى مدير المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتعمل إحدى الشركات على مشروع مختلط تعاني فيه النواتج من مشاكل في الجودة في نهاية أحد سباقات السرعة. ما الإجراء الذي ينبغي لمدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة تعريف المنجز (DoD).",
        "correct": true
      },
      {
        "text": "ابحث عن مجموعة واضحة من اتفاقيات العمل.",
        "correct": false
      },
      {
        "text": "تطبيق تخطيط تدفق القيمة.",
        "correct": false
      },
      {
        "text": "استخدم نهجاً قائماً على الخطة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تكليف مدير مشروع بمشروع معقد بمتطلبات قانونية وتنظيمية وتعاقدية كبيرة. غير أن هذه المتطلبات لم يتم تحديدها أو وضع اللمسات الأخيرة عليها بعد وهناك مخاوف من التأخير في استكمال هذه المتطلبات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ركز على نواتج المشروع بدلاً من ذلك لأن الوفاء بهذه المتطلبات ليس من مسؤولية مدير المشروع.",
        "correct": true
      },
      {
        "text": "اتصل بمالك المنتج وسلط الضوء على مخاطر المشروع المتعلقة بالتأخير في تلبية هذه المتطلبات في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "اجتمع مع مالك المنتج والقسم القانوني لمراجعة حالة المشروع والتقدم المحرز في تحديد هذه المتطلبات.",
        "correct": false
      },
      {
        "text": "تأخير وضع اللمسات الأخيرة على المتطلبات القانونية والتنظيمية والتعاقدية حتى نهاية المشروع، وقبل تاريخ بدء التشغيل .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإدارة مشروع لشركة ناشئة ناجحة. وقد أظهرت الشركة الناشئة نمواً هائلاً مع فوائد متعددة لأعضاء الفريق، بما في ذلك ساعات العمل المرنة وسياسة العمل من المنزل. خلال آخر عملية إعادة نظر، أشار أحد أعضاء الفريق إلى أن سرعة الفريق تحسنت عندما كان الفريق مجتمعاً في غرفة المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "جمع الملاحظات وتحليل تأثير الموقع الفعلي على سرعة الفريق.",
        "correct": true
      },
      {
        "text": "تنقيح الأعمال المتراكمة لتحسين سرعة الفريق والحفاظ على السياسات الحالية.",
        "correct": false
      },
      {
        "text": "شارك الفكرة مع الإدارة العليا واقترح تحديث سياسات الشركة.",
        "correct": false
      },
      {
        "text": "قم بتحديث خطة إدارة الموارد وميثاق الفريق لتعزيز التواجد المشترك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقدر أن يكون للمشروع ما مجموعه 250 نقطة قصة. وخطط الفريق لـ 40 نقطة قصة لكل تكرار وتم تسليم 40 و0 و20 و20 و5 نقاط قصة في التكرارات الأربعة الأولى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تعيين المهام غير المنجزة إلى أعضاء الفريق خلال التكرار التالي.",
        "correct": true
      },
      {
        "text": "اعمل مع أعضاء الفريق لتعديل نقاط القصة المخططة للتكرارات التالية.",
        "correct": false
      },
      {
        "text": "قم بإزالة الميزات التي لا يمكن تسليمها من المنتج المتراكم وتحديث العميل.",
        "correct": false
      },
      {
        "text": "التفاوض مع العميل لتمديد مواعيد التسليم بسبب مواعيد العطلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يطلب العميل استبدال قطعة من الأجهزة المخطط لها بقطعة أخرى ذات ميزات أكثر وسعر أقل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم الميزات الجديدة للتأكد من توافقها مع احتياجات أعمال العميل.",
        "correct": true
      },
      {
        "text": "قم بدمج الأجهزة على الفور لأنها ستقلل من التكلفة الإجمالية للمشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق للتخطيط لتنفيذ الأجهزة الجديدة حسب الطلب",
        "correct": false
      },
      {
        "text": "اطلب الموافقة من مدير المشتريات وقم بتطوير نموذج أولي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدعو مدير المشروع إلى اجتماع لتحديد مخاطر مشروع معقد. يُدعى العديد من الخبراء المتخصصين إلى هذا الاجتماع إلى جانب فريق المشروع.\nلماذا قام مدير المشروع بدعوة الخبراء المختصين؟",
    "explanation": "",
    "choices": [
      {
        "text": "يتمتع خبراء الموضوع بخبرة متخصصة ويمكنهم المساعدة في تحديد المشكلات عالية المخاطر ومعالجتها.",
        "correct": true
      },
      {
        "text": "إن تحديد المخاطر في اجتماع مع خبراء في الموضوع يجعل الحصول على موارد أفضل للمشروع أسهل.",
        "correct": false
      },
      {
        "text": "سيكون من الأسهل قبول المخاطر إذا كان خبراء الموضوع الذين حضروا الاجتماع يعملون معاً.",
        "correct": false
      },
      {
        "text": "يمكن لمدير المشروع الاستفادة من موارد الخبراء المتخصصين لمتابعة المخاطر التي تم تحديدها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم مدير المشروع بإدارة عدة مشاريع مترابطة. وتعتمد بعض هذه المشاريع على نواتج محددة من مشاريع أخرى. لتجنب الاختناقات وتسهيل نجاح المشروع، يجب على مدير المشروع تقييم خطط المشاريع المدمجة لمعرفة التبعيات.\nما هو الإجراء الأنسب لمدير المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد جميع التبعيات بين المشاريع وتوثيقها.",
        "correct": true
      },
      {
        "text": "ضبط الجداول الزمنية للمشروع لإزالة التبعيات.",
        "correct": false
      },
      {
        "text": "القضاء على جميع التبعيات المحتملة بين المشاريع.",
        "correct": false
      },
      {
        "text": "التأكد من أن جميع المشاريع يمكن أن تمضي قدماً بشكل مستقل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع في مرحلة التخطيط ويتطلب وقتاً وجهداً كبيرين لجمع البيانات وتحليلها. ويطلب راعي المشروع من مدير المشروع أن يتخطى المناقشة الجماعية المركزة وجلسات العصف الذهني المخطط لها في محاولة لتسريع العملية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ اللجنة التوجيهية للمشروع بالمشكلة.",
        "correct": true
      },
      {
        "text": "الإقرار بطلب راعي المشروع وتخطي الجلسات.",
        "correct": false
      },
      {
        "text": "أخبر راعي المشروع أن تخطي الجلسات سيعرض المشروع للخطر.",
        "correct": false
      },
      {
        "text": "اجتمع مع راعي المشروع لفهم أسباب ضيق الوقت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع متوسط الحجم يهدف إلى تطوير منتج مبتكر بمتطلبات متغيرة. لا يتوفر العديد من أعضاء الفريق لمدة أسبوعين في الشهر خلال مدة المشروع. يدرك مدير المشروع أن تكلفة الجودة تزداد بشكل كبير خلال تلك الفترات. ومع ذلك، فإن سرعة الفريق مستقرة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة موارد إلى الفريق.",
        "correct": true
      },
      {
        "text": "توسيع نطاق جهود الاختبار.",
        "correct": false
      },
      {
        "text": "توفير التدريب المتبادل.",
        "correct": false
      },
      {
        "text": "زيادة مدة العدو السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشارك مدير المشروع في مشروع تتطور متطلباته باستمرار.\nما الذي يجب أن يفعله مدير المشروع لتحقيق النجاح؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم تحديثات منتظمة وطلب الموافقات المستندة إلى النواتج القابلة للتسليم من مالك المنتج.",
        "correct": true
      },
      {
        "text": "اعمل مع الفريق لضمان سيرهم على المسار الصحيح والتسليم في الموعد المحدد.",
        "correct": false
      },
      {
        "text": "الحفاظ على جو عمل مريح لتحسين تماسك الفريق.",
        "correct": false
      },
      {
        "text": "ضمان تقديم الوثائق والعمليات بشكل مناسب وتحديثها لمالك المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع رشيق مع فريق متعدد الوظائف. يتم إبلاغ مدير المشروع بأن بعض أعضاء الفريق عادةً ما يثيرون متطلبات إضافية ليست ضمن النطاق المعتمد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا السلوك المتوقع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب الفريق على إدارة النطاق باستخدام إطار العمل المناسب.",
        "correct": true
      },
      {
        "text": "رفع الأمر إلى الجهة الراعية وطلب استبدال أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "قم بإجراء اجتماعات الاستعداد اليومية مع الفريق وأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "اشرح أنه لا يمكن تغيير المتطلبات بدون موافقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مديرا مشروعين على توفير الموارد لمشروعيهما. حدد كلا مديري المشروعين نفس الخبير المتخصص (SME) باعتباره مفيدًا لمشروعهما. ويستخدم المشروع (أ) نهجًا تنبؤيًا، بينما يستخدم المشروع (ب) نهجًا مرنًا.\nما المشروع الذي ينبغي تخصيصه للمشروع الصغير والمتوسط الحجم؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب تعيين الشركة الصغيرة والمتوسطة في المشروع (أ) لأن تخطيط المشروع استند إلى دعم الشركة الصغيرة والمتوسطة.",
        "correct": true
      },
      {
        "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النجاح في مشروع رشيق يتحدد بالتميز التقني.",
        "correct": false
      },
      {
        "text": "يجب تعيين مدير مشروع صغير ومتوسط الحجم للمشروع مع مدير المشروع الأقل خبرة لتحسين احتمالية النجاح.",
        "correct": false
      },
      {
        "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النهج المرن يعطي الأولوية للمرونة والقدرة على التكيف.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيدرك مدير المشروع أن الفريق يحتاج إلى تدريب على تقنية معينة مطلوبة في المشروع. ما الذي يجب أن يفعله مدير المشروع للتخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم معرفة الفريق بالتقنية والبحث عن خيارات التدريب الموصى بها.",
        "correct": true
      },
      {
        "text": "تعاقد مع مزود خبير للقيام بالعمل الذي يستخدم تلك التقنية المحددة.",
        "correct": false
      },
      {
        "text": "إنشاء عنصر في سجل المخاطر وإخطار الجهة الراعية.",
        "correct": false
      },
      {
        "text": "قم بإصلاح أي ثغرات في التدريب عند ظهورها أثناء المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nفي نهاية مشروع كبير، يدرك أصحاب المصلحة أن الفوائد المحققة ليست هي نفسها الفوائد المتوقعة. ما هو العنصر الذي يمكن أن يكون قد أدى إلى هذه المشكلة، إذا لم يتم تحديده بشكل جيد في بداية المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وثائق المتطلبات",
        "correct": true
      },
      {
        "text": "نطاق المشروع",
        "correct": false
      },
      {
        "text": "حالة العمل",
        "correct": false
      },
      {
        "text": "مقاييس الفوائد",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء اجتماع الاستعداد اليومي، يقوم أحد أعضاء الفريق بإبلاغ الفريق بأن قصة المستخدم التي كانت في البداية جزءًا من تخطيط السباق السريع أصبحت غير صالحة بسبب تغيير في السياسة تم الإعلان عنه مؤخرًا. ما الذي يجب أن يفعله مدير المشروع استجابةً لهذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إغلاق قصة المستخدم المتعلقة بتغيير السياسة وتوضيح أنها لم تعد ذات قيمة.",
        "correct": true
      },
      {
        "text": "قم بإزالة قصة المستخدم من سباق السرعة الحالي وجدولتها لسباق السرعة التالي.",
        "correct": false
      },
      {
        "text": "إخطار أصحاب المصلحة بأنه لا يمكن تعديل قصص المستخدمين التي تم الالتزام بها في سباق السرعة.",
        "correct": false
      },
      {
        "text": "قم بإزالة قصة المستخدم من العدو السريع واطلب من الفريق الإسراع في إكمال العدو السريع الحالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأت إحدى الشركات مشروعًا لبناء محطة جديدة للطاقة الكهرومائية. تم إجراء تحليل لتحديد متطلبات الامتثال التنظيمي والسلامة والأمن. بعد التحليل، كان من الواضح أن بعض العناصر اللازمة لتحقيق الامتثال قد تكون صعبة ومكلفة في التنفيذ. يشعر أصحاب المصلحة بالقلق إزاء التكلفة والتعقيد الإضافيين ولديهم آراء مختلفة حول أهمية الامتثال وآثاره المحتملة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاجتماع مع أصحاب المصلحة والتأكيد على أهمية الامتثال وتكاليف عدم الامتثال.",
        "correct": true
      },
      {
        "text": "راجع سجل أصحاب المصلحة وحدد أصحاب المصلحة الذين يتمتعون بأعلى سلطة وتأثير.",
        "correct": false
      },
      {
        "text": "رفع مخاوف الامتثال والتباين بين آراء أصحاب المصلحة إلى الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "تحديد متطلبات الامتثال التي يمكن استبعادها من أجل التوافق مع توقعات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق المشروع الذي يستخدم نهجًا مختلطًا بإنتاج نواتج تنبؤية وتدريجية في آن واحد. وتنص خطة إدارة الاتصالات على تفضيل الاتصالات المكتوبة على الأنواع الأخرى. وتنشأ المشاكل يوميا فيما يتعلق بالمهام الإضافية؛ ومع ذلك، فإن تراكم البريد الإلكتروني المتراكم يزداد تعقيدا بشكل متزايد وغير ضروري.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اعتماد المحادثات المباشرة وجهاً لوجه خلال سباقات السرعة.",
        "correct": true
      },
      {
        "text": "اعتماد الاتصالات القضائية خلال سباقات السرعة.",
        "correct": false
      },
      {
        "text": "اعتماد الاتصالات المعطلة أثناء سباقات السرعة.",
        "correct": false
      },
      {
        "text": "اعتماد المحادثات الرسمية خلال سباقات السرعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع قيد التنفيذ مع أعضاء فريق من بلدين مختلفين وهناك شكاوى من كلا الجانبين. يعتقد أعضاء الفريق من البلد \"ألف\" أن أعضاء الفريق من البلد \"باء\" بطيئون جدًا في الاستجابة وغالبًا ما يكون لديهم أيام إجازة محددة. يؤمن أعضاء الفريق من البلد (ب) بالتوازن الجيد بين العمل والحياة ويعتقدون أن هناك حاجة إلى مزيد من التفكير قبل اتخاذ القرارات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تقييم ميثاق الفريق مع أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "إعادة النظر في خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "تذكير أعضاء الفريق بمراعاة الاختلافات الثقافية.",
        "correct": false
      },
      {
        "text": "التحقيق في السبب الجذري لسوء الفهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء توقيع الموافقة على مشروع استراتيجي أدى إلى تكاليف إضافية، لم يتمكن مدير المشروع من تبرير النفقات الإضافية فيما يتعلق بقيمة الأعمال التي تحققت مع التنفيذ الناجح. ما الذي كان ينبغي أن يفعله مدير المشروع لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم تقييم للفوائد المحتملة التي تم تحديدها في دراسة الجدوى الأولية باعتبارها كافية لتبرير تكاليف النفقات الإضافية.",
        "correct": true
      },
      {
        "text": "قياس وتتبع فوائد المشروع المحددة في دراسة الجدوى طوال دورة حياة المشروع.",
        "correct": false
      },
      {
        "text": "إجراء عملية إعادة تقييم للوضع الحالي للمنظمة بعد تنفيذ المشروع لإظهار الفوائد المحققة",
        "correct": false
      },
      {
        "text": "الفوائد غير المالية أو غير الملموسة المشتركة مثل رضا العملاء والسمعة الطيبة كمؤشرات لإظهار القيمة المحققة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في نهاية المرحلة الأولى من مشروع توسعة الاستاد، يدرك مدير المشروع أنه سيتأخر عن الجدول الزمني للمرحلة التالية من المشروع. ويرجع التأخير إلى متطلبات السلامة الجديدة التي يجب الالتزام بها. يشعر أصحاب المصلحة بالإحباط لأنهم لم يكونوا على علم بالتغييرات المحتملة في متطلبات السلامة.\nما الذي كان يجب عليك فعله لتجنب هذا الموقف وضمان أن يكون أصحاب المصلحة على دراية بالاضطرابات المحتملة؟",
    "explanation": "",
    "choices": [
      {
        "text": "زيادة احتياطي طوارئ المشروع لاستيعاب المشاكل غير المتوقعة المتعلقة بالسلامة.",
        "correct": true
      },
      {
        "text": "عقد اجتماعات تواصل منتظمة مع مشرف الموقع للبقاء على اطلاع دائم بمتطلبات السلامة.",
        "correct": false
      },
      {
        "text": "تنفيذ عملية استباقية لتقييم المخاطر أثناء بدء المشروع لتحديد التأخيرات المحتملة المتعلقة بالسلامة.",
        "correct": false
      },
      {
        "text": "اطلب موارد وموظفين إضافيين لمعالجة مخاوف السلامة عند ظهورها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تنتقل الشركة \"أ\" من نهج تنبؤي إلى نهج رشيق. بعد الإصدار التدريجي الثاني للمشروع X، يعرب مالك المنتج عن خيبة أمله من نتائج النموذج الأولي ويريد تصعيد المشروع إلى الإدارة العليا ويطلب فريقاً جديداً. وبسبب ذلك، يبدأ أعضاء الفريق بإلقاء اللوم على بعضهم البعض وعلى النهج الرشيق الجديد بسبب تصور مالك المنتج للمشروع.\nكيف يجب على مدير المشروع حل خلافات الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتبع عملية حل النزاعات الموثقة في ميثاق المشروع.",
        "correct": true
      },
      {
        "text": "استخدم الجلسات الاسترجاعية للسماح للفريق بتحديد سبب النزاع.",
        "correct": false
      },
      {
        "text": "إعادة النظر في رؤية المشروع مع الفريق للتأكد من فهم هدف المشروع",
        "correct": false
      },
      {
        "text": "مراجعة تعريف الإنجاز (DoD) مع مالك المنتج وتحديد سبب الفجوة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون المشروع في مرحلة رئيسية من التنفيذ ويكرس الجميع جهودهم لتحقيق النجاح. يقوم المدير الوظيفي فجأة بسحب أحد أعضاء الفريق الرئيسيين للاستجابة لحالة طارئة دون التواصل مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحقق من تقويم الموارد للعثور على عضو آخر في الفريق.",
        "correct": true
      },
      {
        "text": "إبلاغ راعي المشروع والإدارة التنفيذية بالحالة.",
        "correct": false
      },
      {
        "text": "التواصل مع المدير الوظيفي وطلب عودة العضو الرئيسي.",
        "correct": false
      },
      {
        "text": "راجع التأثير على المشروع وحدد موعدًا للاجتماع مع المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء حضور اجتماع الحوكمة مع الإدارة العليا، يتم إبلاغ مدير المشروع شفهيًا عن تدقيق خارجي وشيك لمشاريع مختارة. وسيمكّن التدقيق المنظمة من الحفاظ على شهادة الجودة الخاصة بها.\nما الذي يجب أن يفعله مدير المشروع أولاً للتحضير للتدقيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث جميع وثائق المشروع ذات الصلة بالوضع الحالي للمشروع.",
        "correct": true
      },
      {
        "text": "قم بتعليق المشروع لضمان الامتثال الكامل لعملية التدقيق.",
        "correct": false
      },
      {
        "text": "تواصل مع المدققين لفهم نطاق التدقيق ومتطلباته.",
        "correct": false
      },
      {
        "text": "اجتمع مع الفريق وأبلغهم بنطاق التدقيق ومتطلباته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى امتثال التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
        "correct": true
      },
      {
        "text": "تقييم مدى صحة المخاوف وتقييم مدى توافق التكنولوجيا الحالية والمقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
        "correct": false
      },
      {
        "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيلاحظ مدير المشروع الذي يدير فريقاً كبيراً أن أعضاء الفريق لا يتفاعلون معاً، مما يؤثر على أداء المشروع وجودة نتائج المشروع. ما الذي يجب أن يفعله مدير المشروع للمساعدة في تنمية ديناميكيات الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماعات جماعية وجهاً لوجه لفهم ماهية المشكلات.",
        "correct": true
      },
      {
        "text": "قم بإخطار المشرفين على أعضاء فريق المشروع بعدم تعاونهم.",
        "correct": false
      },
      {
        "text": "إضافة نقص التواصل الجماعي كمخاطرة في سجل المخاطر ومراقبة الوضع.",
        "correct": false
      },
      {
        "text": "ارجع إلى الدروس المستفادة لفهم كيفية تعامل المشاريع الأخرى مع المشكلات المماثلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء التحقق من صحة التسليمات، يدرك مدير المشروع أن أحد أعضاء فريق المشروع استخدم نسخة قديمة من وثيقة تعريف النطاق، مما تسبب في حدوث أخطاء كبيرة. ما الذي يجب أن يفعله مدير المشروع لإدارة هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش آخر المنجزات خلال الاجتماع القادم.",
        "correct": true
      },
      {
        "text": "تحديث سجل مستندات المشروع.",
        "correct": false
      },
      {
        "text": "إجراء عملية التحكم في التغيير.",
        "correct": false
      },
      {
        "text": "مشاركة وثيقة تعريف النطاق المحدثة مع الفريق .",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع لمشروع تطوير تطبيقات الهاتف المحمول. ويدرك مدير المشروع أن النهج الرشيق هو الأنسب للمشروع، ولكن معظم الفريق ليس لديه خبرة في النهج الرشيق.\nماذا يجب أن يفعل مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام نهج رشيق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب إعادة تعيين المشروع إلى فريق مشروع يتمتع بخبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "اطلب استبدال أعضاء الفريق الذين لم يسبق لهم استخدام الأساليب الرشيقة.",
        "correct": false
      },
      {
        "text": "ترتيب التدريب على مبادئ وعقلية العمل الرشيق لفريق المشروع الحالي.",
        "correct": false
      },
      {
        "text": "استخدم نهجًا تنبؤيًا لأن فريق المشروع على دراية بهذا النهج بالفعل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في اجتماع مشروع رشيق، يقدم أحد أعضاء الفريق تحديثًا لحالة مهمته المهمة. يقاطعه عضو جديد في الفريق عندما يسمع ذكر مهمته ويعطي تحديثًا للحالة قبل أن ينتهي عضو الفريق الأول من تحديثه.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحدث على انفراد مع عضوي الفريق بعد الاجتماع.",
        "correct": true
      },
      {
        "text": "أخبر عضو الفريق الجديد أنه يتصرف بشكل غير احترافي.",
        "correct": false
      },
      {
        "text": "وقفة لمناقشة بروتوكول الاجتماع المناسب مع الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من عضو الفريق الجديد الانتظار حتى ينتهي زميله في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يعمل في منظمة مصفوفة يدير مشروعًا من المقرر أن ينتهي خلال شهر واحد. في اجتماع المشروع اليوم، تم إبلاغ مدير المشروع أن الأخطاء التي تصادف في رمز البرنامج تتزايد باطراد. أثناء المناقشات مع قائد فريق التطوير، تم إخبار مدير المشروع أن هذا أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوت الموعد النهائي، لكن مدير المشروع يشعر بالقلق\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في الجدول الزمني للمشروع لإتاحة المزيد من الوقت للتطوير.",
        "correct": true
      },
      {
        "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أنه تم تخفيف المخاطر",
        "correct": false
      },
      {
        "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يتوافق مع متطلبات الجودة الموثقة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير من خلال عملية التحكم في التغيير لتمديد الموعد النهائي، مما يتيح المزيد من الوقت للتطوير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يكون أحد المشاريع متأخراً عن الجدول الزمني المحدد له عندما يتم تعيين عضو جديد في الفريق معروف بأدائه العالي في الفريق. وأثناء تقييم العضو الجديد في الفريق، يدرك مدير المشروع أن هذا الشخص يفتقر إلى التدريب اللازم للمشروع المحدد، لكنه يمتلك المهارات والخبرة ذات الصلة للانضمام إلى الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأكد من تلقي عضو الفريق التدريب قبل الانضمام إلى الفريق.",
        "correct": true
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة الهامة تحت المراقبة الدقيقة أثناء تلقيه التدريب.",
        "correct": false
      },
      {
        "text": "تكليف عضو الفريق الجديد بالأنشطة غير الحرجة دون مراقبة دقيقة أثناء توفير التدريب",
        "correct": false
      },
      {
        "text": "رفض إضافة عضو الفريق الجديد إلى الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بتجميع فريق يضم مزيجاً من أعضاء الفريق الجدد وذوي الخبرة. يكتشف مدير المشروع أن هناك مشاكل في تماسك الفريق. يعتقد أعضاء الفريق من ذوي الخبرة أن أعضاء الفريق الجدد يفتقرون إلى المهارات التقنية المطلوبة لأداء العمل اللازم ويتوقعون أن عليهم التعويض عن قلة خبرتهم.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم مكافآت أو حوافز أخرى لأعضاء الفريق ذوي الخبرة لتوجيه أعضاء الفريق الجدد.",
        "correct": true
      },
      {
        "text": "تحليل مهارات جميع أعضاء الفريق وتحديد الثغرات ووضع خطط لمعالجتها.",
        "correct": false
      },
      {
        "text": "إعادة تعيين أعضاء الفريق الجدد في مشاريع تتوافق بشكل أفضل مع مهاراتهم وخبراتهم.",
        "correct": false
      },
      {
        "text": "اشرح أنه من المتوقع أن يقوم أعضاء فريق المشروع المحترفون بحل المشكلات دون تدخل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق المشروع الذي يعمل على مشروع ذي أولوية عالية يحركه التغيير قد فاتته مراراً وتكراراً المواعيد النهائية للإصدار. ويحدد مدير المشروع أن هذا يرجع إلى أن أحد أعضاء الفريق من ذوي الخبرة مكلف بمشاريع متعددة ولديه نطاق عمل محدود.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبلاغ الجهة الراعية للمشروع بالمشكلة.",
        "correct": true
      },
      {
        "text": "ضبط الجدول الزمني وإصدار طلب تغيير.",
        "correct": false
      },
      {
        "text": "ناقش هذه المشكلة مع فريق المشروع على الفور.",
        "correct": false
      },
      {
        "text": "تقييم عبء عمل عضو الفريق المتمرس.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين عن طريق المكالمات الهاتفية فقط، كما هو مبين في خطة إدارة الاتصالات. بعد مرور ثلاثة أسابيع على تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال المخصصة الزائدة عن الحاجة من صاحب المصلحة هذا.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "استمر في التواصل عبر المكالمات الهاتفية لأنها كانت فعالة حتى الآن.",
        "correct": true
      },
      {
        "text": "اجتمع مع أصحاب المصلحة لمناقشة احتياجاتهم وتوقعاتهم في مجال التواصل.",
        "correct": false
      },
      {
        "text": "إرسال بريد إلكتروني إلى صاحب المصلحة لطلب تغيير نهج التواصل.",
        "correct": false
      },
      {
        "text": "تعيين أحد أعضاء الفريق للعمل كحلقة وصل بين مدير المشروع وأصحاب المصلحة.",
        "correct": false
        }
      ]
    }
  ]
}
