{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
     {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً. تستخدم المنظمة نهجًا رشيقًا وسجلًا للمخاطر، لكن فريق التطوير يفضل نهج Scrum وينظر إلى إدارة المخاطر على أنها عملية تنبؤية.\nما الذي يجب على مدير المشروع تحديد أولوياته؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة سجل المخاطر وامتلاكه شخصيًا لأن هذا من المتطلبات التنظيمية.",
        "correct": true
      },
      {
        "text": "تفويض مسؤولية تحديث سجل المخاطر إلى فريق التطوير lea",
        "correct": false
      },
      {
        "text": "اطلب من المطورين استخدام سجل المخاطر لأن هذا مطلب تنظيمي.",
        "correct": false
      },
      {
        "text": "فكر في اتباع نهج مختلط ودمج عناصر من سجل المخاطر وعمليات Scrum.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتلقى فريق رشيق العديد من الطلبات غير المخطط لها لتحسينات المنتج في عملية التكرار. ويتسبب هذا العائق في تفويت الفريق للمهام المجدولة.\nكيف ينبغي لمدير المشروع معالجة هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الفريق زيادة جهوده لتلبية الطلبات.",
        "correct": true
      },
      {
        "text": "اطلب من مالك المنتج تضمين التحسينات المطلوبة في التكرار الحالي.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع إعادة ترتيب أولويات جميع الأنشطة الملتزم بها.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج إضافة طلبات التحسين إلى طلبات التحسينات إلى قائمة المنتجات المتراكمة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجري تنفيذ مشروع تجريبي باستخدام نهج رشيق للتطوير. ويقدم المشروع الزيادات المخطط لها في الوقت المحدد، لكن الإدارة العليا تشعر بالقلق لأنها لا ترى القيمة التي يضيفها المشروع.\nكيف يجب على مدير المشروع إيصال قيمة المشروع إلى الإدارة العليا؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين الإدارة العليا في جميع المراجعات المستقبلية للسباقات السريعة لمعالجة مخاوفهم في الوقت الفعلي.",
        "correct": true
      },
      {
        "text": "أرسل تقارير حالة أسبوعية للإدارة العليا وادعهم إلى جلسات استرجاع المعلومات.",
        "correct": false
      },
      {
        "text": "توضيح كيفية توافق أهداف المشروع مع الأهداف الاستراتيجية للمؤسسة.",
        "correct": false
      },
      {
        "text": "تخصيص التقارير المرحلية لتلبية متطلبات الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الأسبوع الثاني من سباق سريع مدته أسبوعان، تعرض أحد أعضاء الفريق الأساسيين لحالة طارئة ولم يتمكن من العمل على المشروع لبقية السباق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير المنتج زيادة الجدول الزمني للمشروع.",
        "correct": true
      },
      {
        "text": "تحديد المهام التي يمكن إعادة إسنادها إلى أعضاء الفريق الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتمديد فترة السباق السريع لتعويض خسارة عضو الفريق الأساسي.",
        "correct": false
      },
      {
        "text": "احصل على موارد إضافية من الفرق الأخرى في السباق السريع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "هناك مشروع قيد التنفيذ حالياً. وقد تم إخطار مدير المشروع بعملية جديدة قد تكون مفيدة إذا تم دمجها في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم كيف يمكن دمج العملية الجديدة",
        "correct": true
      },
      {
        "text": "إصدار ترتيب أولوية للتغيير.",
        "correct": false
      },
      {
        "text": "تحديد الفائدة من التغيير.",
        "correct": false
      },
      {
        "text": "تعديل وثيقة المتطلبات الخاصة بالتغيير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل مدير المشروع مع أعضاء الفريق عن بُعد الذين يعملون بشكل مستقل. ما الذي ينبغي أن يفعله مدير المشروع لتعزيز التعاون بين أعضاء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين أعضاء الفريق في جميع رسائل البريد الإلكتروني المتعلقة بالمشروع.",
        "correct": true
      },
      {
        "text": "اتصل بأعضاء الفريق بشكل فردي لجمع المعلومات وتقديم التحديثات أسبوعياً.",
        "correct": false
      },
      {
        "text": "تعزيز الاجتماعات المنتظمة باستخدام مؤتمرات الفيديو.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو من أعضاء الفريق ملء سجل مهام للتحديثات اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع شكوى تفيد بأن فريق المشروع لم يستجب بشكل صحيح لطلب العميل. ومع ذلك، يدرك مدير المشروع أن الفريق تلقى طلبات متعددة خارج النطاق من العميل.\nما الإجراء الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "شجع أعضاء الفريق على طرح \"الأسباب الخمسة\" أثناء تواصلهم مع العميل.",
        "correct": true
      },
      {
        "text": "اطلب من العميل شرح أفضل للطلبات والمشكلات التي شاركها مع الفريق.",
        "correct": false
      },
      {
        "text": "مراجعة النطاق مع العميل بحيث يمكن توثيق الطلبات الإضافية ومعالجتها كطلبات تغيير.",
        "correct": false
      },
      {
        "text": "طلب تضمينها في جميع الاتصالات المستقبلية بين أعضاء فريق المشروع والعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في الاجتماع الأول حول مشروع إنشاء طريق، يقوم مدير المشروع بتذكير الفريق بأهمية مراعاة جميع القواعد عند القيام بواجباتهم والتفاعل مع أصحاب المصلحة. في وقت لاحق من المشروع، يبدأ أعضاء الفريق في الحضور إلى الاجتماعات في وقت متأخر ولا يتبعون القواعد الأساسية الأخرى.\nلضمان عدم تأثر نتائج المشروع وجدوله الزمني، ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "معالجة المشكلة مع أعضاء الفريق المحددين الذين انتهكوا القواعد الأساسية.",
        "correct": true
      },
      {
        "text": "قم بإزالة أعضاء الفريق الذين انتهكوا القواعد الأساسية.",
        "correct": false
      },
      {
        "text": "قم بترقية جميع أعضاء الفريق الذين لا ينتهكون أي قواعد أساسية.",
        "correct": false
      },
      {
        "text": "السماح للفريق بالتحقيق مع أي من أعضاء الفريق الذين ينتهكون القواعد الأساسية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة التخطيط، يقوم مدير المشروع بوضع الجدول الزمني للمشروع. يقوم فريق المشروع المعين بإنهاء مشروع لا علاقة له بالمشروع، لذلك يتم تعيين موارد مؤقتة للمساعدة في التخطيط وتقدير مدة المهمة. سيقوم فريق المشروع باستبدال الموارد المؤقتة قبل بدء المشروع.\nما الذي يجب على مدير المشروع القيام به قبل الانتهاء من الجدول الزمني للمشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة التقديرات مع الفريق المعين.",
        "correct": true
      },
      {
        "text": "تحقق من مدد مهام المشاريع السابقة.",
        "correct": false
      },
      {
        "text": "تحديث تقدير المدة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "طلب الموافقة من راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يبدي كبير مسؤولي التكنولوجيا (CTO) حماسًا بشأن اعتماد المؤسسة مؤخرًا لممارسات القيادة الخادمة. ويطلب كبير مسؤولي التكنولوجيا أن يطبق جميع مديري المشاريع ممارسات القيادة الخادمة، ولكن يبدو أنه غير متأكد من التطبيقات العملية.\nما هي العبارة التالية التي تمثل أفضل طريقة يجب أن يستجيب بها مدير المشروع لطلب مدير التكنولوجيا؟",
    "explanation": "",
    "choices": [
      {
        "text": "اشرح أن القيادة الخادمة يمكن تكييفها وتطبيقها على أي حالة من حالات المشاريع.",
        "correct": true
      },
      {
        "text": "ذكّر المدير التنفيذي للتكنولوجيا بأن القيادة الخادمة هي الأنسب للمشاريع التي تستخدم أساليب رشيقة.",
        "correct": false
      },
      {
        "text": "توضيح أن ممارسات القيادة الخادمة تركز عادةً على تفضيلات العميل.",
        "correct": false
      },
      {
        "text": "التأكيد على أن القيادة الخادمة تعمل فقط في المشاريع ذات الموارد الكبيرة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال جلسة تخطيط المشروع، يحاول مدير المشروع تحديد خطة إصدار لتحقيق قيمة متسقة في التسليم وقبول العميل. يقترح أحد كبار أصحاب المصلحة أن يكون هناك إصدار في نهاية المشروع للتأكد من أن العميل يرى جميع ميزات المنتج في وقت واحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من فريق المشروع اقتراح جدول زمني للإصدار بناءً على مدى تعقيد ميزات المنتج المحددة.",
        "correct": true
      },
      {
        "text": "يوصى بثلاثة إصدارات، واحد في بداية المشروع وواحد في منتصفه وواحد في نهايته.",
        "correct": false
      },
      {
        "text": "إنشاء خطط إصدار لكل مرة يتم فيها تسليم ميزة المنتج لإجراء اختبارات الجودة والمراجعات.",
        "correct": false
      },
      {
        "text": "اقترح أن يتم تسليم المنتج على مدار عدة تكرارات لجمع ملاحظات العملاء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتكون فريق المشروع عن بُعد من أعضاء من بلدين. يتوقع أحد الفريقين الحصول على ثلاثة أيام إجازة للاحتفال بعطلة وطنية. يخبر مدير المشروع الفريق أن عليهم العمل خلال العطلة لتحقيق إنجاز رئيسي في التكرار الحالي. يشعر الفريق بالاستياء ولا يفهم سبب اضطرارهم للعمل إذا كانت العطلة عطلة وطنية.\nما الذي يجب أن يكون مدير المشروع قد حدده وأبلغه بوضوح في بداية المشروع لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اتفاقيات الفريق",
        "correct": true
      },
      {
        "text": "المعالم البارزة",
        "correct": false
      },
      {
        "text": "الأدوار الفردية",
        "correct": false
      },
      {
        "text": "التسلسل الهرمي للفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتقد مدير المشروع أن فريق المشروع يمكن أن يستفيد من أنشطة التطوير لتحسين أداء المشروع ونتائجه. ويقرر مدير المشروع التخطيط لأنشطة تطوير محددة لكل عضو من أعضاء الفريق.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان نجاح هذه المبادرة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم لمهارات أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من الفريق تحديد خطط التطوير الخاصة بهم.",
        "correct": false
      },
      {
        "text": "توزيع خطط تطوير واضحة على أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تطبيق نظام المكافآت على أساس الأداء.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد ليحل محل مدير مشروع تم نقله مؤخراً إلى مشروع آخر. وأخبر أعضاء الفريق مدير المشروع الجديد أن المشروع متأخر عن الجدول الزمني بسبب التأخير في الحصول على الموافقات على المستندات من العميل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتمع مع العميل لمناقشة التأخير والتفاوض على موعد نهائي جديد.",
        "correct": true
      },
      {
        "text": "تحدث إلى مدير المشروع السابق لفهم الوضع بشكل أفضل.",
        "correct": false
      },
      {
        "text": "تواصل مع العميل واطلب الموافقة المعجّلة على المستندات.",
        "correct": false
      },
      {
        "text": "تقييم أثر التأخيرات على الجدول الزمني للمشروع وميزانيته.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعاً مختلطاً مع فريق ذاتي التنظيم. والفريق غير قادر على الاتفاق على نطاق الزيادة التالية.\nكيف ينبغي لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تسهيل مناقشة الفريق لفهم سبب عدم قدرة الفريق على الاتفاق على نطاق الزيادة التالية.",
        "correct": true
      },
      {
        "text": "تصعيد المشكلة إلى الجهة الراعية للمشروع بحيث تصبح المخاطر التي تشكلها الخلافات حول النطاق واضحة.",
        "correct": false
      },
      {
        "text": "تعاون مع خبير موضوعي مناسب (SME) لتحديد نطاق الزيادة التالية.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق التصويت على الخيارات وتحديد النطاق المناسب بناءً على تصويت الأغلبية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع لمراجعة الجدول الزمني للمشروع، حدد فريق المشروع أن أحد أنشطة المسار الحرج قد تراجع بسبب التبعيات الخارجية. وأصبح الجدول الزمني للمشروع الآن في خطر.\nما الذي يجب على مدير المشروع تحديد أولوياته كاستجابة أولية لمعالجة المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إصدار طلب تغيير والاجتماع مع العميل.",
        "correct": true
      },
      {
        "text": "إعادة جدولة الجدول الزمني وإخطار راعي المشروع.",
        "correct": false
      },
      {
        "text": "تحديث الوثائق وتحديد الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "قم بإخطار العميل وطلب تمديد الجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع جديد مع العديد من أصحاب المصلحة رفيعي المستوى. وقد قدم كل واحد من أصحاب المصلحة توقعاته للمشروع، وأدرك مدير المشروع أن بعض التوقعات تتعارض مع بعضها الآخر.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تيسير عقد اجتماع لمعالجة التوقعات المتضاربة وحلها.",
        "correct": true
      },
      {
        "text": "تحديد أولويات توقعات أصحاب المصلحة ذوي السلطة العليا.",
        "correct": false
      },
      {
        "text": "تحديث سجل أصحاب المصلحة بتوقعات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إنشاء تسلسل هرمي للمشروع لإدارة توقعات أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في بداية المشروع الرشيق، يقوم مدير المشروع بتطوير ميثاق المشروع مع الفريق. وهم غير قادرين على الاتفاق على قيم الفريق.\nما الذي يجب على مدير المشروع مناقشته مع الفريق لمعالجة النزاع؟",
    "explanation": "",
    "choices": [
      {
        "text": "الوتيرة المستدامة",
        "correct": true
      },
      {
        "text": "تعريف تم (DoD)",
        "correct": false
      },
      {
        "text": "احترام الإطار الزمني",
        "correct": false
      },
      {
        "text": "مراسم المشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم إبلاغ مدير مشروع لأحد مشاريع البناء بأن التصريح المطلوب من الحكومة المحلية لم يتم الحصول عليه بعد سيؤدي تقديم طلب للحصول على التصريح إلى تأخير تسليم المشروع لمدة يومين بتكلفة قدرها 40,000 دولار أمريكي. تبلغ غرامة عدم الحصول على التصريح 900 دولار أمريكي في اليوم الواحد.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب للحصول على تصريح وتأخير تسليم المشروع لمدة يومين.",
        "correct": true
      },
      {
        "text": "تجاهل متطلبات التصريح واستمر في المشروع.",
        "correct": false
      },
      {
        "text": "محاولة التفاوض مع الحكومة المحلية للحصول على عفو.",
        "correct": false
      },
      {
        "text": "خصص مبلغ الغرامة كمصروفات إضافية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتألف التكرار الأول لمشروع رشيق من الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي تم بنجاح الآن يتوق أعضاء الفريق إلى تسليم المنتج إلى العميل.\nكيف ينبغي التأكد من أن المنتج جاهز للاستخدام من قبل العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "يحدد مسؤول سكروم الرئيسي أن جميع المتطلبات مرضية",
        "correct": true
      },
      {
        "text": "يوافق فريق المشروع على استيفاء نموذج MVP لتعريف الإنجاز (DoD).",
        "correct": false
      },
      {
        "text": "يقوم المدير الأعلى والعميل بالموافقة على المنتج وقبوله.",
        "correct": false
      },
      {
        "text": "يقرر مالك المنتج أن المنتج MVP يجتاز جميع اختبارات الجودة المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نظرًا للطبيعة المعقدة للمشروع التنبؤي، تقرر المؤسسة استخدام نهج رشيق لمرحلة المشروع. لا يفهم أحد أعضاء الفريق النهج الرشيق حقًا ويواصل تخصيص المهام لبقية أعضاء الفريق. بعد فترة، لا يتمكن الفريق من التكيف من تلقاء نفسه وتنشأ النزاعات مما يؤخر التسليمات.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استبدل عضو الفريق بشخص لديه خبرة في العمل الرشيق.",
        "correct": true
      },
      {
        "text": "انتظر حتى يتمكن الفريق في النهاية من حل النزاع بنفسه وإعادة التنظيم.",
        "correct": false
      },
      {
        "text": "إعادة التأكيد على مبادئ وأدوار أجايل لإنشاء هياكل يمكن للفريق استخدامها.",
        "correct": false
      },
      {
        "text": "تحكّم في الأعمال المتراكمة المتراكمة في السباق السريع وقم بتعيين المهام لأعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "لم يتمكن مدير المبيعات الرئيسي وفريق العمل من تقديم تقرير حالة المشروع في الوقت المحدد لمشروع دمج تقرير المبيعات الجديد. وبالإضافة إلى ذلك، لا يفي التقرير بالتوقعات التي تم تسليط الضوء عليها في اجتماعات المراجعة الجماعية.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.",
        "correct": true
      },
      {
        "text": "تأكد من توثيق الخطة ومشاركتها بين الفريق وأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "زيادة تواتر اجتماعات الفريق لتقديم تقرير الحالة.",
        "correct": false
      },
      {
        "text": "تأكد من إتاحة المزيد من الوقت لأعضاء الفريق للتداول والتخطيط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كجزء من مهمة مؤقتة، يقوم مدير مشروع بقيادة مشروع تجاري. خلال اجتماع الحالة اليومي، تم اكتشاف أن فريق التطوير لم يقم بمهمة حرجة. تؤدي هذه المشكلة إلى تأخير التكرار الحالي. القدرة على اتخاذ الإجراءات اللازمة لمعالجة هذه المشكلة تتجاوز سلطة فريق المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تأجيل التكرار الحالي وإبلاغ أصحاب المصلحة بالمشكلة.",
        "correct": true
      },
      {
        "text": "ادعُ فريق المشروع إلى جلسة تجميعية لتحديد الحل.",
        "correct": false
      },
      {
        "text": "تعديل الجدول الزمني للمشروع لاستيعاب التأخير في التطوير.",
        "correct": false
      },
      {
        "text": "رفع المشكلة إلى راعي المشروع لتحديد الخطوات التالية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تكليف مدير مشروع بمشروع يتضمن فريقاً افتراضياً متعدد الثقافات يضم ممثلين من مختلف البلدان. يحتاج مدير المشروع إلى التحضير لاجتماع استهلالي.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع القواعد واللوائح التي يجب اتباعها أثناء المشروع.",
        "correct": true
      },
      {
        "text": "اطلب من الجهة الراعية موارد مختلفة لتسهيل المشروع.",
        "correct": false
      },
      {
        "text": "ضع في اعتبارك مختلف المناطق الزمنية وقدرات الاتصال والقيود المحتملة.",
        "correct": false
      },
      {
        "text": "قم بإعداد لغة راعي المشروع كلغة التواصل الرسمية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تخطط شركة في صناعة تخضع لتنظيم شديد لإصدار منتج جديد لم يكن متاحًا من قبل في السوق. وقد طلب الرئيس التنفيذي من مدير المشروع أن يقترح طريقة لضمان عدم دخول المنافسين في الصناعة إلى سوق هذا المنتج قبل هذه الشركة.\nما هو نهج تسليم المشروع الذي يجب أن يستخدمه مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدام نهج تنبؤي حيث أن الشركة لديها خبرة سابقة في ذلك.",
        "correct": true
      },
      {
        "text": "قم بتضمين موارد كافية في الميزانية لسرعة إنجاز المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ التكرارات في مرحلة مبكرة من عمليات تطوير المنتج، وجدولة المهام التنبؤية التي سيتم تنفيذها قبل مرحلة الطرح مباشرة.",
        "correct": false
      },
      {
        "text": "اطلب ضم مدرب رشيق إلى فريق أجايل لزيادة سرعة الإصدارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيشعر راعي المشروع بقلق متزايد بشأن القيمة العائدة من الاستثمار في المشروع ويريد التأكد من الوفاء بالمواعيد الأصلية. \nما الذي ينبغي لمدير المشروع أن يفعله لإقناع الجهة الراعية بأن المشروع يسير على الطريق الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "التأكيد على القيمة المقدمة عند بوابة المرحلة.",
        "correct": true
      },
      {
        "text": "زيادة عدد تقارير حالة المشروع.",
        "correct": false
      },
      {
        "text": "التوقعات السابقة والأداء الحالي.",
        "correct": false
      },
      {
        "text": "قم بدعوة راعي المشروع إلى الاجتماعات اليومية للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع الذي يقوم فيه مزود خارجي بتنفيذ حل مخصص، يجب على مدير المشروع التأكد من أن الفريق المحلي سيكون لديه القدرة على دعم الحل.\nما الذي يجب أن يفعله مدير المشروع لضمان قدرة الفريق المحلي على دعم الحل؟",
    "explanation": "",
    "choices": [
      {
        "text": "تفويض مسؤولية دعم الحل المخصص إلى الموفر الخارجي.",
        "correct": true
      },
      {
        "text": "إجراء دورات تدريبية شاملة للفريق المحلي على الحل الجديد.",
        "correct": false
      },
      {
        "text": "تقليل مسؤوليات الفريق المحلي لتقليل الحاجة إلى الدعم.",
        "correct": false
      },
      {
        "text": "تعيين موظفين إضافيين لتوفير الدعم المستمر للفريق المحلي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الافتتاحي للمشروع، يعلن مدير المشروع أنه سيتم استخدام نهج هجين لتنفيذ المشروع. ويثير العديد من أعضاء الفريق القلق لأنهم معتادون على العمل في المشاريع التنبؤية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفع المشكلة إلى راعي المشروع لضمان توافق الفريق مع نهج تنفيذ المشروع.",
        "correct": true
      },
      {
        "text": "قم بإشراك مكتب إدارة المشروع (PMO) لأنه يحدد نهج تنفيذ المشاريع.",
        "correct": false
      },
      {
        "text": "قم بتثقيف أعضاء الفريق حول أجايل والفوائد المرتبطة باستخدام مبادئ أجايل.",
        "correct": false
      },
      {
        "text": "التغيير إلى نهج تنبؤي يتماشى مع مهارات أعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تولى مدير مشروع جديد مسؤولية مشروع جارٍ. تظهر التقارير المرحلية أن المشروع في حدود الميزانية والجدول الزمني المخصصين له. ومع ذلك، أشار أحد الموردين الرئيسيين إلى أنه لن يتمكن من توريد المواد الأساسية حسب الجدول الزمني المحدد\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
        "correct": true
      },
      {
        "text": "مراجعة الأداء مقابل خط الأساس للمشروع.",
        "correct": false
      },
      {
        "text": "بدء الإجراءات القانونية ضد المورد المتخلف عن السداد.",
        "correct": false
      },
      {
        "text": "إنهاء العقد مع المورد فوراً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع ابتكاري كبير يحظى بمكانة عالية لدى المديرين التنفيذيين في الشركة. في الآونة الأخيرة، تغير أحد متطلبات المشروع مؤخرًا ويتطلب استخدام تكنولوجيا جديدة ومبتكرة. ويتطلب التغيير إنشاء منصب جديد ليشغله شخص على دراية بالتكنولوجيا الجديدة. خلال اجتماع الحالة، يعرب أحد أعضاء الفريق الحاليين عن اهتمامه بالوظيفة الجديدة ويؤكد أنه معتمد في هذه التقنية الجديدة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تكليف عضو الفريق بالمهمة لدعم نموهم في المؤسسة، والحصول على مورد ليحل محل الدور القديم لعضو الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من عضو الفريق الاستمرار في المهمة الوظيفية الحالية مع تولي المهمة الجديدة في نفس الوقت الذي يسمح به الوقت.",
        "correct": false
      },
      {
        "text": "رفع الطلب إلى راعي المشروع لتحديد ما إذا كان يمكن تعيين عضو الفريق في المهمة الجديدة.",
        "correct": false
      },
      {
        "text": "قم بتعيين عضو جديد في الفريق واطلب من عضو الفريق الحالي توفير التدريب اللازم لعضو الفريق الجديد للحصول على الشهادة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أوشك المشروع على الانتهاء، ويرغب العميل في الاحتفال بالنجاح من خلال مشاركة حالة عمل حول الفوائد التي حققها المشروع. يشعر مدير المشروع وفريق العمل بالتخوف من مشاركة حالة العمل في هذه المرحلة.\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "التعاون مع العميل لإنشاء حالة عمل تسلط الضوء على فوائد المشروع.",
        "correct": true
      },
      {
        "text": "أقر بالطلب ولكن أكد على محدودية حالة العمل في هذه المرحلة.",
        "correct": false
      },
      {
        "text": "قم بإحالة العميل إلى فريق المشروع للحصول على تفاصيل حول الفوائد التي حققها المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ العميل بأن حالة العمل تتطلب عملاً إضافياً وموارد إضافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتواصل أحد الموارد الرئيسية مع مدير المشروع بعد الاجتماع الافتتاحي ويعرب عن قلقه من عدم قدرته على إنجاز المهام الموكلة إليه بسبب أولويات أخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعدًا لاجتماع الفريق لتقييم الأولويات وإدارتها.",
        "correct": true
      },
      {
        "text": "توثيق عدم التوافر كمخاطرة في سجل المخاطر.",
        "correct": false
      },
      {
        "text": "رفع هذه المشكلة إلى راعي المشروع للحصول على الدعم التنفيذي.",
        "correct": false
      },
      {
        "text": "قم بتحديث خطة إدارة المشروع وفقًا لذلك لتعكس التأخير المحتمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيتفق مزود الخدمة وعميله على حوالي 80 من نطاق عقد مشروع يعملان عليه لتسليم محتوى تسويقي. لدى العميل ميزانية ثابتة وتاريخ إنجاز مستهدف ويريد الحصول على أكبر قيمة تجارية ممكنة من المشروع من خلال زيادة النطاق على أساس تسليم أفضل جهد ممكن مع اقتراب نهاية المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء العقد بناءً على النطاق المتفق عليه وخطة التغييرات الإضافية المتفق عليها.",
        "correct": true
      },
      {
        "text": "التأكد من توثيق عملية مراقبة التغيير في العقد.",
        "correct": false
      },
      {
        "text": "اقتراح خيار عقد نطاق ديناميكي وإضافة عدد ثابت من التكرارات.",
        "correct": false
      },
      {
        "text": "زيادة عدد الموارد في العقد لتقديم المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في المشروع المختلط، لا يفهم العميل الحاجة إلى مشاركة العميل في جميع مراحل المشروع. ونتيجة لذلك، فإن إعادة العمل تتجاوز المستويات المقبولة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقديم طلب تغيير للحصول على المشاركة المطلوبة من العميل.",
        "correct": true
      },
      {
        "text": "قم بإضافة مشكلة العميل هذه إلى مشكلة العميل المتراكمة لتحديد أولوياتها ومراجعتها.",
        "correct": false
      },
      {
        "text": "اجتمع مع العميل لتسليط الضوء على أهمية مشاركته في نجاح المشروع.",
        "correct": false
      },
      {
        "text": "توجيه الإدارة العليا لجعل العميل يعمل بشكل وثيق مع الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجد مدير المشروع المكلف بمشروع قائم أن جودة المنجز غير متسقة. ويجد مدير المشروع أن الفريق لا يلتزم بمعايير التطوير.\nما هي الممارسات التي يجب على مدير المشروع استخدامها لضمان جودة أعلى؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": true
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة والوقت لضمان الجودة.",
        "correct": false
      },
      {
        "text": "تنفيذ عملية التحسين المستمر لضمان تحقيق نتائج متسقة.",
        "correct": false
      },
      {
        "text": "إضافة وحدة عمل لفترة زمنية محددة لإثبات أن الحل قابل للتطبيق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع أن النزاعات بين أعضاء الفريق تحدث في كل سباق سريع. وبعد إجراء تحقيق، يكتشف مدير المشروع أن الفريق بحاجة إلى التدريب على التقنيات الرشيقة من أجل معالجة هذه النزاعات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة تدريب للفريق.",
        "correct": true
      },
      {
        "text": "جدولة الدورات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "إجراء تقييم للاحتياجات التدريبية للفريق.",
        "correct": false
      },
      {
        "text": "توجيه الفريق للبدء في استخدام التقنيات الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مرحلة التخطيط لمشروع ترقية، قام مدير المشروع بقياس المشاريع الحديثة الأخرى التي تستخدم نفس التكنولوجيا. واكتشف مدير المشروع أن الانقطاعات الأطول من المخطط لها حدثت في معظم الحالات بسبب أنشطة الصيانة المتكررة.\nماذا ستكون الخطوة التالية لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مشاريع المقارنة المعيارية باستخدام تقنيات أخرى لإنشاء خط أساس أكثر موضوعية.",
        "correct": true
      },
      {
        "text": "مقارنة التقنيات المماثلة الأخرى والتوصية بتطبيق تقنية أخرى.",
        "correct": false
      },
      {
        "text": "إنشاء عنصر مخاطر في سجل المخاطر وإدراج العتبات وفقًا للمعايير.",
        "correct": false
      },
      {
        "text": "ناقش فترة التوقف المحتملة مع الجهة الراعية واحصل على الموافقة على حالات الانقطاع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة تنفيذ أحد المشاريع، انضم مدير جديد إلى فريق الإدارة وأدخل شرط امتثال إلزامي يؤثر على جميع مهام المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إخطار الفريق بالمتطلبات الجديدة والمضي قدماً في المشروع كما هو مخطط له",
        "correct": true
      },
      {
        "text": "تحديث الجدول الزمني للمشروع والميزانية لتعكس متطلبات المتطلبات الجديدة.",
        "correct": false
      },
      {
        "text": "مراجعة المتطلبات الجديدة وتقييم تأثيرها على مهام المشروع ونواتجه.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر ليعكس المخاطر المحتملة المرتبطة بالمتطلبات الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nاعتاد مدير مشروع العمل على مشاريع تنبؤية وبدأ الآن العمل على مشروع باستخدام نهج مختلط. ما الذي ينبغي أن يفعله مدير المشروع لتمكين الفرق من التركيز على مهمتها؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ منهجية سكرم",
        "correct": true
      },
      {
        "text": "اعتماد القيادة الخادمة.",
        "correct": false
      },
      {
        "text": "تطبيق الأساليب المرنة.",
        "correct": false
      },
      {
        "text": "ابتكر عمليات جديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم تعيين مدير مشروع جديد لمشروع جارٍ ويقرر أن الجودة ثابتة. وتوجد ميزانية كبيرة لضمان الجودة، ويمكن أن تستفيد مجالات أخرى من المشروع من هذه الأموال.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ استراتيجية تخفيض الميزانية لإعادة تخصيص الأموال.",
        "correct": true
      },
      {
        "text": "قم بإجراء فحص كامل حيث لا يوجد هامش للخطأ.",
        "correct": false
      },
      {
        "text": "إدخال أخذ العينات كوسيلة فعالة من حيث التكلفة لضمان الجودة.",
        "correct": false
      },
      {
        "text": "حافظ على الميزانية كما هي في الوقت الحالي واستمر في المراقبة.",
        "correct": false
        }
      ]
    }
  ]
}
