{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "إشراك جميع أعضاء الفريق في أنشطة مشاركة أصحاب المصلحة.\nخلال اجتماع استعادي يشكو أعضاء فريق المشروع من أن المشكلات المفتوحة التي لم يتم إصلاحها أثناء التكرار تؤثر على سرعة إنجازهم. ما الذي يجب أن يفعله مدير المشروع لتحسين الإنتاجية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من حضور أعضاء الفريق اجتماعات الاستعداد اليومية لمناقشة العوائق.",
          "correct": true
        },
        {
          "text": "قم بتوثيق المشكلات في سجل المشكلات وانتظر حلها في وقت آخر.",
          "correct": false
        },
        {
          "text": "تمديد اجتماعات الاستعداد اليومية لمناقشة القضايا بمزيد من التفصيل.",
          "correct": false
        },
        {
          "text": "قم بتصعيد المشكلات إلى راعي المشروع لحلها على الفور.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بتنفيذ مرحلة من مشروع لتكنولوجيا المعلومات في موقع معرض للمشاكل الأمنية. يقوم أحد أعضاء الفريق، الذي يعمل في موقع بعيد، بإخطار مدير المشروع بأن الوكالة التنظيمية المحلية المعنية لم تستلم رسوم التصريح؛ ومع ذلك، فإن مدير المشروع متأكد من أن الرسوم قد تم دفعها. يقوم عضو الفريق بتذكير مدير المشروع بأنه من المقرر إجراء اختبار على المسار الحرج في ذلك الموقع في نفس اليوم.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من عضو الفريق تقديم دليل السداد من مكتب إدارة المشروع (PMO) وتأكد من تسليم النسخة المطبوعة من إيصال السداد بعد ذلك إلى الجهة الرقابية وانتظر الرد.",
          "correct": true
        },
        {
          "text": "اطلب عقد اجتماع مع مسؤول الوكالة لتقديم دليل الدفع والتحقق من عواقب التأخر في الدفع لضمان سير الاختبار كما هو مخطط له.",
          "correct": false
        },
        {
          "text": "إرشاد عضو الفريق بالمضي قدماً في الاختبار لأن عقوبة عدم الامتثال للتصريح لها تأثير ضئيل من حيث التكلفة ولا يمكن تغيير عملية الاختبار.",
          "correct": false
        },
        {
          "text": "أوعز إلى عضو الفريق بالمضي قدمًا في الاختبار حتى لا يسمح بالتأخير في المسار الحرج لأنه لا يمكن تأخير الاختبار أكثر من ذلك وقد تم دفع الرسوم بالتأكيد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم إحدى الشركات التي تستخدم تقليديًا نهجًا تنبؤيًا بتجربة استخدام النهج الرشيق في أجزاء من المشروع. ونظراً لأن الشركة كانت راضية عن النتائج، يطلب راعي المشروع الآن تحويل المشروع بأكمله إلى نهج رشيق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اقتراح أن يسري تغيير النهج إلى أجايل على المشاريع الجديدة.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "استشر مالك المنتج حيث قد يكون لديه أسباب للاستمرار في استخدام نهج تنبؤي.",
          "correct": false
        },
        {
          "text": "تحويل مخرجات المشروع إلى قصص مستخدمين وإبلاغ الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير يعمل كمالك منتج لمشروع برمجيات حكومي. لا يستطيع المدير بشكل متكرر المشاركة مع الفريق وتقديم ملاحظات منتظمة ومهمة حول عناصر المشروع.\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد تفضيلات التواصل ومراجعة المسؤوليات.",
          "correct": true
        },
        {
          "text": "الحصول على ملاحظات بديلة من العميل.",
          "correct": false
        },
        {
          "text": "التوصية بسياسة الباب المفتوح للمشروع .",
          "correct": false
        },
        {
          "text": "اعتماد نهج تعاوني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قدم مدير المشروع تدريباً بالفيديو على البرمجيات الجديدة لكن العديد من أعضاء الفريق أفادوا بأنهم غير مستعدين لاستخدامها.\nما الذي كان ينبغي على مدير المشروع القيام به لضمان التدريب الفعال؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختبار فهم أعضاء الفريق بعد إكمالهم التدريب.",
          "correct": true
        },
        {
          "text": "طلب من قسم التدريب إيجاد المزيد من الدورات التدريبية المناسبة.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق تعلم المهارات المطلوبة من دليل البرامج المصاحب.",
          "correct": false
        },
        {
          "text": "إجراء تقييمات فردية وجماعية حول طريقة التعلم المفضلة لديهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طُلب من مدير مشروع إدارة مشروع معقد قائم. وقد تم تسليم بعض الأهداف بالفعل من قبل مدير المشروع السابق. وأثناء مراجعة خطة إدارة المشروع، أدرك مدير المشروع أن أحد المنجزات الرئيسية مفقود من هدف المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك لضمان تحقيق القيمة المتوقعة للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع المشكلة المتعلقة بالناتج إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "تأكيد الإنجازات المتوقعة وإعادة تحديد خط الأساس للمشروع.",
          "correct": false
        },
        {
          "text": "تتبع النواتج من خلال مراجعة مصفوفة تتبع المتطلبات.",
          "correct": false
        },
        {
          "text": "استخدم صندوق الطوارئ للحصول على المزيد من الموارد لاستكمال النواتج الناقصة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على الشركة إطلاق منتج عالمي للرد على تهديد المنافسة. كجزء من نهج رشيق، يختار الفريق المنطقة X كخط أساس لاختبار التكرار الأول. بينما يلبي المنتج المعايير والمتطلبات في المنطقة X، إلا أنه لا يتوافق مع اثنين من معايير المناطق الأخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من أن المنتج يفي بالمعايير والمتطلبات في المنطقة X والتخطيط لعمليات التكرار المستقبلية لمعالجة عدم الامتثال للمعايير في المناطق الأخرى.",
          "correct": true
        },
        {
          "text": "قم بتوثيق ذلك على أنه عدم امتثال في خطة إدارة الجودة وتصحيحه في التكرار التالي.",
          "correct": false
        },
        {
          "text": "إعادة تخطيط جميع التكرارات لتلبية جميع معايير المناطق الثلاث ضمن نطاق العمل.",
          "correct": false
        },
        {
          "text": "التواصل مع العملاء من كل منطقة للتوصل إلى اتفاق بشأن التصميم الحالي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يعمل في شركة إنشاءات. والمشروع الحالي عبارة عن مبادرة مدتها ثلاث سنوات بملايين الدولارات لإعادة بناء ملعب. وقد تم الانتهاء من المرحلة الأولى من المشروع ضمن الإطار الزمني المحدد بثلاثة أشهر وفي حدود الميزانية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "انتقل إلى المرحلة التالية.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة من مدير البرنامج.",
          "correct": false
        },
        {
          "text": "المضي قدماً في الإغلاق التعاقدي للمرحلة.",
          "correct": false
        },
        {
          "text": "بدء عملية الإغلاق الإداري.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أصحاب المصلحة الرئيسيين مستاء من الميزات الجديدة في التكرار الحالي للمنتج. لم يكن صاحب المصلحة الرئيسي متاحاً أثناء المراجعة الأخيرة ولم تتح له الفرصة لتقديم مدخلاته.\nما الذي كان يجب على مدير المشروع فعله لمنع انزعاج صاحب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الانتظار حتى يوافق جميع أصحاب المصلحة على التغيير قبل التنفيذ",
          "correct": true
        },
        {
          "text": "التأكد من أن معلومات المشروع المحدثة متاحة دائمًا لجميع أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "الاجتماع مع كل صاحب مصلحة على حدة لتجنب الخلاف",
          "correct": false
        },
        {
          "text": "الاجتماعات المجدولة فقط عندما يكون جميع أصحاب المصلحة حاضرين فقط",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد على إنتاج آلة معينة في أحد المصانع من خلال مورد أجنبي. وقبل تسليم المكوِّنين الأخيرين، أبلغ المورِّد مدير المشروع بضرورة إعادة التفاوض على الأسعار وإلا لن يتم تسليم المكوِّنات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع قضية قانونية لدى الشركة لإخلالها بالعقد.",
          "correct": true
        },
        {
          "text": "التواصل مع موردين بديلين للمكونين المتبقيين.",
          "correct": false
        },
        {
          "text": "ابدأ خطة الاستجابة لمدخل الخطر هذا بناءً على المحفز.",
          "correct": false
        },
        {
          "text": "العمل مع المورد للاتفاق على الأسعار الجديدة لتقليل تأثير التكلفة إلى الحد الأدنى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع تم تعيينه مؤخراً في مشروع قائم متعدد الجنسيات وليس على دراية بأصحاب المصلحة الرئيسيين.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب عقد اجتماع مع مدير الموارد.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "اطلب رأي الكفيل أو حكم الخبراء.",
          "correct": false
        },
        {
          "text": "تحديد أداة الاتصالات وتحديث الخطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تواجه المؤسسات تحديات مختلفة في مجالاتها التشغيلية بسبب عوامل خارجية. وقد تطلب ذلك من الشركات تطوير وثائق مشاركة رسمية لتوجيه عملياتها المختلفة.\nكيف ينبغي لمدير المشروع أن يجعل أعضاء فريقه وأصحاب المصلحة على دراية بتفرد المعايير التنظيمية؟",
      "explanation": "",
      "choices": [
        {
          "text": "ستكون العوامل الخارجية المختلفة للمشروع أحد مدخلات خطة إدارة المشروع وستشكل جزءًا من الإحاطة الإعلامية في الاجتماع الافتتاحي.",
          "correct": true
        },
        {
          "text": "يجب أن تكون العوامل الخارجية المختلفة مفهومة بالفعل من قبل أعضاء الفريق وأصحاب المصلحة وإدراجها اختياري.",
          "correct": false
        },
        {
          "text": "يجب على كل من يشارك في المشروع أن يفهم هذه العوامل الخارجية المختلفة ويبذل جهداً في البحث عنها.",
          "correct": false
        },
        {
          "text": "سيتم إطلاع أعضاء الفريق وأصحاب المصلحة على هذه العوامل الخارجية المختلفة من خلال قناة الاتصالات التنظيمية الرسمية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اجتماعات التعاون اليومية، يشكو العديد من أعضاء الفريق من عدم قدرتهم على التركيز بسبب بيئة العمل الصاخبة.\nمن المسؤول عن حل هذه المشكلة من خلال خلق بيئة عمل أكثر ملاءمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "راعي المشروع",
          "correct": true
        },
        {
          "text": "أعضاء الفريق",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "مدير المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق Scrum في منتصف الطريق إلى الإصدار. أثناء العرض التجريبي للسباق، يتم اختيار برنامج جديد من قبل أحد المطورين وتقديمه للفريق. لم يكن البرنامج الجديد عملاً مخططًا له ولكنه يفي بموعد الإصدار. يتم تعطيل العديد من الميزات ذات الأولوية للسباقين التاليين.\nما هي الإجراءات التي يجب على الفريق القيام بها لتقليل الاضطراب إلى الحد الأدنى؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع مالك المنتج على الأعمال المتراكمة لتقديم البرنامج الجديد.",
          "correct": true
        },
        {
          "text": "يقوم فريق سكروم باتخاذ القرارات بنفسه كفريق منظم ذاتيًا ويقدم التغيير أثناء العرض التوضيحي.",
          "correct": false
        },
        {
          "text": "يتواصل المطورون مع مدير سكروم بخصوص التغيير لتحديد مكان وزمان مناقشة التغيير.",
          "correct": false
        },
        {
          "text": "يقوم فريق سكروم بتقييم البرنامج الجديد وإبلاغ العميل بتأثير ذلك على خطة الإصدار",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع على مشروع رشيق تم الانتهاء من تحديد نطاقه ومتطلبات الامتثال. وأثناء المراجعة الدورية للمشروع، يقوم أحد أصحاب المصلحة بإبلاغ مدير المشروع بأن التغييرات المقترحة على تشريعات السلامة في البلد يمكن أن تؤثر على نطاق المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ركز على إكمال الأنشطة حسب تراكمات المنتج.",
          "correct": true
        },
        {
          "text": "تحليل تأثير التغييرات التشريعية على خطة المشروع.",
          "correct": false
        },
        {
          "text": "قم بدمج التغييرات في السباق التالي بناءً على الاقتراح.",
          "correct": false
        },
        {
          "text": "اطلب من الراعي الموافقة على الميزانية الإضافية للتغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم إحدى الشركات بالانتقال من استخدام نهج تنبؤي إلى تنفيذ مشروع هجين بين التنبؤ والمرونة. ويشعر فريق القيادة بالقلق إزاء تحقيق الفوائد ويتابع عن كثب إحدى عمليات تكرار المشروع مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتحديث فريق القيادة بتقرير قيمة قابلة للقياس الكمي لكل عملية تكرار.",
          "correct": true
        },
        {
          "text": "اعرض قيمة العمل على فريق القيادة واحصل على موافقتهم.",
          "correct": false
        },
        {
          "text": "استمر في تقديم نسخ مكررة من الحل واعرض زيادات الفوائد على فريق القيادة.",
          "correct": false
        },
        {
          "text": "انتظر حتى يقوم فريق القيادة بمشاركة تحديثات تحقيق الفوائد لكل عملية تكرار مع الإدارة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبنى أحد الفرق مؤخراً نظام أجايل ويتبع نموذج سكروم. هناك تعارض بين مطور رئيسي وأحد أعضاء فريق ضمان الجودة فيما يتعلق بنهجهم، مما يؤثر على أهداف السباق.\nما الذي يجب أن يفعله مدير المشروع لحل هذه التعارضات؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بعقد اجتماعات منفصلة مع كل عضو من أعضاء الفريق واقترح أن يقوم أعضاء الفريق بحل المشكلة كل على مستواه.",
          "correct": true
        },
        {
          "text": "تحليل الموقف ومساعدة أعضاء الفريق على فهم تأثير النزاع.",
          "correct": false
        },
        {
          "text": "ساعد أعضاء الفريق على التعاون وحل مشاكلهم معًا.",
          "correct": false
        },
        {
          "text": "ناقش الوضع في جلسة استرجاع المعلومات ووضع بند عمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأت إحدى الشركات في تنفيذ مشاريع رشيقة. يشعر راعي المشروع بالإحباط ولا يفهم عملية جمع المتطلبات الجديدة التي تبدو غير مكتملة وتتحرك بسرعة كبيرة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ساعد الجهة الراعية للمشروع على فهم الأدوات والتقنيات المختلفة المتاحة وسبب اختيار هذه الأدوات والتقنيات.",
          "correct": true
        },
        {
          "text": "تحديث سجل أصحاب المصلحة لتحديد راعي المشروع كعائق محتمل.",
          "correct": false
        },
        {
          "text": "دع الفريق يعلم أن الجهة الراعية غير راضية والتحول من التخطيط التكراري إلى التخطيط التنبؤي.",
          "correct": false
        },
        {
          "text": "قم بإيقاف عمل المشروع مؤقتًا حتى تتاح الفرصة لمدير سكروم لمراجعة الأعمال المتراكمة الكاملة مع الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مع اقتراب المشروع من الاكتمال، يصبح الصراع بين مالك المنتج وراعي المشروع بشأن من يملك المنافع المستمدة من الناتج مسألة تقاضي.\nما الذي كان ينبغي على مدير المشروع فعله لمنع حدوث هذا التعارض؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد راعي المشروع كأحد أصحاب المصلحة في بداية المشروع.",
          "correct": true
        },
        {
          "text": "تطوير حالة العمل والموافقة عليها بالاشتراك مع مالك المنتج وراعي المشروع.",
          "correct": false
        },
        {
          "text": "تحديد أي مشكلات محتملة وتسجيلها في سجل المشكلات ومراقبتها بشكل متكرر.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تفصيلي تفصيلي للعمل (WBS) وتنفيذ التتبع المنهجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت إحدى المؤسسات التي تستخدم نهجًا تنبؤيًا التحول إلى نهج رشيق. وتعتقد المنظمة أنها ستقدم المزيد من القيمة لعملائها وقررت أن تعتمد جميع المشاريع النهج المرن.\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق الفوائد؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتقييم تحقيق الفوائد خلال اجتماعات الاستعداد للفريق.",
          "correct": true
        },
        {
          "text": "قم بمواءمة خطة إدارة المزايا مع الأعمال المتراكمة للمنتج.",
          "correct": false
        },
        {
          "text": "تقييم خطة إدارة الفوائد في نهاية سباقات السرعة.",
          "correct": false
        },
        {
          "text": "اطلب من مسؤول سكروم تقديم تحديثات يومية حول تحقيق الفوائد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال المراجعة النهائية لسباق السرعة، ذكر مالك المنتج أن المنتج لا يقدم أي قيمة. يعتقد مدير المشروع أن المنتج يلبي جميع المواصفات المقدمة. يشعر الفريق بالارتباك بسبب تصريح مالك المنتج.\nما الذي يجب أن يفعله مدير المشروع عند استخدام نهج مختلط؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة فوائد المشروع مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "رفع الأمر إلى المجلس التنفيذي حتى يتمكن من اتخاذ قرار بشأن الخطوات التالية.",
          "correct": false
        },
        {
          "text": "حدد أولويات المشاريع المتراكمة واطلب من فريق التطوير إصلاح المشكلات.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج إنهاء المشروع لأنه لم يعد يتماشى مع الفوائد المتوقعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم إحدى الشركات أساليب تنبؤية منذ فترة طويلة جدًا وتحاول تنفيذ بعض المبادرات التكرارية في إطار مشروعها. وقد تم تعيين مدير مشروع لقيادة أول مشروع في هذه البيئة المختلطة.\nكيف ينبغي لمدير المشروع بناء الوعي بالنهج الهجين داخل المؤسسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتمع مع فريق المشروع من أجل تحديد الأدوار والمسؤوليات.",
          "correct": true
        },
        {
          "text": "بناء الجدول الزمني للمشروع من خلال جلسات تكرارية وإبلاغ أصحاب المصلحة بذلك.",
          "correct": false
        },
        {
          "text": "قم بدعوة أصحاب المصلحة الرئيسيين إلى اجتماعات المتابعة اليومية واجتماعات مراجعة المشروع.",
          "correct": false
        },
        {
          "text": "التوصية بالتدريب على المنهجية التكرارية لكبار المديرين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بداية المشروع، اختار الفريق الاستفادة من نهج رشيق لإنجاز المشروع باستخدام قصص المستخدمين لالتقاط المتطلبات. وكجزء من إطار عمل الرقابة في المؤسسة، سيطلب قسم الامتثال الداخلي نسخة من وثيقة المتطلبات المعتمدة.\nما الذي يجب القيام به لتلبية طلب الامتثال هذا؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة نهج المشروع مع الامتثال، والتأكد من فهمهم لكيفية تحقيقه لهدف الرقابة .",
          "correct": true
        },
        {
          "text": "اطبع جميع قصص المستخدمين واجمعها في حزمة واحدة في نهاية المشروع واطلب من مالك المنتج الموافقة عليها.",
          "correct": false
        },
        {
          "text": "قم بتعيين متطلبات الامتثال كمهمة على لوحة كانبان الخاصة بالمشروع لمالك المنتج.",
          "correct": false
        },
        {
          "text": "مراجعة نهج المشروع مع الامتثال، مع الإشارة إلى أن هدف الرقابة غير مطلوب لأن المشروع يستخدم المرونة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اسأل عما إذا تم إجراء أنشطة ضمان الجودة.\nأنشأ مدير المشروع قائمة بأصحاب المصلحة ويقرر كيفية توزيع المعلومات بفعالية على العميل. ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع جميع أصحاب المصلحة وجهاً لوجه أسبوعياً.",
          "correct": true
        },
        {
          "text": "إرسال التحديثات إلى جميع أصحاب المصلحة، بما في ذلك العميل.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لأصحاب المصلحة وإعداد خطة لإدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "مراجعة البيانات التاريخية المرسلة إلى عملاء آخرين واتباع نفس الممارسات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع رشيق في أولى تكراراته العشرة. بعد مراجعة التكرار، يتلقى الفريق ملاحظات أصحاب المصلحة بأن الناتج الأول لا يتماشى مع أهداف المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق الاجتماع مع أصحاب المصلحة لفهم احتياجاتهم.",
          "correct": true
        },
        {
          "text": "اطلب من مالك المنتج مراجعة الأعمال المتراكمة للمنتج وأولوياته.",
          "correct": false
        },
        {
          "text": "اطلب من أصحاب المصلحة تحديد أولويات احتياجاتهم.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية تحديد أولويات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تطبق إحدى الدول قوانين عمل جديدة ذات متطلبات محددة لصحة وسلامة العمال. لم يتم تحديث الإجراءات الحالية للشركة حتى الآن، ولكن الإدارة أبلغت جميع مديري المشاريع باللوائح.\nما الذي يجب أن يفعله مديرو المشاريع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الآثار المحتملة للوائح المحدثة على مشاريعهم.",
          "correct": true
        },
        {
          "text": "تحديث سجل مخاطر المشروع للتعرف على المخاطر الناشئة.",
          "correct": false
        },
        {
          "text": "اطلب من قسم الموارد البشرية تحديث الإجراءات.",
          "correct": false
        },
        {
          "text": "اطلب المشورة من مكتب الشركة حول كيفية تحديد أفضل مسار للعمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر أحد أصحاب المصلحة بالقلق من أن المشروع يتأخر عن الجدول الزمني المحدد، بناءً على معلومات غير رسمية من فريق المشروع. على الرغم من أن بعض المهام قد تراجعت، إلا أن هذه المهام لها عوامات حرة؛ وبخلاف ذلك، فإن المشروع يسير على المسار الصحيح. اتصل مدير المشروع على الفور بصاحب المصلحة لعرض أحدث تقارير حالة المشروع وشرحها.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إصدار مذكرة تنص على أنه لا يمكن مشاركة حالة المشروع إلا من خلال القنوات المصرح بها.",
          "correct": true
        },
        {
          "text": "قم بتضمين صاحب المصلحة في القائمة البريدية لحالة المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة اتصالات المشروع مع فريق المشروع وتحديثها حسب الضرورة.",
          "correct": false
        },
        {
          "text": "تنقيح تقارير الحالة لتحديد التأخيرات التي ينبغي اتخاذ إجراء بشأنها بوضوح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين مدير مشروع لتصميم وتطوير استراتيجية لمؤسسة حكومية. يدرك مدير المشروع أن المشروع لديه كمية محدودة من المعلومات التفصيلية لإعداد تقديرات المشروع. ومع ذلك، فإن العديد من المنظمات الحكومية الأخرى قد اعتمدت بالفعل نفس الاستراتيجية بنجاح.\nفي هذا السيناريو، ما نوع طريقة التقدير التي يجب أن يختارها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "النمذجة البارامترية",
          "correct": true
        },
        {
          "text": "التقدير التناظري",
          "correct": false
        },
        {
          "text": "تقدير ثلاثي النقاط",
          "correct": false
        },
        {
          "text": "حكم الخبراء",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستمر أحد أعضاء فريق المشروع في تغيير أحد زملائه في المشروع أثناء كل سباق سريع. طلب الزميل من مدير المشروع التدخل.\nما الإجراء الذي يجب أن يتخذه مدير المشروع لمعالجة المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحدث مع عضو الفريق لتحديد سبب التغييرات.",
          "correct": true
        },
        {
          "text": "ناقش أي نقص في الجودة في المنجز مع الزميل.",
          "correct": false
        },
        {
          "text": "مراجعة أداء كل من أعضاء الفريق مع مديريهم الوظيفي.",
          "correct": false
        },
        {
          "text": "التحكم في التنفيذ والتسليم لضمان عدم تغيير المخرجات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في خضم مشروع بناء رشيق قيد التنفيذ، يتلقى مدير المشروع إخطاراً بأن الحكومة المحلية قد وافقت مؤخراً على تشريعات أكثر صرامة في مجال الاستدامة تنطبق على جميع مشاريع البناء في المنطقة. سيكون لهذه اللوائح الجديدة تأثير على مواد المشروع وعملياته المتعلقة بالاستدامة.\nما الذي يجب أن يفعله مدير المشروع أولاً للتكيف مع هذه المعايير البيئية الموضوعة حديثاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتمع مع مالك المنتج لتحديث خطة المشروع لدمج متطلبات الاستدامة الجديدة.",
          "correct": true
        },
        {
          "text": "تنظيم ورشة عمل للفريق لتحديد وتقييم الحلول لتلبية متطلبات الاستدامة الجديدة.",
          "correct": false
        },
        {
          "text": "استمر في المشروع كما هو مخطط له واجتمع مع أصحاب المصلحة لوصف اللوائح الجديدة والتماس ملاحظاتهم.",
          "correct": false
        },
        {
          "text": "اطلب تمديد الجدول الزمني من عميل المشروع للسماح بالوقت الإضافي اللازم لتلبية المتطلبات الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشتكي مدير وظيفي مشارك في أحد المشاريع من أحدث تقارير مقاييس الجودة المرتبطة بجميع التكرارات السابقة. لا يعتقد الفريق أن هذه الشكوى صحيحة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "إصلاح التقارير لاستيعاب شكاوى المدير الوظيفي.",
          "correct": true
        },
        {
          "text": "تحدث إلى المدير الوظيفي لفهم مخاوفه المحددة.",
          "correct": false
        },
        {
          "text": "راجع مصفوفة RACI لتحديد المسؤول عن مقاييس الجودة.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق الجودة للتحقق من صحة مقاييس الجودة المطبقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال جلسة فردية، شارك أحد أعضاء الفريق الجدد إحباطه بشأن عدم قدرته على إكمال مهمة تم تكليفه بها بنجاح، حتى بعد أن بذل عضو الفريق قصارى جهده.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة مخاوف أعضاء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "شجع عضو الفريق على مواصلة العمل الجاد في مهامه.",
          "correct": true
        },
        {
          "text": "تحديد السبب الجذري وراء عدم قدرة عضو الفريق على إكمال العمل المكلف به ومعالجته.",
          "correct": false
        },
        {
          "text": "التصريح بتدريب إضافي لعضو الفريق خلال فرص السلسلة التعليمية للشهر القادم.",
          "correct": false
        },
        {
          "text": "تكييف أسلوبهم القيادي بناءً على احتياجات أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكتشف مدير مشروع يعمل مع فريق متنوع ثقافياً وجود نزاعات كبيرة داخل الفريق أثناء تنفيذ المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد موعدًا لاجتماع فريق المشروع لفهم التعارضات.",
          "correct": true
        },
        {
          "text": "تقديم المشورة لأعضاء الفريق للعمل بانسجام وتناغم.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إشراك الأعضاء في أنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قد يتسبب تغيير كبير في سياسة الحكومة في تأخير موعد اكتمال المشروع. اكتمل المشروع بنسبة 90%.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعليق المشروع حتى يتم حل المشكلة مع سياسة الحكومة.",
          "correct": true
        },
        {
          "text": "إشراك مجلس مراقبة التغيير (CCB) لتقييم الآثار المحتملة على المشروع.",
          "correct": false
        },
        {
          "text": "المضي قدماً في المشروع بما أنه على وشك الانتهاء.",
          "correct": false
        },
        {
          "text": "تعيين تاريخ إنجاز جديد للمشروع وإبلاغ أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لكي يعمل فريق المشروع على النحو الأمثل، يجب أن يكون لدى فريق المشروع ميثاق للمشروع ينص على رؤية المشروع أو الغرض منه ومجموعة واضحة من اتفاقيات العمل. ولتحقيق ذلك، ما هو السؤال الذي يجب أن يجيب عنه ميثاق المشروع؟\nلماذا يتم تنفيذ هذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "لماذا أعطت المنظمة الأولوية لهذا المشروع؟",
          "correct": true
        },
        {
          "text": "ما هي المخاطر الرئيسية والتخفيف من حدتها؟",
          "correct": false
        },
        {
          "text": "من سيقوم بالعمل؟",
          "correct": false
        },
        {
          "text": "تم تسليم مشروع لتطوير برنامج حاسوبي جديد. وقد تم وضع البرنامج في مرحلة الإنتاج، ولكن أعضاء فريق المشروع يتصل بهم باستمرار مستخدمون يسألون عن كيفية الاستخدام أو الإبلاغ عن المشاكل، على الرغم من أن المشروع قد أغلق إداريا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجري تنفيذ مشروع ترقية طويل الأمد في سلسلة من النواتج المرحلية. وسيواجه المستخدمون النهائيون مستوى معيناً من التعطيل خلال كل مرحلة قبل تحقيق المخرجات.\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق القيمة المرجوة في كل مرحلة من المراحل؟",
      "explanation": "",
      "choices": [
        {
          "text": "جمع التعليقات باستخدام استطلاعات الرأي حول تجربة المستخدم النهائي وتحليل النتائج.",
          "correct": true
        },
        {
          "text": "مراجعة التكاليف الفعلية المتكبدة لضمان بقاء المشروع في حدود الميزانية.",
          "correct": false
        },
        {
          "text": "التحقق من صحة النطاق لضمان استيفاء الجودة المطلوبة من المخرجات.",
          "correct": false
        },
        {
          "text": "تتبع التقدم المحرز في تحقيق كل فائدة، بناءً على خطة إدارة المزايا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصبح مدير مشروع في منظمة مختلطة سريعة النمو يشعر بالإحباط بشكل متزايد بسبب حجم التغيير السريع في العمليات اليومية. وقد غادر العديد من أعضاء الفريق الجدد الفريق بالفعل أو تمت ترقيتهم إلى أدوار أخرى في المنظمة.\nما الذي يجب أن يفعله مدير المشروع لضمان استقرار حوكمة المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع القيادة لتحديث أصول العمليات التنظيمية (OPAs).",
          "correct": true
        },
        {
          "text": "تطوير عقد اجتماعي جديد لتمكين الفريق.",
          "correct": false
        },
        {
          "text": "تحديث ميثاق الفريق بأعضاء الفريق الجدد.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المشروع بشكل منتظم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال أحد المشاريع التنبؤية، يكون مدير المشروع في مرحلة وضع اللمسات الأخيرة على معايير الخروج لمشروع تطوير نظام مهم. في هذه المرحلة، يقوم أحد أصحاب المصلحة المسؤولين عن المخاطر والامتثال بإبلاغ مدير المشروع بأنه يجب إكمال أحد النواتج الإضافية بسبب تشريع أقرته الحكومة المحلية مؤخرًا. ومن المتوقع أن يكون لهذا التغيير المطلوب تأثير على تاريخ الإصدار المقرر للمشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة وإبلاغهم بأن الطلب لم يكن جزءًا من معايير الخروج.",
          "correct": true
        },
        {
          "text": "التعاون مع أصحاب المصلحة وتقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الجهة الراعية لتجنب تأخير تاريخ إصدار المشروع.",
          "correct": false
        },
        {
          "text": "إضافة هذه المخاطر الجديدة إلى سجل المخاطر ومراقبتها لأن التغييرات خارج نطاق المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين مدير مشروع لمشروع جارٍ مع أعضاء فريق افتراضي من بلدان مختلفة يعملون عن بُعد في مناطق زمنية مختلفة. يلاحظ مدير المشروع أن أعضاء الفريق لا يكملون أنشطة المشروع في الوقت المحدد وغير قادرين على إنجاز النواتج المتوقعة بسبب عدم انتظام الاتصالات.\nكيف ينبغي لمدير المشروع حل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتزويد الفريق بقائمة المنجزات لتوجيههم.",
          "correct": true
        },
        {
          "text": "تواصل مع أعضاء الفريق لفهم التحديات التي تواجههم.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب على إدارة الوقت للفريق.",
          "correct": false
        },
        {
          "text": "اتخذ خطوات لتجميع الفريق في نفس المكتب.",
          "correct": false
        }
      ]
    }
  ]
}
