{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعاً مختلطاً. وقد خرج العديد من أعضاء الفريق من المشروع مؤخرًا، بما في ذلك الشخص الوحيد الذي يتمتع بمهارة حاسمة محددة. في بداية سباق سريع جديد، يحدد مدير المشروع مهمة تتطلب هذه المهارة المفقودة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "أعد تحديد نطاق المشروع لإزالة المهمة التي تتطلب المهارة المفقودة.",
          "correct": true
        },
        {
          "text": "تقييم تأثير المهارة المفقودة على المشروع.",
          "correct": false
        },
        {
          "text": "تأجيل المهمة إلى أن يتم تعيين بديل له",
          "correct": false
        },
        {
          "text": "إعادة إسناد المهمة إلى فريق مشروع آخر يتمتع بالمهارات اللازمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق على مشروع تطوير منتج جديد باستخدام نهج هجين. بعد السباق الرابع، علموا أن سعر صرف السلع المستوردة سيزداد بشكل كبير.\nما الذي يجب على مدير المشروع القيام به للتأكد من إطلاق المنتج النهائي في الوقت المحدد وكما هو محدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل مع أصحاب المصلحة لتطوير نهج الميزنة التدريجية.",
          "correct": true
        },
        {
          "text": "تقليل مواصفات المنتج لاستخدام مواد مستوردة أقل.",
          "correct": false
        },
        {
          "text": "أنفق المال الإضافي وخطط لتعويضه في السباق التالي.",
          "correct": false
        },
        {
          "text": "مراجعة الأعمال المتراكمة لمعرفة تأثير الزيادة في الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال ورشة عمل تصميم روبوت جديد، يسأل المهندسون مدير المشروع عن بروتوكولات السلامة والبيئة لإجراءات تشغيله.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "توظيف مهندس متخصص لدعم فريق التصميم.",
          "correct": true
        },
        {
          "text": "تزويد الفريق بأصول العملية التنظيمية وميثاق المشروع.",
          "correct": false
        },
        {
          "text": "ابحث في وثائق الدروس المستفادة للمشاريع المماثلة.",
          "correct": false
        },
        {
          "text": "قم بإجراء معيار مرجعي مع مصانع مماثلة لالتقاط قيود الامتثال الخاصة بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يطلب مدير الأعمال ومالك المنتج طريقة أكثر مرونة لدمج التغييرات في الأعمال المتراكمة للمنتج. إنهم يريدون تقليل وقت الوصول إلى السوق من أجل الاستجابة لاستراتيجية إصدار المنافسين.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تدريب مالك المنتج على تحديد أولويات عناصر المنتج المتراكمة وفقًا لأهداف العمل.",
          "correct": true
        },
        {
          "text": "مراجعة سجل الافتراضات وخطة إدارة المشروع لتحديد التغييرات المحتملة.",
          "correct": false
        },
        {
          "text": "إنشاء عملية شاملة لمراقبة التغيير واختيار مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تفويض جميع أصحاب المصلحة الرئيسيين بإجراء تعديلات من أجل تسليم المنتج بشكل أسرع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التكرار، يعلن أحد أعضاء فريق المشروع الرئيسيين عن استقالته. يدرك مدير المشروع أن إحدى ميزات المنتج ستتأثر بالاستقالة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل طلب تغيير لتعديل تاريخ التسليم بناءً على هذا الوضع غير المتوقع.",
          "correct": true
        },
        {
          "text": "اطلب من الموارد البشرية (HR) الاحتفاظ بعضو الفريق حتى نهاية المشروع.",
          "correct": false
        },
        {
          "text": "تسريع تبادل المعرفة مع الفريق متعدد الوظائف لضمان فهم هذا الوضع",
          "correct": false
        },
        {
          "text": "ناقش الموقف مع مالك المنتج وحدد ما إذا كان ينبغي إضافة موارد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتقدم مشروع واسع النطاق باستمرار. ومع ذلك، يواجه الفريق صعوبات في إكمال بعض القصص المعقدة والحفاظ على سرعة الإنجاز. يكتشف مدير المشروع أن التعاون غير الفعال أدى إلى سوء الفهم والإحباط.\nما الذي يجب على مدير المشروع القيام به لتحسين أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز على القيادة الخادمة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل السبب الجذري.",
          "correct": false
        },
        {
          "text": "اطلب البصيرة من أحد المرشدين.",
          "correct": false
        },
        {
          "text": "تحسين اتصالات الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه أحد كبار أعضاء الفريق تحديات مع عضو جديد في فريق المشروع. يطلب العضو الأقدم في الفريق من مدير المشروع المشورة بشأن كيفية التعامل مع العضو الجديد في الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من أداء عضو الفريق ومصفوفة توزيع المسؤوليات لتقييم التعارض.",
          "correct": true
        },
        {
          "text": "اطلب من عضو الفريق الأقدم مواجهة عضو الفريق الجديد في اجتماع الاستعداد اليومي التالي.",
          "correct": false
        },
        {
          "text": "تدريب عضو الفريق الأقدم على نماذج حل النزاعات وكيفية تطبيقها على هذا الموقف.",
          "correct": false
        },
        {
          "text": "اطلب عقد اجتماع فردي مع العضو الجديد في الفريق واطلب منه تجنب العضو الأقدم في الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير مشروع للتو مسؤولية مشروع جارٍ. استقال مدير المشروع السابق من المنظمة. وخلال مراجعة وثائق المشروع، أدرك مدير المشروع وجود انحرافات كبيرة في عملية الشراء التي استخدمها مدير المشروع السابق للتعاقد مع مقدمي الخدمات الذين يعملون حالياً في المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اتصل بمدير المشروع السابق لفهم الأساس المنطقي لعملية الشراء غير الطبيعية.",
          "correct": true
        },
        {
          "text": "اتصل بمزوّدي الخدمة لمناقشة الانحراف ومطالبتهم بحل المشكلة.",
          "correct": false
        },
        {
          "text": "إبلاغ مقدمي الخدمة ومدير المشروع السابق إلى لجنة الأخلاقيات في المنظمة.",
          "correct": false
        },
        {
          "text": "وضع علامة على عملية الشراء غير الطبيعية كمسألة حرجة تسترعي انتباه الإدارة العليا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع مبتكر، يريد الراعي تقديم منصة معالجة بيانات مبتكرة وكبيرة لخدمة العملاء بشكل أفضل. ومع ذلك، لا يمكن وصف وظائف المنصة بوضوح في متطلبات المشروع. من أجل الحصول على استثمار مستمر، سيتم عرض كل مخرجات المشروع التي تظهر تقدمًا على الإدارة.\nما نوع نهج المشروع الذي يجب أن يوصي به مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنبؤي",
          "correct": true
        },
        {
          "text": "الشلال",
          "correct": false
        },
        {
          "text": "المرونة",
          "correct": false
        },
        {
          "text": "هجين",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار قبول المنتج لمشروع برمجيات، يخبر راعي المشروع مدير المشروع أن البرنامج لن ينجح إلا إذا تم تغيير لون السمة من الأحمر إلى الأزرق. قام مدير المشروع بمراجعة وثائق التخطيط وأكد أن لون السمة يجب أن يكون إعادة أصر الراعي على تغيير اللون إلى اللون الأزرق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اقتراح أن يقدم راعي المشروع طلب تغيير رسمي لتغيير متطلبات الموضوع.",
          "correct": true
        },
        {
          "text": "أخبر راعي المشروع بقبول الموضوع لأن العقد ينص بوضوح على أنه يجب إعادة",
          "correct": false
        },
        {
          "text": "اتفق مع راعي المشروع وقم بتغيير لون السمة حسب الطلب لتجنب أي تعارض محتمل.",
          "correct": false
        },
        {
          "text": "اطلب من قسم المشتريات تغيير لون السمة إلى اللون الأزرق ليتماشى مع توقعات راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير المشروع للتو إدارة مشروع مدته 5 سنوات وصل إلى منتصفه. وفي اجتماع اللجنة التوجيهية، سأل المدير التنفيذي عما إذا كان المشروع يسير على الطريق الصحيح لتحقيق هدف زيادة الإنتاج بنسبة 40 في المائة. أجاب مدير المشروع أنه نظرًا لأنهم عملوا في المشروع لمدة شهر واحد فقط، فإنهم لا يعرفون حالة المشروع.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة تقرير الحالة الأخير لفهم حالة المشروع.",
          "correct": true
        },
        {
          "text": "التحقق من صحة حالة المشروع مع المطور الرئيسي.",
          "correct": false
        },
        {
          "text": "مراجعة حالة المشروع الأخيرة مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "التحقق من الجدول الزمني للمشروع لفهم حالة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال مرحلة تنفيذ المشروع، يحدد فريق المشروع مخاطر لم تكن متوقعة من قبل يمكن أن تؤخر المشروع لعدة أشهر. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل المخاطر.",
          "correct": true
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر.",
          "correct": false
        },
        {
          "text": "تحديث الجهات الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "التخطيط لميزانية إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال أحد الاجتماعات، يقدم أحد أعضاء فريق العمل في مشروع إنشائي مقترحًا إلى مدير المشروع. ينص الاقتراح على أن تقسيم المشروع إلى مرحلتين سيخفف من مخاطر التأخير. ستؤدي المرحلة الأولى إلى الحصول على الحد الأدنى من المنتج القابل للتطبيق (MVP) الذي من شأنه أن يوفر للعميل فوائد مبكرة. ومن شأن ذلك أن يحد من حجم الأضرار والتجاوزات الأخرى في التكاليف بنسبة 90.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء دراسة جدوى لتقييم مخاطر وفوائد المقترح.",
          "correct": true
        },
        {
          "text": "رفض المقترح والاستمرار في المشروع كما كان مخططاً له في البداية",
          "correct": false
        },
        {
          "text": "توجيه الفريق بتنفيذ التغييرات المقترحة دون مزيد من المراجعة.",
          "correct": false
        },
        {
          "text": "ناقش المقترح مع العميل وأصحاب المصلحة الآخرين للحصول على آرائهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ للتو مشروع جديد يضم أعضاء فريق من بلدين. ونظراً لاختلاف التوقيت، ينتهي أحد الموقعين من العمل بعد ساعة من بدء عمل الموقع الآخر لهذا اليوم.\nما الذي يجب على مدير المشروع القيام به لتعزيز التواصل بين الموقعين؟",
      "explanation": "",
      "choices": [
        {
          "text": "أثني على أعضاء الفريق المتاحين بعد ساعات العمل.",
          "correct": true
        },
        {
          "text": "حدد مواعيد الاجتماعات عبر الإنترنت خلال الساعات المتداخلة.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق الالتزام بساعات العمل الموحدة.",
          "correct": false
        },
        {
          "text": "صياغة ميثاق الفريق لوضع منهجية لصنع القرار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كجزء من أحد نواتج المشروع، يقوم مدير المشروع بشرح كيفية استخدام أحد المنتجات لمجموعة فرعية من موظفي العميل من خلال مكالمة جماعية افتراضية مدتها 30 دقيقة. يشتكي موظفو العميل من أن ورشة عمل لمدة يومين كانت ستكون أكثر فعالية للتدريب.\nما الذي كان ينبغي على مدير المشروع فعله لمنع هذه الشكوى؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم الاحتياجات التدريبية لموظفي العميل.",
          "correct": true
        },
        {
          "text": "إدراج هذا الخطر في خطة إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "توفير احتياطي طوارئ للتدريب الإضافي.",
          "correct": false
        },
        {
          "text": "وضع خطة تدريب غير متزامنة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كان أحد كبار أعضاء الفريق مؤثرًا للغاية ولعب دورًا حاسمًا في المشاريع السابقة. وفي هذا المشروع الجديد، لم يعد العضو الأقدم يلعب دورًا حاسمًا في هذا المشروع الجديد ولم يعد يلعب دورًا حاسمًا\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بترتيب اجتماع للفريق لمناقشة طرق زيادة التحفيز.",
          "correct": true
        },
        {
          "text": "توفير حوافز لزيادة التحفيز.",
          "correct": false
        },
        {
          "text": "اطلب من المدير الوظيفي التحدث مع عضو الفريق.",
          "correct": false
        },
        {
          "text": "قم بترتيب اجتماع فردي مع عضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "غالبًا ما يهيمن على المناقشات خلال الاجتماعات الأسبوعية لفريق المشروع أحد كبار أعضاء الفريق الذي يميل إلى التحدث على أعضاء الفريق الآخرين وانتقاد وجهة نظرهم علانية. ويتسبب ذلك في إحباط معنويات أعضاء الفريق الآخرين ويؤدي إلى عدم المشاركة خلال الاجتماعات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإزالة عضو الفريق الأقدم من الاجتماع الأسبوعي.",
          "correct": true
        },
        {
          "text": "نظّم نشاطاً لبناء الفريق يشجع على إيجاد الحلول معاً.",
          "correct": false
        },
        {
          "text": "فرض القواعد الأساسية الحالية لسلوك الفريق.",
          "correct": false
        },
        {
          "text": "تصعيد سلوك عضو الفريق الأقدم إلى المدير الوظيفي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين مدير مشروع جديد لمشروع في مرحلة التنفيذ. وقد أنجز المشروع للتو منجزات المرحلة الأولى. خلال ورشة عمل لاستعراض نطاق المرحلة الثانية من المشروع، اشتكى اثنان من أصحاب المصلحة من عدم إبلاغهم بالمنافع التي تم تسليمها بالفعل\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى اللجنة التوجيهية لأنه يجب أن يكون الراعي قد أبلغ أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى الجهة الراعية لأن السؤال جاء من بعض كبار أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "قم بتسجيل المشكلة في سجل المشكلات، ومناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "تسجيل المشكلة في السجل، ومراجعة مصفوفة أصحاب المصلحة، وتحديث خطة إدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نجح فريق مشروع رشيق في إصدار نواتج محدثة في كل سباق سريع توفر باستمرار قيمة متزايدة للمستخدمين. ومع ذلك، فإن المشروع يتجاوز الميزانية المخصصة له في البداية، ولا يزال هناك العديد من البنود في الأعمال المتراكمة للمشروع. وقد أعرب أصحاب المصلحة عن مخاوف متزايدة، ويحتاج مدير المشروع إلى اتخاذ قرار بشأن أفضل مسار عمل لمعالجة الوضع وإدارة توقعات أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قياس رضا المستخدمين وتقديم النتائج إلى اللجنة التوجيهية.",
          "correct": true
        },
        {
          "text": "قم بإزالة النواتج المتراكمة التي لم تكن جزءًا من ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "طلب ميزانية إضافية بناءً على تقدير محدث للبنود المتراكمة المتبقية.",
          "correct": false
        },
        {
          "text": "التأكيد على توقع وجوب إنهاء العمل الملتزم به في الوقت المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التخطيط لمشروع جديد، يجد مدير مشروع جديد أن طلب تقديم العروض (RFP) يشير إلى عدة لوائح حكومية. ومع ذلك، يكتشف مدير المشروع أن المبادئ التوجيهية للامتثال المتعلقة بلائحتين محددتين قيد الإنشاء وغير متوفرة حالياً. تنصح الإدارة العليا مدير المشروع بأن المبادئ التوجيهية ستكون متاحة عندما يتم الوصول إلى تلك المرحلة من المشروع وتوجه مدير المشروع إلى مواصلة العمل على المقترح.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأخير المشروع وشرح عواقب عدم الامتثال للإدارة العليا.",
          "correct": true
        },
        {
          "text": "توثيق التفاعلات مع الإدارة العليا كافتراضات في سجل الافتراضات.",
          "correct": false
        },
        {
          "text": "التحقق من متطلبات اللوائح الحكومية ووضع استراتيجية للامتثال لها.",
          "correct": false
        },
        {
          "text": "مواصلة العمل على الاقتراح وتحديثه كلما تم فهم المزيد من إرشادات الامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مسؤول عن قيادة إصدار منتج له جداول زمنية صارمة للوصول إلى السوق. تم تقدير إجمالي 600 نقطة من نقاط القصة مع سرعة 60 نقطة لكل تكرار. تم تعيين فريق يصل عدد أعضائه إلى عضوين لهذا المشروع.\nما العبارة الصحيحة عن هذا السيناريو؟",
      "explanation": "",
      "choices": [
        {
          "text": "وتمثل السرعة 60 نقطة لكل تكرار الحد الأدنى للعمل الذي يجب إنجازه، ويمثل عضوان من الفريق الحد الأقصى لحجم الفريق.",
          "correct": true
        },
        {
          "text": "تعني سرعة 60 نقطة في كل تكرار أن المشروع تحت السيطرة، بينما تعني سرعة 60 نقطة في كل تكرار أن المشروع تحت السيطرة، وتعني سرعة 2 من أعضاء الفريق أن المشروع خارج السيطرة.",
          "correct": false
        },
        {
          "text": "تعني السرعة 60 نقطة لكل تكرار أن المشروع تحت السيطرة، ويمثل عضوان من الفريق الحد الأقصى لحجم الفريق.",
          "correct": false
        },
        {
          "text": "تمثل سرعة 60 نقطة في كل تكرار الحد الأدنى من العمل الذي يجب إنجازه، ويعني وجود عضوين من الفريق أن المشروع تحت السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إخطار مدير مشروع في إحدى شركات التصنيع بوجود عطل في الماكينة التي تم تسليمها أثناء الاختبارات الأولية. فشلت الآلة في الامتثال لمواصفات التصميم القياسية، مما أدى إلى حدوث أعطال ومخاوف تتعلق بالسلامة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة إجراء الاختبار الأولي وتنفيذه.",
          "correct": true
        },
        {
          "text": "تقييم العوامل البيئية والفردية.",
          "correct": false
        },
        {
          "text": "تقييم الوثائق الفنية للماكينة.",
          "correct": false
        },
        {
          "text": "تحقق من الاتصالات بين أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بقيادة مشروع لتقديم منتج جديد في صناعة شديدة التنظيم ويجب عليه إعطاء الأولوية لممارسات إدارة الجودة. يفكر مدير المشروع في إدارة تحسينات الجودة.\nما الذي يجب أن يركز عليه مدير المشروع لضمان التركيز على إدارة تحسينات الجودة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد أولويات الإصدار السريع للمنتج وتحليل ملاحظات المستهلكين لتحديد التحسينات اللازمة للجودة وتنفيذها.",
          "correct": true
        },
        {
          "text": "تنفيذ استراتيجية التدقيق المتكرر للجودة وتتبع عيوب المنتج لتحديد ومعالجة أي مشكلات في الجودة.",
          "correct": false
        },
        {
          "text": "تبسيط ممارسات الجودة والامتثال من خلال تفويض مسؤولية مراقبة الجودة إلى عضو معين في الفريق.",
          "correct": false
        },
        {
          "text": "وضع مقاييس وأهداف واضحة للجودة لكل مرحلة من مراحل المشروع لضمان الامتثال لمعايير الجودة التنظيمية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بقيادة مشروع يتبع النهج التنبؤي للشركة. يكتشف مدير المشروع أن المشروع متأخر عن الجدول الزمني والميزانية لأن أحد أصحاب المصلحة الرئيسيين يقدم عددًا كبيرًا من طلبات التغيير بشكل غير عادي.\nما الذي يجب أن يفعله مدير المشروع لمساعدة الشركة على تحقيق النتائج المرجوة من المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المخاطر لتحديد خطة تخفيف المخاطر.",
          "correct": true
        },
        {
          "text": "استخدم احتياطي الطوارئ لتنفيذ نشاط المسار السريع.",
          "correct": false
        },
        {
          "text": "مراجعة عملية التحكم في التغيير وتنفيذ التحسينات.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة مع صاحب المصلحة إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع إدارة مشاريع متعددة في خمسة بلدان مختلفة، وقد صدر له توجيه جديد بشأن الزي في مكان العمل وترتيبات المكاتب. وقد قوبل هذا الأمر بمقاومة في ثلاثة بلدان، مما أدى إلى سلسلة من سوء الفهم والاستياء والمشاكل القانونية المحتملة.\nما الذي كان ينبغي على مدير المشروع فعله للتعامل مع هذا الموقف بشكل أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الإدارة العليا التوضيح والاستثناءات قبل إصدار توجيه عام لجميع الدول.",
          "correct": true
        },
        {
          "text": "تقييم السمات الثقافية والشخصية في مختلف البلدان قبل إصدار توجيه عام.",
          "correct": false
        },
        {
          "text": "تحديد الحالة الاجتماعية والاقتصادية لأعضاء الفريق قبل إصدار توجيه واسع النطاق.",
          "correct": false
        },
        {
          "text": "الحصول على قائمة بالتفضيلات الشخصية من أعضاء الفريق قبل إصدار توجيهات عامة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع في مرحلة تنفيذ المشروع. يتخطى أحد أصحاب المصلحة الذين تم تحديدهم حديثًا مدير المشروع باستمرار للحصول على تعليقات من راعي المشروع مباشرة، مما يزيد من الضغط والإحباط لجميع أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الدعوة إلى عقد اجتماع لجميع أصحاب المصلحة في المشروع لمناقشة الأمر ووضع خطة عمل مناسبة.",
          "correct": true
        },
        {
          "text": "أرسل خطة إدارة الاتصالات إلى صاحب المصلحة بالبريد الإلكتروني وأشر إلى أنه وافق على الخطة.",
          "correct": false
        },
        {
          "text": "قابل راعي المشروع وتأكد من أن مدير المشروع يجب أن يكون نقطة الاتصال الوحيدة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة لفهم احتياجاتهم وتحديث خطة إدارة التواصل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على إطلاق الحد الأدنى من المنتج القابل للتطبيق (MVP) لمنتج جديد في السوق. وقد تقدم الفريق بنجاح إلى التكرار الثالث من أصل ستة تكرارات من إجمالي ستة تكرارات مخطط لها. خلال اجتماع تخطيط التكرار القادم، يقوم العميل بإخطار الفريق بأن أحد المنافسين يعتزم التغلب عليهم في السوق وإطلاق منتج مماثل في الربع القادم.\nكيف ينبغي لمدير المشروع معالجة هذا التحدي التنافسي؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإقرار بالمشكلة وتضمين تفاصيل شاملة في تقرير الحالة التالي للمشروع.",
          "correct": true
        },
        {
          "text": "زيادة حجم الفريق للإسراع في تسليم المنتج وإطلاق المنتج قبل المنافس.",
          "correct": false
        },
        {
          "text": "اجتمع مع العميل لمناقشة تقليل الأعمال المتراكمة في المشروع للمساعدة في تسريع تسليم المنتج.",
          "correct": false
        },
        {
          "text": "اعمل مع الفريق لتحديد أولويات الميزات الأساسية وإعادة تعريف MVP للتغلب على المنافسين في السوق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كان فريق مشروع مشتت يعمل معًا في مشروع تطوير طويل الأجل. أنهى الفريق للتو عملية تكرار عندما انضم عضو جديد إلى فريق المشروع. خلال أول اجتماع استعراضي افتراضي لهم، يقاطع عضو الفريق المنضم حديثًا ويطلب من الجميع إعادة ذكر أدوارهم وأعمالهم السابقة في التكرارات السابقة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتوجيه عضو الفريق الجديد لمراجعة خطة إدارة المشروع بعد الاجتماع.",
          "correct": true
        },
        {
          "text": "أبلغ عضو الفريق أنه من الأفضل معالجة هذا السؤال في اجتماع آخر.",
          "correct": false
        },
        {
          "text": "اطلب من كل عضو في الفريق شرح دوره وما عمل عليه في التكرارات السابقة.",
          "correct": false
        },
        {
          "text": "اطلب من المدير الوظيفي للعضو الجديد في الفريق مراجعة عملية التأهيل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لإعادة تصميم نظام نقاط البيع في أحد المتاجر. يقوم الفريق حاليًا باختبار الوظيفة الجديدة عندما يقترح أحد أصحاب المصلحة الرئيسيين تغييرًا. يمكن أن يحقق التغيير فائدة كبيرة ويزيد من رضا العملاء، ولكنه يتطلب أيضًا المزيد من الموارد.\nما الإجراءات التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أوقف الاختبار وحدد موعداً لعقد اجتماع لمراجعة التغييرات المقترحة مع الموارد.",
          "correct": true
        },
        {
          "text": "الاختبار بينما يجتمع مدير المشروع مع أصحاب المصلحة الرئيسيين لمراجعة التغييرات المقترحة.",
          "correct": false
        },
        {
          "text": "توثيق التغييرات المقترحة وتقييم أي تأثير على الوقت والتكلفة والموارد.",
          "correct": false
        },
        {
          "text": "تأجيل التغييرات المقترحة والسماح للفريق بأنشطة الاختبار والتنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تخطط إحدى شركات تنظيم الفعاليات لحدث جديد لعميل يعقد مؤتمرات نصف سنوية. ويتولى إدارة المشروع مدير مشروع جديد قام بمراجعة سجل الدروس المستفادة من الحدث الأخير ويشعر بالقلق من احتمال تكرار مشكلة سابقة.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد السبب الجذري والتشاور مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تعامل مع المشكلة إذا ظهرت أثناء التخطيط للحدث.",
          "correct": false
        },
        {
          "text": "التوصية بإعادة جدولة المؤتمر القادم.",
          "correct": false
        },
        {
          "text": "نفذ نفس الاستراتيجيات المستخدمة في الحدث الأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "توشك إحدى الشركات على بدء مشروع في مكان ناءٍ معروف بالطقس القاسي. وقد تم الاتفاق على تنفيذ المشروع باستخدام نهج متوقع متعدد المراحل. وتتألف كل مرحلة من عدة تكرارات.\nما الذي يجب أن يفعله مدير المشروع في حالة الطقس القاسي؟",
      "explanation": "",
      "choices": [
        {
          "text": "أوقف العمل مؤقتًا حتى وصول فريق متخصص لتقييم الأضرار التي لحقت بالموقع.",
          "correct": true
        },
        {
          "text": "راجع الخطط الأولية في حالة الطوارئ، ثم قم بتحديث واتباع الإجراءات التصحيحية.",
          "correct": false
        },
        {
          "text": "تقديم المشورة للإدارة لإعادة النظر في هذا الاستثمار واستمرارية المشروع.",
          "correct": false
        },
        {
          "text": "أوقف عملية التكرار، وقم بإجراء استعراض بأثر رجعي، وانتقل إلى المرحلة التالية من المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيلاحظ مدير المشروع أن أعضاء الفريق لا يتعاونون أو لا يتصرفون بشكل استباقي. ما الذي كان ينبغي أن يفعله مدير المشروع في بداية المشروع لتحقيق بيئة مشروع أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تقييم لديناميكيات الفريق.",
          "correct": true
        },
        {
          "text": "تعيين جميع المهام في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تيسير اجتماعات الفريق الإضافية.",
          "correct": false
        },
        {
          "text": "تقسيم المشروع إلى المزيد من التكرارات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مسؤول عن مشروع شلالي مدته شهران لإنشاء منتج جديد. وقد مضى تسعة أشهر على بدء تنفيذ المشروع عندما اقترح العميل استخدام تكنولوجيا جديدة أصبحت متاحة من شأنها أن تقلل من تكاليف المشروع بنسبة 0.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة التكوين لتضمين التقنية الجديدة كجزء من التصميم.",
          "correct": true
        },
        {
          "text": "مواصلة العمل كما هو مخطط له نظرًا لأن التقنية الجديدة لم تكن جزءًا من خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء طلب تغيير لتقييم جدوى وتأثير استخدام التقنية الجديدة.",
          "correct": false
        },
        {
          "text": "اطلب من فريق التطوير تنفيذ جميع المكونات المتبقية بالتقنية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مسؤول عن مشروع شلالي مدته شهران لإنشاء منتج جديد. وقد مضى تسعة أشهر على بدء تنفيذ المشروع عندما اقترح العميل استخدام تكنولوجيا جديدة أصبحت متاحة من شأنها أن تقلل من تكاليف المشروع بنسبة 0.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة التكوين لتضمين التقنية الجديدة كجزء من التصميم.",
          "correct": true
        },
        {
          "text": "مواصلة العمل كما هو مخطط له نظرًا لأن التقنية الجديدة لم تكن جزءًا من خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء طلب تغيير لتقييم جدوى وتأثير استخدام التقنية الجديدة.",
          "correct": false
        },
        {
          "text": "اطلب من فريق التطوير تنفيذ جميع المكونات المتبقية بالتقنية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد اجتماعات المراجعة، يكتشف مدير المشروع سوء تفاهم حول أحد النواتج المهمة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من أعضاء الفريق توضيح ما يمكن إنجازه.",
          "correct": true
        },
        {
          "text": "اطلب من العميل توضيح ما يمكن تسليمه.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج توضيح ما يمكن إنجازه.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية توضيح ما يمكن إنجازه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بوضع ميزانية المشروع. بعد تقدير تكلفة كل نشاط، يضيف المدير احتياطي طوارئ بزيادة التكلفة المقدرة لجميع الأنشطة بنفس النسبة المئوية. غير أن ذلك يؤدي إلى تجاوز التكلفة الإجمالية للميزانية المخصصة حتى قبل إضافة احتياطي الإدارة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب ميزانية إضافية للتأكد من أن جميع تقديرات التكاليف ممولة بشكل مناسب",
          "correct": true
        },
        {
          "text": "تقليل النسبة المئوية للزيادة لتقليل التكلفة الإجمالية للمشروع.",
          "correct": false
        },
        {
          "text": "إعادة حساب احتياطي الطوارئ بناءً على المخاطر المحددة واستراتيجيات الاستجابة.",
          "correct": false
        },
        {
          "text": "تخصيص جزء من احتياطي الطوارئ لاحتياطي الإدارة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في المشروع الرشيق، تشير حالة المشروع إلى أن المشروع 95 خلال مراجعة التكرار، كان أصحاب المصلحة قلقين بشأن قيمة الأعمال التي يتم تقديمها\nما الذي يجب أن يفعله مدير المشروع لضمان مواءمة المشروع بشكل صحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "التواصل مع أصحاب المصلحة للتخفيف من مخاوفهم.",
          "correct": true
        },
        {
          "text": "توجيه راعي المشروع لمراجعة أهداف المشروع والعمل على تحقيقها",
          "correct": false
        },
        {
          "text": "اجتمع مع مالك المنتج لإعادة تقييم نطاق المشروع ومخرجاته.",
          "correct": false
        },
        {
          "text": "اطلب من محلل الأعمال تعديل أهداف المشروع وفقًا لذلك.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب موعد نهائي رئيسي من أحد أعضاء الفريق المتخصصين الذين تلقوا فجأة خبرًا مفاده أن عليهم مغادرة المكتب لمدة أسبوعين. لديهم ما يقرب من ثلاثة أيام عمل حتى مغادرتهم ولن يكونوا متاحين عبر أي قنوات اتصال.\nما الذي يجب أن يفعله مدير المشروع الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اضبط خطة المشروع والجدول الزمني لاستيعاب الغياب.",
          "correct": true
        },
        {
          "text": "تحديد المهام الحرجة والتبعيات التي قد تتأثر بها",
          "correct": false
        },
        {
          "text": "تقديم مورد بديل لعضو الفريق المغادر.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق الإسراع قدر المستطاع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء مشروع مختلط، يقوم مدير المشروع بمراجعة أداء فريق المشروع ويدرك أن سرعة الفريق ليست سريعة بما يكفي لتحقيق هدف بوابة المراجعة التالية. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد أولويات محتويات القصص المتراكمة وقم بإزالة بعض القصص.",
          "correct": true
        },
        {
          "text": "قم بزيادة مدة السباق السريع لإتاحة المزيد من الوقت للفريق.",
          "correct": false
        },
        {
          "text": "استخدم اجتماع الاستعداد لتقييم العوائق والمشاكل.",
          "correct": false
        },
        {
          "text": "إنشاء طلب تغيير لتعديل أهداف بوابة المراجعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيعمل فريق على مشروع جديد ويرفض الراعي الموافقة على زيادة الميزانية اللازمة للتكرار الحالي. ما الذي ينبغي أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم طلب تغيير للحصول على موافقة رسمية على زيادة الميزانية.",
          "correct": true
        },
        {
          "text": "العمل مع أصحاب المصلحة لتطوير مناهج مرنة لوضع الميزانية.",
          "correct": false
        },
        {
          "text": "اشرح للجهة الراعية مخاطر عدم الحصول على الموافقة على الميزانية.",
          "correct": false
        },
        {
          "text": "أنفق المال الإضافي وخطط للتعويض في السباق القادم.",
          "correct": false
        }
      ]
    }
  ]
}
