{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "في المراحل الأولى من تشكيل الفريق، يكون مدير المشروع غير قادر على التركيز على المهام الرئيسية لأن أعضاء الفريق يطلبون المساعدة باستمرار لحل النزاعات المتعلقة بتفسير متطلبات العميل.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمكين الفريق من حل النزاعات فيما بينهم.",
          "correct": true
        },
        {
          "text": "اقضِ بعض الوقت في حل هذه النزاعات مع الفريق.",
          "correct": false
        },
        {
          "text": "استخدم لجنة حل النزاعات للمساعدة في حل هذه النزاعات.",
          "correct": false
        },
        {
          "text": "تصعيد النزاعات إلى مدير البرنامج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع لتكنولوجيا المعلومات (IT) بفريق جديد لمشروع تطوير برمجيات في بيئة رشيقة. يقدّر مدير المشروع أن المشروع سيستغرق عددًا معينًا من الأيام استنادًا إلى الخبرة السابقة في مؤسسة أخرى.\nكيف ينبغي لمدير المشروع التحقق من صحة هذا الافتراض وتخطيط وإدارة الجدول الزمني للمشروع بشكل صحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مسح في المؤسسة وإنشاء بيانات للتحقق من صحة المطالبات.",
          "correct": true
        },
        {
          "text": "التقدير استناداً إلى اجتماعات مراجعة السباق السريع ومدخلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دراسة اجتماعات التخطيط السابقة لسباق السرعة وثقافة المشروع في المؤسسة.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام فريق المشروع بتسليم مخرجات المشروع، ولكن مدير المشروع يرغب في تقييم ما إذا كان المشروع قد حقق القيمة المرجوة منه للجهة الراعية.\nما هو العامل الأكثر ملاءمة لمدير المشروع لتقييمه؟",
      "explanation": "",
      "choices": [
        {
          "text": "مواءمة ما تم إنجازه مع توقعات الجهة الراعية.",
          "correct": true
        },
        {
          "text": "ما إذا كانت مخرجات المشروع قد زادت من الدخل المحتمل للجهة الراعية.",
          "correct": false
        },
        {
          "text": "ما إذا كانت فروق أداء التسليم ضمن الحدود التي حددتها الجهة الراعية.",
          "correct": false
        },
        {
          "text": "التزام المشروع بشكل عام بقيود النطاق والوقت والميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني أعضاء الفريق الرشيق من صعوبات. في حين أن هناك ثقة بين أعضاء الفريق، فإن غالبية قرارات الفريق يتخذها عدد قليل من أعضاء الفريق الأكثر خبرة.\nما الذي يجب أن يفعله مدير المشروع من أجل تمكين فريق عمل عالي الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "ثني أعضاء الفريق ذوي الخبرة عن التحدث أولاً، والسماح للآخرين بتقديم أفكارهم.",
          "correct": true
        },
        {
          "text": "تيسير الاجتماعات لضمان مشاركة جميع أعضاء الفريق في قرارات الفريق.",
          "correct": false
        },
        {
          "text": "تدريب الفريق لضمان تقديم جميع الأعضاء للأفكار وتحقيق توافق في الآراء بين أعضاء الفريق",
          "correct": false
        },
        {
          "text": "قم بإثارة المشكلة في جلسة استرجاعية واطلب من الفريق إضفاء الطابع الرسمي على اتفاقيات الفريق الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد مشاريع تطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعرون أنه سيكون ذا فائدة كبيرة للمشروع. ومع ذلك، فإن هذا المطلب لا يتماشى مع أهداف المشروع التي وثقها صاحب العمل\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من فهم أصحاب المصلحة للغرض من المشروع.",
          "correct": true
        },
        {
          "text": "تشجيع أصحاب المصلحة على اتباع متطلبات العمل المكتوبة.",
          "correct": false
        },
        {
          "text": "تضمين المتطلبات الإضافية في المشروع وإبلاغ صاحب العمل.",
          "correct": false
        },
        {
          "text": "المسار السريع للمشروع واقتراح المتطلبات الجديدة على صاحب العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع رشيق في البلد \"أ\" مع فريق التطوير ومحلل الأعمال في البلد \"ب\"، وفريق ضمان الجودة في البلد \"ب\" خلال السباق الثاني، يتضح أن جميع حالات الاختبار قد فشلت يتأكد الميسر الرشيق من أن محلل الأعمال قد غير معايير قبول القصص وأبلغ هذه التغييرات إلى فريقه المحلي فقط.\nما الذي يجب أن ينفذه مدير المشروع الرشيق من الآن فصاعداً لمنع تكرار ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "حماية كلمة المرور على قصص المستخدمين",
          "correct": true
        },
        {
          "text": "وثائق مراقبة التغيير الموقعة",
          "correct": false
        },
        {
          "text": "إشعارات التغيير التلقائية من أداة قصة المستخدم",
          "correct": false
        },
        {
          "text": "تهيئة التراكمات المتراكمة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيشارك خبير متخصص ذو مهارة عالية في مشروع حكومي حيث سيتبع ما يقرب من 30 من النواتج نهجًا رشيقًا. ويدعو مدير المشروع الخبير الصغير والمتوسط الحجم للانضمام إلى فريق العمل الرشيق للمساهمة في هذه التكرارات. لكن الشركة الصغيرة والمتوسطة مترددة لأنها تعتقد أن العمل ضمن فريق عمل محبط ومثبط للمعنويات ويبطئ من سرعتها، كما أنها تريد تحقيق أعلى جودة ممكنة للمخرجات.\nما الذي يجب أن يفعله مدير المشروع لمعالجة مخاوف الشركات الصغيرة والمتوسطة وتشجيعها على الانضمام إلى فريق العمل الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "التوصية بتطوير الذكاء العاطفي لدى الشركات الصغيرة والمتوسطة من خلال الاندماج مع الفريق.",
          "correct": true
        },
        {
          "text": "اشرح أن العمل الجماعي يعزز التحسين المستمر وحلقات التغذية الراجعة المبكرة.",
          "correct": false
        },
        {
          "text": "اطلب أن يقوم الخبير الصغير والمتوسط بإجراء الاجتماعات الاستعراضية كمراقب موضوعي.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية الاجتماع مع الشركات الصغيرة والمتوسطة والمساعدة في تحسين موقفها تجاه العمل الجماعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع أن إحدى المهام على المسار الحرج متأخرة عن الجدول الزمني. يعتقد مدير المشروع أن الموارد الإضافية ستساعد، لكن الإدارة العليا رفضت طلب التمويل الإضافي اللازم لإضافة موارد إضافية. يجب على مدير المشروع العمل بالموارد والميزانية المعتمدة.\nما هي الممارسة الأنسب لمدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تسوية الموارد",
          "correct": true
        },
        {
          "text": "التحطم",
          "correct": false
        },
        {
          "text": "التتبع السريع",
          "correct": false
        },
        {
          "text": "تحليل سيناريو ماذا لو",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تجميع فريق عالمي متعدد الوظائف لتنفيذ مبادرة متعددة الجنسيات. ما الذي ينبغي لمدير المشروع أن يفعله لضمان المشاركة الكاملة للفريق في جميع مراحل المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنسيق معلومات المنطقة الزمنية والاتفاق على أوقات الاجتماعات.",
          "correct": true
        },
        {
          "text": "ضمان تقديم البرامج بلغات متعددة.",
          "correct": false
        },
        {
          "text": "ترجمة وثائق المشروع.",
          "correct": false
        },
        {
          "text": "تقديم إرشادات حول الأدوات والممارسات الشائعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تعيين مدير مشروع للتو فريق مشروع جديد ويحتاج إلى تعيين المهام لمشروع قادم بسرعة وفعالية. ولضمان إسناد المهام إلى الموارد المناسبة، ما هو النهج الذي ينبغي اتباعه؟",
      "explanation": "",
      "choices": [
        {
          "text": "وزع المهام بالتساوي لأن الفريق يجب أن يتمتع جميع أفراده بمهارات متساوية.",
          "correct": true
        },
        {
          "text": "خصص المهام الأكثر تعقيدًا للأعضاء الأقدم في فريق المشروع.",
          "correct": false
        },
        {
          "text": "قم بتقييم خلفية الفريق وخبرته وقدراته، ثم قم بتعيين المهام.",
          "correct": false
        },
        {
          "text": "تعيين أعضاء الفريق ذوي الخبرة لمساعدة أعضاء الفريق الذين يفتقرون إلى الخبرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الانطلاق، يقوم الراعي بإبلاغ فريق المشروع بأنه لا يمكنه حضور أي اجتماعات للنصف الأول من المشروع. ويرغب الراعي في تعيين بديل له.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب أن يتمتع البديل بنفوذ كبير وسلطة اتخاذ القرار.",
          "correct": true
        },
        {
          "text": "قم بإعداد اجتماع مع الراعي البديل في أقرب وقت ممكن لمناقشة جدول الأعمال القادم",
          "correct": false
        },
        {
          "text": "طلب الاهتمام الكامل من الجهة الراعية وتصعيد هذه المشكلة إلى مكتب إدارة المشروع (PMO).",
          "correct": false
        },
        {
          "text": "تحليل أثر التغيير والعمل مع الجهة الراعية لتحديد البديل المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع جديد. يوجد خلاف بين اثنين من موارد المشروع الرئيسية بشأن أحد المتطلبات. ويرغب مدير المشروع في فهم وجهتي النظر، لكن أحد الموردين لا يرغب في مقابلة مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "قبول منصب كبير موارد المشروع الأقدم.",
          "correct": false
        },
        {
          "text": "مراجعة أصول العمليات التنظيمية (OPAs).",
          "correct": false
        },
        {
          "text": "ارجع إلى القواعد الأساسية للفريق ورؤية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع على مشروع يهدف إلى تزويد العملاء بقدرات تتبع الشحنات في الوقت الفعلي. واجه فريق المشروع خلافات مستمرة تدور في المقام الأول حول التفسيرات المختلفة لكيفية مساهمة قصص المستخدمين في نجاح المشروع. يعتقد بعض أعضاء الفريق أن قصص المستخدمين يجب أن تعطي الأولوية للسرعة، في حين يؤكد آخرون على الدقة كأولوية قصوى.\nما الذي يجب أن يفعله مدير المشروع لمعالجة خلافات أعضاء الفريق حول قصص المستخدمين؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من مدير المنتج الاجتماع مع الفريق وتوضيح متطلبات قصص المستخدمين.",
          "correct": true
        },
        {
          "text": "حدد موعدًا لعقد اجتماع مع راعي الأعمال للحصول على توضيح بشأن قصص المستخدمين.",
          "correct": false
        },
        {
          "text": "قم بمراجعة ميثاق المشروع باستمرار مع أعضاء الفريق لضمان المواءمة.",
          "correct": false
        },
        {
          "text": "تحقق من توافق قصص المستخدم مع أهداف العمل وأهداف المشروع بشكل عام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقدم مشروع بناء لمدة 8 أشهر تقريبًا، ويبلغ مؤشر أداء الجدول الزمني 0.68. ويعتزم مدير المشروع تنفيذ المشروع كما هو مخطط له دون تكلفة إضافية.\nما الذي يجب أن يفعله مدير المشروع للمشروع في الوقت المحدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "اصطدم بالجدول الزمني",
          "correct": true
        },
        {
          "text": "تسريع الجدول الزمني.",
          "correct": false
        },
        {
          "text": "تقليل نطاق المشروع.",
          "correct": false
        },
        {
          "text": "تقليل جودة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت إحدى المؤسسات مؤخرًا بتحديث خطتها الاستراتيجية وكانت بعض التغييرات جوهرية. خلال اجتماع لمشروع جاري، تساءل أحد أصحاب المصلحة المهمين عن كيفية توافق المشروع مع الخطة الاستراتيجية الجديدة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة بفعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة ميثاق المشروع ومراجعته لضمان التوافق مع الاستراتيجية المؤسسية.",
          "correct": true
        },
        {
          "text": "حدد موعداً لعقد اجتماع متابعة مع أصحاب المصلحة لمناقشة مخاوفهم.",
          "correct": false
        },
        {
          "text": "تذكير أصحاب المصلحة بأن المشروع قد بدأ قبل تغيير الاستراتيجية.",
          "correct": false
        },
        {
          "text": "طمأنة أصحاب المصلحة بأن المشروع يتماشى مع الاستراتيجية التنظيمية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إطلاق مشروع استراتيجي وتم تعيين مدير للمشروع المشروع المشروع يتقدم المشروع ويسير الفريق بنجاح، ولكن أحد أصحاب المصلحة الرئيسيين يتصل بمدير المشروع ويشتكي من عدم تلقي تحديثات عن التقدم المحرز.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من إرسال نسخة إلى صاحب المصلحة على رسائل البريد الإلكتروني الأسبوعية الخاصة بالحالة.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة اتصالات المشروع وتحديثها.",
          "correct": false
        },
        {
          "text": "أرسل إلى صاحب المصلحة نسخة من أحدث تقرير عن حالة المشروع.",
          "correct": false
        },
        {
          "text": "قم بدعوة صاحب المصلحة الرئيسي لحضور الاجتماع التالي للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تدعو خطة إدارة الجودة (QMP) إلى إجراء اختبار الانحدار قبل كل إصدار للمنتج، ولكن لم يتم تضمين هذه الاختبارات في هيكل تقسيم العمل (WBS).\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم طلب تغيير لإضافة حزم عمل اختبار الانحدار إلى نطاق المشروع.",
          "correct": true
        },
        {
          "text": "اطلب موارد اختبار إضافية من المدير الوظيفي لضمان الجودة.",
          "correct": false
        },
        {
          "text": "اقترح على عميل المشروع إزالة اختبار الانحدار من متطلبات الجودة.",
          "correct": false
        },
        {
          "text": "اطلب موافقة راعي المشروع على إزالة اختبار الانحدار من خطة إدارة الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع جديد يتولى إدارة مشروع إنشاءات. وعند مراجعة خطة إدارة المشروع، يدرك مدير المشروع أن متطلبات الصحة والسلامة لم يتم تناولها بشكل كافٍ لدى مدير المشروع مخاوف جدية ويريد معالجة هذا القصور.\nما هو الشاغل الأساسي في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قد يؤدي الفشل في معالجة قضايا الصحة والسلامة إلى الإضرار بثقة العميل وسمعته.",
          "correct": true
        },
        {
          "text": "يجب أن يتوافق المشروع مع جميع المتطلبات والمسؤوليات القانونية والتنظيمية.",
          "correct": false
        },
        {
          "text": "قد يتعرض الجدول الزمني للمشروع للخطر من خلال تنفيذ تدابير السلامة الإضافية.",
          "correct": false
        },
        {
          "text": "يعلم مدير المشروع أنه من الضروري تلبية مقاييس الأداء المحددة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اقترح أحد أصحاب المصلحة استخدام منتج جاهز ومفتوح المصدر لتسريع عملية التطوير. وقد قام الفريق بتحليل المنتج ووجده قابلاً للتطبيق ومرغوباً فيه، ولكنه يحتاج إلى التجريب ويتطلب مهارات إضافية من المستخدمين.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الشروع في طلب تغيير رسمي.",
          "correct": true
        },
        {
          "text": "طلب التدريب لفريق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة التكاليف.",
          "correct": false
        },
        {
          "text": "استشر مدير المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة تعمل في القطاع المالي مشروعًا هجينًا جديدًا للامتثال للوائح الحكومية الجديدة. وقد حدد الفريق سرعة موثوقة تبلغ 65 نقطة قصة لكل تكرار. ويستغرق كل تكرار أسبوعين. يريد الراعي أن يعرف متى سينتهي المشروع إذا كان هناك 040 نقطة قصة متبقية.\nكم عدد الأشهر التي سيستغرقها المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "2 شهران",
          "correct": true
        },
        {
          "text": "4 أشهر",
          "correct": false
        },
        {
          "text": "8 أشهر",
          "correct": false
        },
        {
          "text": "6 أشهر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق رشيق بالتخطيط لتكرار لمدة أسبوعين. في منتصف التكرارات القليلة الماضية، أجرى مالك المنتج تغييرات وأعاد ترتيب أولويات الميزات، مما أثر على مخرجات الفريق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتصعيد المشكلة إلى الإدارة العليا واطلب من مالك المنتج اتخاذ إجراء بشأنها.",
          "correct": true
        },
        {
          "text": "أبلغ الفريق بتجاهل التغييرات التي طلبها مالك المنتج أثناء التكرار.",
          "correct": false
        },
        {
          "text": "اشرح الآثار المترتبة على إجراء التغييرات أثناء التكرار لمالك المنتج.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج إجراء تغييرات حسب الحاجة لأن النهج الرشيق يستجيب للتغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم قبول منتج جديد من قبل العميل، ولكن بعد أسبوعين تلقى مدير المشروع شكوى من العميل تفيد بأن متطلبات وظائف المنتج لم تتحقق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "مراجعة عملية التحقق من صحة النطاق.",
          "correct": false
        },
        {
          "text": "حدد موعداً لفحص المنتج.",
          "correct": false
        },
        {
          "text": "التحقق من صحة النطاق مع العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في صناعة خاضعة للتنظيم، ويعمل الفريق على مشروع حيث يتم تحديد أولويات المتطلبات في الأعمال المتراكمة. تم تحديد الحد الأدنى من المنتج القابل للتطبيق (MVP) للإطلاق علم مدير المشروع أن الهيئة التنظيمية للمشروع تتطلب نموذجًا أوليًا للفحص قبل إطلاق هذا المنتج النموذج الأولي ليس جزءًا من تعريف MVP.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحدث مع مالك المنتج لتحديد أولويات أنشطة الامتثال في الأنشطة المتراكمة لتقديم نموذج أولي إلى الهيئة التنظيمية.",
          "correct": true
        },
        {
          "text": "حدد المتطلبات الناقصة، وحدد أولويات العمل التنظيمي الناقص مباشرةً في الأعمال التنظيمية المتراكمة وأسند العمل إلى الفريق.",
          "correct": false
        },
        {
          "text": "إعادة جدولة إطلاق المنتج حتى يتمكن الفريق من إنتاج نموذج أولي للفحص، كما هو مطلوب من قبل الهيئة التنظيمية.",
          "correct": false
        },
        {
          "text": "أنشئ تعريفًا جديدًا لـ MVP يحتوي على متطلبات النطاق للنموذج الأولي المطلوب وحدد أولويات هذا النطاق مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نظراً لنقص الموارد الماهرة محلياً، تقوم الشركة بتوظيف فريق مشروع منتشر دولياً يعمل افتراضياً. لم يسبق لمدير المشروع أن عمل مع فريق افتراضي وهو قلق بشأن المشاركة.\nما الذي يجب أن يفعله مدير المشروع لضمان استمرار مشاركة هذا الفريق الافتراضي؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من حضور الفريق الافتراضي بأكمله اجتماع انطلاق المشروع.",
          "correct": true
        },
        {
          "text": "اعتماد خطة إدارة الاتصالات لفريق افتراضي سابق.",
          "correct": false
        },
        {
          "text": "الاعتماد على الاتصال غير المتزامن لجميع تقارير الحالة الرئيسية.",
          "correct": false
        },
        {
          "text": "قم بإجراء عمليات التحقق والاجتماعات المتكررة على فترات مجدولة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء الاستعداد، يقوم أحد أعضاء الفريق بالإبلاغ بشكل خاطئ عن اكتمال قصة ما والتي تعتبر تبعية لقصص أخرى. عندما يبدأ الفريق في العمل على القصص ذات الصلة، لا يتمكنون من مواصلة التطوير لأن القصة الأولية لم تكتمل\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "راجع التخطيط لسباق السرعة مع الفريق بأكمله لفهم الترابط بين القصص.",
          "correct": true
        },
        {
          "text": "تحدث إلى عضو الفريق الذي أبلغ خطأً عن اكتمال القصة.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج مراجعة معايير القبول قبل دفعها إلى قائمة الأعمال المتراكمة في سباق السرعة.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق أن يشرح تفسيرهم لتعريف الإنجاز (DoD) في نهاية السباق السريع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد تسعة أشهر، يختتم المشروع مرحلته الأولى بإصدار منتج جديد للعميل. العميل غير راضٍ ويذكر أن العديد من الميزات الرئيسية مفقودة.\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتقييم الميزات الناقصة مع العميل ووضع خطة لإدراجها في مرحلة المشروع التالية التي تستغرق تسعة أشهر.",
          "correct": true
        },
        {
          "text": "قم بمراجعة خطة المشروع لتحديد ما إذا كانت الميزات المفقودة جزءًا من النطاق الأصلي أو إذا تمت إضافتها لاحقًا.",
          "correct": false
        },
        {
          "text": "اطلب تمويلاً إضافياً من أجل تقليل الجدول الزمني لدورة الإصدار الحالية حتى يتمكن الفريق من تقديم القيمة في وقت أقرب.",
          "correct": false
        },
        {
          "text": "أعد تشغيل المشروع من خلال تنفيذ دورة حياة رشيقة ودمج إنشاء الحد الأدنى من المنتج القابل للتطبيق (MVP).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع في مرحلة التنفيذ. يكتشف مدير المشروع الجديد أن أعضاء الفريق ليس لديهم خبرة سابقة بالتكنولوجيا المستخدمة في المشروع. ومع ذلك، هناك العديد من المديرين الوظيفيين الذين لديهم خبرة بالتكنولوجيا.\nما الذي يجب أن يفعله مدير المشروع أولاً لضمان نجاح أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من المدراء الوظيفيين العمل كمرشدين أو مدربين للفريق.",
          "correct": true
        },
        {
          "text": "اطلب من الجهة الراعية استبدال أعضاء الفريق ذوي الخبرة.",
          "correct": false
        },
        {
          "text": "تحديد المخاطر المرتبطة بقلة خبرة أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تطوير تقارير الحالة لرصد مهارات الفريق وكفاءاته.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تعيين مدير مشروع لمشروع طويل الأجل مدته ثلاث سنوات. ما هو النهج الذي ينبغي أن يتبعه مدير المشروع لمعالجة الأنشطة القريبة الأجل، بينما يتم تخطيط العمل الطويل الأجل على مستوى عالٍ ثم يتم تفصيله لاحقاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "ركز على اكتساب فريق عمل وتقديمه في أقرب وقت ممكن.",
          "correct": true
        },
        {
          "text": "إشراك الجهة الراعية في عمليات التحقق من الصحة وتحديد الأولويات.",
          "correct": false
        },
        {
          "text": "تنفيذ ورش عمل مع العميل لمواعيد التسليم.",
          "correct": false
        },
        {
          "text": "التحقق من صحة المتطلبات وتنفيذ تخطيط الموجة المتجددة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ مدير المشروع أن أعضاء الفريق لا يتفاعلون مع بعضهم البعض ويعتقد أن عدم التفاعل يؤثر سلبًا على أداء المشروع. يحاول مدير المشروع زيادة تفاعل الفريق من خلال استضافة فعالية بعد انتهاء العمل، ولكن لم يحضر سوى عدد قليل من أعضاء الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل استبيانًا للفريق لجمع أفكار لأنشطة ما بعد العمل من أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "استمر في دعوة أعضاء الفريق إلى الفعاليات وتحسين الروح المعنوية بشكل تدريجي.",
          "correct": false
        },
        {
          "text": "تقديم حوافز ومكافآت دورية لأعضاء الفريق الأعلى أداءً.",
          "correct": false
        },
        {
          "text": "استطلع آراء الفريق بشكل سري لتحديد السبب الجذري لعدم التفاعل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام راعي مشروع بملايين الدولارات باستدعاء مدير المشروع لعقد اجتماع أزمة. قدم العميل طلبًا رسميًا لضغط الجدول الزمني بشكل كبير من أجل الوفاء بالموعد النهائي القانوني.\nما الذي يجب أن يفعله مدير المشروع للتحضير للاجتماع؟",
      "explanation": "",
      "choices": [
        {
          "text": "بدء إجراءات التعجيل بتنفيذ المشروع.",
          "correct": true
        },
        {
          "text": "تنفيذ التغييرات المطلوبة على الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "أدوات التحليل لتعطيل أنشطة المشروع.",
          "correct": false
        },
        {
          "text": "إعداد تقرير تقييم أثر التغيير للمراجعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تكليف مدير مشروع بمعالجة مخاوف مالك المنتج بشأن تسليم الحد الأدنى من المنتج القابل للتطبيق (MVP) في السباق الرابع. أي من المقاييس التالية يجب أن يستخدمها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مؤشر الأداء المجدول (SPI)",
          "correct": true
        },
        {
          "text": "مؤشر تكلفة الجدول الزمني (SCI)",
          "correct": false
        },
        {
          "text": "معدل الاحتراق",
          "correct": false
        },
        {
          "text": "التحليل النوعي للمخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في شركة تعمل في مشاريع تسليم المفتاح المعقدة. وأثناء تقييم الفريق، يجد مدير المشروع أن الأداء العام يتأثر سلباً لأن الفريق يواجه مشكلة في التكيف مع التغييرات المتكررة في متطلبات المشروع وحالته.\nما الذي يجب أن يفعله مدير المشروع لضمان أن يكون الفريق مجهزاً بشكل أفضل للتكيف مع التغيير؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الجهة الراعية التواصل مباشرةً مع فريق المشروع.",
          "correct": true
        },
        {
          "text": "التواصل مع أصحاب المصلحة بانتظام لتجنب التغييرات المتكررة.",
          "correct": false
        },
        {
          "text": "تقديم التوجيه الفردي لكل عضو من أعضاء الفريق على أساس ثابت.",
          "correct": false
        },
        {
          "text": "إنشاء قنوات وبروتوكولات اتصال واضحة ومتسقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف الطريق خلال مشروع مدته عام، يرسل أحد موردي الأجهزة إلى مدير المشروع إشعارًا بنية زيادة الأسعار بسبب تقلب أسعار الصرف. مدير المشروع غير متأكد من سلطته التفاوضية.\nما هي الوثيقة التي يجب على مدير المشروع الرجوع إليها؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل المخاطر",
          "correct": true
        },
        {
          "text": "خطة إدارة المشتريات",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "استراتيجية التواصل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تراجع أداء فريق المشروع خلال التكرارات الثلاثة الأخيرة. يشعر بعض أعضاء الفريق بخيبة أمل، ويثيرون مخاوفهم خلال الاجتماع الاستعراضي.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد نقاط الفشل المحتملة استناداً إلى إجراءات العمل التكرارية",
          "correct": true
        },
        {
          "text": "تحفيز الفريق على تقديم أداء أفضل.",
          "correct": false
        },
        {
          "text": "التركيز على العلاج، وليس فقط على تصحيح الأعراض.",
          "correct": false
        },
        {
          "text": "مقارنة أداء الفريق بفرق المشاريع الأخرى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدرك مدير المشروع الذي يعمل في بيئة رشيقة أن بعض أعضاء الفريق الجدد يواجهون صعوبة في فهم كيفية تحقيق أعضاء الفريق الأقدم نتائج معينة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ترتيب اجتماع مراجعة مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تأكد من تركيز أعضاء الفريق على مهامهم.",
          "correct": false
        },
        {
          "text": "تقييم الحاجة إلى نقل المعرفة.",
          "correct": false
        },
        {
          "text": "تشجيع وتيسير توجيه الأقران وتسهيله.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع داخلي لمكتب إدارة المشاريع في المنظمة (PMO). وكان المشروع في البداية تحت رعاية مدير مكتب إدارة المشاريع الذي تم استبداله منذ ذلك الحين ولا يرى المدير الجديد قيمة كبيرة في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم اجتماع انطلاق المشروع الثاني مع قائد مكتب إدارة المشاريع الجديد وفريق المشروع.",
          "correct": true
        },
        {
          "text": "استخدم البيانات السابقة للحصول على الرعاية من قائد مكتب إدارة المشاريع الجديد لأن المشروع كان فعالاً.",
          "correct": false
        },
        {
          "text": "استخدم الفوائد التي كان مدير المشروع يتتبعها طوال فترة المشروع لإثبات قيمة المشروع.",
          "correct": false
        },
        {
          "text": "استمر في المشروع كما هو مخطط له لأنه تمت الموافقة عليه بالفعل وهو قيد التنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيتم تحديد تشييد المبنى بشكل جيد من خلال المخططات والمواصفات المكتوبة. سيتم تسليم الخدمة في غضون عامين في بيئة عالية التضخم. ما نوع العقد الذي ينبغي أن يستخدمه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد التكلفة زائد الرسوم التحفيزية (CPIF)",
          "correct": true
        },
        {
          "text": "عقد السعر الثابت الثابت الثابت (FFP)",
          "correct": false
        },
        {
          "text": "عقد السعر الثابت مع تعديل السعر الاقتصادي (FPEPA)",
          "correct": false
        },
        {
          "text": "عقد الوقت والمواد (T&M)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وضع مدير المشروع خطة لإدارة المشروع استنادًا إلى منهجيات رشيقة في محاولة لتسليم المنتج بسرعة. ومع ذلك، فإن المشروع معقد والمتطلبات غير واضحة، مما يعرض الجدول الزمني للخطر.\nما الذي يجب أن يفعله مدير المشروع لإعادة المشروع إلى مساره الصحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة جدولة الجدول الزمني لقبول التوقعات الإضافية والتأخيرات المحتملة.",
          "correct": true
        },
        {
          "text": "قم بمراجعة الأعمال المتراكمة للمنتج مع مالك المنتج والفريق لحل الحالة.",
          "correct": false
        },
        {
          "text": "زيادة عدد الاجتماعات التحضيرية وتنفيذ تحديثات الحالة اليومية.",
          "correct": false
        },
        {
          "text": "تعديل الخطة لتوظيف المزيد من ميزات دورة الحياة التكرارية والتدريجية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعًا لتنفيذ نظام برمجيات لتحسين العمليات تم تطويره داخليًا. غير أن نسبة اعتماده في المنظمة كانت أقل من 50 في المائة بسبب عدم التوافق مع العمليات الأساسية.\nأي من الإجراءات الثلاثة التالية كان ينبغي على مدير المشروع القيام بها لتحقيق فوائد المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تقييم كامل للاحتياجات في مرحلة التصميم.",
          "correct": true
        },
        {
          "text": "إطلاق البرنامج التجريبي في إحدى وحدات الأعمال الأساسية وجمع الملاحظات.",
          "correct": false
        },
        {
          "text": "ضمان مشاركة أصحاب المصلحة على نطاق أوسع لكسب المزيد من التأييد.",
          "correct": false
        },
        {
          "text": "إصدار تعليمات لفريق التسويق بجمع الملاحظات من العملاء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء أحد اجتماعات الاستعداد، اعترض بعض أعضاء الفريق بشدة على كيفية توزيع المهام، فقد شعروا بالتعب والإحباط لأن توزيع المهام كان شكوى متكررة طوال المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "راجع خطة إدارة المشروع لتحديد كيفية إدارة هذا الوضع.",
          "correct": true
        },
        {
          "text": "ناقش مع مديري المشاريع الآخرين إذا كان عليهم معالجة شكاوى مماثلة.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل لبناء الفريق لتحسين التعاون والتواصل.",
          "correct": false
        },
        {
          "text": "العمل مع الفريق لوضع خطة لمعالجة مخاوف توزيع المهام.",
          "correct": false
        }
      ]
    }
  ]
}
