{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال مشروع مختلط، يقوم مدير المشروع بمراجعة أداء فريق المشروع ويدرك أن سرعة الفريق ليست سريعة بما يكفي لتحقيق هدف بوابة المراجعة التالية. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد أولويات محتويات القصص المتراكمة وقم بإزالة بعض القصص.",
          "correct": true
        },
        {
          "text": "قم بزيادة مدة السباق السريع لإتاحة المزيد من الوقت للفريق.",
          "correct": false
        },
        {
          "text": "استخدم اجتماع الاستعداد لتقييم العوائق والمشاكل.",
          "correct": false
        },
        {
          "text": "إنشاء طلب تغيير لتعديل أهداف بوابة المراجعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيعمل فريق على مشروع جديد ويرفض الراعي الموافقة على زيادة الميزانية اللازمة للتكرار الحالي. ما الذي ينبغي أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم طلب تغيير للحصول على موافقة رسمية على زيادة الميزانية.",
          "correct": true
        },
        {
          "text": "العمل مع أصحاب المصلحة لتطوير مناهج مرنة لوضع الميزانية.",
          "correct": false
        },
        {
          "text": "اشرح للجهة الراعية مخاطر عدم الحصول على الموافقة على الميزانية.",
          "correct": false
        },
        {
          "text": "أنفق المال الإضافي وخطط للتعويض في السباق القادم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة اختبار المشروع، يجد أحد أعضاء الفريق أن بعض المتطلبات لم يتم الوفاء بها. إذا قام المشروع الآن بإضافة عمل للوفاء بالمتطلبات، فقد يتسبب ذلك في تجاوز كبير للوقت والتكلفة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا.",
          "correct": true
        },
        {
          "text": "إجراء تحليل الأثر.",
          "correct": false
        },
        {
          "text": "الدعوة إلى اجتماع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كان من المقرر الانتهاء من مشروع بناء خط أنابيب الغاز في غضون 36 شهرًا. وبعد 24 شهراً، علّقت السلطات الحكومية المحلية المشروع بعد 24 شهراً، بحجة خرق إجراءات التأثير الاجتماعي.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع خطة طوارئ في حالة التعليق من قبل الحكومة المحلية.",
          "correct": true
        },
        {
          "text": "مراجعة اللوائح والإجراءات المحلية والتخطيط لها وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "طلب موارد إضافية لتسريع البناء بعد التعليق.",
          "correct": false
        },
        {
          "text": "إنشاء قناة اتصال منتظمة مع الحكومة المحلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه افتتاح مكتب جديد في الخارج تأخيراً محتملاً لأن التصريح المطلوب لم يصدر بعد من الحكومة المحلية. اجتمع فريق المشروع لتقييم مسار العمل المناسب على النحو المبين في سجل المخاطر. وبعد إجراء تقييم شامل، قرر الفريق تأجيل الافتتاح إلى موعد آخر.\nما هي الوثيقة التي يجب أن يستخدمها مدير المشروع لتحديث خطة إدارة المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة المخاطر",
          "correct": true
        },
        {
          "text": "تقرير المخاطر",
          "correct": false
        },
        {
          "text": "سجل المخاطر",
          "correct": false
        },
        {
          "text": "سجل الدروس المستفادة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع متعدد السنوات قيد التنفيذ عندما يعلن أحد الموارد الرئيسية عن تقاعده. ويشعر مدير المشروع بالقلق بشأن تأثير ذلك على المشروع وقد حدد أن العديد من المهام الحرجة ستتأثر\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مطالبة باقي أعضاء الفريق بالعمل لساعات إضافية للمهام المتأثرة.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة بأن مهام المورد لن تكون في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "التعاون مع مدير الموارد لتحديد البديل المناسب وتدريبه.",
          "correct": false
        },
        {
          "text": "شجع عضو الفريق المتقاعد على تأجيل التقاعد لتجنب تعطيل المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق رشيق بتسليم الميزات باستمرار في الوقت المحدد، ولكنه اكتشف مؤخرًا فجوة كبيرة في البنية أدت إلى إعادة العمل.\nما هي الممارسة الرشيقة التي يجب أن يستخدمها مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخطيط الزيادة",
          "correct": true
        },
        {
          "text": "فريق العمل بأثر رجعي",
          "correct": false
        },
        {
          "text": "العرض التوضيحي لأصحاب المصلحة",
          "correct": false
        },
        {
          "text": "الوقوف اليومي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "دُعي أحد كبار أصحاب المصلحة إلى اجتماع مراجعة سريع وطلب من أحد أعضاء فريق المشروع وصف المنتج النهائي الذي سيقدمه المشروع. لم يتمكن عضو الفريق من الإجابة وأرجأ السؤال إلى عضو أرفع منه في الفريق.\nما الذي كان ينبغي فعله بشكل مختلف في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب أن يكون عضو الفريق قد نصح صاحب المصلحة بسؤال مسؤول سكروم.",
          "correct": true
        },
        {
          "text": "كان يجب على عضو الفريق أن ينصح صاحب المصلحة بسؤال مالك المنتج.",
          "correct": false
        },
        {
          "text": "كان ينبغي أن يحتفظ أصحاب المصلحة بأسئلتهم حتى اجتماع المراجعة السريع التالي.",
          "correct": false
        },
        {
          "text": "كان ينبغي على أصحاب المصلحة توجيه أسئلتهم إلى مدير المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتعمل إحدى الشركات على مشروع مختلط تعاني فيه النواتج من مشاكل في الجودة في نهاية أحد سباقات السرعة. ما الإجراء الذي ينبغي لمدير المشروع اتخاذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة تعريف المنجز (DoD).",
          "correct": true
        },
        {
          "text": "ابحث عن مجموعة واضحة من اتفاقيات العمل.",
          "correct": false
        },
        {
          "text": "تطبيق تخطيط تدفق القيمة.",
          "correct": false
        },
        {
          "text": "استخدم نهجاً قائماً على الخطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تكليف مدير مشروع بمشروع معقد بمتطلبات قانونية وتنظيمية وتعاقدية كبيرة. غير أن هذه المتطلبات لم يتم تحديدها أو وضع اللمسات الأخيرة عليها بعد وهناك مخاوف من التأخير في استكمال هذه المتطلبات.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ركز على نواتج المشروع بدلاً من ذلك لأن مدير المشروع ليس مسؤولاً عن تلبية هذه المتطلبات.",
          "correct": true
        },
        {
          "text": "اتصل بمالك المنتج وسلط الضوء على مخاطر المشروع المتعلقة بالتأخير في تلبية هذه المتطلبات في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "اجتمع مع مالك المنتج والقسم القانوني لمراجعة حالة المشروع والتقدم المحرز في تحديد هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "تأخير وضع اللمسات الأخيرة على المتطلبات القانونية والتنظيمية والتعاقدية حتى نهاية المشروع، وقبل تاريخ بدء التشغيل .",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع لشركة ناشئة ناجحة. وقد أظهرت الشركة الناشئة نمواً هائلاً مع فوائد متعددة لأعضاء الفريق، بما في ذلك ساعات العمل المرنة وسياسة العمل من المنزل. خلال آخر عملية إعادة نظر، أشار أحد أعضاء الفريق إلى أن سرعة الفريق تحسنت عندما كان الفريق مجتمعاً في غرفة المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "جمع الملاحظات وتحليل تأثير الموقع الفعلي على سرعة الفريق.",
          "correct": true
        },
        {
          "text": "تنقيح الأعمال المتراكمة لتحسين سرعة الفريق والحفاظ على السياسات الحالية.",
          "correct": false
        },
        {
          "text": "شارك الفكرة مع الإدارة العليا واقترح تحديث سياسات الشركة.",
          "correct": false
        },
        {
          "text": "قم بتحديث خطة إدارة الموارد وميثاق الفريق لتعزيز التواجد المشترك.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقدر أن يكون للمشروع ما مجموعه 250 نقطة قصة. وخطط الفريق لـ 40 نقطة قصة لكل تكرار وتم تسليم 40 و0 و20 و20 و5 نقاط قصة في التكرارات الأربعة الأولى.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تعيين المهام غير المنجزة إلى أعضاء الفريق خلال التكرار التالي.",
          "correct": true
        },
        {
          "text": "العمل مع أعضاء الفريق لتعديل نقاط القصة المخططة للتكرارات التالية.",
          "correct": false
        },
        {
          "text": "قم بإزالة الميزات التي لا يمكن تسليمها من المنتج المتراكم وتحديث العميل.",
          "correct": false
        },
        {
          "text": "التفاوض مع العميل لتمديد مواعيد التسليم بسبب مواعيد العطلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يطلب العميل استبدال قطعة من الأجهزة المخطط لها بقطعة أخرى ذات ميزات أكثر وسعر أقل.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتقييم الميزات الجديدة للتأكد من توافقها مع احتياجات أعمال العميل.",
          "correct": true
        },
        {
          "text": "قم بدمج الأجهزة على الفور لأنها ستقلل من التكلفة الإجمالية للمشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق للتخطيط لتنفيذ الأجهزة الجديدة حسب الطلب",
          "correct": false
        },
        {
          "text": "اطلب الموافقة من مدير المشتريات وقم بتطوير نموذج أولي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدعو مدير المشروع إلى اجتماع لتحديد مخاطر مشروع معقد. يُدعى العديد من الخبراء المتخصصين إلى هذا الاجتماع إلى جانب فريق المشروع.\nلماذا قام مدير المشروع بدعوة الخبراء المختصين؟",
      "explanation": "",
      "choices": [
        {
          "text": "يتمتع خبراء الموضوع بخبرة متخصصة ويمكنهم المساعدة في تحديد المشكلات عالية المخاطر ومعالجتها.",
          "correct": true
        },
        {
          "text": "إن تحديد المخاطر في اجتماع مع خبراء في الموضوع يجعل الحصول على موارد أفضل للمشروع أسهل.",
          "correct": false
        },
        {
          "text": "سيكون من الأسهل قبول المخاطر إذا كان خبراء الموضوع الذين حضروا الاجتماع يعملون معاً.",
          "correct": false
        },
        {
          "text": "يمكن لمدير المشروع الاستفادة من موارد الخبراء المتخصصين لمتابعة المخاطر التي تم تحديدها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيقوم مدير المشروع بإدارة عدة مشاريع مترابطة. وتعتمد بعض هذه المشاريع على نواتج محددة من مشاريع أخرى. لتجنب الاختناقات وتسهيل نجاح المشروع، يجب على مدير المشروع تقييم خطط المشاريع المدمجة لمعرفة التبعيات.\nما هو الإجراء الأنسب لمدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد جميع التبعيات بين المشاريع وتوثيقها.",
          "correct": true
        },
        {
          "text": "ضبط الجداول الزمنية للمشروع لإزالة التبعيات.",
          "correct": false
        },
        {
          "text": "القضاء على جميع التبعيات المحتملة بين المشاريع.",
          "correct": false
        },
        {
          "text": "التأكد من أن جميع المشاريع يمكن أن تمضي قدماً بشكل مستقل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكون المشروع في مرحلة التخطيط ويتطلب وقتاً وجهداً كبيرين لجمع البيانات وتحليلها. ويطلب راعي المشروع من مدير المشروع أن يتخطى المناقشة الجماعية المركزة وجلسات العصف الذهني المخطط لها في محاولة لتسريع العملية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ اللجنة التوجيهية للمشروع بالمشكلة.",
          "correct": true
        },
        {
          "text": "الإقرار بطلب راعي المشروع وتخطي الجلسات.",
          "correct": false
        },
        {
          "text": "أخبر راعي المشروع أن تخطي الجلسات سيعرض المشروع للخطر.",
          "correct": false
        },
        {
          "text": "اجتمع مع راعي المشروع لفهم أسباب ضيق الوقت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع متوسط الحجم يهدف إلى تطوير منتج مبتكر بمتطلبات متغيرة. لا يتوفر العديد من أعضاء الفريق لمدة أسبوعين في الشهر خلال مدة المشروع. يدرك مدير المشروع أن تكلفة الجودة تزداد بشكل كبير خلال تلك الفترات. ومع ذلك، فإن سرعة الفريق مستقرة.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة موارد إلى الفريق.",
          "correct": true
        },
        {
          "text": "توسيع نطاق جهود الاختبار.",
          "correct": false
        },
        {
          "text": "توفير التدريب المتبادل.",
          "correct": false
        },
        {
          "text": "زيادة مدة العدو السريع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشارك مدير المشروع في مشروع تتطور متطلباته باستمرار.\nما الذي يجب أن يفعله مدير المشروع لتحقيق النجاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تحديثات منتظمة وطلب الموافقات المستندة إلى النواتج القابلة للتسليم من مالك المنتج.",
          "correct": true
        },
        {
          "text": "اعمل مع الفريق لضمان سيرهم على المسار الصحيح والتسليم في الموعد المحدد.",
          "correct": false
        },
        {
          "text": "الحفاظ على جو عمل مريح لتحسين تماسك الفريق.",
          "correct": false
        },
        {
          "text": "ضمان تقديم الوثائق والعمليات بشكل مناسب وتحديثها لمالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع رشيق مع فريق متعدد الوظائف. يتم إبلاغ مدير المشروع بأن بعض أعضاء الفريق عادةً ما يثيرون متطلبات إضافية ليست ضمن النطاق المعتمد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا السلوك المتوقع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تدريب الفريق على إدارة النطاق باستخدام إطار العمل المناسب.",
          "correct": true
        },
        {
          "text": "رفع الأمر إلى الجهة الراعية وطلب استبدال أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "قم بإجراء اجتماعات الاستعداد اليومية مع الفريق وأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "اشرح أنه لا يمكن تغيير المتطلبات بدون موافقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مديرا مشروعين على توفير الموارد لمشروعيهما. حدد كلا مديري المشروعين نفس الخبير المتخصص (SME) باعتباره مفيدًا لمشروعهما. ويستخدم المشروع (أ) نهجًا تنبؤيًا، بينما يستخدم المشروع (ب) نهجًا مرنًا.\nما المشروع الذي ينبغي تخصيصه للمشروع الصغير والمتوسط الحجم؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب تعيين الشركة الصغيرة والمتوسطة في المشروع (أ) لأن تخطيط المشروع استند إلى دعم الشركة الصغيرة والمتوسطة.",
          "correct": true
        },
        {
          "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النجاح في مشروع رشيق يتحدد بالتميز التقني.",
          "correct": false
        },
        {
          "text": "يجب تعيين مدير مشروع صغير ومتوسط الحجم للمشروع مع مدير المشروع الأقل خبرة لتحسين احتمالية النجاح.",
          "correct": false
        },
        {
          "text": "يجب أن يتم تعيين المدير التنفيذي للمشروع (ب) لأن النهج المرن يعطي الأولوية للمرونة والقدرة على التكيف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيدرك مدير المشروع أن الفريق يحتاج إلى تدريب على تقنية معينة مطلوبة في المشروع. ما الذي ينبغي أن يفعله مدير المشروع للتخفيف من هذه المخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم معرفة الفريق بالتقنية والبحث عن خيارات التدريب الموصى بها.",
          "correct": true
        },
        {
          "text": "تعاقد مع مزود خبير للقيام بالعمل الذي يستخدم تلك التقنية المحددة.",
          "correct": false
        },
        {
          "text": "إنشاء عنصر في سجل المخاطر وإخطار الجهة الراعية.",
          "correct": false
        },
        {
          "text": "قم بإصلاح أي ثغرات في التدريب عند ظهورها أثناء المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nفي نهاية مشروع كبير، يدرك أصحاب المصلحة أن الفوائد المحققة ليست هي نفسها الفوائد المتوقعة. ما هو العنصر الذي يمكن أن يكون قد أدى إلى هذه المشكلة، إذا لم يتم تحديده بشكل جيد في بداية المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "وثائق المتطلبات",
          "correct": true
        },
        {
          "text": "نطاق المشروع",
          "correct": false
        },
        {
          "text": "حالة العمل",
          "correct": false
        },
        {
          "text": "مقاييس الفوائد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال اجتماع الاستعداد اليومي، يقوم أحد أعضاء الفريق بإبلاغ الفريق بأن قصة المستخدم التي كانت في البداية جزءًا من تخطيط السباق السريع أصبحت غير صالحة بسبب تغيير في السياسة تم الإعلان عنه مؤخرًا. ما الذي يجب أن يفعله مدير المشروع استجابةً لهذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إغلاق قصة المستخدم المتعلقة بتغيير السياسة وتوضيح أنها لم تعد ذات قيمة.",
          "correct": true
        },
        {
          "text": "قم بإزالة قصة المستخدم من سباق السرعة الحالي وجدولتها لسباق السرعة التالي.",
          "correct": false
        },
        {
          "text": "إخطار أصحاب المصلحة بأنه لا يمكن تعديل قصص المستخدمين التي تم الالتزام بها في سباق السرعة.",
          "correct": false
        },
        {
          "text": "قم بإزالة قصة المستخدم من العدو السريع واطلب من الفريق الإسراع في إكمال العدو السريع الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأت إحدى الشركات مشروعًا لبناء محطة جديدة للطاقة الكهرومائية. تم إجراء تحليل لتحديد متطلبات الامتثال التنظيمي والسلامة والأمن. بعد التحليل، كان من الواضح أن بعض العناصر اللازمة لتحقيق الامتثال قد تكون صعبة ومكلفة في التنفيذ. يشعر أصحاب المصلحة بالقلق إزاء التكلفة والتعقيد الإضافيين ولديهم آراء مختلفة حول أهمية الامتثال وآثاره المحتملة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة والتأكيد على أهمية الامتثال وتكاليف عدم الامتثال.",
          "correct": true
        },
        {
          "text": "راجع سجل أصحاب المصلحة وحدد أصحاب المصلحة الذين يتمتعون بأعلى سلطة وتأثير.",
          "correct": false
        },
        {
          "text": "رفع مخاوف الامتثال والتباين بين آراء أصحاب المصلحة إلى الجهة الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "تحديد متطلبات الامتثال التي يمكن استبعادها من أجل التوافق مع توقعات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق المشروع الذي يستخدم نهجًا مختلطًا بإنتاج نواتج تنبؤية وتدريجية في آن واحد. وتنص خطة إدارة الاتصالات على تفضيل الاتصالات المكتوبة على الأنواع الأخرى. وتنشأ المشاكل يوميا فيما يتعلق بالمهام الإضافية؛ ومع ذلك، فإن تراكم البريد الإلكتروني المتراكم يزداد تعقيدا بشكل متزايد وغير ضروري.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اعتماد المحادثات المباشرة وجهاً لوجه خلال سباقات السرعة.",
          "correct": true
        },
        {
          "text": "اعتماد الاتصالات القضائية خلال سباقات السرعة.",
          "correct": false
        },
        {
          "text": "اعتماد الاتصالات المعطلة أثناء سباقات السرعة.",
          "correct": false
        },
        {
          "text": "اعتماد المحادثات الرسمية خلال سباقات السرعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "هناك مشروع قيد التنفيذ مع أعضاء فريق من بلدين مختلفين وهناك شكاوى من كلا الجانبين. يعتقد أعضاء الفريق من البلد \"ألف\" أن أعضاء الفريق من البلد \"باء\" بطيئون جدًا في الاستجابة وغالبًا ما يكون لديهم أيام إجازة محددة. يؤمن أعضاء الفريق من البلد (ب) بالتوازن الجيد بين العمل والحياة ويعتقدون أن هناك حاجة إلى مزيد من التفكير قبل اتخاذ القرارات.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تقييم ميثاق الفريق مع أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "إعادة النظر في خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "تذكير أعضاء الفريق بمراعاة الاختلافات الثقافية.",
          "correct": false
        },
        {
          "text": "التحقيق في السبب الجذري لسوء الفهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء توقيع الموافقة على مشروع استراتيجي أدى إلى تكاليف إضافية، لم يتمكن مدير المشروع من تبرير النفقات الإضافية فيما يتعلق بقيمة الأعمال التي تحققت مع التنفيذ الناجح. ما الذي كان ينبغي أن يفعله مدير المشروع لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تقييم للفوائد المحتملة التي تم تحديدها في دراسة الجدوى الأولية باعتبارها كافية لتبرير تكاليف النفقات الإضافية.",
          "correct": true
        },
        {
          "text": "قياس وتتبع فوائد المشروع المحددة في دراسة الجدوى طوال دورة حياة المشروع.",
          "correct": false
        },
        {
          "text": "إجراء عملية إعادة تقييم للوضع الحالي للمنظمة بعد تنفيذ المشروع لإظهار الفوائد المحققة",
          "correct": false
        },
        {
          "text": "مشاركة المنافع غير المالية أو غير الملموسة مثل رضا العملاء والسمعة الطيبة كمؤشرات لإظهار القيمة المحققة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في نهاية المرحلة الأولى من مشروع توسعة الاستاد، يدرك مدير المشروع أنه سيتأخر عن الجدول الزمني للمرحلة التالية من المشروع. ويرجع التأخير إلى متطلبات السلامة الجديدة التي يجب الالتزام بها. يشعر أصحاب المصلحة بالإحباط لأنهم لم يكونوا على علم بالتغييرات المحتملة في متطلبات السلامة.\nما الذي كان يجب عليك فعله لتجنب هذا الموقف وضمان أن يكون أصحاب المصلحة على دراية بالاضطرابات المحتملة؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة احتياطي طوارئ المشروع لاستيعاب المشاكل غير المتوقعة المتعلقة بالسلامة.",
          "correct": true
        },
        {
          "text": "عقد اجتماعات تواصل منتظمة مع مشرف الموقع للبقاء على اطلاع دائم بمتطلبات السلامة.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية استباقية لتقييم المخاطر أثناء بدء المشروع لتحديد التأخيرات المحتملة المتعلقة بالسلامة.",
          "correct": false
        },
        {
          "text": "اطلب موارد وموظفين إضافيين لمعالجة مخاوف السلامة عند ظهورها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تنتقل الشركة \"أ\" من نهج تنبؤي إلى نهج رشيق. بعد الإصدار التدريجي الثاني من المشروع X، يعرب مالك المنتج عن خيبة أمله من نتائج النموذج الأولي ويريد تصعيد المشروع إلى الإدارة العليا ويطلب فريقاً جديداً. وبسبب ذلك، يبدأ أعضاء الفريق بإلقاء اللوم على بعضهم البعض وعلى النهج الرشيق الجديد بسبب تصور مالك المنتج للمشروع.\nكيف يجب على مدير المشروع حل خلافات الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اتبع عملية حل النزاعات الموثقة في ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "استخدم الجلسات الاسترجاعية للسماح للفريق بتحديد سبب النزاع.",
          "correct": false
        },
        {
          "text": "إعادة النظر في رؤية المشروع مع الفريق للتأكد من فهم هدف المشروع",
          "correct": false
        },
        {
          "text": "مراجعة تعريف الإنجاز (DoD) مع مالك المنتج وتحديد سبب الفجوة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متضاربة. وطلبت الإدارة العليا من مدير المشروع أن يتجنب \"الضوضاء\" في المشاريع السياسية على وجه التحديد.\nعلى الرغم من صعوبة العثور على الموارد اللازمة للمشروع، ما الذي يجب على مدير المشروع القيام به لضمان سير المشروع بسلاسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطبيق \"إذا فعلت شيئاً لطيفاً لي سأفعل لك شيئاً لطيفاً لك.\"",
          "correct": true
        },
        {
          "text": "كن متسقًا مع الأقوال والأفعال لتجنب النزاعات مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الاستفادة من المجاملات للحصول على الموارد، والتعاون من أجل تحقيق الأهداف المشتركة.",
          "correct": false
        },
        {
          "text": "تخصيص الموارد الشحيحة بكفاءة لتلبية احتياجات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يطلب أحد أصحاب المصلحة الذين لم يتم تحديدهم مسبقًا داخل مؤسسة العميل إجراء تغيير يمكن أن يؤثر على نطاق المشروع يكون تأثير صاحب المصلحة داخل مؤسسة العميل قويًا.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد موعدًا للاجتماع، وبناءً على النتائج، قم بتحديث خطة إدارة المشروع.",
          "correct": true
        },
        {
          "text": "إصدار طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تحديد أصحاب المصلحة الجدد وتحديث سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع جميع أصحاب المصلحة لمناقشة التغيير",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيقترح أحد أعضاء الفريق استخدام منتج جديد لتسريع تطوير الميزات، ولكن هذا سيزيد من ميزانية المشروع. يتبع فريق المشروع نهجًا تدريجيًا لتطوير المنتج، ويكون مالك المنتج مسؤولاً عن تحديد الأولويات وإدارة الأعمال المتراكمة للمنتج. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "استشر مالك المنتج واستعرض مزايا وعيوب استخدام المنتج الجديد.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة التكاليف وتحديثها لاستيعاب الأثر المحتمل على الميزانية.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي لتنفيذ المنتج الجديد من الجهة الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "قم بمراجعة معايير القبول لقصص المستخدمين لدمج المنتج الجديد بفعالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ المشروع، يثير العديد من أصحاب المصلحة مخاوف بشأن أداء الفريق والتسليم. ويعتقد مدير المشروع أن المشروع يسير وفق النطاق والميزانية والجدول الزمني المعتمدين.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "راسل أصحاب المصلحة عبر البريد الإلكتروني لطمأنتهم بشأن الإجراءات المتخذة.",
          "correct": true
        },
        {
          "text": "استشر خطة إدارة الاتصالات لإدارة توقعات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "اطلب من راعي المشروع التدخل",
          "correct": false
        },
        {
          "text": "اطلب من أصحاب المصلحة تصعيد مخاوفهم إلى الرئيس التنفيذي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nطلب مدير المشروع من كل عضو من أعضاء الفريق المتورطين في النزاع تقديم تضحية لحل الموقف. هذا النهج يتوافق مع أي أسلوب من أساليب حل النزاعات؟",
      "explanation": "",
      "choices": [
        {
          "text": "التسوية/إعادة التسوية",
          "correct": true
        },
        {
          "text": "التعاون/حل المشكلات",
          "correct": false
        },
        {
          "text": "سلس/ملائم",
          "correct": false
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب موعد التسليم الرئيسي لمشروع ما بسرعة، ولكن هناك عنصر من المقرر إنجازه في خطر. يبدأ أحد أعضاء الفريق في التصرف بشكل دفاعي ويلقي باللوم على الآخرين في هذه المشكلة\nكيف كان ينبغي لمدير المشروع أن يتصرف لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع قواعد أساسية للتفاعل يجب على الفريق بأكمله اتباعها.",
          "correct": true
        },
        {
          "text": "إنشاء علاقات هادفة بين أعضاء الفريق والحفاظ عليها.",
          "correct": false
        },
        {
          "text": "الأنماط الرسمية الراسخة للسلطة والمسؤولية والمساءلة.",
          "correct": false
        },
        {
          "text": "وضع مبادئ واضحة للتفويض وتقاسم المسؤولية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتلقى مشروع نظام حسابات مستحقة القبض الذي تم إطلاقه مؤخرًا في مرحلة الإنتاج غرامة من هيئة تنظيمية لأن النظام لم يتوافق مع اللوائح المحلية. ما الذي كان ينبغي أن يفعله مدير المشروع لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة التحكم في المخاطر المحددة.",
          "correct": true
        },
        {
          "text": "تحديد عملية التحكم في الجودة.",
          "correct": false
        },
        {
          "text": "تنفيذ سجل التحكم في المشكلات.",
          "correct": false
        },
        {
          "text": "إشراك قسم مراجعة الحسابات في تخطيط المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ فريق الجودة أثناء الفحص النهائي لأحد النواتج القابلة للتسليم أن هناك انحرافًا في مكون معين. ومع ذلك، لم يشر العميل إلى أي شيء فيما يتعلق بذلك في مواصفاته.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ارفع الأمر إلى خبير تقني.",
          "correct": true
        },
        {
          "text": "إجراء تدقيق ضمان الجودة.",
          "correct": false
        },
        {
          "text": "الموافقة على ما تم تسليمه لأنه لا يحيد عن أي مواصفات للعميل.",
          "correct": false
        },
        {
          "text": "رفض ما تم تسليمه، بحجة الانحراف عن مواصفات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصدرت الجهة التنظيمية الحكومية المحلية إشعارًا لجميع الشركات بشأن مشروع جديد يهدف إلى تيسير تقديم تقارير المعلومات إلى جهة تنظيمية دولية. ومع ذلك، ونظراً للطبيعة الديناميكية للمشروع، هناك إمكانية لتغيير المتطلبات بينما يظل تاريخ التسليم ثابتاً ويشعر مدير المشروع المكلف بهذه المبادرة بالقلق إزاء عدم اليقين والجدول الزمني القصير للتسليم.\nكيف ينبغي لمدير المشروع الاستعداد بشكل أفضل لمعالجة هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ نهج تكراري وتدريجي في المجالات ذات الصلة بالمشروع للتكيف مع المتطلبات المتغيرة.",
          "correct": true
        },
        {
          "text": "الاجتماع مع الجهة الراعية لتحديد جدول زمني مفصل للمشروع لضمان اكتمال المشروع في الوقت المحدد",
          "correct": false
        },
        {
          "text": "وضع خطة طوارئ مفصلة باستخدام تقنية التعجيل بأنشطة المشروع حسب الحاجة",
          "correct": false
        },
        {
          "text": "تعزيز استراتيجيات التواصل والمشاركة مع الحكومة المحلية لضمان المواءمة والتحديثات في الوقت المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nما الذي يجب أن يفعله مدير المشروع للحصول على موافقة أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة الموارد",
          "correct": true
        },
        {
          "text": "إدارة مشاركة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "مراقبة ومراقبة أعمال المشروع",
          "correct": false
        },
        {
          "text": "جدولة اجتماع بين الراعي وأصحاب المصلحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت إحدى المنظمات التي كانت تستخدم في السابق مناهج تنبؤية في السابق اعتماد نهج إطار العمل الرشيق المتدرج (SAFe® ). وكان هناك مشروع مهم بالنسبة للمؤسسة في منتصف مرحلة التنفيذ وقت اتخاذ هذا القرار.\nما النهج الذي يجب أن يستخدمه مدير المشروع لمواصلة تنفيذ المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "سكروم",
          "correct": true
        },
        {
          "text": "كانبان",
          "correct": false
        },
        {
          "text": "تنبؤي",
          "correct": false
        },
        {
          "text": "سكروم واسع النطاق (LeSS)",
          "correct": false
        }
      ]
    }
  ]
}
