{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "سؤال\nيكمل فريق المشروع تحديد متطلبات المشروع والمنتج. أي مما يلي تم استخدامه لإنجاز ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "المقارنة المعيارية ومخطط الشبكة وتحليل الاتجاهات",
          "correct": true
        },
        {
          "text": "هيكل تقسيم العمل (WBS)، وتحليل الاتجاهات، والمراقبة/المحادثات",
          "correct": false
        },
        {
          "text": "العصف الذهني ومخططات التقارب ورسم الخرائط الذهنية",
          "correct": false
        },
        {
          "text": "مخططات التقارب والمقارنة المعيارية والملاحظة/المحادثة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب أحد العملاء إجراء تغيير في وظيفة المنتج الذي سيتم تسليمه في سباق السرعة التالي. كما تم تعيين الأخصائي المسؤول عن هذا التغيير في مشروع آخر قابل للتسليم في مشروع آخر. يحتاج مدير المشروع إلى التفاوض مع مدير المشروع حول مدى توفر الأخصائي.\nمن المسؤول عن التأكد من توفر الأخصائي؟",
      "explanation": "",
      "choices": [
        {
          "text": "راعي المشروع",
          "correct": true
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيلاحظ مدير المشروع أن المشروع لا يسير على ما يرام وأن المنجزات تتراجع، ما هي الخطوة الأولى التي يجب على مدير المشروع اتخاذها لاتخاذ قرار بشأن كيفية التقدم في المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد المشكلة.",
          "correct": true
        },
        {
          "text": "تبادل الأفكار والحلول.",
          "correct": false
        },
        {
          "text": "وضع معيار للقياس",
          "correct": false
        },
        {
          "text": "حدد هدفاً.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الانتهاء من مشروع تحول واسع النطاق ومتعدد السنوات وفقًا للمتطلبات المحددة وفي حدود الميزانية والجدول الزمني المعتمدين كما تم التحقق من صحة المتطلبات وتأكيدها من قبل الشركة. ومع ذلك، كشف تحليل ما بعد التسليم للمشروع أن المشروع لم يحقق الفوائد المتوقعة منه.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من تسجيل المتطلبات بشكل صحيح في الأعمال المتراكمة للمنتج.",
          "correct": true
        },
        {
          "text": "وضع استراتيجية عمل للمساعدة في إدارة التغيير التنظيمي.",
          "correct": false
        },
        {
          "text": "تحسين عمليات إعداد تقارير الحالة لتسليط الضوء على نتائج محددة للمشروع.",
          "correct": false
        },
        {
          "text": "قياس قيمة الأعمال وإثباتها طوال دورة حياة المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نظرًا لوجود مشكلة في الميزانية، قرر فريق المشروع استخدام معدات منخفضة التكلفة مع عدم يقين أعلى في الاختبار لتقليل التكلفة. ومع ذلك، فإن نتائج الاختبار غير مستقرة وتؤدي إلى تباينات. أحد أعضاء الفريق على دراية بالموقف ويقترح استخدام معدات عالية الدقة مع درجة عدم يقين أقل في الاختبار لزيادة جودة الاختبار.\nكيف ينبغي أن يستجيب مدير المشروع لهذا الاقتراح؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفض المقترح بسبب قيود الميزانية واتباع خطة إدارة الجودة.",
          "correct": true
        },
        {
          "text": "اقبل الاقتراح لأن المعدات عالية الدقة تنتج نتائج اختبار دقيقة مع انخفاض عدم اليقين في الاختبار.",
          "correct": false
        },
        {
          "text": "قم بتقييم الاقتراح لتحديد ما إذا كانت المعدات عالية الدقة تنتج نتائج اختبار دقيقة مع انخفاض عدم اليقين في الاختبار.",
          "correct": false
        },
        {
          "text": "اقبل المقترح لأن الميزانية ليست مشكلة عند أخذ ضمان الجودة في الاعتبار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nما هو النهج الذي يجب أن يستخدمه مدير المشروع لتشجيع التعاون بين المطورين في نموذج التطوير الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختبار القبول",
          "correct": true
        },
        {
          "text": "التنمية المدفوعة بالسلوك",
          "correct": false
        },
        {
          "text": "تطوير التطبيقات المشتركة",
          "correct": false
        },
        {
          "text": "تطوير سريع للتطبيقات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نظرًا للتغييرات التنظيمية، تم استبدال أحد أصحاب المصلحة الرئيسيين بموظف جديدبسبب التغييرات التنظيمية، لن يُعقد الاجتماع القادم لمراجعة الحالة لتحديث التقدم المحرز في المشروع حتى الشهر المقبل.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد موعدًا لاجتماع منفصل مع أصحاب المصلحة الجدد لإطلاعهم على حالة المشروع.",
          "correct": true
        },
        {
          "text": "إعداد تقرير حالة المشروع وإرساله إلى صاحب المصلحة الجديد لمراجعته.",
          "correct": false
        },
        {
          "text": "اطلب المشورة من راعي المشروع حول كيفية الحصول على الدعم من صاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "انتظر نافذة الاتصال التالية لمشاركة المعلومات مع صاحب المصلحة الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بقيادة مشروع يستلزم الانتقال إلى نظام أجايل سيقوم المشروع بتجربة نموذج التسليم الرشيق على غرار استخدام أربعة موارد من أحد البائعين، ويعمل إلى جانب اثنين من الموارد الداخلية التي لا تتمتع بخبرة في مجال أجايل يحتاج مدير المشروع إلى العمل كمدرب لفريق المشروع ومساعدتهم على فهم الاختلافات بين عمل فريق المشروع التقليدي وفريق أجايل.\nما هو أهم شيء يجب على مدير المشروع القيام به لتأسيس سلوك الفريق الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز على النتيجة التي أنتجها الفريق.",
          "correct": true
        },
        {
          "text": "بناء الثقة داخل الفريق.",
          "correct": false
        },
        {
          "text": "تشجيع التعاون بين الفريق.",
          "correct": false
        },
        {
          "text": "محاسبة كل عضو من أعضاء الفريق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nعند الانتهاء من المشروع، لا يمكن تحقيق اتفاق العميل من خلال المفاوضات. ماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ أعضاء فريق المشروع.",
          "correct": true
        },
        {
          "text": "بدء التقاضي منذ اكتمال جميع الأعمال",
          "correct": false
        },
        {
          "text": "بدء مرحلة الإغلاق",
          "correct": false
        },
        {
          "text": "استكشف التحكيم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nما العبارة التي تميّز بشكل صحيح بين الإدارة والقيادة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يسأل المديرون كيف ومتى؛ بينما يسأل القادة ماذا ولماذا.",
          "correct": true
        },
        {
          "text": "يركز المديرون على الأهداف طويلة المدى؛ بينما يركز القادة على الأهداف قصيرة المدى.",
          "correct": false
        },
        {
          "text": "يتحدى المديرون الوضع الراهن، بينما يقبل القادة الوضع الراهن.",
          "correct": false
        },
        {
          "text": "يُلهم المديرون الثقة؛ بينما يعتمد القادة على السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخضع أحد المشاريع للتدقيق في كمية استخدامه للمياه. يقوم فرع تراخيص المياه التابع للحكومة بتغيير سياسته ليكون أكثر تقييداً.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مواءمة موارد المشروع لمعارضة مع معيار ترخيص المياه الجديد",
          "correct": true
        },
        {
          "text": "إلغاء المشروع بسبب حالة عدم اليقين التي ظهرت مع تغيير السياسة.",
          "correct": false
        },
        {
          "text": "تقييم أثر تغيير السياسة على نطاق المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء جدول زمني جديد للمشروع بناءً على التغييرات المحتملة في سياسة المياه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في برنامج مدته خمس سنوات، انضم العديد من أعضاء فريق المشروع وغادروا المشاريع الفرعية. ولهذا السبب، غالباً ما يحدث تضارب بين أعضاء الفريق.\nما الأسلوب الذي يجب أن يستخدمه مدير المشروع لحل النزاعات على المدى الطويل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجبار",
          "correct": true
        },
        {
          "text": "التنعيم",
          "correct": false
        },
        {
          "text": "التسوية",
          "correct": false
        },
        {
          "text": "حل المشكلات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في برنامج مدته خمس سنوات، انضم العديد من أعضاء فريق المشروع وغادروا المشاريع الفرعية. ولهذا السبب، غالباً ما يحدث تضارب بين أعضاء الفريق.\nما الأسلوب الذي يجب أن يستخدمه مدير المشروع لحل النزاعات على المدى الطويل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجبار",
          "correct": true
        },
        {
          "text": "التنعيم",
          "correct": false
        },
        {
          "text": "التسوية",
          "correct": false
        },
        {
          "text": "حل المشكلات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل الفريقان (أ) و(ب) على مشروعين رشيقين مختلفين لنفس العميل. يستخدمان نفس الطريقة لحساب وحدات العمل، وتستغرق كل عملية تكرار أسبوعين. في التكرارين الأولين، أكمل الفريق \"أ\" 50 وحدة عمل وأكمل الفريق \"ب\" 200 وحدة عمل. يتم إكمال مهام كلا الفريقين كما هو مخطط لهأبلغ العميل عن 5 أخطاء لكل وحدة عمل للفريق أ و 0 أخطاء لكل وحدة عمل للفريق ب\nما الاستنتاج الذي يجب أن يخلص إليه مدير المشروع فيما يتعلق بالفرق وأدائها؟",
      "explanation": "",
      "choices": [
        {
          "text": "يحقق الفريق (ب) أداءً أفضل من الفريق (أ) حيث أكمل وحدات عمل أكثر في نفس المدة.",
          "correct": true
        },
        {
          "text": "أكمل الفريقان (أ) و(ب) مهامهما كما هو مخطط لها؛ وبالتالي فإن أداءهما متساوٍ.",
          "correct": false
        },
        {
          "text": "أداء الفريق \"أ\" أفضل من أداء الفريق \"ب\" بسبب وجود أخطاء أقل لكل وحدة عمل.",
          "correct": false
        },
        {
          "text": "أكملت الفرق تجربتين فقط؛ لذلك من السابق لأوانه تقييم أدائها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال أحد اجتماعات الملاحظات، يتم إبلاغ مدير المشروع من قبل أعضاء الفريق أن التحقق من صحة النواتج أمر صعب بسبب حقيقة أن المتطلبات التقنية تتغير باستمرار قبل المواعيد المحددة لتسليمها مما يتسبب في إعادة العمل. يقترح مدير المشروع اعتماد منهجية أكثر ملاءمة لإدارة المشروع لمعالجة هذا الأمر في المشاريع القادمة.\nما هي منهجية إدارة المشروع التي تناسب هذا الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "المرونة",
          "correct": true
        },
        {
          "text": "تنبؤي",
          "correct": false
        },
        {
          "text": "الشلال",
          "correct": false
        },
        {
          "text": "تزايدي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تتداخل مرحلة تنفيذ المشروع مع عطلة في البلد الذي يوجد فيه مقر غالبية أعضاء الفريق تعتبر هذه المرحلة حرجة، ويطلب من جميع أعضاء الفريق العمل خلال العطلة. وهذا يؤثر سلباً على معنويات الفريق.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب المساعدة من الفرق الأخرى الموجودة في بلدان أخرى",
          "correct": true
        },
        {
          "text": "أنشطة المشروع المؤجلة",
          "correct": false
        },
        {
          "text": "إعداد خطة مشاركة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة الموارد بشكل أفضل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يؤثر تنفيذ أحد متطلبات العمل لمشروع تكنولوجيا المعلومات على عدة تطبيقات. يلاحظ مالك التطبيق أنه لا يمكن بدء التغييرات على وظيفة في التطبيق X إلا عند الانتهاء من تطوير ميزة جديدة في التطبيق Y.\nهذا مثال على أي تبعية؟",
      "explanation": "",
      "choices": [
        {
          "text": "بدء التشغيل من البداية إلى النهاية (SS)",
          "correct": true
        },
        {
          "text": "الانتهاء من البداية إلى النهاية (FS)",
          "correct": false
        },
        {
          "text": "من البداية إلى النهاية (SF)",
          "correct": false
        },
        {
          "text": "من النهاية إلى النهاية (FF)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيتولى مدير مشروع إدارة مشروع تمت الموافقة عليه مؤخراً. ما الذي سيلعب دوراً رئيسياً في تحديد طريقة التواصل؟",
      "explanation": "",
      "choices": [
        {
          "text": "متطلبات أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "تواتر التوزيع",
          "correct": false
        },
        {
          "text": "نموذج المرسل-المستقبل",
          "correct": false
        },
        {
          "text": "أساليب إدارة الاجتماعات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nمدير مشروع يتعامل مع فرق عمل افتراضية حول العالم ما الذي يجب على مدير المشروع فعله للتغلب على الاختلافات بين الثقافات؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإنشاء قنوات تواصل مع أعضاء الفريق ودعوة أعضاء الفريق للمساهمة بحرية",
          "correct": true
        },
        {
          "text": "تعزيز الحدود الشخصية القوية والسيادة الفردية",
          "correct": false
        },
        {
          "text": "خلق بيئة يمكن فيها لأعضاء الفريق التواصل بصراحة وشفافية",
          "correct": false
        },
        {
          "text": "خلق فهم مشترك لأهداف الفريق وغاياته",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم المشروع بتطوير منتج حيث يكون وقت الوصول إلى السوق أمرًا بالغ الأهمية. خلال مرحلة التنفيذ، يقدم العميل طلب تغيير لإدراج أحدث التقنيات التي من شأنها تعزيز ميزات المنتج وتوفير ميزة تنافسية. سيؤثر التغيير على قيود المشروع، لكن الفوائد تفوق التكلفة والجهد المبذول.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اعتماد نهج التسليم التدريجي وإطلاق الميزات الأساسية للمنتج في السوق أولاً لمواجهة المنافسة.",
          "correct": true
        },
        {
          "text": "بدء مشروع منفصل لاعتماد التقنية الجديدة بشكل تدريجي لتعزيز ميزات المنتج مع نضوج التقنية.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية متكاملة للتحكم في التغيير ومراجعة قيود المشروع لإدارة النطاق المعزز بفعالية.",
          "correct": false
        },
        {
          "text": "إغلاق المشروع الحالي وبدء مشروع جديد بنهج التسليم التدريجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يبدأ مدير المشروع بملاحظة الأعضاء غير المنخرطين الذين يصلون متأخرين، ولا يقومون بالتسليم في الوقت المحدد، ولا يحضرون الاجتماعات، وينتجون تسليمات منخفضة الجودة.\nما الإجراء الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقيق في سبب سلوك أعضاء الفريق غير المنخرطين وتعزيز الروح المعنوية والمشاركة.",
          "correct": true
        },
        {
          "text": "اطلب من أعضاء الفريق تغيير طريقة عملهم لتتناسب مع أحدث اتجاهات العمل.",
          "correct": false
        },
        {
          "text": "شجّع الفريق على مضاعفة جهوده لتعويض أعضاء الفريق المنفصلين عن العمل.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق التخلي عن العملية التي تبطئ تقدمهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، تنشأ مشكلة تتطلب ميزانية إضافية ووقتًا إضافيًا لحل المشكلة. لم يحدد فريق المشروع هذه المشكلة كمخاطرة أثناء التخطيط لإدارة المخاطر. ويشير راعي المشروع إلى أن هذا الخطر قد حدث في مشاريع سابقة.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذا السهو؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المخاطر.",
          "correct": true
        },
        {
          "text": "الرغبة في المخاطرة المؤسسية المؤكدة.",
          "correct": false
        },
        {
          "text": "مراجعة سجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "احتياطيات الطوارئ الإضافية المخصصة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال التكرار الأخير للتخطيط في مشروع رشيق، يكتشف الفريق أن اللوائح الإلزامية لم يتم تضمينها في الحد الأدنى من المنتج القابل للتطبيق (MVP). ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق تضمين هذا المطلب التنظيمي في الأعمال المتراكمة للتكرار.",
          "correct": true
        },
        {
          "text": "اطلب من مالك المنتج مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": false
        },
        {
          "text": "اطلب من أصحاب المصلحة مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية الموافقة على تضمين هذا الشرط التنظيمي في الأعمال المتراكمة للتكرار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تحتاج في مشروعك إلى بعض المساعدة في تيسير الاجتماعات ومتابعة بنود العمل وتقديم أعضاء الفريق الجدد والتوسط في النزاعات.\nمن هو أنسب نوع من أعضاء الفريق لمساعدتك في هذه الأنشطة؟",
      "explanation": "",
      "choices": [
        {
          "text": "عضو الفريق الموجه نحو الطاقة.",
          "correct": true
        },
        {
          "text": "عضو الفريق الموجه نحو الشركات التابعة.",
          "correct": false
        },
        {
          "text": "عضو الفريق الموجه نحو الإنجاز.",
          "correct": false
        },
        {
          "text": "عضو الفريق الموجه نحو التسليم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت إحدى المؤسسات تطبيق نظام أجايل وتم اختيار مدير مشروع مع Scrum Master لتدريب فريق المشروع على فهم التسليم الرشيق. سأل أحد أعضاء الفريق مدير المشروع عن معنى التسلسل الهرمي للقيادة الخادمة.\nكيف يجب أن يستجيب مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "من المفترض أن يخدم أعضاء الفريق مديرهم.",
          "correct": true
        },
        {
          "text": "من المفترض أن يخدم المديرون أعضاء فريقهم.",
          "correct": false
        },
        {
          "text": "من المفترض أن يخدم العملاء أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "من المفترض أن يقوم أعضاء الفريق بخدمة عملائهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انتهى فريق المشروع مؤخرًا من سباق سريع لتطوير ميزتين لنظام إدارة الأسطول. وعلى الرغم من أن الفريق قام بتسليم الميزات المطلوبة، إلا أنه واجه العديد من المشكلات والتعارضات خلال فترة السباق. كان أعضاء الفريق منزعجين من هذه التجربة وأظهروا الآن نقصًا في الحافز بسبب ما حدث\nما الذي يمكن لمدير المشروع أن يفعله للمساعدة في زيادة تحفيز الفريق ومشاركته في المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإعداد اجتماعات فردية مع أعضاء فريق المشروع.",
          "correct": true
        },
        {
          "text": "قم بمراجعة التقدم المحرز في سباق السرعة مع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "راجع إجراءات التخطيط لسباق السرعة مع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "قم بإجراء استعراض استعادي للسباق السريع مع أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لقيادة مشروع رشيق. يريد مدير المشروع استخدام التحفيز لتشجيع الفريق على الأداء الجيد خلال المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطبيق نظام للمكافآت يهدف إلى الحفاظ على تفاعل الفريق وتحفيزه",
          "correct": true
        },
        {
          "text": "استخدم احتياطيات الإدارة لتمويل بعض أنشطة بناء الفريق.",
          "correct": false
        },
        {
          "text": "تضخيم تقديرات المشروع لتوفير احتياطي مالي لأنشطة الفريق.",
          "correct": false
        },
        {
          "text": "اطلب من راعي المشروع تمويل المزيد من أنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعاً يتطلب موافقة وكالة حكومية. وتقوم الوكالة حاليًا بصياغة تشريع سيؤثر على عملية الموافقة على المشروع، ولكن من غير الواضح متى سيصبح التشريع قانونًا. يشعر مدير المشروع بالقلق من أن التشريع قد يؤخر المراحل الرئيسية للمشروع أو يحد من خيارات تطوير المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدم بطلب للحصول على مخصص طوارئ إضافي للاستعداد للتأخير المتوقع في مراحل المشروع.",
          "correct": true
        },
        {
          "text": "مراجعة نطاق المشروع وتقديم طلب لاستبعاد الأنشطة المرتبطة بالتشريع.",
          "correct": false
        },
        {
          "text": "تقييم التعرض للمخاطر باستمرار لتقليل الآثار السلبية على المشروع ونتائجه.",
          "correct": false
        },
        {
          "text": "المضي قدمًا في المشروع على أساس أن التشريع المعلق سيصدر دون تأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nسجل المخاطر هو وثيقة تسجل تفاصيل جميع المخاطر الفردية المحددة للمشروع. ما هو الحد الأدنى لمحتوى هذه الوثيقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المخاطر المحددة وفئات المخاطر وتأثيراتها على الأهداف",
          "correct": true
        },
        {
          "text": "أصحاب المخاطر، والاستجابات المحتملة للمخاطر المحتملة، ومحفزات المخاطر",
          "correct": false
        },
        {
          "text": "المخاطر المحددة، وأصحاب المخاطر، والاستجابات المحتملة للمخاطر المحتملة",
          "correct": false
        },
        {
          "text": "سجل المشكلات والمقاييس والاتجاهات وتوزيع المخاطر عبر فئات المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nبسبب الانكماش في بيئة الأعمال التجارية، لا يستطيع العميل تسديد دفعة المشروع إلا جزئياً بدلاً من الدفع الشهري الملتزم به بالكامل. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش الأمر مع الإدارة وأوقف المشروع مؤقتًا بسبب قيود ميزانية العميل.",
          "correct": true
        },
        {
          "text": "تقديم الميزات ذات القيمة التجارية الأعلى، بناءً على الميزانية المتاحة.",
          "correct": false
        },
        {
          "text": "تقديم الميزات التي تحتوي على مكونات صغيرة مستقلة، بناءً على الميزانية المتاحة.",
          "correct": false
        },
        {
          "text": "الاستمرار في التطوير المخطط له والتسليم فقط عندما يتم السداد الكامل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nقررت إحدى الشركات تشكيل فرق رشيقة داخل المؤسسة لتحسين نتائج المشاريع والاستفادة من الفرص الجديدة في السوق. وقد تم تعيين مدير مشروع يتمتع بخبرة واسعة في مجال العمل الرشيق للإشراف على العملية. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "توظيف وتعيين وتقييم ممارسي المشاريع الرشيقة الجدد.",
          "correct": true
        },
        {
          "text": "تنفيذ مكتب رشيق لإدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "تحديد المعايير الخاصة بوقت إطلاق المشاريع الرشيقة.",
          "correct": false
        },
        {
          "text": "إجراء تحليل بأثر رجعي لتجارب المشاريع السابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيجب على مدير المشروع اتخاذ القرارات يومياً، بغض النظر عن مستوى أهمية القرار أو أهميته. ما الذي يجب أن يفعله مدير المشروع لضمان أن تكون قراراته غير متحيزة وعقلانية؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام البيانات دون التحقق من دقتها",
          "correct": true
        },
        {
          "text": "فهم أنهم لا يستطيعون تحقيق كل شيء",
          "correct": false
        },
        {
          "text": "اتخاذ القرارات بسرعة",
          "correct": false
        },
        {
          "text": "اتخاذ القرارات فقط عندما تكون النتائج مؤكدة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طُلب من مدير المشروع إدارة مشروع يسمح للشركة بالامتثال للائحة جديدة قادمة. بعد بدء المشروع مباشرة، يتم تعديل النطاق ليعمل فريق المشروع الآن على مهام محددة، بينما يقوم فريق عالمي بإدارة البرنامج لعدة دول بالتوازي. لم يتم بعد مشاركة خطة إدارة المشروع، كما تم تحديد الموعد النهائي لإكمال المشروع\nما الذي يجب أن يفعله مدير المشروع للتعامل مع النطاق والتغييرات؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء مدخل للمخاطر في خطة إدارة المخاطر بسبب عدم وجود خطة عالمية لإدارة المشروع.",
          "correct": true
        },
        {
          "text": "قم بإضفاء الطابع الرسمي على التغيير في النطاق مع راعي المشروع للحد من المساءلة عن المهام المحددة.",
          "correct": false
        },
        {
          "text": "مراجعة أصول العمليات التنظيمية (OPAs) من حالات مماثلة والنهج التي تم تنفيذها",
          "correct": false
        },
        {
          "text": "قم بتحديد الأعمال المتراكمة الأولية وابدأ العمل على أوضح المهام، ثم قم بتنقيح النطاق تدريجيًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيتم تعيين مدير مشروع لمشروع وتكون المهمة الأولى هي المساعدة في إنشاء هيكل تقسيم العمل (WBS). ما هي الأداة أو التقنية أو الوثيقة التي تستخدم كنقطة انطلاق لإنشاء هيكل تفصيلي فعّال لتقسيم العمل؟",
      "explanation": "",
      "choices": [
        {
          "text": "خط الأساس للنطاق",
          "correct": true
        },
        {
          "text": "قائمة الأنشطة",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "قاموس WBS",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعًا مهمًا لتقديم حل جديد. يستثمر الرئيس التنفيذي بشكل كبير في المشروع، والمدير المالي هو مالك المنتج. أثناء مرحلة الاختبار، يطلب المدير المالي متطلبًا إضافيًا غير وظيفي لتقصير وتيرة معالجة المعاملات. سيؤثر هذا المتطلب الجديد على تاريخ الإطلاق، ويصر المدير المالي على تنفيذه.\nما الذي يجب على مدير المشروع فعله لتقليل تأثير المتطلبات الجديدة على تاريخ الإطلاق وإدارة توقعات الرئيس التنفيذي والمدير المالي؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتمع مع المدير المالي واقترح تأجيل تنفيذ المتطلب الجديد إلى مرحلة ما بعد الإطلاق.",
          "correct": true
        },
        {
          "text": "اطلب من الرئيس التنفيذي التدخل وإيقاف تنفيذ المتطلب الجديد، حيث إن التطوير قد اكتمل.",
          "correct": false
        },
        {
          "text": "أخبر فريق المشروع أن يقوم بتحديث تراكمات المنتج بالمتطلبات الجديدة وتعديل خطط المشروع.",
          "correct": false
        },
        {
          "text": "تقييم نطاق المتطلبات الجديدة غير الوظيفية لتحديد تأثيرها المحدد على تاريخ بدء التشغيل المخطط له.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيشارك فريق المشروع بنشاط في إعداد التسليم الأخير قبل أن يصبح المنتج النهائي في مرحلة الإنتاج. ما الذي ينبغي لمدير المشروع أن يفعله للتأكد من أن الفريق بأكمله متزامن بشكل كامل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من حضور الفريق للاجتماعات اليومية ومشاركته بفعالية",
          "correct": true
        },
        {
          "text": "التأكد من أن المعلومات المطلوبة متوفرة ومتاحة لكل عضو وفي متناول كل عضو",
          "correct": false
        },
        {
          "text": "التأكد من تصور العمل المطلوب إنجازه على لوحة بيضاء مرئية وفي متناول الجميع",
          "correct": false
        },
        {
          "text": "تأكد من وجود مساحة للفريق لإجراء محادثة منتظمة كلما دعت الحاجة إلى ذلك",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nما هي المخرجات الرئيسية لعملية تحديد المخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقرير المخاطر وسجل المخاطر",
          "correct": true
        },
        {
          "text": "تقرير المخاطر، وسجل المخاطر، وتحديثات وثائق المشروع",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر، وسجل المخاطر، والاستجابات للمخاطر",
          "correct": false
        },
        {
          "text": "تقرير المخاطر والاحتمالية ومصفوفة التأثير",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع حالة العمل، يقر مدير المشروع بأن العديد من ظروف السوق قد تغيرت مؤخرًا بشكل كبير. ونتيجة لذلك، فإن القيمة المتوقعة للمشروع الجاري تنفيذه قد تكون مهددة\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إيقاف المشروع على الفور بسبب عدم التأكد من أن المشروع سيحقق القيمة المتوقعة.",
          "correct": true
        },
        {
          "text": "الاستمرار في المشروع نظرًا لعدم إبلاغ مدير المشروع رسميًا بأي تغيير في ظروف السوق.",
          "correct": false
        },
        {
          "text": "اطلب من فريق المشروع التحقيق في تطور ظروف السوق خلال الأشهر الستة الماضية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الجهة الراعية للمشروع لمناقشة المعلومات والسؤال عما إذا كانت المنظمة لا تزال تدعم تنفيذ المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود فريق سكروم. أثناء اختبار قبول الأعمال (BAT)، يرفض العميل الناتج بسبب رداءة الجودة، ويرجع ذلك إلى عدم التعاون بين أعضاء الفريق.\nما الذي كان يجب على مدير المشروع فعله لمنع حدوث ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم تعليمات مفصلة حول كيفية ووقت إنجاز العمل.",
          "correct": true
        },
        {
          "text": "طلب وثائق مفصلة وتوقيعات مفصلة بين مراحل المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ التتبع التفصيلي لتقدم المشروع والإنتاجية والتكاليف.",
          "correct": false
        },
        {
          "text": "قدمت رؤية مفصلة ومكّنت الفريق وجعلته مسؤولاً عن العمل.",
          "correct": false
        }
      ]
    }
  ]
}
