{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال مشروع تكنولوجي جديد، ينشأ الارتباك بسبب عدم وجود حالة مستقبلية واضحة المعالم ومعلنة للمنتج. ماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء خطة إدارة المزايا والحصول على الموافقة عليها.",
          "correct": true
        },
        {
          "text": "اسأل راعي المشروع عن النتيجة التي يجب أن تكون عليها نتيجة المشروع.",
          "correct": false
        },
        {
          "text": "ناقش النطاق والأهداف مع المالك الوظيفي.",
          "correct": false
        },
        {
          "text": "مراجعة حالة عمل المشروع لتحديد البدائل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير المشروع أن يضمن أن تكون مسؤوليات أصحاب المصلحة واضحة وموجزة وتعزز الإنجاز الناجح مع الحفاظ على مشاركة أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون مع أصحاب المصلحة لتحديد مسار عملهم الذي يمكن إدارته",
          "correct": true
        },
        {
          "text": "قم بتعيين مسؤوليات جديدة فقط بعد استيفاء المواعيد النهائية السابقة.",
          "correct": false
        },
        {
          "text": "قم بتعيين أكبر عدد ممكن من المسؤوليات التي تعتقد أن صاحب المصلحة يمكنه تحملها.",
          "correct": false
        },
        {
          "text": "إضافة مسؤوليتين جديدتين على الأقل بعد استيفاء المواعيد النهائية السابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أجرى قائد المشروع ومالك المنتج محادثة جانبية حول حالة التسليم القادم. وأثار مالك المنتج مخاوف بشأن الطريقة التي يتعامل بها مالك الهندسة المعمارية مع التسليم القادم.\nما الذي يجب على قائد المشروع فعله لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "طمئن مالك المنتج بعدم القلق واطلب منه حضور الاجتماعات اليومية.",
          "correct": true
        },
        {
          "text": "شارك مخاوف مالك المنتج مع مالك الهندسة المعمارية واطلب رأيه.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج عدم التدخل وتجاهل المخاوف إلى ما بعد التسليم.",
          "correct": false
        },
        {
          "text": "تأكد من حضور أعضاء الفريق الاجتماعات اليومية لمناقشة المشاكل وحلها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nبعد إجراء العديد من المقابلات مع أصحاب المصلحة الرئيسيين والتحقق من ميثاق المشروع، وجد مدير المشروع أن الهيكل التنظيمي الحالي للمشروع لم يعد مناسباً للأهداف الاستراتيجية للمشروع. ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم وثائق الدروس المستفادة والتحقق من صحة الهيكل التنظيمي الذي تم استخدامه في الماضي لمشاريع مماثلة.",
          "correct": true
        },
        {
          "text": "اطلب من الفريق توثيق المخاطر في سجل مخاطر المشروع ووضع خطة استجابة للمخاطر وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "تقييم الفجوات بين الهيكل التنظيمي الحالي وفوائد المشروع المتوقعة لتحديد الإجراءات المطلوبة.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق مراجعة ميثاق المشروع وتقييم أهداف المشروع لمعرفة مدى ملاءمتها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مدير المشروع في وضع خطة لمشروع جديد. خلال الاجتماع التخطيطي الأول، يسأل أصحاب المصلحة عن قيمة المشروع ومدى ارتباطه بأهداف المنظمة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إحالة أصحاب المصلحة إلى خطة إدارة النطاق.",
          "correct": true
        },
        {
          "text": "قم بإحالة أصحاب المصلحة إلى ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "قم بدعوة راعي المشروع للانضمام إلى الاجتماع للرد على الأسئلة.",
          "correct": false
        },
        {
          "text": "اطلب من مكتب إدارة المشروع (PMO) توفير الوثائق اللازمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تعلن شركة أم عن مشروع تكامل لجميع شركاتها الفرعية. يغطي مشروع التكامل الأقسام القانونية والموارد البشرية والمالية للشركات التابعة. تستثمر الإدارة العليا في هذا المشروع باعتباره أول مشروع رشيق للشركة وتم تعيين مدير مشروع جديد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة لمناقشة المخاطر.",
          "correct": true
        },
        {
          "text": "وضع ميثاق الفريق.",
          "correct": false
        },
        {
          "text": "خطة لتعزيز مستوى النضج الرشيق للفريق.",
          "correct": false
        },
        {
          "text": "وضع استراتيجية انتقالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nمدير مشروع غير قادر على إكمال قائمة أهداف المشروع بسبب التوجيهات المتضاربة من مديري إدارتين. ما هو النهج الذي من شأنه أن يسمح للمديرين بتعديل توجيهاتهما مع تحقيق نتيجة مربحة/مربحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون/حل المشكلات",
          "correct": true
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        },
        {
          "text": "سلس/ملائم",
          "correct": false
        },
        {
          "text": "القوة/مباشرة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير مشروع لمشروع إنشائي بقيمة 5 ملايين دولار أمريكي أن يفي بإنجاز مشروع محدد قبل الموعد المخطط له بسبب توقع حدوث نمط من الطقس القاسي على مدار الموسم قريباً. وقد تجاوز المشروع ميزانيته بالفعل، والجهة الراعية للمشروع غير مستعدة لتقديم تمويل إضافي.\nما هي الأداة أو التقنية التي يجب أن يستخدمها مدير المشروع لتحقيق الإنجاز قبل بدء الطقس القاسي؟",
      "explanation": "",
      "choices": [
        {
          "text": "المحاكاة",
          "correct": true
        },
        {
          "text": "التتبع السريع",
          "correct": false
        },
        {
          "text": "تجانس الموارد",
          "correct": false
        },
        {
          "text": "التحطم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كان مدير المشروع قد بدأ للتو مشروعًا طويل الأجل عندما طبقت الحكومة تشريعًا جديدًا يقضي بضرورة تسجيل جميع المهندسين العاملين في الدولة يعتمد التسجيل على مجال العمل والخبرة والتطوير المهني الذي تم إنجازه في السنوات الثلاث الماضية. ونظراً لقيود الميزانية في الشركة خلال السنوات الثلاث الماضية، كانت هناك فرص محدودة للمهندسين لاكتساب التطوير المهني الرسمي.\nكيف ينبغي لمدير المشروع التعامل مع الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال طلب إلى مجلس إدارة التغيير لتقييم الوضع.",
          "correct": true
        },
        {
          "text": "مراجعة مصفوفة مهارات الفريق وتحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إرسال جميع المهندسين إلى التطوير المهني لتلبية المتطلبات.",
          "correct": false
        },
        {
          "text": "أبلغ المهندسين بضرورة تسجيلهم لمواصلة العمل لدى الشركة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف عملية تنفيذ المشروع، يغادر راعي المشروع ويتم تعيين راعٍ جديد ويطلب الراعي الجديد إجراء مراجعات رئيسية على المخرجات.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ جميع التغييرات على المخرجات.",
          "correct": true
        },
        {
          "text": "طلب موارد إضافية لتعديل النواتج.",
          "correct": false
        },
        {
          "text": "تقييم الآثار المحتملة للتغييرات.",
          "correct": false
        },
        {
          "text": "تمديد الجدول الزمني للمشروع ليشمل التغييرات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمر إحدى الشركات بتغيير تنظيمي. وقد تغيرت معظم الإدارة العليا، بما في ذلك المشرف المباشر لمدير المشروع. يتسم المشرف بأسلوب عمل عدواني وقد أبدى تعليقات انتقادية لمدير المشروع فيما يتعلق بالمشروع الجاري دون أن يفهم الوضع حقًا. يشعر مدير المشروع بعدم الارتياح في العمل مع المشرف الجديد.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع لمراجعة المشروع لشرح النقاط الرئيسية للمشروع للمشرف الجديد.",
          "correct": true
        },
        {
          "text": "تطبيق توصيات المشرف الجديد على المشروع.",
          "correct": false
        },
        {
          "text": "تقييم تأثير التغيير التنظيمي على المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ فريق المشروع بضرورة أن يكونوا مستعدين لتبني التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nهناك تعارض بين اثنين من أعضاء الفريق فيما يتعلق بمهمة المشروع. ما هي طريقة حل النزاع التي ينبغي أن يستخدمها مدير المشروع لجعل الوضع مربحاً للطرفين؟",
      "explanation": "",
      "choices": [
        {
          "text": "التعاون/حل المشكلات",
          "correct": true
        },
        {
          "text": "القوة/مباشرة",
          "correct": false
        },
        {
          "text": "سلس/ملائم",
          "correct": false
        },
        {
          "text": "التسوية/إعادة التسوية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع يعد جزءًا من مبادرة كبيرة لتحويل الأعمال. وقد حصل المشروع على دعم من المسؤولين التنفيذيين في قسم الجودة. على الرغم من أن النطاق لم يتم الانتهاء منه بعد، إلا أن الجهة الراعية للمشروع تمكنت من الحصول على ميزانية طوارئ كبيرة لتغطية أي تغييرات في النطاق، وأكدوا لمدير المشروع أن المال لا يمثل مشكلة. تم التعجيل بكل هذه التغييرات بسبب الأهمية الاستراتيجية للمشروع.\nما الذي يجب أن يكون التركيز الأساسي لمدير المشروع في تطوير استراتيجية إدارة التغيير؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع تقييم احتياجات أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "تطوير هيكل تقسيم العمل (WBS)",
          "correct": false
        },
        {
          "text": "تطوير هيكل توزيع المخاطر (RBS)",
          "correct": false
        },
        {
          "text": "وضع خطة تواصل تنظيمية للاتصال المؤسسي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم احتساب الميزانية الأصلية للمشروع عند الإنجاز (BAC) على أنها 000,000 دولار أمريكي، ولكن التقدير عند الإنجاز (EAC) هو 000,20 دولار أمريكي. إذا كان مؤشر أداء الجدول الزمني (SPI) يساوي ، فما هو مؤشر أداء التكلفة (CPI)؟",
      "explanation": "",
      "choices": [
        {
          "text": "يساوي",
          "correct": true
        },
        {
          "text": "أقل من",
          "correct": false
        },
        {
          "text": "يساوي",
          "correct": false
        },
        {
          "text": "أكبر من",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل مدير مشروع للتو مشروعًا في مؤسسة تقدّر الدروس المستفادة تشجع القيادة جميع أصحاب المصلحة في المشروع على استخدام العملية والأدوات والنتائج من مستودع الدروس المستفادة في المشاريع المستقبلية. استعدادًا لتحديث مستودع الدروس المستفادة، قام مدير المشروع بجمع بيانات المشروع ذات الصلة والملاحظات.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتخزين جميع التعليقات والتوصيات الواردة للرجوع إليها في المستقبل.",
          "correct": true
        },
        {
          "text": "قم بتحليل النتائج وتنظيمها مع أصحاب المصلحة لاستخراج الرؤى.",
          "correct": false
        },
        {
          "text": "توثيق النتائج ومشاركتها مع أصحاب المصلحة لمراجعتها وإبداء الملاحظات عليها.",
          "correct": false
        },
        {
          "text": "استرجع جميع التعليقات والتوصيات التي تم تلقيها في الماضي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع رشيق. ومن أجل التأكد من توافر تمويل كافٍ للمشروع، يطلب راعي المشروع من مدير المشروع تقديراً لموعد اكتمال المشروع\nكيف يجب أن يستجيب مدير المشروع للراعي؟",
      "explanation": "",
      "choices": [
        {
          "text": "أبلغ الجهة الراعية بأن التقدير غير ضروري، حيث تدعم المرونة الاستجابة للتغيير بدلاً من اتباع خطة.",
          "correct": true
        },
        {
          "text": "ذكّر الجهة الراعية بأن المشاريع الرشيقة لا يتم الحكم عليها بناءً على الميزانية والجدول الزمني.",
          "correct": false
        },
        {
          "text": "تقديم التقدير إلى الجهة الراعية، حيث تدعم أجايل التقدير.",
          "correct": false
        },
        {
          "text": "التأثير على الراعي لإضافة احتياطي طوارئ للتكلفة في حالة تجاوز التكلفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يعمل على مشروع سيقدم حلاً في بلد ما بسبب احتمال حدوث خرق أمني، تحظر حكومة البلد \"أ\" التكنولوجيا التي سيتم استخدامها في حل المشروع، مما يؤثر سلباً على المشروع. مدير المشروع على وشك الانتهاء من تركيب المشروع بعد أن قام بالفعل بشراء المواد والتكنولوجيا المحظورة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المشروع واتباع عملية التحكم في التغيير.",
          "correct": true
        },
        {
          "text": "اطلب من الفريق القانوني مراجعة التغيير وتحديد الرد المناسب.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع حول المشكلة وطلب التوجيه بشأن الخطوات التالية.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بأن المشروع لا يمكنه تقديم النطاق المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل أحد مديري المشاريع مؤخرًا مشروعًا قام فيه بحل العديد من النواتج دون المستوى التي رفضها العميل. ولاحظ مدير المشروع أنه عندما تم حل ثلاثين (30) عيبًا من العيوب ذات الأولوية من إجمالي مائة (00) عيب تم تحديدها للمشروع، أدى ذلك إلى زيادة نسبة رضا العميل إلى 00٪ وقبول جميع النواتج\nما المبدأ الذي يوضحه هذا الحدث؟",
      "explanation": "",
      "choices": [
        {
          "text": "باريتو",
          "correct": true
        },
        {
          "text": "مونت كارلو",
          "correct": false
        },
        {
          "text": "كايزن",
          "correct": false
        },
        {
          "text": "صوت العميل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إجراء اجتماع استعادي فوجئ أعضاء الفريق بنتائج أداء الفريق التي شاركها فريق العمل في المشروع وأعرب الجميع عن جهلهم بالقياسات وتوافر الأدوات المختلفة في المكان.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الموارد البشرية شرح أدوات قياس الأداء المختلفة",
          "correct": true
        },
        {
          "text": "إبلاغ أعضاء الفريق لملء الملاحظات بشكل منتظم",
          "correct": false
        },
        {
          "text": "تزويد أعضاء الفريق بتغذية راجعة مستمرة حول أدائهم",
          "correct": false
        },
        {
          "text": "تخطيط وتحديد إطار عمل واضح لقياس الأداء",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مدير مشروع سكروم جديد في إحدى الشركات لبناء تطبيق لقياس حركة المرور ومراقبتها لصالح إحدى البلديات. تم إخطار مدير المشروع بأن البلدية قد رفضت للتو الجزء الخاص بقياس حركة المرور من التطبيق لأنه لا يتوافق مع اللوائح الوطنية القائمة منذ فترة طويلة.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من مالك المنتج التعامل مع الامتثال للوائح التنظيمية.",
          "correct": true
        },
        {
          "text": "تخصيص عضو فريق من ذوي الخبرة للتحقق من الامتثال التنظيمي.",
          "correct": false
        },
        {
          "text": "جعل مدير سكروم المسؤول الوحيد عن الامتثال التنظيمي.",
          "correct": false
        },
        {
          "text": "ناقش أهمية الامتثال للوائح مع الجهة الراعية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقرر مدير المشروع لمشروع معقد، يهدف إلى تحسين النتائج المالية للشركة، استخدام طريقة القيمة النقدية المتوقعة (EMV) لاختيار أفضل استراتيجية. ولتحقيق ذلك، يحدد فريق المشروع ثلاثة سيناريوهات مع احتمالات النتائج التالية: السيناريو (25%) والسيناريو 2 (50%) والسيناريو 3 (25%) للاستراتيجية (أ)، مع تسجيل نقاط 60 دولارًا و20 دولارًا و-20 دولارًا على التوالي. أما الاستراتيجية الأخرى، وهي الاستراتيجية (ب)، فقد سجلت قيمة احتمالية 75 دولارًا.\nما هي الاستراتيجية التي يفضلها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستراتيجية (أ) مع درجة القيمة السوقية للاستراتيجية (أ) تبلغ 65.",
          "correct": true
        },
        {
          "text": "الاستراتيجية (ب) مع درجة القيمة السوقية للاستراتيجية (ب) تبلغ 75.",
          "correct": false
        },
        {
          "text": "الاستراتيجية (أ) مع درجة القيمة السوقية للاستراتيجية (أ) 95.",
          "correct": false
        },
        {
          "text": "الاستراتيجية (ب) مع درجة القيمة السوقية للاستراتيجية (أ) 95.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشارك مدير مشروع في مشروع تطوير التجارة الإلكترونية. وقد اكتمل المشروع بنجاح باستخدام النموذج الهجين وبدأ تسليم العمليات. لاحظ مدير المشروع أن فريق التطوير مسترخٍ ولا يقضي الوقت في عملية التسليم، مما يؤثر على دعم التطبيق.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "واجه فريق التطوير وطالبهم بالاهتمام الفوري بعملية التسليم.",
          "correct": true
        },
        {
          "text": "اجتمع مع فريق التطوير لمناقشة أهمية عملية التسليم وتأثيرها على دعم التطبيق.",
          "correct": false
        },
        {
          "text": "قم بتفويض مسؤولية عملية التسليم إلى عضو آخر في الفريق لضمان إنجازها بشكل صحيح.",
          "correct": false
        },
        {
          "text": "تجاهل المشكلة وتوقع أن يقوم فريق التطوير بمعالجة المشكلة وحلها من تلقاء نفسه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعاً رشيقاً في مرحلة التنفيذ. وبعد بضعة سباقات، يدرك مدير المشروع أن تقديرات الفريق ليست واقعية.\nما الإجراء الذي يجب على مدير المشروع اتخاذه لإزالة هذا العائق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق معالجة هذه المشكلة في الاستعراض الاستعراضي التالي لتجنب التأثير على السباق الجاري.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة من راعي المشروع لإضافة مخزون احتياطي للطوارئ إلى سباق السرعة، وتغيير تاريخ الانتهاء.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق معالجة هذه المشكلة في جلسة الاستعداد التالية، والوفاء بالالتزام بالسباق الجاري.",
          "correct": false
        },
        {
          "text": "قم بتنظيم جلسات تنقيح المنتجات المتراكمة لفهم النطاق ومراجعة التقديرات بشكل أفضل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بتتبع مشروع بنية تحتية يعتمد على مزود خدمة. وقد أبلغ مزود الخدمة مدير المشروع بأن بعض مكونات الطرف الثالث لن يتم تصنيعها أو دعمها بعد المراجعة الأولية، وهذا من شأنه أن يؤخر الجدول الزمني بشكل كبير ويزيد من الميزانية.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع هذه المشكلة إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        },
        {
          "text": "إجراء مراجعة مع الفريق.",
          "correct": false
        },
        {
          "text": "قم بتحديث حالة المشروع لتعكس هذه النتائج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء مراجعة تقرير الحالة، يلاحظ مدير المشروع أن جودة الترميز لأحد المطورين على مدى ستة أشهر أقل إحصائيًا من مطور آخر مكلف بنفس المهمة. ما الأداة التي يجب أن يستخدمها مدير المشروع لتتبع مصدر المشكلة وصولاً إلى سببها الجذري القابل للتنفيذ؟",
      "explanation": "",
      "choices": [
        {
          "text": "الرسم البياني",
          "correct": true
        },
        {
          "text": "مخطط التحكم",
          "correct": false
        },
        {
          "text": "رسم بياني مبعثر",
          "correct": false
        },
        {
          "text": "مخطط إيشيكاوا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشتكي مدير مشروع من أن ثلاثة مهندسين من خلفيات ثقافية مختلفة يغادرون اجتماعات المشروع مرتين في اليوم ويفترض أنهم \"يثرثرون ويدخنون\" لمدة 5 دقائق. يرد مدير الهندسة بأن غيابهم بسبب وقت الصلاة.\nما الذي يجب أن يفعله مدير المشروع أولاً لتصحيح افتراضه؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاعتذار عن التحيز اللاواعي.",
          "correct": true
        },
        {
          "text": "وضع خطة لتحسين أخلاقيات العمل",
          "correct": false
        },
        {
          "text": "قم بإعداد اجتماع لزيادة الوعي الثقافي.",
          "correct": false
        },
        {
          "text": "تابع وشاهد لتبدي ملاحظة مستنيرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تكليف مدير مشروع لشركة صغيرة بمشروع ذي نطاق معقد وجديد. يوصي مدير البرنامج بإنشاء فريق يضم أفرادًا يمكنهم تقديم خبرات تكميلية.\nما هي خصائص الشبكة التي ينبغي بناؤها؟",
      "explanation": "",
      "choices": [
        {
          "text": "التنسيق المركزي، وأعضاء الفريق مع أصحاب المصلحة الداخليين والخارجيين، والتزام جميع المشاركين باتفاقية العمل ومجموعة القواعد",
          "correct": true
        },
        {
          "text": "أعضاء الفريق المنظم ذاتي التنظيم مع أصحاب المصلحة الداخليين والخارجيين، ويلتزم جميع المشاركين باتفاقية العمل ومجموعة من القواعد",
          "correct": false
        },
        {
          "text": "التنظيم الذاتي، وأعضاء الفريق مع أصحاب المصلحة الداخليين، والتزام جميع المشاركين باتفاقية العمل ومجموعة من القواعد",
          "correct": false
        },
        {
          "text": "التنسيق المركزي، وأعضاء الفريق مع أصحاب المصلحة الداخليين، والتزام جميع المشاركين باتفاقية العمل ومجموعة من القواعد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تعيين ممارس رشيق لقيادة مشروع تطوير برمجيات في صناعة جديدة نسبياً حيث معايير الامتثال الخارجية غير محددة بوضوح ما الذي يجب على الممارس الرشيق القيام به لضمان نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحدث إلى المديرين الرشيقين في المؤسسات الأخرى التي تواجه نفس التحديات لمعرفة كيفية معالجتهم للمشكلات.",
          "correct": true
        },
        {
          "text": "وضع مجموعة من المعايير التي تناسب الدور ودعم الفريق في تنفيذها.",
          "correct": false
        },
        {
          "text": "استخدام أفضل الممارسات العالمية كدليل إرشادي لتنفيذ المشروع مع دمج اتجاهات التكنولوجيا الجديدة ومراقبة معايير الامتثال.",
          "correct": false
        },
        {
          "text": "ارجع إلى البيانات السابقة الأخرى الموجودة من الصناعات ذات الصلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب الالتزامات تجاه مشروع آخر، فشل محاسب في تسليم تقرير مهم إلى مدير المشروع في الوقت المحدد. لم يتوقع مدير المشروع التأخير ولم يدرك أن المحاسب لديه أولويات متضاربة.\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمت الإشارة إلى مصفوفة RACI.",
          "correct": true
        },
        {
          "text": "الجداول الزمنية المرجعية.",
          "correct": false
        },
        {
          "text": "تمت الإشارة إلى خطة تخصيص الموارد.",
          "correct": false
        },
        {
          "text": "تمت الإشارة إلى تقويم الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتؤدي مشكلة غير متوقعة إلى الحاجة إلى شراء قطعة جديدة من الماكينات الضرورية لتلبية مواصفات الجودة. من أين يمكن الحصول على الأموال اللازمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "أصحاب المصلحة الرئيسيون",
          "correct": true
        },
        {
          "text": "احتياطي الإدارة",
          "correct": false
        },
        {
          "text": "احتياطي الطوارئ",
          "correct": false
        },
        {
          "text": "راعي المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة مصفوفة ويدير مشروع تطوير برمجيات داخلي لتحسين نظام التتبع في الشركة. ومن المقرر أن يكتمل المشروع في غضون شهر واحد. سيتم تحقيق بعض الفوائد بمجرد تشغيل النظام، ومع ذلك، لن تتحقق الفوائد الكاملة لفترة من الوقت. على الرغم من أن مدير المشروع سيقوم بتتبع الفوائد من خلال إغلاق المشروع، إلا أنه قلق بشأن تتبع فوائد أنشطة ما بعد المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب بدء مشروع جديد لرصد تحقيق الفوائد والإبلاغ عنها.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة المنافع لتمديد المشروع حتى تتحقق جميع المنافع",
          "correct": false
        },
        {
          "text": "تحديث هيكل تقسيم العمل (WBS) والجدول الزمني للمشروع مع المهام لتتبع تحقيق الفوائد.",
          "correct": false
        },
        {
          "text": "التنسيق مع مالك المنافع لمراقبة تحقيق المنافع بعد إغلاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار أحد مكونات المشروع، يكتشف أحد كبار المختبرين وظيفة من شأنها ضمان الأداء المستقبلي لحل المشروع. سيؤدي ذلك إلى تغيير في النطاق.\nما نوع طلب التغيير الذي يجب تقديمه لتضمين هذه الوظيفة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجراءات الوقائية",
          "correct": true
        },
        {
          "text": "الإجراءات التصحيحية",
          "correct": false
        },
        {
          "text": "إصلاح العيوب",
          "correct": false
        },
        {
          "text": "تحديث النطاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء مراجعة وثائق المشروع، يكتشف مدير المشروع أنه تم إجراء تعديلات دون الحصول على الموافقات المناسبة. ماذا ينبغي لمدير المشروع أن يفعل بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع المشكلة إلى مكتب إدارة المشروع (PMO).",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة التغيير.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المتطلبات.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيعمل مدير مشروع على تطوير حالة عمل لتأمين التمويل والموارد. ما المطلوب لضمان إعطاء الأولوية الصحيحة للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع خطة التسليم الأكثر كفاءة",
          "correct": true
        },
        {
          "text": "وضع جدول زمني واضح ومفصل للمشروع",
          "correct": false
        },
        {
          "text": "مواءمة المشروع مع أهداف الشركة وغاياتها",
          "correct": false
        },
        {
          "text": "مواءمة المشروع مع خارطة طريق الشركة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد بدء أحد سباقات السرعة، قام أحد أصحاب المصلحة الرئيسيين بإنشاء رسالة بريد إلكتروني إلى فريق المشروع معرباً عن استيائه من العمل الذي بدأ للتو، على الرغم من عدم خبرته في العمل الرشيق. أصرّ صاحب المصلحة على تغيير المخرجات الداخلية والخارجية.\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب تقييم الفريق للمسألة في اجتماع الاستعداد التالي.",
          "correct": true
        },
        {
          "text": "تغيير الأعمال المتراكمة والامتثال لطلب أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "قم بتيسير عقد اجتماع مع مالك المنتج وأصحاب المصلحة الرئيسيين للمواءمة على المخرجات.",
          "correct": false
        },
        {
          "text": "تشجيع أصحاب المصلحة على المشاركة في مناقشة بشأن توضيح الأعمال المتراكمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة تنفيذ المشروع، يتم تعيين مدير مشروع جديد ليحل محل مدير المشروع السابق. وعندما يبدأ مدير المشروع في إدارة المشروع، يكتشف أن أداء الفريق يتراجع بشكل ملحوظ، مما يؤثر على مؤشرات الأداء الرئيسية للمشروع. وقد حقق هذا الفريق أداءً جيداً في مشاريع مماثلة في الماضي.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك لتحسين هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الموارد والأصول التنظيمية.",
          "correct": true
        },
        {
          "text": "تنفيذ تقنيات الضغط لإعادة المشروع إلى مساره الصحيح.",
          "correct": false
        },
        {
          "text": "الدعوة لعقد اجتماع للفريق لتحديد السبب الجذري لتراجع الأداء.",
          "correct": false
        },
        {
          "text": "تقدير تأثيرات خط الأساس وتقديم طلب تغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكون المشروع في مرحلة الاختبار، ويقوم فريق مراقبة الجودة بإبلاغ مدير المشروع بأن جودة المخرجات من أحد البائعين رديئة. ووجدت تحقيقاتهم أن الموظفين المعينين لا يملكون الشهادات المطلوبة.\nكيف نشأت هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "لم يتضمن عرض البائعين قائمة بالأشخاص المعينين للمشروع.",
          "correct": true
        },
        {
          "text": "لم يفرض راعي المشروع ثلاثة مراجع من عملاء سابقين.",
          "correct": false
        },
        {
          "text": "لم تشتمل خطة إدارة المشتريات على الشهادات المطلوبة",
          "correct": false
        },
        {
          "text": "كان لدى فريق مراقبة الجودة معايير عالية جدًا وتم اختبارها بدقة شديدة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يدير مشروعًا بجدول تسليم صارم للغاية وتاريخ إنجاز ثابت. ويتطلب المشروع مكونات باهظة الثمن وهشة ومعرضة لإعادة العمل والرفض. يقوم مدير المشروع بتطوير معايير اختيار البائعين.\nما هي استراتيجية اختيار البائعين؟",
      "explanation": "",
      "choices": [
        {
          "text": "أقل سعر بغض النظر عن موقع مستودع البائع.",
          "correct": true
        },
        {
          "text": "سعر مقبول إذا كان البائع أقرب إلى موقع المشروع.",
          "correct": false
        },
        {
          "text": "توصية راعي المشروع بناءً على الخبرة السابقة.",
          "correct": false
        },
        {
          "text": "توصيات أعضاء الفريق بناءً على الخبرة السابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة تنفيذ مشروعك، أبلغك مدير الموارد أن أحد الخبراء المخصصين لمشروعك يجب أن يكون متحمسًا من أجل تحقيق أداء جيد للغاية.\nما هي الإجراءات الموصى بها لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تذكير المدير الوظيفي بأن من واجبه تحفيز فريقه",
          "correct": true
        },
        {
          "text": "ذكّر عضو الفريق بأن هناك عقوبات على السلوكيات السيئة.",
          "correct": false
        },
        {
          "text": "ذكّر عضو الفريق بأن هناك حوافز مالية للفريق.",
          "correct": false
        },
        {
          "text": "تذكير أعضاء الفريق بدورهم المهم وكيف سيتم مكافأتهم على ذلك",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع استثماري لمعالجة المياه. أقرت الحكومة المحلية مؤخرًا قانونًا يتطلب الالتزام بالمياه النظيفة وفقًا للمعايير العالمية. وقد بدأ العمل بهذا القانون الجديد في الشهر الماضي وسرعان ما تم إقراره\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ أصحاب المصلحة والاستمرار في المشروع وفقًا للخطط الأصلية حيث تم إقرار القانون بعد بدء المشروع",
          "correct": true
        },
        {
          "text": "الاجتماع مع الجهة الراعية للمشروع والتوصية بمواصلة المشروع لأن المتطلبات القانونية الجديدة يمكن أن تتحقق",
          "correct": false
        },
        {
          "text": "إجراء تحليل لتأثير اللائحة على المشروع والأعمال وإبلاغ أصحاب المصلحة به.",
          "correct": false
        },
        {
          "text": "التوصية بإيقاف جميع الأعمال في المشروع فورًا حتى يتم فهم تأثير اللائحة التنظيمية",
          "correct": false
        }
      ]
    }
  ]
}
