{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "تمت الموافقة على لائحة جديدة ستؤثر على المنجزات في المرحلة الرابعة من المشروع. وتتبع عملية التسليم نهجًا تكراريًا ويجري حاليًا استكمال المرحلة الثانية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع راعي المشروع لمناقشة زيادة التكلفة.",
          "correct": true
        },
        {
          "text": "احصل على الموافقة على الميزانية الإضافية من اللجنة التوجيهية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الخبراء المتخصصين (SMEs) لتقييم التأثير على الأهداف.",
          "correct": false
        },
        {
          "text": "الحصول على الموافقة على استثناء من تطبيق اللائحة الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nلاحظ قائد المشروع أن أحد أعضاء الفريق الجديد غير متحمس ويصل دائمًا متأخرًا عن العمل، مما يتسبب في تأخير في التسليمات. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الموارد البشرية التعامل مع حضور أعضاء الفريق ونصحهم بالحضور في الوقت المحدد، وتذكيرهم بالحوافز في نهاية المشروع.",
          "correct": true
        },
        {
          "text": "اطلب من أحد كبار أعضاء الفريق التحدث مع عضو الفريق ومشاركة الخبرات الشخصية ومعرفة أسباب مشاكل الأداء.",
          "correct": false
        },
        {
          "text": "خلال الاجتماع اليومي، اطلب من جميع أعضاء الفريق الوصول في الوقت المحدد، وخطط لفعالية بعد ساعات العمل للاحتفال بتقدم المشروع.",
          "correct": false
        },
        {
          "text": "تحدث مع أعضاء الفريق على أساس فردي، مع التأكيد على أهمية العمل الجماعي وقيمة مساهمات كل عضو في الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع تنقيح الأعمال المتراكمة للمنتج، يختلف أحد أصحاب المصلحة من القسم القانوني ومالك المنتج على تحديد أولوية عنصر معين. يذكر مالك المنتج أن تحديد الأولويات الحالي يضيف قيمة قصوى للمشروع، ويذكر صاحب المصلحة أنه يجب إعطاء الأولوية للعنصر لأنه من متطلبات الامتثال الحكومي.\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استسلم لسلطة مالك المنتج في تحديد الأولويات وذكّر أصحاب المصلحة بأن هذه ليست مسؤوليتهم.",
          "correct": true
        },
        {
          "text": "افحص المواقف السابقة في سجل الدروس المستفادة لإيجاد حل لها وتحديد أولويات الأعمال المتراكمة وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "استخدم تقنيات التفاوض لإقناع مالك المنتج بتحديد أولويات الأعمال المتراكمة على النحو الذي اقترحه أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسهيل المناقشة بين مالك المنتج وأصحاب المصلحة لمناقشة وجهات نظرهم ومخاوفهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع فريقين متحمسين للغاية يعملان عادةً على 3-4 مشاريع قصيرة متزامنة ذات مواعيد نهائية ضيقة. وفي الآونة الأخيرة، انخفض التواصل والروح المعنوية وأداء المشروع في الفريقين، ويريد مدير المشروع تحسين فعالية الفريق ونجاح المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطبيق أداة تعاون جديدة لتسهيل التواصل بين الفريقين.",
          "correct": true
        },
        {
          "text": "إجراء مراجعات للأداء الفردي لتحديد مشاكل الأداء داخل كل فريق ومعالجتها.",
          "correct": false
        },
        {
          "text": "نظّم أنشطة بناء الفريق لزيادة تماسك الفريق ورفع الروح المعنوية.",
          "correct": false
        },
        {
          "text": "تسهيل جلسات التواصل المفتوح لتحديد التحديات الكامنة ومعالجتها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تجميع فريق لمشروع جديد سيستخدم نهجًا تنبؤيًا من خلال جمع المتطلبات ونهجًا رشيقًا للتطوير والاختبار. لا يتمتع جميع أعضاء الفريق بخبرة في العمل في نهج أجايل. بدأ الجدول الزمني في الانزلاق بسبب عدم وضوح هيكلية نهج التطوير الرشيق.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإعداد اجتماعات حالة أسبوعية لمراجعة تقدم الفريق وتصعيد التأخير بانتظام.",
          "correct": true
        },
        {
          "text": "اجتمع مع الفريق، وسمح لأعضاء الفريق باتخاذ القرارات بشأن ما يجب القيام به، ووضع أهداف الأداء.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات يومية لمتابعة تقدم الفريق وتصعيد التأخير إلى أصحاب المصلحة حسب الاقتضاء.",
          "correct": false
        },
        {
          "text": "إجراء اجتماعات روتينية وتحديد أعضاء الفريق الذين يعانون من ضعف الأداء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكتشف فريق المشروع فرصة لتحسين البرمجيات دون التأثير على الميزانية أو الجدول الزمني. يقوم الفريق بإجراء التحسين دون توثيق مناسب، مما يتسبب لاحقًا في حدوث مشكلات في الإنتاج.\nما هي العملية التي كان ينبغي إجراؤها لمنع حدوث ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدول التحكم",
          "correct": true
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر",
          "correct": false
        },
        {
          "text": "إدارة نطاق الخطة",
          "correct": false
        },
        {
          "text": "تنفيذ التحكم في التغيير المتكامل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق إدارة مشروع بتطوير نظام معلومات إدارة المشاريع (PMIS) كأداة تعاون لأصحاب المصلحة الداخليين والخارجيين. ويريد مدير المشروع تطوير مكون لوحة معلومات داخل النظام يتم تحديثها بمعلومات عن أداء المشاريع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد البيانات التي سيتم عرضها",
          "correct": true
        },
        {
          "text": "حدد أدوات التصور المناسبة.",
          "correct": false
        },
        {
          "text": "تحديد وتيرة تحديثات لوحة التحكم.",
          "correct": false
        },
        {
          "text": "تحديد احتياجات التواصل لأصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق مشروع رشيق بتنفيذ منصة تقنية داعمة عبر الأقسام. وهم يخططون لمراجعة الجاهزية للتسليم.\nمن الذي ينبغي أن يقترحه مدير المشروع لإجراء مراجعة الجاهزية؟",
      "explanation": "",
      "choices": [
        {
          "text": "مالك المنتج مسؤول عن رؤية المنتج وإدارة الأعمال المتراكمة.",
          "correct": true
        },
        {
          "text": "مدير مراقبة الجودة (QC) مسؤول عن ضمان جودة التسليم وكفاءته.",
          "correct": false
        },
        {
          "text": "مدير ضمان الجودة (QA) مسؤول عن اقتراح تدابير لتحسين التسليم.",
          "correct": false
        },
        {
          "text": "الخبير المتخصص (SME) مسؤول عن الفهم العميق للمنصة ومتطلباتها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق ما على منتج جديد باستخدام نهج مسوّر. بعد سباق السرعة الثالث لاحظوا أن احتياجات السوق قد تتغير، وأن المنتج قد لا يناسب احتياجات السوق الجديدة.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مسح السوق لمعرفة التأثيرات المحتملة على المشروع.",
          "correct": true
        },
        {
          "text": "تغيير نطاق المنتج لتلبية الاحتياجات الجديدة.",
          "correct": false
        },
        {
          "text": "وضع اللمسات الأخيرة على المنتج في الوقت المحدد والميزانية المحددة لإطلاقه كما هو مخطط له",
          "correct": false
        },
        {
          "text": "مراجعة الأعمال المتراكمة لمعرفة تأثير الاحتياجات الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أي مشروع، هناك صاحب مصلحة لا يرى أي فائدة للمشروع. في بعض الأحيان يستخدم صاحب المصلحة السياسة لوضع عقبات تحول دون إتمام المشروع بنجاح.\nما هي شخصية هذا النوع من أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الرواقية",
          "correct": true
        },
        {
          "text": "محايد",
          "correct": false
        },
        {
          "text": "البطل",
          "correct": false
        },
        {
          "text": "الخصم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجري تطوير نظام جديد ليحل محل العملية اليدوية الحالية. وخلال أحد العروض التجريبية، أعرب أصحاب المصلحة في مجال الأعمال عن قلقهم من أنهم لن يكتسبوا أي قيمة من استخدام هذا النظام.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش ذلك مع مدير المنتج وحدد قصص المستخدمين الجديدة لمعالجة مخاوف العمل.",
          "correct": true
        },
        {
          "text": "عقد اجتماع اللجنة التوجيهية لتحديد عوامل النجاح الحاسمة للمشروع.",
          "correct": false
        },
        {
          "text": "إنشاء خطة إدارة فوائد المشروع ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة مقاييس الأداء مع أصحاب المصلحة لضمان تحقيق النظام للمقاييس المتفق عليها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق منتشر جغرافياً مشروعاً بنجاح. ويريد مدير المشروع الحصول بسرعة على ملاحظات الفريق لإجراء تحليل إحصائي.\nما هي الطريقة التي يجب أن يستخدمها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مؤتمر بالفيديو",
          "correct": true
        },
        {
          "text": "مجموعة التركيز",
          "correct": false
        },
        {
          "text": "الاستبيانات",
          "correct": false
        },
        {
          "text": "البريد الإلكتروني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة دولية بتطبيق تقنية مبتكرة في أحد مصانعها الإنتاجية. وقد أظهرت هذه التكنولوجيا بالفعل عوائد إيجابية في موقع آخر.\nما الذي يجب أن يعتبره مدير المشروع جانباً رئيسياً في التنفيذ الناجح لهذه التقنية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم حالة العمل للتأكد من أن العائد على الاستثمار (ROI) يلبي أو يتجاوز مؤشرات أداء الموقع الأول.",
          "correct": true
        },
        {
          "text": "استشر مدير التكنولوجيا للتأكد من أن التكنولوجيا يمكن أن تتناسب مع الموقع الجديد.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل لتبادل المعلومات لعرض التقنية الجديدة وفوائدها على أصحاب المصلحة في الموقع الجديد.",
          "correct": false
        },
        {
          "text": "وضع ميثاق المشروع للتنفيذ في الموقع الجديد باستخدام الدروس المستفادة من الموقع الأول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استحوذت شركة كبرى على شركة ناشئة في مراحلها الأولى. وفي ضوء هذا السيناريو الجديد، طُلب من مدير المشروع مراجعة خارطة طريق المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد تعريف القيمة مع أصحاب المصلحة وإعادة ترتيب أولويات المشروع المتراكمة وفقًا لذلك.",
          "correct": true
        },
        {
          "text": "إعادة ترتيب أولويات المشروع المتراكمة من خلال تحديد أولويات تلك الميزات التي تزيد من العائد على الاستثمار (ROI).",
          "correct": false
        },
        {
          "text": "إعادة ترتيب أولويات خارطة الطريق من خلال التركيز على الفوائد طويلة الأجل وتقليل الديون التقنية.",
          "correct": false
        },
        {
          "text": "إطلاق استطلاع رأي العملاء لتقييم ميزات المشروع الرئيسية بشكل أفضل قبل إعادة ترتيب أولويات خارطة الطريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل فريق للعمل على مشروع عالمي، يدعو قائد المشروع إلى عقد اجتماع لكسر الجليد بين أعضاء الفريق المتنوعين.\nما الذي يجب أن يفعله مدير المشروع لتحفيز الفريق على التعبير عن توقعاته؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من أعضاء الفريق كتابة توقعاتهم على الملاحظات البريدية",
          "correct": true
        },
        {
          "text": "اطرح أسئلة مباشرة على كل عضو من أعضاء الفريق وانتظر إجاباتهم",
          "correct": false
        },
        {
          "text": "إطلاع أعضاء الفريق على حوافز نجاح المشروع",
          "correct": false
        },
        {
          "text": "ابدأ بإجراء تقييم ذاتي للفريق لزيادة استقلالية الفريق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تقييم إدارة المشروع، وبعد إنفاق 40% من ميزانية المشروع المعتمدة، وافقت الإدارة على توصية مراجع الحسابات بإنهاء المشروع\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "حساب القيمة النقدية المتوقعة للمشروع وتوثيقها في الدروس المستفادة",
          "correct": true
        },
        {
          "text": "الاستعانة بخبير استشاري مستقل لتبرير استمرار المشروع.",
          "correct": false
        },
        {
          "text": "بدء عملية إغلاق المشروع وتوثيق الدروس المستفادة للرجوع إليها في المستقبل.",
          "correct": false
        },
        {
          "text": "إعداد تقرير مالي للاعتراف بالتكاليف الفعلية المنفقة كتكاليف غارقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يدير مشروعًا مختلطًا باتفاقية وقت محدد وسعر محدد. ويواجه مدير المشروع صعوبة في جعل الفريق يقدم الجداول الزمنية الخاصة به. وتشير الملاحظات الواردة من الفريق إلى أن العمل سيتم تسليمه كل أسبوعين، وبالتالي لا حاجة إلى تقديم جداول زمنية ومع ذلك، يحتاج مدير المشروع إلى الجداول الزمنية لاستكمال تقييم تكلفة المشروع.\nما الذي يجب على مدير المشروع القيام به لضمان تقديم جميع أعضاء الفريق لجداولهم الزمنية على النحو المطلوب؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من مكتب إدارة المشروع (PMO) التأكد من تقديم الفريق لكشوف الوقت الخاصة بهم.",
          "correct": true
        },
        {
          "text": "أرسل تذكيرًا أسبوعيًا إلى كل عضو من أعضاء الفريق لإخطارهم بتقديم كشوف الوقت الخاصة بهم.",
          "correct": false
        },
        {
          "text": "شرح تأثير عدم تقديم الجداول الزمنية على تقييم تكلفة المشروع.",
          "correct": false
        },
        {
          "text": "تغيير وتيرة تقديم كشوف الوقت من كل أسبوعين إلى أسبوعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء تطوير أحد المشاريع، لاحظ مدير المشروع أن النتائج ليست جيدة كما هو متوقعأي أداة أو وثيقة توضح العناصر التي تؤثر على المقاييس الرئيسية؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط باريتو",
          "correct": true
        },
        {
          "text": "مخطط التشغيل",
          "correct": false
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "سجل المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nما هو الهدف الرئيسي لأسلوب القيادة الحالم؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعم الفريق في التنظيم الذاتي وتقرير رؤية مشتركة.",
          "correct": true
        },
        {
          "text": "دعم اعتماد أحدث التقنيات والممارسات.",
          "correct": false
        },
        {
          "text": "توفير التوجيه طويل الأجل وإشراك الفريق لتقديمه.",
          "correct": false
        },
        {
          "text": "تحديد الأولويات وتعيين المهام التي تتماشى مع الرؤية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع يحتوي على مكوّن باستخدام تقنية أجايل. يطلب راعي المشروع من مدير المشروع إضافة مكوّن جديد إلى هذا المشروع وهو مكوّن منظم من قبل الحكومة بقواعد ضريبية معقدة جديدة مع توفير الوقت الكافي لتنفيذ هذه القواعد. يقترح الراعي تنفيذ هذا المكوّن الجديد باستخدام نهج غير رشيق تنبؤي بسبب تعقيده.\nما هي المنهجية التي سيستخدمها مدير المشروع لهذا المكون الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "أبلغ راعي المشروع بأنك ستدير المكوّن الجديد باستخدام منهجية أجايل لأن أجايل تدعم منهجية \"مقاس واحد يناسب الجميع\".",
          "correct": true
        },
        {
          "text": "استخدم النهج الهجين من خلال الاستمرار في إدارة المكوّن الحالي باستخدام الرشيق، والمكوّن الجديد باستخدام التنبؤي.",
          "correct": false
        },
        {
          "text": "إدارة المكون الحالي وكذلك المكون الجديد باستخدام نهج قائم على الخطة التنبؤية.",
          "correct": false
        },
        {
          "text": "اطلب التوجيه من راعي المشروع بشأن المنهجية الأنسب للمكون الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم أحد أصحاب المصلحة العدوانيين وذوي التأثير المنخفض بتعطيل اجتماع استهلالي من خلال الشكوى من الانتهاكات الإجرائية في المشاريع السابقة. يكشف بحث مدير المشروع أن الانتهاكات لم يكن لها تأثير كبير.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطبيق منهجية حل النزاعات بالانسحاب/التجنب",
          "correct": true
        },
        {
          "text": "تطبيق منهجية حل النزاعات بشكل سلس/ملائم",
          "correct": false
        },
        {
          "text": "تطبيق منهجية حل النزاعات بالقوة/المباشرة",
          "correct": false
        },
        {
          "text": "تطبيق منهجية الحل الوسط/إعادة التسوية/إعادة التوفيق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ الشركة في تطبيق برنامج Scrum. في منتصف الطريق تقريبًا خلال السباق الأول، تظهر مشاكل في التواصل. بعض أعضاء فريق المشروع ليسوا متزامنين مع أعضاء الفريق الآخرين.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تثقيف الفريق حول أهمية التواصل في Scrum.",
          "correct": true
        },
        {
          "text": "وضع مبادئ توجيهية واضحة للتواصل.",
          "correct": false
        },
        {
          "text": "تحديد السبب الجذري لمشاكل التواصل.",
          "correct": false
        },
        {
          "text": "مراقبة تواصل الفريق وتقديم الملاحظات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على تطبيق تنظيمي له مدة محددة للتسليم. ويستخدم الفريق نهجًا مختلطًا وقسّم عملية التطوير إلى ثلاثة سباقات سريعة. لم تسفر أول مرحلتين من سباقات السرعة عن النتائج المطلوبة بسبب التأخير من الوحدات الوظيفية. يشعر المدير المالي بالاضطراب بسبب العقوبات الوشيكة في حال عدم اكتمال التطبيق، كما أن فريق المشروع محبط\nمن المسؤول عن إلهام فريق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مالك المنتج",
          "correct": true
        },
        {
          "text": "المدير المالي",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مدير المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم نشر قاعدة بيانات جديدة للعلاقات مع العملاءيستدعي الجدول الزمني للانتقال من النظام السابق على مدار أسبوع واحد ومع ذلك، يعتقد بعض أصحاب المصلحة الرئيسيين أن الأمر قد يستغرق وقتًا أطول للانتقال.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتقييم المخاوف والمخاطر المترتبة على عدم النشر ضمن الإطار الزمني المقرر والتصرف وفقًا لذلك.",
          "correct": true
        },
        {
          "text": "تغيير خطة النشر بحيث تتوفر موارد إضافية لتنفيذ النشر في عطلة نهاية الأسبوع.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المخاطر وتنقيحها حسب الضرورة",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني لزيادة الإطار الزمني لخطة النشر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء إجراء عملية تحليل نوعي لمخاطر المشروع، يجد مدير المشروع أن المنتج يفتقد إلى \"تعريف المنجز\". ما نوع هذه المخاطرة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المخاطر التجارية",
          "correct": true
        },
        {
          "text": "المخاطر الخارجية",
          "correct": false
        },
        {
          "text": "مخاطر الإدارة",
          "correct": false
        },
        {
          "text": "المخاطر التقنية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يطلب العميل إجراء تغيير كبير في النطاق بسبب تغيير في بيئة السوق، مما سيضيف بشكل كبير إلى تكلفة المشروع. تتم الموافقة على هذا التغيير من خلال عملية مراقبة التغيير.\nما الذي يجب أن يفعله مدير المشروع لوضع المشروع على المسار الصحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة تقييم خط الأساس للنطاق وتأثيره على أهداف المشروع.",
          "correct": true
        },
        {
          "text": "استخدم احتياطي الإدارة لحساب عدم اليقين في الجدول الزمني.",
          "correct": false
        },
        {
          "text": "مراقبة المخاطر لضمان فعالية عملية إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "إعادة تقييم خطة إدارة التكاليف لمعالجة أثر التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين مدير مشروع لمشروع تحديث نظام قديم. تم ترسيخ خطة إدارة المشروع وتم تسليم المتطلبات إلى قسم تكنولوجيا المعلومات لتطويرها. ومع ذلك، يعلن الرئيس التنفيذي للشركة عن التوجه الاستراتيجي الجديد للشركة والخطط القادمة لتطبيق تخطيط موارد المؤسسة (ERP).\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من راعي المشروع توصيات لإبقاء المشروع على المسار الصحيح.",
          "correct": true
        },
        {
          "text": "فهم وتوضيح كيفية توافق المشروع الحالي مع الرؤية الشاملة للمؤسسة.",
          "correct": false
        },
        {
          "text": "عقد اجتماع لفريق المشروع لتخطيط وتأكيد تخصيصات الموارد للمشروع الجديد.",
          "correct": false
        },
        {
          "text": "راجع الجدول الزمني للمشروع للتأكد من اكتمال المشروع في الوقت المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مشروع معقد بدأ منذ ثمانية أشهر. ويمتلك مدير المشروع فريق عمل عالي الجودة يعمل بجدية وحماس ونجاح.\nما نوع الإدارة والقيادة التي يجب أن يستخدمها مدير المشروع في هذه المرحلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمكينهم من تحسين النتائج",
          "correct": true
        },
        {
          "text": "الدعم مع التكرارات الدورية والتغذية الراجعة",
          "correct": false
        },
        {
          "text": "المساعدة في حل النزاعات",
          "correct": false
        },
        {
          "text": "التغذية الراجعة أو التدريب أو المساعدة فقط عندما يطلبون ذلك",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء تنفيذ مرحلة تكرارية حرجة من مشروع ما، أصبحت مشكلة تم تحديدها سابقًا كمشكلة خطرة، مشكلة مؤكدة، مما أدى إلى توقف التقدم. بعد إدخال العنصر الجديد في سجل المشكلة، ماذا ينبغي لمدير المشروع أن يفعل بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة الاتصالات وإشراك أصحاب المصلحة في الحل كلما لزم الأمر.",
          "correct": true
        },
        {
          "text": "تغيير خطة إدارة الاتصالات وإسناد ملكيتها إلى أحد أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "قم بتصعيد المشكلة داخل الفريق خلال الاجتماع التالي لاستعراض المشروع بأثر رجعي.",
          "correct": false
        },
        {
          "text": "أضف المشكلة إلى قائمة المنتجات المتراكمة لجعلها في بؤرة التركيز خلال السباق الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تلقى مدير المشروع بريدًا إلكترونيًا من المصنع بشأن المعدات الرئيسية التي لن يتم تسليمها كما هو مخطط لهايجب على مدير المشروع إجراء ترتيبات بديلة مع بائعين آخرين لتنفيذ إصلاح مؤقت.\nمن المسؤول عن تأكيد توافر الموارد اللازمة للإصلاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "مزود الخدمة",
          "correct": true
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم عضو جديد إلى المشروع أثناء مرحلة التنفيذ. يتطلب العمل تعاوناً قوياً مع أعضاء الفريق الآخرين.\nما الذي يجب أن يفعله مدير المشروع لتعزيز بيئة تعاونية؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل رسالة بريد إلكتروني إلى فريق المشروع تطلب منهم التعاون مع عضو الفريق الجديد.",
          "correct": true
        },
        {
          "text": "شارك جميع المعلومات المتاحة وخصص وقتاً لشرح العمل الجاري بالتفصيل.",
          "correct": false
        },
        {
          "text": "اطلب من كل عضو وصف اهتماماته وخبراته في اجتماع الفريق القادم.",
          "correct": false
        },
        {
          "text": "نظّم ورشة عمل لمدة يوم واحد مع الفريق بأكمله لإطلاع العضو الجديد على آخر المستجدات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نفذت إحدى الشركات مشروع تحول كبير لإعداد نفسها للاقتصاد المتغير. وأثناء تنفيذ مشروع التحول، ظهرت تكنولوجيا جديدة لم تكن متوقعة في خطة إدارة المخاطر.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتصعيد الأمر إلى قسم تكنولوجيا المعلومات وتنظيم تدريب لأعضاء الفريق المتأثرين.",
          "correct": true
        },
        {
          "text": "إعادة النظر في خطة إدارة المشتريات وتحديد العقود المتأثرة لعمليات الشراء القادمة.",
          "correct": false
        },
        {
          "text": "إعادة النظر في خطة إدارة المخاطر وتطبيق عملية تخطيط مخاطر المشروع.",
          "correct": false
        },
        {
          "text": "قم بتصعيد المشكلة إلى اللجنة التوجيهية التالية وتيسير عقد اجتماع عصف ذهني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أظهر أحد أصحاب المصلحة الرئيسيين في المشروع اهتمامًا في بداية مشروع رشيق معقد، لكنه أصبح أقل مشاركة مع تقدم السباق السريع بسبب المسؤوليات الإضافية. وبعد مرور بضعة سباقات، رفض صاحب المصلحة الرئيسي أحد نواتج المشروع. يقوم الفريق بإعادة صياغة الناتج المرفوض للسباق التالي.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "توثيق رؤية المشروع وأهدافه.",
          "correct": true
        },
        {
          "text": "تحليل التغيرات في سمات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة الرئيسيين في عملية صنع القرار.",
          "correct": false
        },
        {
          "text": "اتصالات مخصصة لأصحاب المصلحة بناءً على احتياجات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل الفريق للعمل على مشروع عالمي مع عمليات تسليم تدريجية، شارك قائد المشروع خطة قياس الأداء مع الفريق. لم يعجب أعضاء الفريق بالخطة المقترحة، حيث أعربوا عن عدم واقعيتها\nما الذي يجب على قائد المشروع القيام به لضمان مشاركة أعضاء الفريق في تنفيذ خطة إدارة الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من أعضاء الفريق الالتزام بالخطة، وإلا فلن يتم تقييمهم بشكل صحيح",
          "correct": true
        },
        {
          "text": "تضمين التقييمات الذاتية في بداية المشروع ومنتصفه ونهايته لزيادة استقلالية الفريق.",
          "correct": false
        },
        {
          "text": "اطلب من فريق الموارد البشرية تقديم عرض تقديمي حول مقاييس أداء الشركة.",
          "correct": false
        },
        {
          "text": "تحدث إلى عضو الفريق على أساس فردي لإقناعه بفوائد الخطة المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع هجين (تنبؤي-مرن). أثناء اجتماع الاستعداد، يذكر أحد أعضاء الفريق أنه بسبب الخبرة في مشروع سابق، يعتقد أن أحد المخرجات القادمة قد يحتاج إلى الامتثال للوائح الحكومية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتصعيد المشكلة إلى مكتب إدارة المشروع (PMO) حتى يتمكنوا من تحديد ما إذا كان هناك حاجة إلى أي امتثال",
          "correct": true
        },
        {
          "text": "أوقف المشروع حتى يتم التأكد من خضوع المنجز لأي لوائح.",
          "correct": false
        },
        {
          "text": "مراجعة الدروس المستفادة من المشروع السابق لتحديد ما إذا كان هناك حاجة إلى أي امتثال",
          "correct": false
        },
        {
          "text": "قم بإزالة المهمة من المسار الحرج وتعيين المورد للعمل على متطلب آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع على مشروع معقد يكون فيه أحد البائعين مسؤولاً عن تسليم عدة مكونات أساسية. يقع مدير المشروع وفريق البائع في منطقتين زمنيتين مختلفتين، وقد أصبح هذا الاختلاف في التوقيت تحدياً كبيراً، مما يؤدي إلى مشاكل في الإنتاجية داخل المشروع. غالبًا ما يواجه أعضاء الفريق من كلا الجانبين صعوبة في تنسيق الاجتماعات ومشاركة التحديثات والتواصل بفعالية بسبب تباين المناطق الزمنية.\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "راقب الجدول الزمني للمشروع عن كثب واتخذ الإجراءات اللازمة في حالة حدوث خطأ في المراحل الرئيسية",
          "correct": true
        },
        {
          "text": "اطلب من كلا الفريقين تغيير ساعات عملهما إلى منطقة زمنية مشتركة.",
          "correct": false
        },
        {
          "text": "ابحث عن مساحة مشتركة وانقل فريق البائعين مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "قم بإنهاء الارتباط وابحث عن بائع جديد في المنطقة الزمنية المحلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تكليف مدير مشروع بمشروع يضمن امتثال المؤسسة للتشريعات الجديدة من الناحية التنظيمية. في أي مرحلة من مراحل المشروع ينبغي لمدير المشروع أن يوثق أهداف الامتثال؟",
      "explanation": "",
      "choices": [
        {
          "text": "مرحلة البدء",
          "correct": true
        },
        {
          "text": "مرحلة التخطيط",
          "correct": false
        },
        {
          "text": "مرحلة التنفيذ",
          "correct": false
        },
        {
          "text": "مرحلة الإغلاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كان مشروع تطوير برمجيات هام قيد التطوير خلال سباقات السرعة الستة الماضية. وقد تم إجراء عرض توضيحي لأصحاب المصلحة قبل يومين من السباق النهائي، حيث أعرب أحد أصحاب المصلحة الجدد عن أن المنتج لن يلبي توقعات السوق.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش الأمر مع راعي المشروع وأصحاب المصلحة الجدد واطلب منهم إصلاح المشكلة المتوقعة.",
          "correct": true
        },
        {
          "text": "مراجعة نطاق وخطة المشروع مع صاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "مراجعة قائمة المهام المطلوبة مع فريق التطوير وأصحاب المصلحة الجدد.",
          "correct": false
        },
        {
          "text": "اتباع خطة إدارة التغيير ومراجعة النطاق والخطة بناءً على طلب أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيضغط أحد كبار أصحاب المصلحة في مجال الأعمال الذي يتمتع بسنوات عديدة من الخبرة على فريق العمل الرشيق لتسليم معظم الوظائف الموعودة للعميل بعد 8 أشهر في المستقبل بدلاً من عمليات التسليم التدريجية المتعددة على مدار الأشهر الثمانية. ما الذي يجب أن يفعله قائد المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "اعمل مع فريق أجايل لجدولة عمليات التسليم التدريجية لتمكين تسليم قيمة الأعمال في وقت أقرب إلى العميل.",
          "correct": true
        },
        {
          "text": "جدولة اجتماعات مع العميل لتحديد قدرته على دعم عمليات التسليم الإضافية المتعددة.",
          "correct": false
        },
        {
          "text": "تقديم تفاصيل عن المشكلة إلى فريق أجايل وتعديل أهدافهم وخطط الإصدار لتتوافق مع طلب أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "اعمل مع أصحاب المصلحة لفهم ما هي المخاوف وفي الوقت نفسه نقل فوائد عمليات التسليم التدريجية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع مع أصحاب المصلحة الداخليين فقط وتم تحذيره من قبل راعي المشروع بأن بعض أصحاب المصلحة يحتاجون إلى اهتمام خاص. المنظمة هرمية للغاية.\nأي من النماذج التالية يجب استخدامه في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "شبكة الطاقة-الفائدة",
          "correct": true
        },
        {
          "text": "شبكة تأثير الطاقة-التأثير",
          "correct": false
        },
        {
          "text": "شبكة المصالح-التأثير",
          "correct": false
        },
        {
          "text": "شبكة الفائدة-التأثير",
          "correct": false
        }
      ]
    }
  ]
}
