{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "سؤال\nمشروع تجريبي على وشك الانتهاء ويريد فريق المشروع تسجيل التحديات التي تم التغلب عليها والفرص المتاحة للعمل المستقبلي. أين سيوثقون هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديثات أصول العملية التنظيمية",
          "correct": true
        },
        {
          "text": "تقرير أداء العمل",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "سجل الدروس المستفادة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تقني معقد في مرحلة التنفيذ. تتم إضافة تقنيات جديدة إلى الأعمال المتراكمة بناءً على متطلبات العملاء، مما ينطوي على تغييرات كبيرة في النواتج.\nما الذي يجب أن يفعله مدير المشروع لإرضاء العميل؟",
      "explanation": "",
      "choices": [
        {
          "text": "أعد تخطيط سباقات السرعة والإصدارات لتلبية كل توقعات العميل.",
          "correct": true
        },
        {
          "text": "إدارة توقعات العملاء بناءً على احتياجات أعمال المؤسسة.",
          "correct": false
        },
        {
          "text": "قبول المتطلبات الجديدة، وجدولة الاجتماعات للتخطيط لجدول زمني جديد للإصدار.",
          "correct": false
        },
        {
          "text": "دفع فريق المشروع إلى زيادة المرونة وقبول التحدي الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتعد إدارة الجودة جانبًا حيويًا في أي مشروع. أي من جوانب مراقبة الجودة التالية هو أحد مكونات نظام القياس العالي الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "الدقة",
          "correct": true
        },
        {
          "text": "عدم الدقة",
          "correct": false
        },
        {
          "text": "عدم التكرار",
          "correct": false
        },
        {
          "text": "المدة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء تنفيذ المشروع، ارتكب أحد أعضاء الفريق خطأً أدى إلى تأخير الجدول الزمني للمشروع لمدة أسبوع. ما الذي ينبغي لمدير المشروع أن يفعله فيما يتعلق بهذا الخطأ والتأخير؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش المشكلة مع الفريق، وابحث عن حلول لها، واعرض المساعدة والدعم للفريق.",
          "correct": true
        },
        {
          "text": "تأكد من فهم تأثير هذا الخطأ من قبل عضو الفريق الذي ارتكب الخطأ.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا للتأكد من عدم حدوث خطأ مماثل مرة أخرى.",
          "correct": false
        },
        {
          "text": "ابحث عن حل، وقم بإيصاله إلى الفريق، وعزز أنه يجب تنفيذه الآن.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتألف فريق المشروع الافتراضي من أعضاء من مختلف البلدان مع وجود اختلافات ثقافية. ويشعر مدير المشروع بالقلق من أن الاختلافات الثقافية قد تؤدي إلى سوء التواصل والنزاع.\nما الذي يجب على مدير المشروع القيام به للتخفيف من حدة النزاعات المحتملة بشكل فعال؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتحديد القواعد الأساسية الخاصة بالمشروع بشكل تعاوني وتعميمها.",
          "correct": true
        },
        {
          "text": "اشتراط أن تكون جميع الاتصالات داخل فريق المشروع في شكل مكتوب.",
          "correct": false
        },
        {
          "text": "تعيين العضو الأقدم في فريق إحدى الدول للعمل كمحكم في حالة نشوب نزاع.",
          "correct": false
        },
        {
          "text": "اتخاذ جميع قرارات حل النزاعات ثم إبلاغ الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تعتبر مساهمة أصحاب المصلحة الرئيسيين ضرورية لنجاح المشروع. ومع ذلك، فإن أصحاب المصلحة يتأخرون دائماً في اتخاذ القرارات الحاسمة للمشروع.\nما الذي يمكن لمدير المشروع فعله لإعادة إشراك أصحاب المصلحة هؤلاء؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتمع مع صاحب المصلحة لفهم سبب التأخير.",
          "correct": true
        },
        {
          "text": "إزالة صاحب المصلحة من المشروع.",
          "correct": false
        },
        {
          "text": "أطلع اللجنة التوجيهية على تأخيرات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إضافة تأخير صاحب المصلحة إلى سجل المشكلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ الفريق قائد المشروع أنهم ليسوا متأكدين من احتياجات أصحاب المصلحة، على الرغم من جهود جمع المتطلبات المتعددة والمشاركة في اجتماعات الحالة.\nكيف ينبغي لمدير المشروع التعامل مع هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الطلب من الفريق العمل مع أصحاب المصلحة لتحليل متطلباتهم التفصيلية والتوقيع على المواصفات",
          "correct": true
        },
        {
          "text": "ناقش مع الفريق خيار إلغاء المشروع نظرًا لأن المخاطرة كبيرة جدًا بحيث لا يمكن الاستمرار فيه",
          "correct": false
        },
        {
          "text": "اطلب من الفريق كتابة مجموعة من قصص المستخدمين لالتقاط الاحتياجات وتحديد الأولويات وإدارة القصص",
          "correct": false
        },
        {
          "text": "توثيق ما يعتقد الفريق أن أصحاب المصلحة يحتاجون إليه، وعرضه على أصحاب المصلحة، وطلب ملاحظاتهم لمشاركتها مع الفريق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال أحد الاجتماعات اليومية، أثار فريق المشروع مشكلة تتمثل في أن أحد خبراء الموضوع في مجال الأعمال يغير تعريف \"تم\" بشكل متكرر، وأعربوا عن خشيتهم من أن يكون ذلك علامة على عدم الثقة. ما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تذكير الفريق بالتركيز على عملهم، والالتزام بالتحدث مع الشركة الصغيرة والمتوسطة",
          "correct": true
        },
        {
          "text": "قم بتذكير مالك المنتج بدعم الفريق والتحدث مع الشركة الصغيرة والمتوسطة",
          "correct": false
        },
        {
          "text": "تذكير الشركة الصغيرة والمتوسطة بالحفاظ على تعريف الإنجاز الذي تم الاتفاق عليه في البداية",
          "correct": false
        },
        {
          "text": "ذكّر الفريق بأن التغذية الراجعة المستمرة مهمة للنجاح",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nمدير مشروع يدير مشروعًا سأل راعيه عن سبب تطوير بعض مكونات المشروع داخليًا. أين يمكن العثور على هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "في خطة إدارة المشتريات، تحت بند قرارات البناء مقابل الشراء",
          "correct": true
        },
        {
          "text": "في ميثاق المشروع، ضمن قسم الافتراضات والقيود",
          "correct": false
        },
        {
          "text": "في وثيقة البنية التقنية، تحت حدود الحل، تحت حدود الحل",
          "correct": false
        },
        {
          "text": "في وثيقة بنية الحل، تحت الغرض من المشروع ومبرراته",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ مدير المشروع أن المشروع متأخر عن الجدول الزمني بسبب تأخر تسليم المواديبلغ فريق المشتريات مدير المشروع أن القواعد الجديدة التي فرضتها الحكومة لشراء هذه المواد هي السبب في هذا التأخير.\nفي أي خطة يجب توثيق هذه القواعد الجديدة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة المشتريات",
          "correct": true
        },
        {
          "text": "إدارة الاتصالات",
          "correct": false
        },
        {
          "text": "مشاركة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "إدارة الجداول الزمنية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتوي المشروع المعقد على مشاركين متعددين. ويتفق مدير المشروع مع الفريق على ضرورة فهم أفضل لوجهة نظر جميع المشاركين في المشروع لتحقيق النجاح الأمثل للمشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة تحليل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "وضع خطة تواصل.",
          "correct": false
        },
        {
          "text": "إجراء تحليل SWOT.",
          "correct": false
        },
        {
          "text": "إجراء تحليل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأصبحت بيئة العمل غير مستقرة بسبب قيام أحد أصحاب المصلحة بتغيير مخرجات المشروع ونتائجه في منتصف مرحلة التنفيذ. ومع أخذ صاحب المصلحة في الاعتبار، كيف ينبغي لمدير المشروع أن يضمن تحقيق فوائد المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من موافقة فريق المشروع على خطة إدارة المشروع وتزويد أصحاب المصلحة بتحديثات مستمرة.",
          "correct": true
        },
        {
          "text": "الجمع بين النهجين الرشيق والتنبؤي وإدارة التغييرات في النطاق العام بأقل قدر من الانحرافات.",
          "correct": false
        },
        {
          "text": "تأكد من أن مخرجات المشروع وأهدافه مصممة خصيصاً لتلبية المتطلبات الأولية.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة على أساس مستوى التأثير والتأكد من تسجيل متطلباتهم بشكل كافٍ وفقًا لعملية إدارة التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنظمة المكافآت\nكان أداء الإصدار الأول الذي تم تسليمه إلى فريق مراقبة الجودة ضعيفًا، ويشكو المختبرون من عدم قدرتهم على إكمال جميع حالات الاختبار كما هو مخطط له ما هي الأداة التي تساعد على مراقبة الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "رسم بياني للتشغيل",
          "correct": true
        },
        {
          "text": "مخطط تدفق البيانات",
          "correct": false
        },
        {
          "text": "مخطط التدفق",
          "correct": false
        },
        {
          "text": "مخطط غير متحكم فيه",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروع معالجة مياه الصرف الصحي لمصنع. أثناء تنفيذ المشروع، أصدرت الحكومة بشكل غير متوقع معايير جديدة لحماية البيئة أكثر صرامة من المعايير السابقة.\nلضمان الامتثال لهذه اللوائح المحدثة، ماذا ينبغي أن يكون مسار العمل الأولي لمدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع فريق المشروع لتقييم آثار اللوائح الحكومية الجديدة على متطلبات المشروع.",
          "correct": true
        },
        {
          "text": "راجع سجل المخاطر الخاص بالمشروع لتحديد ما إذا كان هذا التغيير قد تم توثيقه مسبقًا كمخاطر محتملة للمشروع.",
          "correct": false
        },
        {
          "text": "قم بصياغة طلب تغيير رسمي يوضح بالتفصيل التعديلات وتقديمه إلى مجلس مراقبة التغيير (CCB) لتقييمه.",
          "correct": false
        },
        {
          "text": "بدء مناقشات مع الوكالة الحكومية للتفاوض على جدول زمني منقح لاعتماد المعايير البيئية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال الاجتماع الاستعراضي، يُظهر أعضاء الفريق عدم ارتباطهم بالفريق، مشيرين إلى أنهم يكررون نفس الأفكار مرارًا وتكرارًا.\nكيف يمكن لمدير المشروع التعامل مع هذا الموقف على أفضل وجه؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من أعضاء الفريق إيلاء المزيد من الاهتمام للجلسة حتى لو كانوا يعتقدون أنهم يعرفون ما هو قادم.",
          "correct": true
        },
        {
          "text": "اطلب من أعضاء الفريق إبداء ملاحظاتهم حتى لو كانت مماثلة لملاحظات أعضاء الفريق الآخرين للتأكيد على نقاطهم.",
          "correct": false
        },
        {
          "text": "شجع أعضاء الفريق على تقديم ملاحظات أفضل لأنهم يعرفون الأسئلة بالفعل.",
          "correct": false
        },
        {
          "text": "شجع الفريق على تقديم أفكار لتحسين العملية ودعم التغييرات بناءً على الملاحظات التي يتلقاها",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مشروع لتطوير تطبيق برمجيات جديد سيستخدمه فريق مبيعات الشركة. ومن المتوقع أن يستغرق المشروع ستة أشهر لإكماله وتبلغ ميزانيته ٠٠٠ ٠٠٠ دوﻻر. قام مدير المشروع بتحديد أدوات تطوير البرمجيات والأجهزة والتدريب التي سيتم شراؤها\nما هو أهم شيء يجب على مدير المشروع القيام به أثناء وضع خطة المشتريات؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من شراء جميع الموارد في حدود الميزانية.",
          "correct": true
        },
        {
          "text": "تأكد من أن المشروع يسير وفق الجدول الزمني المحدد دون أي تأخير.",
          "correct": false
        },
        {
          "text": "التأكد من أن جميع الموارد المشتراة ذات جودة عالية.",
          "correct": false
        },
        {
          "text": "التأكد من شراء جميع الموارد في الموعد المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم مؤخراً بيع جزء كبير من شركة محلية إلى شركة دولية. وتفرض الشركة الأم الجديدة تطبيق لوائح الصحة والسلامة والبيئة (HSE) على جميع المشاريع في الشركة المحلية.\nما الذي يجب على مديري المشاريع القيام به للحفاظ على الامتثال؟",
      "explanation": "",
      "choices": [
        {
          "text": "انتظر حتى يقوم القسم الوظيفي المسؤول عن لوائح الصحة والسلامة والبيئة بالإبلاغ عن تغيير العملية.",
          "correct": true
        },
        {
          "text": "اطلب من القسم الوظيفي المسؤول عن لوائح الصحة والسلامة والبيئة تعيين عضو جديد في الفريق.",
          "correct": false
        },
        {
          "text": "تحدث مع الجهة الراعية للمشروع للحصول على توضيح حول لوائح الصحة والسلامة والبيئة الجديدة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق الصحة والسلامة والبيئة لفهم تأثير اللوائح الجديدة على المشاريع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيساعد مدير مشروع مؤسسته على الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الرشيقة. يسأل أحد أعضاء الفريق متى يجب القيام بأنشطة تحديد المتطلبات عالية المستوى وتصميم الحلول في منهجية رشيقة.\nكيف ينبغي لمدير المشروع الإجابة على هذا السؤال؟",
      "explanation": "",
      "choices": [
        {
          "text": "في نظام أجايل، يجب أن تبدأ هذه الأنشطة بمجرد تجميع فريق المشروع، ويفضل أن يكون ذلك في السباق الأول.",
          "correct": true
        },
        {
          "text": "في أجايل، يجب أن يخطط الفريق لتنفيذ بعض هذه الأنشطة كجزء من السباق السريع صفر قبل بدء التطوير.",
          "correct": false
        },
        {
          "text": "في أجايل، يجب على الفريق تجنب الهدر، لذلك يجب القيام بهذه الأنشطة كجزء من التطوير.",
          "correct": false
        },
        {
          "text": "في أجايل، يتبع الفريق استراتيجية اللحظة الأخيرة المسؤولة ويجب أن يؤجل تلك الأنشطة قدر الإمكان.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع بمشروع لتنفيذ نظام إدارة سلامة الأصول. وقد أشار راعي الأعمال التنفيذي إلى أنه من المتوقع أن يحسن النظام جودة العمليات ويطيل العمر الافتراضي للأصول.\nما الذي يجب أن يفعله مدير المشروع لإثبات قيمة العمل بمجرد دخول النظام مرحلة الإنتاج؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع معايير النجاح الحرجة، والوفورات المحتملة في التكاليف، ومقاييس الأداء المستمرة للمشروع.",
          "correct": true
        },
        {
          "text": "اكتب حالات الاختبار لتتماشى مع قيم العمل وتأكد من وضوح معايير القبول أثناء اختبار قبول المستخدم (UAT).",
          "correct": false
        },
        {
          "text": "تحقق من أن جميع المتطلبات ومعايير القبول تتماشى مع قيمة العمل وتوقعاته.",
          "correct": false
        },
        {
          "text": "التحقق من صحة العائد على الاستثمار (ROI)، ومراجعة أداء الأصول الحالي، واستخدامه كمعيار للقياسات المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع رشيق في التكرار الأخير. خلال الاجتماع اليومي، يدرك الفريق أنهم لن يكونوا قادرين على إكمال جميع الأنشطة التي تم التخطيط لها في هذا السباق. يضع أعضاء الفريق خطة طوارئ.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش خطة الطوارئ مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "ناقش خطة الطوارئ مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "ناقش خطة الطوارئ مع الجهة الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ خطة الطوارئ على الفور.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرر فريق مشروع في منتصف مشروع تسليم تدريجي أنه بحاجة إلى مساعدة خبير في الموضوع (SME) يعمل في قسم مختلف. فطلب فريق المشروع من الخبير الصغير والمتوسط الانضمام إلى فريقهم والمساعدة في مهمة محددة وأبلغوا قائد المشروع بهذا الإجراء.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من ميزانية المشروع وقم بتقييم أثر وجدوى إضافة مورد إضافي",
          "correct": true
        },
        {
          "text": "التحدث مع راعي المشروع والحصول على الموافقة، مع توضيح أن هذا المورد مهم وحاسم",
          "correct": false
        },
        {
          "text": "تحدث إلى المدير الوظيفي لهذا المورد المطلوب وتحقق من توفره ونطاقه الترددي",
          "correct": false
        },
        {
          "text": "تيسير تنسيق الموارد مع الموارد اللازمة بناءً على اتفاقية عمل الفرق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيقوم مدير مشروع بإنهاء مشروع ما ويطلب الراعي رؤى حول تحقيق الفوائد. كيف يمكن لمدير المشروع حساب قيمة نتائج المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم فوائد المشروع النوعية والكمية.",
          "correct": true
        },
        {
          "text": "قم بتسعير الفوائد الملموسة وقسمها على النفقات.",
          "correct": false
        },
        {
          "text": "إجراء تقييم مالي بأثر رجعي.",
          "correct": false
        },
        {
          "text": "تقييم النتائج ومقارنتها بالميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع استعراضي بأثر رجعي، أكد فريق المشروع أن جميع النواتج قد اكتملت وفقًا للمواصفات الواردة في المواصفات المتراكمة للمنتج. ومع ذلك، ازداد عدد الأخطاء التي تم العثور عليها أثناء الاختبار بشكل كبير.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع أخصائيي ضمان الجودة لتوضيح المشكلة والبحث عن حلول لها.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة المخاطر لتحديد استراتيجية التخفيف من المخاطر.",
          "correct": false
        },
        {
          "text": "إجراء تحليل مونت كارلو لتحديد السيناريوهات والإجراءات المحتملة.",
          "correct": false
        },
        {
          "text": "قم بتسجيل المخاطر في سجل المخاطر ورصدها أثناء التكرار التالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعاً رشيقاً. يشكو مالك المنتج من أن فريق المشروع يكمل باستمرار عددًا أقل من نقاط القصة مقارنة بفريق سكروم الذي يعمل على مشروع آخر.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق معالجة هذه المشكلة كجزء من الاستعراض بأثر رجعي لتحسين سرعته في السباق التالي.",
          "correct": true
        },
        {
          "text": "أخبر مالك المنتج أنه من غير الصحيح مقارنة السرعة بين الفرق لأن نقاط القصة خاصة بكل فريق.",
          "correct": false
        },
        {
          "text": "احصل على موافقة من مالك المنتج لإضافة مخزن مؤقت للطوارئ إلى سباق السرعة، وتغيير المدة لزيادة السرعة.",
          "correct": false
        },
        {
          "text": "تحمل المسؤولية الكاملة عن الأداء المتدني للفريق مقارنة بالفريق الآخر والاعتذار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بيئة العمل الرشيقة، يجب على قائد المشروع أن يفكر دائمًا في تخصيص وقت للمناقشات المفتوحة والحرة بين أعضاء الفريق حول كيفية تحسين أداء الفريق.\nما أهمية هذه الممارسة بالنسبة للفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب على الفرق اتخاذ إجراءات لزيادة الإنتاجية باستمرار",
          "correct": true
        },
        {
          "text": "يجب على الفرق أن تختبر باستمرار طرقاً جديدة للقيام بالأشياء",
          "correct": false
        },
        {
          "text": "يجب أن تسعى فرق العمل باستمرار إلى تحسين عملياتها",
          "correct": false
        },
        {
          "text": "يجب على الفرق أن تدفع أعضاءها باستمرار إلى العمل بجدية أكبر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقدمت مؤسسة تعليمية بشكوى بعد تقديم طلب شراء وحدة برمجيات من شركة تستخدم ممارسات رشيقة. وتدّعي الشكوى أن فوترة الدفع مقابل التسليم الجزئي تنتهك بيان أجايل إذا لم يشارك العميل في اجتماعات سير العمل.\nأي من القيم الأربع للبيان الرشيق تدعمها مطالبة العميل؟",
      "explanation": "",
      "choices": [
        {
          "text": "عمليات تحافظ على وتيرة ثابتة إلى أجل غير مسمى",
          "correct": true
        },
        {
          "text": "تسليم البرامج بشكل متكرر وفي فترات قصيرة",
          "correct": false
        },
        {
          "text": "تعاون العملاء على التفاوض على العقود",
          "correct": false
        },
        {
          "text": "برنامج العمل كمقياس أساسي للتقدم المحرز",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يسير مشروع الدعم التشغيلي بسلاسة، لكن العميل يشكو باستمرار من عدم وضوح الرؤية في جودة أعمال الدعم.\nكيف ينبغي لمدير المشروع معالجة مخاوف العميل هذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإعداد التقارير ذات الصلة، وأرسلها إلى العميل يوميًا، وانشرها في مجلد مشترك للمراجعة المستقبلية.",
          "correct": true
        },
        {
          "text": "اطلب من العميل تعيين مدير من منطقته لمراجعة الأنشطة اليومية والاتفاقيات التي تم التوصل إليها خلال جميع المناقشات.",
          "correct": false
        },
        {
          "text": "خطط لاجتماع حوكمة متكرر مع العميل لعرض التقدم المحرز ونشر البيانات في مجلد مشترك للمراجعة المستقبلية.",
          "correct": false
        },
        {
          "text": "أبلغ العميل أن أحد أعضاء الفريق سيشرف على تحديثها كل يوم بعد إجراء أهم المناقشات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nبعد إجراء مراجعة سنوية للموظفين، ومناقشة إدارة المشاريع ومعرفة المهارات الشخصية، اتخذت الشركة قراراً بتدريب جميع الموظفين لمواجهة التحديات الجديدة. ستكون طريقة تدريب جميع الموظفين على موقع إلكتروني تتوفر فيه جميع المحتويات والامتحانات والنماذج والأصول التنظيمية الأخرى.\nما هي الطريقة المستخدمة لأغراض التدريب؟",
      "explanation": "",
      "choices": [
        {
          "text": "اسحب",
          "correct": true
        },
        {
          "text": "ادفع",
          "correct": false
        },
        {
          "text": "تفاعلية",
          "correct": false
        },
        {
          "text": "العلاقات بين الأشخاص",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يعلم مدير المشروع أن المدير الوظيفي لأحد أعضاء الفريق يريد إبعاده من المشروع لأنه يعتقد أنه لا ينبغي له تنفيذ مهمة معينة بسبب تضارب الأولويات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من مصفوفة إسناد المسؤولية (RAM).",
          "correct": true
        },
        {
          "text": "تحقق من هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "تحقق من المخطط التنظيمي.",
          "correct": false
        },
        {
          "text": "تحقق من خطة إدارة الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتوجه أحد أعضاء الفريق إلى مدير المشروع مباشرة بعد انتهاء اجتماع المشروع بشأن حاجته إلى المساعدة لإكمال مهمة متأخرة عن موعدها.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجاهل طلب عضو الفريق، واطلب مضاعفة الجهود لإكمال المهمة",
          "correct": true
        },
        {
          "text": "ناقش المشكلة خلال الاجتماع اليومي، وقرر مسار العمل مع الفريق",
          "correct": false
        },
        {
          "text": "اطلب من عضو الفريق الخروج من المهمة وإعادة تخصيص المهمة لشخص آخر",
          "correct": false
        },
        {
          "text": "اطلب من أحد أعضاء الفريق المبتدئين المساعدة في إكمال المهمة في تاريخ الاستحقاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف عملية التسليم التدريجي للمشروع، وبسبب تغيير في التكنولوجيا، أبلغ أحد أعضاء الفريق قائد المشروع أنه بسبب نقص المعرفة في التكنولوجيا سيتأخر التسليم واقترح الاستعانة بمصادر خارجية.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ المستخدم النهائي بتأخير التسليم المحدد بسبب التقنية الجديدة",
          "correct": true
        },
        {
          "text": "ابحث عن خدمة الاستعانة بمصادر خارجية تتمتع بالخبرة المطلوبة",
          "correct": false
        },
        {
          "text": "إبلاغ الكفيل بالتأخير وطلب دعمه وموافقته",
          "correct": false
        },
        {
          "text": "مناقشة تأثير التكنولوجيا الجديدة مع الفريق واتخاذ قرار العمل بشكل مشترك",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد مع العديد من أصحاب المصلحة الذين لديهم أولويات متضاربة. وطلبت الإدارة العليا من مدير المشروع أن يتجنب \"الضجيج\" لأن هذا المشروع سياسي للغاية. اختار مدير المشروع الاستعانة بآراء خبراء من شخصيات معروفة في هذا المجال.\nماذا فعل مدير المشروع لتلبية طلب الإدارة العليا؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستجابة بطريقة ودية للإدارة العليا",
          "correct": true
        },
        {
          "text": "يبدو أنه كان متسقًا في استخدام الكلمات والأفعال",
          "correct": false
        },
        {
          "text": "التعاون مع الإدارة العليا لتحقيق الأهداف المشتركة",
          "correct": false
        },
        {
          "text": "اتخذ إجراءً بناءً على سلطة الإدارة العليا في التصرف",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع رشيق. ينضم إلى المشروع عضو جديد لم يسبق له العمل في فريق رشيق. يطلب العضو الجديد من مدير المشروع أن يشرح لمدير المشروع سبب استخدام النهج الرشيق\nماذا يجب أن تكون استجابة مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "لإزالة المخاطر وزيادة القدرة على التنبؤ والرؤية",
          "correct": true
        },
        {
          "text": "تقديم القيمة بشكل أسرع وتغيير النطاق بناءً على الملاحظات والتعليقات",
          "correct": false
        },
        {
          "text": "لتقليل التكاليف وزيادة جودة المخرجات النهائية",
          "correct": false
        },
        {
          "text": "الاستغناء عن الحاجة إلى التوثيق من خلال تقديم منتجات عاملة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "7\nتقوم مجموعة من أصحاب المصلحة في إحدى المؤسسات المالية بإجراء مراجعة لإغلاق المشروع. ويشعر بعض أصحاب المصلحة بالقلق من أن نواتج المشروع لا تفي بمعايير الإغلاق المحددة ما هو أول شيء ينبغي لمدير المشروع القيام به لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من أن الجهات المعنية تفي مخرجات المشروع بجميع معايير الإغلاق المحددة",
          "correct": true
        },
        {
          "text": "اقتراح تعديل معايير الإغلاق بحذف المعايير التي لم يتم استيفاؤها.",
          "correct": false
        },
        {
          "text": "اتخاذ تدابير تصحيحية من خلال تكييف معايير الإغلاق وتمديد الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "قم بإجراء تحليل شامل لتحديد سبب عدم استيفاء معايير الإغلاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع متمرس يدير مشروعًا رشيقًا بملايين الدولارات. يقوم مدير المشروع بإبلاغ الفريق بالقواعد الأساسية، ولكن بعد 12 تكرار، يبدأ مدير المشروع في ملاحظة أن بعض أعضاء الفريق لا يتبعون القواعد الأساسية.\nما الذي يجب على مدير المشروع القيام به أولاً لضمان التزام الفريق بالقواعد الأساسية؟",
      "explanation": "",
      "choices": [
        {
          "text": "اتصل بالموارد البشرية لطلب إرسال رسالة تحذير مكتوبة لأعضاء الفريق الذين لا يتبعون القواعد الأساسية.",
          "correct": true
        },
        {
          "text": "اطلب من المدير الوظيفي استبدال أعضاء الفريق الذين لا يتبعون القواعد الأساسية.",
          "correct": false
        },
        {
          "text": "حدد موعداً لعقد اجتماع مع فريق المشروع لتعزيز القواعد الأساسية.",
          "correct": false
        },
        {
          "text": "قم بإخطار راعي المشروع بهذا السلوك واطلب من الراعي اتخاذ إجراءات تأديبية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام أحد موردي المشروع بإبلاغ مدير المشروع بأن أحد نواتج المشروع التي تم الاستعانة بمصادر خارجية لإنجازها سيكون متاحًا بعد 6 أشهر من الجدول الزمني المتفق عليه للمشروع. وذكر البائع أنه يركز على نواتج المشروع الأخرى ذات الأولوية في التبعية، وأن هذا الناتج بالذات ليس له تبعيات معلنة.\nما الذي يجب أن يفعله مدير المشروع لتجنب التأخير في الجدول الزمني في المستقبل؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة التبعيات والاستجابة للتحديات.",
          "correct": true
        },
        {
          "text": "تأكد من انتهاء جميع التبعيات الجديدة لبدء التشغيل",
          "correct": false
        },
        {
          "text": "حدد أي تبعيات إذا كانت موجودة.",
          "correct": false
        },
        {
          "text": "عقد اجتماع لإبلاغ العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه مدير مشروع تأخيرًا في أحد المشاريع بسبب قرار اتخذه المدير الوظيفي بتقديم الدعم في الموقع لمشروع آخر دون استشارة الأطراف الأخرى المتأثرة بهذا القرار.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من تأثير التأخير على الجدول الزمني والتكلفة.",
          "correct": true
        },
        {
          "text": "شارك جدول العمل مع المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة للاتفاق على خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "أبلغ العميل بالتأخير وحدد موعدًا جديدًا للتسليم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكشف تقييم الأثر أن أحد النواتج يمكن أن يتأخر إنجازه لمدة أسبوعين. لم يكن أحد الموارد الرئيسية متاحاً للعمل في نشاط غير حاسم بسبب أولويات أخرى. وقد يتسبب ذلك في زيادة عبء العمل على الموارد الأخرى المتبقية.\nبما أن التكلفة هي العائق الرئيسي لهذا المشروع، ما الذي يجب أن يفعله مدير المشروع على الفور؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد ما إذا كانت المهمة لديها تعويم متاح للوفاء بتاريخ انتهاء المشروع.",
          "correct": true
        },
        {
          "text": "استئجار مورد مؤقت للقيام بالوظيفة",
          "correct": false
        },
        {
          "text": "استشارة الفريق وتقليل النطاق.",
          "correct": false
        },
        {
          "text": "تغيير تقويم الموارد لتجنب التأخيرات الكبيرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدرب أجايل بتقديم المشورة لمؤسسة برمجيات كبيرة كانت تستخدم منهجية الشلال وتخطط الآن للبدء في استخدام منهجية أجايل أو المنهجية الهجينة.\nما هو اقتراح مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستمرار في استخدام الشلال، لأن النظام الهجين لا يتناسب مع الهيكل التنظيمي.",
          "correct": true
        },
        {
          "text": "ابدأ بالأجايل ثم انتقل إلى الهجين، على الرغم من أن تطبيق الأجايل يستغرق وقتاً طويلاً.",
          "correct": false
        },
        {
          "text": "ابدأ باستخدام المنهجيات الهجينة لأن المعرفة بالشلال قابلة للنقل.",
          "correct": false
        },
        {
          "text": "البدء في استخدام المنهجية الهجينة، وهي المنهجية الأكثر ملاءمة لمؤسسات البرمجيات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم فريق المنتج نهج النماذج الأولية لتقديم مبادرة أعمال متعددة السنوات. يلاحظ مدير المشروع أن بعض قصص المستخدمين تستغرق وقتًا أطول في التسليم.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الجدول الزمني للمشروع وإعادة تخصيص الموارد.",
          "correct": true
        },
        {
          "text": "قم بإجراء استعراض بأثر رجعي مع الفريق لتحديد الاختناقات.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا للتدخل.",
          "correct": false
        },
        {
          "text": "قم بتعديل نطاق المشروع لإزالة قصص المستخدمين المتأخرة.",
          "correct": false
        }
      ]
    }
  ]
}
