{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع في الموقع (أ) مع فريق محلي، بينما يوجد المطورون في موقع بعيد آخر، ويوجد مقيّم الجودة في موقع بعيد آخر. يدرك مدير المشروع أن هذه المسافات تعني أن الفريق قد يعاني من التأخير عند الحاجة إلى التواصل.\nما الذي يمكن أن يفعله مدير المشروع للتخفيف من حدة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة عدد جلسات الوقوف في اليوم الواحد.",
          "correct": true
        },
        {
          "text": "استعن بأعضاء الفريق الجدد محلياً.",
          "correct": false
        },
        {
          "text": "إنشاء نافذة حوض السمك.",
          "correct": false
        },
        {
          "text": "تقليل الحاجة إلى اتصالات الفريق من خلال تجميع الأعمال المتراكمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع بملايين الدولارات قيد التنفيذ بالفعل. خلال اجتماع حالة المشروع، ذكر أحد أعضاء الفريق أن هناك بعض التأخيرات بسبب عدم استجابة أحد كبار المسؤولين التنفيذيين للاتصالات.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء عملية لإرسال رسائل تذكير يومية إلى المسؤول التنفيذي الأول.",
          "correct": true
        },
        {
          "text": "قم بإزالة المهمة من المسار الحرج حتى لا تؤثر على الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "استخدم الشبكات للتواصل مع المسؤول التنفيذي الأول للحصول على رد.",
          "correct": false
        },
        {
          "text": "رفع مستوى القلق إلى مدير المسؤول التنفيذي الأول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى مدير المشروع للتو ميثاق المشروع وحصل على موافقة راعي المشروع. ثم عرض مدير المشروع ميثاق المشروع على أصحاب المصلحة ولاحظ عدم مشاركة بعضهم خلال هذا الاجتماع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتضمين ذلك في سجل المخاطر لأن مدير المشروع غير متأكد من فهم أصحاب المصلحة لمسؤولياتهم في هذا المشروع.",
          "correct": true
        },
        {
          "text": "عقد اجتماعات فردية مع أصحاب المصلحة هؤلاء لضمان فهمهم للمخرجات الرئيسية ومسؤولياتهم.",
          "correct": false
        },
        {
          "text": "قم بالإبلاغ عن المخاوف بشأن عدم مشاركة أصحاب المصلحة إلى الجهة الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "اطلب من فريق المشروع مراقبة أصحاب المصلحة هؤلاء ومشاركتهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ أحد رواد الأعمال مشروع تطوير برمجيات. تمت الموافقة على ميثاق المشروع، وتم تعيين مدير للمشروع للإشراف على تنفيذ المشروع. أثناء التطوير، ظهرت مخاطر سياسية غير متوقعة، مما تسبب في حاجة ملحة للتعجيل بالمشروع. طلب راعي المشروع تقريرًا عن أي تأخيرات متوقعة.\nما الأداة التي يجب أن يستخدمها مدير المشروع لإعداد التقرير الخاص بالتأخيرات المتوقعة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل الاتجاهات",
          "correct": true
        },
        {
          "text": "تحليل الأسباب الجذرية",
          "correct": false
        },
        {
          "text": "تقارير الجودة",
          "correct": false
        },
        {
          "text": "قائمة المعالم البارزة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ أحد مشاريع تكنولوجيا المعلومات، يكتشف اثنان من أعضاء فريق المشروع ميزة جديدة من شأنها تغيير مظهر المنتج وجعله أكثر جاذبية من الناحية الجمالية. وبعد أن تحمسا لفرصة إضافة هذه الميزة، قاما بالتواصل مع مدير المشروع للموافقة على هذه الإضافة إلى المنجزات، مما سيزيد من رضا العميل وربما يزيد من فرص الشركة في الحصول على عقود مشاريع إضافية من العميل.\nكيف يجب أن يستجيب مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "وافق على الفكرة من أجل تحقيق التوقعات المتوقعة من أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "ذكّر أعضاء الفريق أنه في حال عدم وجود طلب تغيير معتمد، يجب أن يكون التركيز على النطاق المتفق عليه.",
          "correct": false
        },
        {
          "text": "احصل على موافقة باقي أعضاء الفريق ونفذ الميزة بمجرد موافقة أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تنفيذ التغيير في أقرب وقت ممكن لتحسين إمكانية تحقيق إيرادات مستقبلية .",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع إنشائي بلغ 40% من مرحلة التنفيذ. وقد طلب راعي المشروع من مدير المشروع التأكد من أن جميع أصحاب المصلحة الرئيسيين لا يزالون ملتزمين بالمشروع.\nكيف ينبغي لمدير المشروع تقييم مستويات المشاركة الحالية لأصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "من خلال مراجعة خطة إدارة الاتصالات وتحديثها",
          "correct": true
        },
        {
          "text": "من خلال تحليل سجل المشكلات الأكثر تحديثًا",
          "correct": false
        },
        {
          "text": "من خلال مطالبة أصحاب المصلحة الرئيسيين بتقديم إقرار موقّع عليه",
          "correct": false
        },
        {
          "text": "من خلال مراجعة مصفوفة تقييم مشاركة أصحاب المصلحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ فريق سكروم وجود اتجاه لتراكم العمل في آخر عدة سباقات سرعة. تم تحديد السبب الجذري لذلك على أنه مهمة مراجعة التعليمات البرمجية. يبدو أن عنق الزجاجة هذا يحدث لأن الفريق يعتمد على خبير خارجي.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتقييم عنق الزجاجة وتسليط الضوء عليه وزيادة مدة السباق.",
          "correct": true
        },
        {
          "text": "تقييم قدرات الفريق وتحديد التدريب الداخلي المطلوب لإزالة المعوقات.",
          "correct": false
        },
        {
          "text": "رتب خياراً بديلاً للحصول على خبير احتياطي لتجنب التسرب.",
          "correct": false
        },
        {
          "text": "العمل مع الفريق والبدء في مراجعة الكود وإيقاف المراجعات من الخبير لتجنب التجاوزات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تغيرات السوق، قررت إحدى الشركات تسريع الجدول الزمني لإصدار منتجاتها، والانتقال من الدورات السنوية إلى الدورات ربع السنوية. يرى مدير المشروع أن هذه فرصة ممتازة لاستخدام دورة حياة رشيقة، لكن الإدارة العليا غير مقتنعة بالفكرة.\nما الذي يجب على مدير المشروع فعله لزيادة فرص النجاح باستخدام هذا النهج؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب موافقة راعي المشروع على الميزانية والموارد الإضافية.",
          "correct": true
        },
        {
          "text": "راجع الأعمال المتراكمة للمنتج لتحديد بعض المكاسب السريعة لعرضها على أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "قم بدعوة الإدارة العليا لحضور ورشة عمل التحول الرقمي.",
          "correct": false
        },
        {
          "text": "اجعل فريق المشروع يعمل افتراضيًا واستخدم وفورات التكلفة لتسريع عملية التسليم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع مسؤول عن مشروع كبير يتضمن العمل مع العديد من البائعين. ويرتبط أحد الشواغل الرئيسية للمشروع بجودة المنتجات والخدمات المشتراة وتسليمها في الوقت المناسب على النحو الذي التزم به البائعون.\nما الذي يجب على مدير المشروع القيام به لضمان تلبية المنتجات لمتطلبات الجودة وتسليمها في الوقت المحدد؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفع بند في سجل المخاطر لالتقاط الآثار المحتملة المتعلقة بالتأخيرات في شراء المنتجات والخدمات، مما يخفف من مخاطر الجودة دون المستوى الأمثل.",
          "correct": true
        },
        {
          "text": "إجراء مراجعات أداء المشتريات على أساس منتظم مع جميع البائعين المتعاقدين لضمان تسليم جميع المنتجات والخدمات أو سيتم تسليمها في الوقت المحدد وحسب العقد المتفق عليه.",
          "correct": false
        },
        {
          "text": "تفويض إدارة عملية الشراء والتفاعل مع جميع البائعين إلى قسم المشتريات في المؤسسة حيث أن لديهم الأدوات والوسائل اللازمة للتعامل مع عدد كبير من البائعين.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة البائعين مع جميع البائعين للتأكد من موافقتهم على الخطة، مما يقلل من مخاطر المنتجات غير المسلمة والمنتجات منخفضة الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أعضاء الفريق غير راضٍ عن عبء العمل ويشعر بأنه لا يتلقى الدعم الكافي. ويرغب مدير المشروع في الاجتماع مع عضو الفريق لمناقشة مخاوفه وتطبيق نهج إدارة النزاع بالتسوية/التوفيق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اشرح قيود المشروع وأولوياته لعضو الفريق.",
          "correct": true
        },
        {
          "text": "استمع إلى مخاوف أعضاء الفريق وحاول فهم وجهة نظرهم.",
          "correct": false
        },
        {
          "text": "اقتراح عبء عمل منقح أكثر قابلية للإدارة بالنسبة لعضو الفريق.",
          "correct": false
        },
        {
          "text": "عرض تقديم دعم إضافي لعضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد اجتماعات المراجعة، يعلم مدير المشروع بالمتطلبات غير الواضحة التي قد تؤثر على الموعد المحدد لإنجاز المشروع. لا يزال راعي المشروع يريد الوفاء بالموعد النهائي الأصلي.\nكيف يجب على مدير المشروع التعامل مع المشكلة باستخدام الممارسات الرشيقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدم التسليم التكراري وحدد أولويات المتطلبات بناءً على أهميتها وتأثيرها.",
          "correct": true
        },
        {
          "text": "أبلغ الراعي أنه سيتم إضافة طلب تغيير النطاق إلى التكرار التالي.",
          "correct": false
        },
        {
          "text": "سجل النطاق غير الواضح كمشكلة وقم بتصعيدها إلى مالك المنتج لاتخاذ قرار بشأن المتطلبات غير الواضحة.",
          "correct": false
        },
        {
          "text": "اطلب من سيد سكروم توضيح النطاق قبل مواصلة المشروع .",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مدير مشروع لإدارة مشروع لشركة ناشئة بمنح من مصدر أجنبي. وفي منتصف الطريق إلى هذا المشروع، يتم إبلاغ مدير المشروع بأن هناك متطلبات تنظيمية حكومية قد تؤثر على المشروع لأن العميل لديه مصادر تمويل أجنبية.\nما الذي يجب على مدير المشروع فعله بما أنه تم استلام جميع الموافقات اللازمة لهذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد ملكية هذا المشروع بناءً على ميثاق المشروع الذي تمت الموافقة عليه مسبقاً ومتابعة المشروع.",
          "correct": true
        },
        {
          "text": "راجع سجل المخاطر لتحديد احتمالية قبول العميل للمشروع وتلبية المتطلبات التنظيمية.",
          "correct": false
        },
        {
          "text": "التأكد من أن المشروع يتوافق مع جميع اللوائح ومواكبة جميع الآثار القانونية.",
          "correct": false
        },
        {
          "text": "أوقف المشروع، واطلب أموالاً إضافية للحصول على تصاريح عمل، واستمر في المشروع دون مزيد من التأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بمراجعة حالة المشروع مع الفريق ويحدد أنه يمكن الإفراج عن مورد من الموردين في وقت أبكر مما هو مخطط له. يراجع مدير المشروع الجدول الزمني ويؤكد هذا التغيير ويبلغ البائع بذلك. يجادل المورد بأن المورد يجب أن يبقى لفترة زمنية معينة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اترك الجدول كما هو حيث يجب أن يبقى المورد قيد التشغيل.",
          "correct": true
        },
        {
          "text": "تأكيد تغييرات الجدول الزمني ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "قم بالتحضيرات لإصدار المورد إلى البائع.",
          "correct": false
        },
        {
          "text": "راجع الشروط والأحكام الواردة في عقد البائع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لقيادة فريق مشروع متعدد الوظائف. وخلال جلسة عصف ذهني، أدرك مدير المشروع أن بعض أعضاء الفريق لا يرون الحاجة إلى التغيير، وهذا يؤثر على مخرجات الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة صياغة أهداف المشروع للفريق.",
          "correct": true
        },
        {
          "text": "اطلب من راعي المشروع مراجعة ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "إشراك أعضاء الفريق لفهم شكوكهم والحصول على موافقتهم.",
          "correct": false
        },
        {
          "text": "إنهاء جلسة العصف الذهني واعتماد أساليب المقابلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لقيادة فريق مشروع متعدد الوظائف. وخلال جلسة عصف ذهني، أدرك مدير المشروع أن بعض أعضاء الفريق لا يرون الحاجة إلى التغيير، وهذا يؤثر على مخرجات الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة صياغة أهداف المشروع للفريق.",
          "correct": true
        },
        {
          "text": "اطلب من راعي المشروع مراجعة ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "إشراك أعضاء الفريق لفهم شكوكهم والحصول على موافقتهم.",
          "correct": false
        },
        {
          "text": "إنهاء جلسة العصف الذهني واعتماد أساليب المقابلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لضمان الجودة، أجريت مراجعة للجودة على العمليات المستخدمة في خطة تنفيذ المشروع. وتمثلت إحدى مسائل عدم المطابقة التي أثارها مراجع الحسابات في عدم توافر قوائم حضور اجتماعات استعراض مخاطر المشروع.\nلماذا تعتبر قائمة الحضور مهمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "وهي وثيقة يتم تسجيلها ضمن سجل الدروس المستفادة.",
          "correct": true
        },
        {
          "text": "وهو سجل يوضح عدد الحاضرين في الاجتماع.",
          "correct": false
        },
        {
          "text": "من الممارسات المعتادة في المشاريع عقد اجتماعات اختيارية لمراجعة المخاطر.",
          "correct": false
        },
        {
          "text": "دليل على عقد اجتماعات مراجعة المخاطر مع أعضاء فريق المشروع المناسبين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مرحلة مبكرة من المشروع، يدرك مدير المشروع أن أحد أعضاء الفريق الرئيسيين غير مستعد لأداء المهمة الموكلة إليه.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان تضمين التدريب في خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "راجع متطلبات التدريب مع عضو الفريق.",
          "correct": false
        },
        {
          "text": "قم بمراجعة كل مهمة مطلوبة مع عضو الفريق عند بدء تنفيذها.",
          "correct": false
        },
        {
          "text": "رفع المشكلة إلى المدير الوظيفي للمورد لحلها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في إحدى المؤسسات باستخدام نهج مختلط لتنفيذ المشاريع. ويتمثل نطاق المشروع في تنفيذ نظام جديد للموارد البشرية. سيتم تسليم البنية التحتية من خلال مشروع آخر، وكلا المشروعين جزء من برنامج تحويل الأعمال الذي يهدف إلى تحسين عمليات الموارد البشرية. يجب وضع الجدول الزمني للمشروع في صيغته النهائية، لكن مدير المشروع في المشروع الآخر غير قادر على تقديم تواريخ تسليم البنية التحتية.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "انتظر حتى يتم وضع الجدول الزمني لمشروع البنية التحتية ثم ضع الجدول الزمني لمشروع نظام الموارد البشرية.",
          "correct": true
        },
        {
          "text": "ناقش الموقف مع مدير المشروع الآخر، واتفق على بعض المعالم، ثم تابع العمل على الجدول الزمني لمشروع نظام الموارد البشرية.",
          "correct": false
        },
        {
          "text": "وضع جدول زمني استنادًا إلى المعلومات المتوفرة من فريق إدارة البرنامج ثم مواءمة المعالم الرئيسية تدريجيًا مع مشروع البنية التحتية.",
          "correct": false
        },
        {
          "text": "ضع جدولاً زمنيًا بناءً على المعلومات المتاحة واطلب من مدير المشروع الآخر مواءمة معالم البنية التحتية مع مواعيد تسليم مشروع الموارد البشرية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مرحلة بدء مشروع رشيق، يقترح أحد كبار أعضاء الفريق استخدام أداة توثيق جديدة بناءً على الخبرة في مشروع سابق.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تثبيط استخدام أداة التوثيق الجديدة.",
          "correct": true
        },
        {
          "text": "طلب موافقة الجهة الراعية على أداة التوثيق الجديدة.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق تقديم ملاحظاته بشأن أداة التوثيق الجديدة.",
          "correct": false
        },
        {
          "text": "قم بترتيب جلسة تدريبية للفريق حول كيفية استخدام أداة التوثيق الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لا يستطيع أحد أعضاء الفريق العمل لمدة أسبوع واحد بسبب إجازة مرضية. عضو الفريق مكلف حاليًا بمهمة في المسار الحرج.\nما هي الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اختر عضوًا آخر في الفريق لتولي المهمة على الفور.",
          "correct": true
        },
        {
          "text": "تقييم الآثار المحتملة لتأخير المشروع.",
          "correct": false
        },
        {
          "text": "راجع خطة الاستجابة للمخاطر للتخفيف من حدة هذه المشكلة.",
          "correct": false
        },
        {
          "text": "إقناع عضو الفريق بالمضي قدماً في إكمال المهمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يخطط لمشروع معقد يجب أن يقدم منتجًا عالي الجودة في حدود الميزانية المتفق عليها. يتوق أصحاب المصلحة في المشروع إلى رؤية إطلاق المنتج ويضغطون على الفريق لتسليم المنتج في أقرب وقت ممكن. يجب على مدير المشروع تحديد المدة المقدرة للمشروع ومعالجة توقعات أصحاب المصلحة.\nكيف ينبغي لمدير المشروع تحديد تقدير واقعي لمدة المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكيد توقعات أصحاب المصلحة في التسليم.",
          "correct": true
        },
        {
          "text": "تقدير مدة كل مهمة من مهام المشروع.",
          "correct": false
        },
        {
          "text": "تحليل معايير ومعايير الصناعة.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق إنشاء خطة إصدار مفصلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بالتخطيط لفريق مشروع سيبدأ العمل قريبًا على نظام فرعي مهم. هناك بديلان تقنيان تم تحديدهما للنظام الفرعي، ولكن ليس من الواضح ما إذا كان أي من البديلين سيؤدي أداءً مرضيًا. سيتعرض المشروع للخطر إذا كان أداء النظام الفرعي الحرج غير مرضٍ.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "توجيه الفريق لتقييم بدائل النظام الفرعي وتقييمها.",
          "correct": true
        },
        {
          "text": "إضافة أداء النظام الفرعي إلى سجل المشكلات وتعيين مالك لهذه المشكلة.",
          "correct": false
        },
        {
          "text": "جدولة العمل للبديل الواعد وإضافة احتياطي إداري للبديل الآخر.",
          "correct": false
        },
        {
          "text": "تقديم المشورة لأصحاب المصلحة بشأن المخاطر الرئيسية التي يشكلها أداء النظام الفرعي على المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكتشف مدير المشروع أن أحد أصحاب المصلحة يقدم تقارير حالة غير دقيقة إلى اللجنة التوجيهية. وعلاوة على ذلك، لا يملك صاحب المصلحة معلومات دقيقة عن المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة الاتصالات لضمان حصول أصحاب المصلحة على المعلومات اللازمة.",
          "correct": true
        },
        {
          "text": "حدد موعداً لعقد اجتماع مع صاحب المصلحة لمناقشة التقارير غير الدقيقة وتقديم معلومات دقيقة.",
          "correct": false
        },
        {
          "text": "إرسال تحديثات منتظمة إلى اللجنة التوجيهية لإبقائهم على اطلاع دائم بالمشروع.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة وطلب الموافقة المسبقة على جميع التقارير قبل إرسالها إلى اللجنة التوجيهية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم العثور على مشكلة امتثال أثناء تنفيذ أحد المشاريع. تسبب ذلك في إجراء فحص للمنتج من قبل فريق التدقيق الداخلي. ونتيجة لذلك، تأخر المشروع عن الجدول الزمني.\nما الذي كان ينبغي أن يفعله مدير المشروع في البداية لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من توثيق متطلبات الامتثال.",
          "correct": true
        },
        {
          "text": "إنشاء قوالب لتوثيق الامتثال.",
          "correct": false
        },
        {
          "text": "استأجرت مستشار امتثال.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة في بداية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق استشاري للمشروع عن بعد من فريق المشروع الأساسي. وهناك تدفق مستمر للمعلومات بين هذين الفريقين، ويوافق كلا الفريقين على وثائق المشروع. وأي تأخير في الموافقات سيؤدي إلى نفقات إضافية.\nما هي الممارسة التي من شأنها أن تضمن لمدير المشروع أن جميع المستندات متوفرة ومحدثة ومعتمدة بشكل صحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "السماح للفرق الاستشارية والأساسية بتطوير وصيانة أنظمة تصنيف وتسمية الوثائق الخاصة بها.",
          "correct": true
        },
        {
          "text": "مطالبة كل عضو من أعضاء الفرق الاستشارية وفرق المشروع بالاحتفاظ بسجلات محدثة.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية الاحتفاظ بالتغييرات والموافقة عليها في سجل مستند واحد.",
          "correct": false
        },
        {
          "text": "الإشراف على سجل مستندات واحد ونظام واحد للتحكم في التغيير يستخدمه كلا الفريقين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تحليل حكم الخبراء\nقام أحد البائعين لمشروع كبير ومعقد بتنفيذ أعمال أكثر مما كان متوقعًا في الأصل في عقد الوقت والمواد. وقد تسبب هذا النوع من العقود في تأخر المشروع عن الجدول الزمني المحدد له وتجاوز ميزانيته. العقد على وشك الانتهاء.\nماذا ينبغي لمدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء طلب عرض أسعار (RFQ) لصياغة قائمة بالبائعين الجدد.",
          "correct": true
        },
        {
          "text": "التحول إلى اتفاقية خدمات رئيسية مع ملاحق للعمل الإضافي حسب الحاجة.",
          "correct": false
        },
        {
          "text": "استشر مستودع الدروس المستفادة لصياغة قائمة بالبائعين الجدد المحتملين.",
          "correct": false
        },
        {
          "text": "حاول التفاوض على عقد بسعر ثابت مع البائع الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "دخل مدير مشروع إلى مكتب أحد المشاريع ووجد أحد أعضاء الفريق وممثل أحد الموردين منخرطين في خلاف حول بند في اتفاقية التوريد. دعا مدير المشروع المورد للتفاوض مع فريق المشروع لحل النزاع.\nبتطبيق مبادئ التفاوض، ما الذي يجب أن يهدف إليه مدير المشروع وفريق العمل؟",
      "explanation": "",
      "choices": [
        {
          "text": "التخلي عن هدف المشروع من أجل الحصول على نتيجة رابحة وخاسرة.",
          "correct": true
        },
        {
          "text": "تحقيق هدف المشروع للحصول على نتيجة رابحة للجميع.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع لتحقيق نتيجة مربحة للجانبين.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع مهما كانت النتيجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مع اقتراب نهاية مشروع كبير، لم تكن بعض التقارير الفنية المتعلقة بالخدمة التي تم تسليمها جاهزة. وطلب مدير المشروع من أعضاء الفريق الحصول على الوثائق المفقودة، لكن الفريق ادعى أنه أنجز بالفعل المهام الموكلة إليه.\nكيف ينبغي لمدير المشروع معالجة هذا القلق؟",
      "explanation": "",
      "choices": [
        {
          "text": "راجع المخطط الهرمي لتأكيد المناصب والعلاقات.",
          "correct": true
        },
        {
          "text": "ارجع إلى مخطط RACI للتحقق من صحة الأدوار والمسؤوليات المعينة.",
          "correct": false
        },
        {
          "text": "ناقش قائمة الأنشطة وتأكد من فهم الفريق للعمل المطلوب.",
          "correct": false
        },
        {
          "text": "أدخل جميع الافتراضات والقيود في سجل الافتراضات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني فريق المشروع الموزع جغرافيًا من مشاكل في التطوير بين فرق العمل الموزعة جغرافيًا والافتراضية، مما يؤدي إلى انخفاض الإنتاجية.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلات؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجبار أعضاء الفريق على العمل من موقع واحد.",
          "correct": true
        },
        {
          "text": "الحصول على خبرات خاصة لتقديم المشورة لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "وضع بروتوكولات لحل النزاعات بين أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "قم بإعداد اجتماعات وجهاً لوجه مع أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يضم مشروع تصميم فندق حضري فريق عمل دولي متعدد التخصصات والثقافات. مدير المشروع بصدد وضع النسخة الأولى من خطة إدارة المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام نهج الشلال في إدارة المشاريع.",
          "correct": true
        },
        {
          "text": "قم بتفويض معظم المهام إلى أعضاء الفريق الموجودين في نفس المنطقة الزمنية.",
          "correct": false
        },
        {
          "text": "استخدم قناة اتصال واحدة لفريق المشروع بأكمله.",
          "correct": false
        },
        {
          "text": "دمج الاعتبارات الثقافية في خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من المقرر أن يقوم أحد أعضاء الفريق بزيارة موقع عميل في الخارج الأسبوع المقبل. لكن مدير المشروع سمع مدير المشروع بالصدفة عضو الفريق يخبر منسق المشروع أن مديره الوظيفي رفض طلب عضو الفريق الحصول على إجازة كتعويض عن زيارة العميل. يحتاج مدير المشروع إلى التأكد من أن عضو الفريق سيزور موقع العميل الأسبوع المقبل.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قابل عضو الفريق مباشرةً لإخباره بما سمعته منه.",
          "correct": true
        },
        {
          "text": "تأكد مع عضو الفريق من إمكانية إجراء زيارة العميل.",
          "correct": false
        },
        {
          "text": "واجه المدير الوظيفي بشأن إجازة عضو الفريق.",
          "correct": false
        },
        {
          "text": "سجل المشكلة كمخاطرة في سجل المخاطر وقم بتعيين عضو آخر في الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحاول مدير المشروع لمشروع هجين جديد تشكيل فريق المشروع. أفضل المرشحين لأعضاء الفريق متباعدون جغرافياً، لذلك هناك خطر أن يتعارض هذا الوضع مع أداء المشروع. سيؤدي التجميع إلى زيادة التكاليف بشكل كبير؛ وبسبب المنافسة الشديدة، فإن الشركة تكافح مالياً من أجل البقاء.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من توفر الأدوات المناسبة للتعاون الافتراضي للفريق.",
          "correct": true
        },
        {
          "text": "الإصرار على جمع الفريق معًا من خلال خفض الميزانية في مكان آخر.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج الحصول على أموال إضافية لدعم الموقع المشترك.",
          "correct": false
        },
        {
          "text": "تنظيم العمل وفقًا لمواقع أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وصل فريق المشروع للتو إلى أحد معالم المشروع بنجاح. لاحظ مدير المشروع أن أداء الفريق كان جيداً للغاية.\nما النهج الذي يجب أن يستخدمه مدير المشروع للتواصل مع الفريق بشأن أدائه؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجنب الإفصاح عن أي شيء يتعلق بأدائهم حيث من المتوقع أن يقوم الفريق بتسليم الإنجازات بنجاح.",
          "correct": true
        },
        {
          "text": "انتظر حتى نهاية المشروع وقم بإبلاغ الفريق بما تم إنجازه بشكل جيد وسيئ في كل مرحلة.",
          "correct": false
        },
        {
          "text": "تقديم ملاحظات لفريق المشروع فيما يتعلق بأدائهم الجيد في الاجتماع التالي للمشروع.",
          "correct": false
        },
        {
          "text": "تجاهل ما تم إنجازه بالفعل في المشروع واطلب من فريق المشروع التركيز على ما تبقى إنجازه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وصلت إحدى المنظمات إلى منتصف الطريق في مشروع مدته خمس سنوات وسار كل شيء كما هو مقرر. ويشير آخر تقييم للمشروع إلى أن المشروع لن يكون متوافقاً مع لائحة دولية تم إدخالها مؤخراً.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "المضي قدماً في المشروع لأن اللائحة الجديدة ليست جزءاً من متطلبات المشروع الأولية.",
          "correct": true
        },
        {
          "text": "عقد ورشة عمل مع اللجنة التوجيهية للمشروع لمراجعة اللائحة الجديدة وإيجاد حل.",
          "correct": false
        },
        {
          "text": "الاستفادة من احتياطي الطوارئ لتمويل المهام الإضافية المطلوبة للتنظيم الجديد.",
          "correct": false
        },
        {
          "text": "اطلب أموالاً من احتياطي الإدارة لأن التنظيم الجديد يمثل مخاطرة غير معروفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع لإنشاء وظيفة تجارية جديدة في الشركة. وبعد عدة أشهر من إنجازه، لا يزال مدير المشروع يتولى إدارة العمليات التجارية للمشروع أثناء عمله في مشروع آخر.\nما الذي كان ينبغي على مدير المشروع القيام به في بداية المشروع لمنع حدوث ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان أن يكون تنقيح الهيكل التنظيمي من المنجزات.",
          "correct": true
        },
        {
          "text": "تضمين خطة الانتقال كمنتج قابل للتسليم في عملية إغلاق المشروع.",
          "correct": false
        },
        {
          "text": "توضيح مخطط RACI مع راعي المشروع في بداية المشروع.",
          "correct": false
        },
        {
          "text": "التأكد من تضمين عملية التوظيف في خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نشأ نزاع حول كيفية المضي قدماً بين اثنين من أعضاء الفريق قبل الإصدار. يحتاج الفريق إلى العمل معاً لإكمال إصدار المنتج.\nما الذي يجب أن يفعله مدير المشروع أولاً لتهدئة الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتعيين مدرب رشيق لإرشاد أعضاء الفريق حول كيفية إدارة نزاعاتهم دون الإضرار بالمشروع.",
          "correct": true
        },
        {
          "text": "راقب تفاعلات أعضاء الفريق وتحدث معهم حول شكواهم قبل تطبيق أسلوب حل النزاعات.",
          "correct": false
        },
        {
          "text": "قم بإعداد اجتماعات مع كل من أعضاء الفريق وإدارة الموارد البشرية لتذكيرهم بأهمية التسليم التالي للمنتج.",
          "correct": false
        },
        {
          "text": "اشرح لأعضاء الفريق أنهم يضيعون الوقت في الدخول في صراع ولا يقدمون وظائف المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من أجل تحديد نهج هجين جديد لمشروع ما، يقرر مدير المشروع أن هناك حاجة إلى إجراء تقييم للثقافة التنظيمية.\nيجب على مدير المشروع أن يراعي التوازن بين أي عنصرين؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستكشاف والاستقرار",
          "correct": true
        },
        {
          "text": "السرعة والنماذج التقليدية",
          "correct": false
        },
        {
          "text": "المرونة والقدرة على التنبؤ",
          "correct": false
        },
        {
          "text": "الاضطراب والامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال إحدى عمليات التكرار، أمضى الفريق ضعف الوقت المتوقع لأن أحد عناصر المنتج المتراكمة كان معقدًا ولا يمكن تقسيمه إلى عناصر أصغر.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "دمج نهج تكيفي لبقية المشروع.",
          "correct": true
        },
        {
          "text": "دمج نهج تنبؤي لبقية المشروع.",
          "correct": false
        },
        {
          "text": "وضع خطة لإدارة المخاطر لهذا السباق السريع.....",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج إعادة ترتيب أولويات المنتج المتراكمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "التواصل مع أصحاب المصلحة الرئيسيين بشأن الأثر المترتب على ذلك.\nأثناء تنفيذ المشروع، قرر فريق المراجعة أن المتطلبات التنظيمية الحرجة لم يتم الوفاء بها. ماذا كان ينبغي لمدير المشروع أن يفعل أولا لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث سجل المشكلات بالمتطلبات التنظيمية.",
          "correct": true
        },
        {
          "text": "تقييم البيئات التنظيمية الداخلية والخارجية.",
          "correct": false
        },
        {
          "text": "كان على فريق التدقيق مراجعة خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تضمين عضو من فريق التدقيق في المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجري تنفيذ مشروع مختلط يضم العديد من أصحاب المصلحة. وبناءً على طلب مكتب إدارة المشروع (PMO)، يتم تخزين تقارير حالة المشروع، بالإضافة إلى وثائق المشروع الأخرى، في مستودع مركزي. عند مراجعة المستندات المخزنة في المستودع، اكتشف مدير المشروع أن المستندات إما لم يتم تحديثها أو أنها مفقودة.\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش الوضع مع راعي المشروع لتقليل مستوى التوثيق.",
          "correct": true
        },
        {
          "text": "العمل مع قادة الفرق لتحديث تقارير المشروع المطلوبة.",
          "correct": false
        },
        {
          "text": "أوقف جميع أنشطة المشروع حتى يتم تحديث وثائق المشروع وتحميلها.",
          "correct": false
        },
        {
          "text": "حدد موعداً لجلسة نقل المعرفة في المرحلة النهائية من المشروع.",
          "correct": false
        }
      ]
    }
  ]
}
