{
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "يقوم مشروع رشيق بتكراره الخامس من أصل 1. بعد آخر استعراض بأثر رجعي، أدرك أعضاء الفريق أنهم اضطروا إلى العمل لساعات إضافية لتسليم العمل الملتزم به.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق أن يكون لديه التزام أقل للتكرار التالي.",
          "correct": true
        },
        {
          "text": "اطلب أعضاء فريق إضافيين للحفاظ على السرعة.",
          "correct": false
        },
        {
          "text": "قم بإجراء استرجاع مركّز لمساعدة الفريق على اكتشاف السبب الجذري.",
          "correct": false
        },
        {
          "text": "تنفيذ نقطة تحقق في التكرار للتحقق مما إذا كان الفريق يسير على المسار الصحيح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع يتضمن عدداً قليلاً من البائعين. يسأل راعي المشروع عن كيفية حصول المشروع على السلع والخدمات الخارجية.\nأين يجب توثيق هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "في خطة إدارة المشتريات",
          "correct": true
        },
        {
          "text": "في اتفاقية الخدمة الرئيسية",
          "correct": false
        },
        {
          "text": "في عقد فاتورة المواد",
          "correct": false
        },
        {
          "text": "في اتفاقية مستوى الخدمة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إعداد ميثاق مشروع لمشروع جديد، يستعرض مدير المشروع الدروس المستفادة من المشاريع السابقة. وتُظهر وثائق الدروس المستفادة مشاكل متكررة تتعلق بانخفاض مستويات المشاركة وعدم توافق أصحاب المصلحة على أهداف المشروع.\nما الذي يجب أن يفعله مدير المشروع لتجنب تكرار هذه المشكلة في المشروع الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "السماح لأي صاحب مصلحة بالانضمام إلى مجلس التحكم في التغيير (CCB) في أي وقت في المشروع.",
          "correct": true
        },
        {
          "text": "قم بتضمين جميع أصحاب المصلحة في مصفوفة إسناد المسؤولية (RAM) لقبول النواتج.",
          "correct": false
        },
        {
          "text": "اجمع كل المتطلبات المقدمة من كل صاحب مصلحة على حدة وأدرجها في هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "بناء فهم مشترك بين أصحاب المصلحة حول المخرجات الرئيسية الموضحة في ميثاق المشروع المعتمد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "1\nخلال اجتماع للفريق، طلب أعضاء الفريق من مدير المشروع تقديم المشورة لهم بشأن التبعيات الداخلية للمشروع. ما الذي يجب أن يطلبه مدير المشروع من الفريق بشأن التبعيات الداخلية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعرّف على أحدث التغييرات التنظيمية.",
          "correct": true
        },
        {
          "text": "اقرأ عن الاندماج مع منظمة منافسة.",
          "correct": false
        },
        {
          "text": "تحقق من التغييرات المتعلقة بسياسة العمل من المنزل.",
          "correct": false
        },
        {
          "text": "تعرّف على ترقية مزود الإنترنت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام الراعي بإخطار مالك المنتج بأنه تمت الموافقة على ميزانية المشروع. ومع ذلك، فإن أي استثمار إضافي للمشروع يجب أن ينتظر حتى السنة المالية التالية. ويشعر مالك المنتج بالقلق من أن يؤدي ذلك إلى تعطيل المشروع.\nما الذي يجب أن يفعله مالك المنتج؟",
      "explanation": "",
      "choices": [
        {
          "text": "تتبع الميزانية استنادًا إلى خطة الإصدار وإظهار القيمة للأعمال.",
          "correct": true
        },
        {
          "text": "اشرح أن المشروع قد بدأ للتو وأن الميزانية ستحتاج إلى تعديلها",
          "correct": false
        },
        {
          "text": "تتبع الميزانية بناءً على كل سباق سريع وقم بإزالة النواتج التي لا يمكن تحقيقها.",
          "correct": false
        },
        {
          "text": "تأكد من أن مدير المشروع يراقب كل فاتورة من المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "15\nما هي المهارات الشخصية التي يحتاجها مديرو المشاريع أو فرق العمل لمراقبة العلاقات مع أصحاب المصلحة، وتقييم استراتيجيات المشاركة، وتعديل هذه الأساليب حسب الحاجة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستماع الفعال والقيادة والوعي الثقافي والسياسي",
          "correct": true
        },
        {
          "text": "التدريب وصنع القرار والوعي الثقافي والسياسي",
          "correct": false
        },
        {
          "text": "الاستماع الفعال وبناء الفريق والقيادة والتواصل الشبكي",
          "correct": false
        },
        {
          "text": "التواصل والتأثير والوعي الثقافي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "16\nمشروع جديد ينطوي على درجة عالية من عدم اليقين في التكلفة المطلوبة لإنجازه. ما هو النهج الذي ينبغي أن يستخدمه مدير المشروع لتحديد التكاليف المتوقعة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدير التناظري",
          "correct": true
        },
        {
          "text": "التقنيات الإحصائية التي تقدر",
          "correct": false
        },
        {
          "text": "التقدير البارامترية",
          "correct": false
        },
        {
          "text": "تقدير ثلاثي النقاط",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام أحد مطوّري التطبيقات بأخذ بطاقة قصة للعمل مكتوب عليها \"يمكن للعميل الدفع باستخدام بطاقة الائتمان\". بعد التنفيذ، تم رفض الوظيفة لأن التطبيق لا يمكن أن يقبل بطاقات الائتمان الأجنبية.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "وصف قصة المستخدم بمزيد من التفصيل.",
          "correct": true
        },
        {
          "text": "جدولة قصة المستخدم للتكرار التالي.",
          "correct": false
        },
        {
          "text": "إجراء تهيئة متراكمة متكررة مع الفريق.",
          "correct": false
        },
        {
          "text": "جمع مواصفات متطلبات أكثر تفصيلاً من المستخدمين النهائيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "17\nفي أحد البرامج، تقوم عدة مجموعات بتحديد تقنيات حل المشكلات وتقدم كل مجموعة مقترحًا. من بين تلك المقترحات، أي منها صالح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء فحوصات سلامة المشروع",
          "correct": true
        },
        {
          "text": "قراءة المؤلفات المتعلقة بمجال عملك",
          "correct": false
        },
        {
          "text": "إنشاء صندوق اقتراحات المشاريع",
          "correct": false
        },
        {
          "text": "كل ما سبق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع امتثال جديد يختلف عن المشاريع العادية لأنه سيشمل شركاء متعددي الجنسيات والعديد من الإدارات الحكومية. وسيسفر المشروع عن اعتماد معايير وإجراءات جديدة.\nما الذي يجب أن يفعله مدير المشروع منذ البداية؟",
      "explanation": "",
      "choices": [
        {
          "text": "التأكد من تحديد متطلبات العمل والوفاء بها",
          "correct": true
        },
        {
          "text": "التأكد من توفر تصميم الحل منذ بداية المشروع",
          "correct": false
        },
        {
          "text": "ضمان التنفيذ والتسليم بفعالية",
          "correct": false
        },
        {
          "text": "التأكد من تفسير إرشادات الامتثال والتحقق من صحتها",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "1\nيعمل فريق المشروع على تحديد التبعيات لأنشطة مشروع جارٍ. ما الإجراء الذي ينبغي أن يتخذه فريق المشروع أولاً لإدارة التبعيات بنجاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة التبعيات وتتبعها.",
          "correct": true
        },
        {
          "text": "توصيل التبعيات إلى الراعي.",
          "correct": false
        },
        {
          "text": "تقييم التبعيات وتوثيقها.",
          "correct": false
        },
        {
          "text": "تعيين مجدولين للمشروع لجميع المهام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "منشأة مستودع جديد قيد الإنشاء. يقوم مدير المشروع بتنفيذ جهود تطوير الفريق مثل التدريب الذي سيؤدي إلى انخفاض نسبة العيوب.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم برنامج تدريبي.",
          "correct": true
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "زيادة مراجعات مراقبة الجودة.",
          "correct": false
        },
        {
          "text": "إضافة تكاليف التدريب إلى الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "واجه فريق المشروع مؤخرًا تأخيرات بسبب عدم الامتثال مما جعل الجدول الزمني للمشروع أقل مرونة وزاد من مخاطر التكلفة وسوء الجودة. ويقوم الفريق بتبادل الأفكار حول سبل تجنب ذلك في المستقبل.\nما هي الآثار البعيدة المدى المترتبة على المنظمة إذا لم يتم حل مشكلة عدم الامتثال هذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "بقاء الأعمال واستمراريتها",
          "correct": true
        },
        {
          "text": "عملاء غير راضين أو مستخدمين نهائيين غير راضين",
          "correct": false
        },
        {
          "text": "استجابة أبطأ للنظام",
          "correct": false
        },
        {
          "text": "الغرامات والعقوبات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع في مشروع الذكاء الاصطناعي بكياسة وثقة. فهم يقدمون الدعم، ويستمعون بانتباه، ويسمحون لأعضاء فريقهم بالعمل تحت إشراف قليل.\nما هو نموذج سلوك العامل الذي يظهره مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "نظرية التوقع",
          "correct": true
        },
        {
          "text": "النظرية X",
          "correct": false
        },
        {
          "text": "النظرية Y",
          "correct": false
        },
        {
          "text": "نظرية Z",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "2\nقرر مدير المشروع إشراك طرف ثالث لإدارة مخاطر المشروع نظرًا لأن لديه خبرة أكبر من فريق المشروع الحالي. ما هو نوع استراتيجية الاستجابة التي طبقها مدير المشروع لمعالجة مخاطر المشروع بشكل عام؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجنب",
          "correct": true
        },
        {
          "text": "الاستغلال",
          "correct": false
        },
        {
          "text": "التحويل",
          "correct": false
        },
        {
          "text": "تقليل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع تم تعيينه حديثاً يدير مشروعاً للمرة الأولى ويشعر بالقلق من تزايد التوترات. فأعضاء فريق المشروع يتجادلون خلال مرحلة تتطلب جهداً مكثفاً وقد أعرب أصحاب المصلحة عن بعض الشكوك حول أداء المشروع. في مناقشة مع مدير المشروع الأقدم، يعترف مدير المشروع الجديد بأن لديه خوفاً من النزاع ويسأل مدير المشروع الأقدم عن كيفية تصوره للنزاع.\nكيف ينبغي لمدير المشروع الأقدم أن يستجيب؟",
      "explanation": "",
      "choices": [
        {
          "text": "الصراع في المشاريع أمر لا مفر منه - ركز على إدارته.",
          "correct": true
        },
        {
          "text": "يمكن منع حدوث تضارب في المشاريع - إعادة تخطيط التخفيف من حدة المشكلة.",
          "correct": false
        },
        {
          "text": "التعارض في المشاريع كارثي - قم بإعداد خطة للتعافي.",
          "correct": false
        },
        {
          "text": "الصراع في المشاريع أمر صحي - امتنع عن التدخل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "21\nيقوم مدير مشروع بتقييم فرصتين استثماريتين. من المتوقع أن يولد المشروع (أ) تدفقات نقدية قدرها دولار واحد في السنة لمدة خمس سنوات باستثمار أولي قدره 35 دولاراً. من المتوقع أن يولد المشروع (ب) تدفقات نقدية بقيمة دولار أمريكي سنويًا لمدة خمس سنوات باستثمار مبدئي قدره 25 دولارًا أمريكيًا. معدل العائد المطلوب للشركة هو 1%. ما هو صافي القيمة الحالية (NPV) لكل مشروع، وأيهما يجب أن يوصي به مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) - 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) - 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بالمشروع (ب) لأن صافي القيمة الصافية قبل خصم القيمة العادلة.",
          "correct": true
        },
        {
          "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بأي من المشروعين لأن صافي القيمة الحالية للمشروع (أ) متشابهة.",
          "correct": false
        },
        {
          "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) - 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) - 1,5.3 دولار أمريكي. وينبغي لمدير المشروع ألا يوصي بأي من المشروعين لأن كلاهما له قيمة صافي ربحية سلبية.",
          "correct": false
        },
        {
          "text": "وتبلغ القيمة الصافية للقيمة الحالية للمشروع (أ) 21,62.75 دولارًا أمريكيًا، وتبلغ القيمة الصافية للمشروع (ب) 1,5.3 دولار أمريكي. وينبغي لمدير المشروع أن يوصي بالمشروع (أ) لأن صافي القيمة الصافية قبل خصم القيمة الحالية أعلى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "22\nأعرب بعض أعضاء الفريق المكلفين بمشروع تكنولوجي جديد عن عدم معرفتهم بالتكنولوجيا والتحديات التي سيواجهونها أثناء التنفيذ. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "نظرًا لتواريخ استحقاق المشروع، استبدل الأعضاء بموظفين أكثر دراية.",
          "correct": true
        },
        {
          "text": "اطلب من أعضاء الفريق القيام ببعض الأبحاث وجهود التعلم الذاتي حول التكنولوجيا.",
          "correct": false
        },
        {
          "text": "إعادة توزيع الأعضاء للعمل على المهام المختلفة التي لديهم خبرة فيها وإتمامها.",
          "correct": false
        },
        {
          "text": "طمأنة أعضاء الفريق بوجود مسار تدريبي لتعلم التكنولوجيا الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعًا رشيقًا. بالنسبة للتكرارات من الأول إلى الخامس، يعرض مخطط سرعة الفريق نقطة قصة واحدة، و3 نقاط قصة، و22 نقطة قصة، و23 نقطة قصة، و22 نقطة قصة.\nما الذي توضحه هذه المعلومات عن أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "لا يتبع الفريق الممارسات الرشيقة بشكل صحيح.",
          "correct": true
        },
        {
          "text": "تستقر سرعة الفريق بمرور الوقت.",
          "correct": false
        },
        {
          "text": "الفريق متأخر عن الجدول الزمني.",
          "correct": false
        },
        {
          "text": "يحتاج الفريق إلى تغيير منهجيته الرشيقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تنفيذ المشروع يتم تنفيذ دورة حياة المشروع على أنها تنبؤية؛ ومع ذلك، سيتم تسليم النواتج الرئيسية بشكل تدريجي إلى العميل. تكون الموارد المعينة من ذوي الخبرة والموثوقية ومستعدة لاتخاذ القرارات التي اعتاد مدير المشروع على اتخاذها بعد كل تسليم تدريجي في مشاريع أخرى.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أبلغ الفريق أنه على الرغم من أن هذه بيئة مختلطة، يجب أن يظل مدير المشروع مسؤولاً عن اتخاذ القرارات.",
          "correct": true
        },
        {
          "text": "استشر مالك المنتج حول السماح للموارد باتخاذ القرارات.",
          "correct": false
        },
        {
          "text": "دعم قرارات الفريق ونقل مسؤولية اتخاذ القرارات إليهم.",
          "correct": false
        },
        {
          "text": "حدد موعدًا لاجتماع اللجنة التوجيهية واحصل على موافقتها على الطلب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "25\nيكتشف مدير مشروع وجود عيب كبير في أحد نواتج المشروع الرئيسية. ما هي عملية إدارة المشروع التي يتم إجراؤها؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة الجودة",
          "correct": true
        },
        {
          "text": "مراقبة الجودة",
          "correct": false
        },
        {
          "text": "إدارة جودة الخطة",
          "correct": false
        },
        {
          "text": "أخذ العينات الإحصائية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "26\nيصر أحد أصحاب المصلحة في المشروع على إضافة ميزة إضافية إلى منتج المشروع دون تغيير النطاق أو الميزانية أو الجدول الزمني. يسمح مدير المشروع بتضمين هذه الميزة لأنها تضيف قيمة كبيرة للمنتج النهائي. ومع ذلك، يكتشف مدير المشروع أن إضافة هذه الميزة قد أدت إلى إطالة الجدول الزمني للمشروع وزيادة تكاليف المشروع.\nما العملية التي كان ينبغي على مدير المشروع اتباعها قبل تضمين ميزة المنتج الإضافية؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحكم في التغيير",
          "correct": true
        },
        {
          "text": "تخطيط الجدول الزمني",
          "correct": false
        },
        {
          "text": "تخطيط المشتريات",
          "correct": false
        },
        {
          "text": "تدقيق الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق المشروع اتخاذ قرار بشأن الخطوات التالية التي يجب اتخاذها من أجل معالجة التأخيرات في الجدول الزمني للمهام التي تم تحديدها مؤخرًا. ويتوقع مدير المشروع من أعضاء الفريق اتخاذ القرارات المناسبة للمهام الموكلة إليهم على التوالي والمضي في تنفيذها.\nما نوع أسلوب القيادة الذي يستخدمه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ديمقراطية",
          "correct": true
        },
        {
          "text": "استبدادي",
          "correct": false
        },
        {
          "text": "إطلاق العنان",
          "correct": false
        },
        {
          "text": "التنعيم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "27\nأي من أدوات المشروع التالية لا تستخدم نظام WBS كمدخلات؟",
      "explanation": "",
      "choices": [
        {
          "text": "الجدول الزمني للمشروع",
          "correct": true
        },
        {
          "text": "نطاق المشروع",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        },
        {
          "text": "خطة الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم إحدى الشركات منهجية Lean Six Sigma في أحد المشاريع. في منتصف المشروع، دُعي استشاري خارجي في منهجية اللين الستة سيجما لإجراء تدقيق للتأكد من تطبيق المنهجية بشكل صحيح\nما العملية التي يتم استخدامها؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة الجودة",
          "correct": true
        },
        {
          "text": "مراقبة الجودة",
          "correct": false
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر",
          "correct": false
        },
        {
          "text": "إدارة جودة الخطة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "2\nبعد أن قامت إحدى المنظمات بتدريب وتنفيذ تطبيق برمجيات جديدة إلزامية لإدارة المشاريع لجميع موظفي المشروع، لاحظ مدير المشروع أن العديد من أعضاء الفريق أظهروا مستويات منخفضة من الالتزام بالبرنامج الجديد. ما سبب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الخوف من المجهول",
          "correct": true
        },
        {
          "text": "نقص المهارات المطلوبة",
          "correct": false
        },
        {
          "text": "عدم وجود رؤية واضحة للمشروع",
          "correct": false
        },
        {
          "text": "الكثير من التواصل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إقفال المشروع، يجد مدير المشروع صعوبة في الحصول على ردود فعل ناجحة لإنجاز المشروع. فبعض أصحاب المصلحة لا يوافقون على معايير نجاح المشروع ويشعرون بالإحباط من المشروع منذ البداية.\nإلى ماذا يجب أن يشير مدير المشروع لمعالجة هذه المخاوف؟",
      "explanation": "",
      "choices": [
        {
          "text": "ميثاق المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة الجودة",
          "correct": false
        },
        {
          "text": "بيان النطاق",
          "correct": false
        },
        {
          "text": "وثائق المتطلبات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع (ب): يتمتع بخبرة معتدلة خاصة في مشاريع البناء، متاح في اليوم التالي لمدة أسبوع واحد\nأي مدير مشروع يجب أن يختاره مدير مكتب إدارة المشاريع وعلى أي أساس؟",
      "explanation": "",
      "choices": [
        {
          "text": "أ متاح على الفور ولديه خبرة أكبر للتخطيط بسرعة وبشكل صحيح.",
          "correct": true
        },
        {
          "text": "ب يفهم بشكل أفضل تعقيدات التخطيط التنبؤي ويستعين بشبكة من الخبراء المتخصصين (SMEs).",
          "correct": false
        },
        {
          "text": "أ أكثر حداثة وإلمامًا بأحدث اتجاهات ومنهجيات تخطيط المشاريع.",
          "correct": false
        },
        {
          "text": "ب سيكون متاحًا للعمل لفترة أطول في حالة الخطأ في الموعد النهائي للتقديم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nحدد فريق مدير المشروع عدم وجود توقعات مناسبة لنقل المعرفة في المشروع. أي من العقبات لا تنطبق في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة منهجية للمشروع المنجز",
          "correct": true
        },
        {
          "text": "التعامل مع الإخفاقات والأخطاء الشخصية",
          "correct": false
        },
        {
          "text": "عدم كفاية الدافع الفردي لتوثيق الدروس المستفادة",
          "correct": false
        },
        {
          "text": "مشاركة القيادة المتفرقة لتعزيز نقل المعرفة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع مع فريق لتطوير حزم العمل. لاحظ مدير المشروع وجود فجوة في عملية جمع المتطلبات حيث كانت هناك نقاط مهمة مفقودة، مما يؤثر على الجدول الزمني للمشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة إلغاء المشروع.",
          "correct": true
        },
        {
          "text": "الاجتماع مع راعي المشروع وأصحاب المصلحة لطلب زيادة الميزانية.",
          "correct": false
        },
        {
          "text": "اجتمع مع مدير المنتج لإنشاء عمل متراكم بالمتطلبات الناقصة.",
          "correct": false
        },
        {
          "text": "قم بتقييم الأثر وتحديث سجل المخاطر وعرضه على أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "32\nأي مما يلي ليس قوة قائمة على الموارد فيما يتعلق بالمشاريع الضخمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التوظيف على أساس تعاقدي",
          "correct": true
        },
        {
          "text": "توظيف المواهب الخبيرة",
          "correct": false
        },
        {
          "text": "التوظيف على أساس الإعارة",
          "correct": false
        },
        {
          "text": "التوظيف عن طريق التحكم المباشر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تفكر إحدى الشركات في اعتماد المنهجية الرشيقة للمشاريع المستقبلية. يقود مدير المشروع مناقشة تركز على الفوائد المرتبطة بالمنهجية الرشيقة.\nأي من النقاط التالية يجب على مدير المشروع تسليط الضوء عليها؟",
      "explanation": "",
      "choices": [
        {
          "text": "الشفافية أمر أساسي، والتسليم المبكر والموثوق به، والمنهجية تتبنى التغيير",
          "correct": true
        },
        {
          "text": "طريقة تعتمد على المنتج، وتقسم المشاريع إلى مراحل قيمة، وتركز على مبررات العمل",
          "correct": false
        },
        {
          "text": "توجد وثائق واضحة، ونقطة مسؤولية واحدة، وتعاون فعال",
          "correct": false
        },
        {
          "text": "عدم العمل لوقت إضافي إن أمكن، والتواصل وجهاً لوجه والنظر باستمرار إلى الوراء للمضي قدماً",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nيعمل الفريق منذ شهرين وقد فاتته باستمرار قصص المستخدمين المخطط لها. كيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعزيز تغيير مدة التكرار من أجل الالتزام بما هو مخطط له",
          "correct": true
        },
        {
          "text": "تأكد من أن حجم العدو السريع مناسب لمدة التكرار.",
          "correct": false
        },
        {
          "text": "الانخراط في توظيف مورد من ذوي المهارات العالية لتعزيز المهارات.",
          "correct": false
        },
        {
          "text": "فكر في استخدام نظام المكافآت لتشجيع التسليم في الوقت المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nيسعى مدير المشروع إلى التخفيف من عبء العمل في قسم تكنولوجيا المعلومات مع تمكين الأعمال من بدء عمليات التنفيذ الجديدة وإرساء الأساس للحلول المستقبلية. كيف ينبغي لمدير المشروع تسهيل هذا الانتقال؟",
      "explanation": "",
      "choices": [
        {
          "text": "فرض سياسات حوكمة صارمة لتكنولوجيا المعلومات مركزية داخل قسم تكنولوجيا المعلومات، مما يضمن التوحيد والسيطرة على جميع مساعي تكنولوجيا المعلومات.",
          "correct": true
        },
        {
          "text": "تفويض مقترحات مشاريع تكنولوجيا المعلومات الشاملة إلى قسم تكنولوجيا المعلومات لتقييمها والموافقة عليها قبل البدء في أي مشروع.",
          "correct": false
        },
        {
          "text": "تمكين وحدات الأعمال من استخدام منصة مبسطة لإدارة مشاريع تكنولوجيا المعلومات لبدء المشاريع ومراقبتها بشكل مستقل.",
          "correct": false
        },
        {
          "text": "التعاون مع فرق عمل تكنولوجيا المعلومات متعددة الوظائف لتخطيط وتنفيذ مشاريع تكنولوجيا المعلومات بشكل مشترك، وتعزيز التعاون بين أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "35\nيعمل مدير مشروع على إدارة المتطلبات في شركة أدوية. ما هو التحسين الذي ينبغي أن تتوقعه مؤسسة مدير المشروع كنتيجة للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "جودة منخفضة",
          "correct": true
        },
        {
          "text": "زيادة التكاليف",
          "correct": false
        },
        {
          "text": "تقليل المخاطر",
          "correct": false
        },
        {
          "text": "زيادة الجدول الزمني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء وضع خطة إدارة أصحاب المصلحة لمشروع كبير، ينظم مدير المشروع ورشة عمل لتحديد وتقييم قوة أصحاب المصلحة وتأثيرهم. نظرًا لضيق الوقت، يمكن أن تستغرق ورشة العمل يومًا واحدًا فقط.\nما الذي يجب على مدير المشروع فعله لتحقيق هذا الهدف ضمن الإطار الزمني لورشة العمل؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام مصفوفة القوة-المصلحة",
          "correct": true
        },
        {
          "text": "استخدام تقنية المجموعة الاسمية",
          "correct": false
        },
        {
          "text": "استخدام نموذج مكعب أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "استخدم مخطط باريتو البياني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير المشروع بالتواصل مع الجهة الراعية ومناقشة المخاوف المتعلقة بعدم الامتثال. ويدرك مدير المشروع أن هذا يمكن أن يكون حالة تدقيق محتملة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "لا تفعل شيئًا واستمر في العمل كما في السابق، على افتراض أنه سيكون هناك تدقيق.",
          "correct": true
        },
        {
          "text": "فك ارتباط القسم غير الملتزم، حيث أن هذا الأمر يمثل مشكلة",
          "correct": false
        },
        {
          "text": "افصح عن مصدر المشكلة للمراجعين ودعهم يتخذون القرار.",
          "correct": false
        },
        {
          "text": "الحصول على الالتزام والموافقة من القيادة على عدم الامتثال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع (أ) = 5%، المشروع (ب) = 5%، المشروع (ج) = 3%، المشروع (د) = 1%.\nأي من هذه المشاريع يجب اختياره بناءً على أرقام معدل العائد الداخلي المقدمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المشروع أ",
          "correct": true
        },
        {
          "text": "المشروع ب",
          "correct": false
        },
        {
          "text": "المشروع ج",
          "correct": false
        },
        {
          "text": "المشروع دال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بإدارة مشروع رشيق. مدير مكتب إدارة المشاريع ليس على دراية بالتسليم الرشيق.\nأي من العبارات التالية تصف النهج الرشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستجابة للتغيير على اتباع خطة",
          "correct": true
        },
        {
          "text": "تعاون العملاء على اتباع خطة",
          "correct": false
        },
        {
          "text": "الاستجابة للتغيير على العمليات والأدوات",
          "correct": false
        },
        {
          "text": "تعاون العملاء على الاختبار الشامل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الفريق، يتجادل اثنان من أعضاء الفريق الذين عملوا على نفس المهام حول من هو المخطئ في تأخر المهمة. لا يريد أي منهما أن يُنظر إليه على أنه المتسبب في التأخير.\nما هو السبب الأرجح لهذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الأولويات المتضاربة",
          "correct": true
        },
        {
          "text": "مسؤوليات غير واضحة",
          "correct": false
        },
        {
          "text": "المنافسة الشخصية",
          "correct": false
        },
        {
          "text": "اختيار الموظفين",
          "correct": false
        }
      ]
    }
  ]
}
