{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 2760,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "3\nيجب أن يكون مديرو المشاريع قادرين على تحديد العيوب التي تسبب أخطاء في اتخاذ القرارات. ما هو الخيار الذي من شأنه أن يساعد مدير المشروع على اتخاذ القرارات المثلى؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستفادة من التحيزات",
          "correct": true
        },
        {
          "text": "استخدام افتراضات خاطئة",
          "correct": false
        },
        {
          "text": "التحقق مع الآخرين",
          "correct": false
        },
        {
          "text": "تطبيق الأخطاء المنطقية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التخطيط لمشروع ما مع عمليات التسليم التدريجي، يدرك الفريق أنه سيحتاج إلى خبرة محددة لأحد المخرجات في نهاية المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإلحاق الفريق بالتدريب حتى يتمكنوا من التزود بالخبرات اللازمة.",
          "correct": true
        },
        {
          "text": "طلب توافر الموارد اللازمة ذات الخبرة من الجهة الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق اكتساب الخبرة من خلال التعلم الذاتي.",
          "correct": false
        },
        {
          "text": "تحديد اتفاقية العمل ومشاركتها مع الفريق لتنسيق الأنشطة لاكتساب الخبرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في شركة سيارات ناجحة ذات معايير جودة عالية. ويحتاج مدير المشروع إلى التأكد من أنه ينشئ شبكة WBS عالية الجودة.\nأي مما يلي ليس من الخصائص الرئيسية لنمط مخطط الشبكة WBS عالي الجودة؟",
      "explanation": "",
      "choices": [
        {
          "text": "موجه نحو التسليم",
          "correct": true
        },
        {
          "text": "التسلسل الهرمي",
          "correct": false
        },
        {
          "text": "قاعدة 1%",
          "correct": false
        },
        {
          "text": "التركيز على العملاء",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق المشروع للتو مسحًا بيئيًا واكتشفوا الكثير من العوائق ذات الصلة التي يمكن أن تؤثر سلبًا على تنفيذ المشروع. يعمل مدير المشروع مع الفريق لفهم تفاصيل كل عائق تم تحديده وكيفية ارتباط العوائق ببعضها البعض، من أجل فهم التعقيد الكلي للمشروع. سيمكن ذلك الفريق من التوصل إلى خطة تعالج التحديات التي تم تحديدها\nأي من الأساليب التالية استخدمها مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل باريتو",
          "correct": true
        },
        {
          "text": "التحليل النقدي",
          "correct": false
        },
        {
          "text": "التفكير النُظُمي",
          "correct": false
        },
        {
          "text": "إدارة الجودة الشاملة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق المشروع مشروع بنجاح مشروعاً. بدأ نفس الفريق وثلاثة أشخاص جدد مشروعًا آخر بقيادة مدير جديد في سكروم.\nكيف سيقود مدير سكروم الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "عالية التوجيه، عالية الدعم",
          "correct": true
        },
        {
          "text": "منخفضة التوجيه، عالية الدعم",
          "correct": false
        },
        {
          "text": "عالية التوجيه، منخفضة الدعم",
          "correct": false
        },
        {
          "text": "منخفضة التوجيه، منخفضة الدعم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود فريقاً في مشروع تطوير جديد. يتكون الفريق من مجموعة متنوعة من الأشخاص ذوي الشخصيات وأساليب العمل المختلفة. ويلتزم مدير المشروع بإنشاء فريق متماسك ومنتج، لذلك قرر تقديم نموذج سلوك DISC لمساعدة أعضاء الفريق على فهم بعضهم البعض بشكل أفضل.\nاستنادًا إلى نموذج سلوك DISC، أي من الخصائص التالية أفضل وصف لأسلوب التأثير؟",
      "explanation": "",
      "choices": [
        {
          "text": "مباشر وموجه نحو تحقيق النتائج وحازم",
          "correct": true
        },
        {
          "text": "منفتح ومتحمس ومتفائل",
          "correct": false
        },
        {
          "text": "متعاون، صبور، متواضع، لبق، متواضع، لبق",
          "correct": false
        },
        {
          "text": "تحليلية ومتحفظة ودقيقة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "شركة لديها عقد قائم لصيانة وتحسين قاعدة بيانات عميل أحد العملاء. يقوم القسم القانوني للشركة بإبلاغ مدير المشروع بأن تشريعًا جديدًا يتطلب حماية أكثر صرامة لمعلومات العملاء قد يتم توقيعه قريبًا ليصبح قانونًا. وسيتطلب القانون تطبيق ميزات أمنية إضافية في قاعدة البيانات التي يقوم مدير المشروع بصيانتها. لم يتم تضمين هذه الميزات في نطاق العقد الحالي.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب دعم راعي المشروع للتأثير على العميل لتعديل العقد على الفور.",
          "correct": true
        },
        {
          "text": "اطلب من القسم القانوني إثارة المسألة في مفاوضات العقد التالي مع العميل.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر مع المشكلة وتخطيط الاستجابة للمخاطر مع راعي المشروع والعميل.",
          "correct": false
        },
        {
          "text": "انتظر حتى يتم الانتهاء من المتطلبات القانونية حتى يمكن تحديد التغيير في النطاق بشكل ملموس",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "3\nما هو العنصر الأساسي للحفاظ على دعم والتزام جميع أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الصدق",
          "correct": true
        },
        {
          "text": "التواصل الفعال",
          "correct": false
        },
        {
          "text": "الشفافية",
          "correct": false
        },
        {
          "text": "الموثوقية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في نهاية المشروع للسماح بتهدئة النزاع وتسجيله في الدروس المستفادة\nأثناء تنفيذ المشروع، تنشأ مشكلة تتطلب تنفيذ خطة الطوارئ الخاصة بالمشروع، مما يؤثر على الجدول الزمني للمشروع. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الشروع في تدقيق المخاطر.",
          "correct": true
        },
        {
          "text": "إصدار طلب تغيير.",
          "correct": false
        },
        {
          "text": "مراجعة تأثير التكلفة.",
          "correct": false
        },
        {
          "text": "تحديث خطة الطوارئ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يفكر مدير مشروع في إحدى المؤسسات في تنفيذ مشروع رشيق في التنفيذ. ولدى المنظمة مكتب قوي لإدارة المشاريع (PMO) وعملية واضحة المعالم للتحكم في التغيير.\nما هو الجانب الرئيسي في تنفيذ المشاريع الرشيقة الذي يجب على مدير المشروع التأكيد عليه باعتباره الحجة الأكثر إقناعاً لاعتماده؟",
      "explanation": "",
      "choices": [
        {
          "text": "يمكن للتسليم الرشيق تحسين الجودة من خلال التسليم التدريجي وإصلاح العيوب بكفاءة.",
          "correct": true
        },
        {
          "text": "توفر فرق العمل الرشيقة المرونة في استيعاب التغييرات المخطط لها مع تبسيط عملية الموافقة.",
          "correct": false
        },
        {
          "text": "يستخدم مالك المنتج قائمة تعرف باسم قائمة الأعمال المتراكمة لتحديد أولويات عناصر العمل، بما في ذلك التغييرات المخطط لها.",
          "correct": false
        },
        {
          "text": "إن التسليم الرشيق مناسب تمامًا للتعامل مع التغييرات غير المتوقعة وتوقعات الأعمال المتغيرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتطلب أحد المشاريع خدمات بائع متخصص لتركيب قطعة معقدة ومكلفة للغاية من المعدات. أرسل مدير المشروع بريدًا إلكترونيًا قبل أسبوع إلى أحد الشركاء لطلب حضور أحد المتخصصين إلى الموقع. لسوء الحظ، لم يرد البائع للتأكيد.\nما هي طريقة التواصل المستخدمة في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "اسحب",
          "correct": true
        },
        {
          "text": "تفاعلية",
          "correct": false
        },
        {
          "text": "ادفع",
          "correct": false
        },
        {
          "text": "العلاقات بين الأشخاص",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقود مشروعًا يتم تنفيذه في وقت واحد في بلدين بفارق 11 ساعة في التوقيت. ويحتاج مدير المشروع إلى تحديد وقت مناسب للطرفين لتزويد أصحاب المصلحة بمعلومات عن الجدول الزمني للمشروع وتكلفته والتقدم المحرز في الأداء.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدم الساعة العالمية لتحديد بعض الأوقات المحتملة التي تناسب جميع الأطراف المعنية.",
          "correct": true
        },
        {
          "text": "أرسل استبياناً إلى أصحاب المصلحة تسألهم فيه عن مدى تفرغهم خلال الأسبوع.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعين منفصلين، واحد لأصحاب المصلحة في كل بلد.",
          "correct": false
        },
        {
          "text": "سجل الاجتماع وأرسله إلى أصحاب المصلحة لمشاهدته في وقتهم الخاص.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق المشروع بعملية تحديد الفوائد المرتبطة بمشروعين من أجل اختيار المشروع الذي سيحقق قيمة أكبر للأعمال. وتتضمن المهمة تحليل المشروع الذي يساعد الشركة على أفضل وجه في تلبية متطلبات الامتثال والمتطلبات التنظيمية، فضلاً عن تحسين رضا العملاء.\nأي مما يلي أفضل وصف لفئة الفوائد التي يتم تحليلها في هذه المهمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الفائدة الكمية",
          "correct": true
        },
        {
          "text": "الفائدة النوعية",
          "correct": false
        },
        {
          "text": "مزايا الجودة",
          "correct": false
        },
        {
          "text": "فائدة حقيقية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "7\nأثناء تخطيط الإصدار، ينشأ تعارض بين أصحاب المصلحة فيما يتعلق بتحديد أولويات بعض الاحتياجات، مما يؤدي إلى فقدان فريق التطوير للتركيز. لمواءمة جميع أصحاب المصلحة وحل هذا النزاع، ما هو أسلوب حل النزاعات الذي ينبغي لمدير المشروع أن يستخدمه؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجبار",
          "correct": true
        },
        {
          "text": "التعاون",
          "correct": false
        },
        {
          "text": "الانسحاب",
          "correct": false
        },
        {
          "text": "التنعيم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع فريق مشروع يتألف من أعضاء من أقسام مختلفة، بما في ذلك الهندسة والتسويق والمبيعات. أثناء عملية التطوير، ينشأ تعارض بين فريقي الهندسة والتسويق. يركز الفريق الهندسي على تسليم المنتج في الوقت المحدد وفي حدود الميزانية، بينما يركز فريق التسويق على ضمان تلبية المنتج لاحتياجات السوق المستهدفة.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اقترح أن يتنازل كل من فريقي الهندسة والتسويق عن شيء ما للتوصل إلى اتفاق.",
          "correct": true
        },
        {
          "text": "اقترح أن يعمل فريقا الهندسة والتسويق معًا لإيجاد حل يناسب كلا الفريقين.",
          "correct": false
        },
        {
          "text": "اقترح أن يكون الفريق الهندسي على صواب وضمان تسليم المنتج في الوقت المحدد وفي حدود الميزانية.",
          "correct": false
        },
        {
          "text": "اقترح أن تتنافس فرق الهندسة والتسويق لمعرفة من يمكنه التوصل إلى أفضل الحلول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج العميل إلى معرفة حالة المنتج والمشروع ككل والخطوات التالية المخطط لها في الشهر التالي كل شهر.\nكيف يجب على مدير المشروع التواصل مع هذا العميل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال رسالة بريد إلكتروني أسبوعية عن الحالة الأسبوعية، بما في ذلك تقييم كامل للقيمة المكتسبة.",
          "correct": true
        },
        {
          "text": "إنشاء تقرير حالة شهري وإدراج المشكلات الفنية كمرفق.",
          "correct": false
        },
        {
          "text": "قم بإجراء مكالمة شهرية مع العميل لتلخيص ما حدث مؤخرًا وتقديم مراجعة عامة للمنتج.",
          "correct": false
        },
        {
          "text": "عرض التقدم المحرز في المشروع على دفعات شهرية مع التحقق من صحة الحالة بشكل رسمي وشامل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "متطلبات الامتثال لا يمكن اعتبارها من أصول المنظمة ويجب تضمينها في تقرير فترة السنتين\nيتلقى فريق ما نواتج تمت الاستعانة بمصادر خارجية ويقرر أنها لا تفي بمعايير القبول المتفق عليها ما الذي يجب على مدير المشروع الرجوع إليه للتحقق من ذلك مع البائع؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة المشتريات",
          "correct": true
        },
        {
          "text": "طلب تقديم العروض (RFP)",
          "correct": false
        },
        {
          "text": "بيان العمل (SOW)",
          "correct": false
        },
        {
          "text": "عمليات التفتيش",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "5\nيحتاج مدير المشروع في مؤسسة متعددة الوظائف إلى إبلاغ مدير المشروع مدير الإدارة بعدد ونوع الموارد المطلوبة، والمدة الزمنية التي سيحتاجها مدير المشروع ما الذي يجب أن يستخدمه مدير المشروع لتقديم معلومات الموارد هذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعيينات الموارد",
          "correct": true
        },
        {
          "text": "الرسم البياني للموارد",
          "correct": false
        },
        {
          "text": "مصفوفة إسناد المسؤولية (RAM)",
          "correct": false
        },
        {
          "text": "المخطط التنظيمي للمشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم مدير مشروع مؤخرًا إلى مؤسسة جديدة. راعي المشروع هو خبير في الموضوع ويريد إدارة النطاق من خلال تقديم زيادات صغيرة وتغيير النطاق بناءً على الملاحظات.\nأي من الطرق التالية ينبغي أن يكون الخيار الموصى به؟",
      "explanation": "",
      "choices": [
        {
          "text": "سكروم",
          "correct": true
        },
        {
          "text": "الشلال",
          "correct": false
        },
        {
          "text": "كانبان",
          "correct": false
        },
        {
          "text": "تنبؤي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يريد مدير المشروع تحفيز أعضاء فريقه وتحسين أداء المشروع.\nما النهج الذي من المرجح أن يكون أكثر فعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "كافئ جميع أعضاء الفريق على قدم المساواة بمنحهم جوائز رسمية للاعتراف بإنجازاتهم علنًا.",
          "correct": true
        },
        {
          "text": "تنفيذ المبادرات بناءً على فهم مدير المشروع لما يحفز الآخرين.",
          "correct": false
        },
        {
          "text": "قم بتفويض التحفيز لأعضاء الفريق، على افتراض أنهم محترفون يتمتعون بالتحفيز الذاتي.",
          "correct": false
        },
        {
          "text": "تقديم مجموعة متنوعة من الحوافز التحفيزية المصممة خصيصًا لتلبية احتياجات أعضاء الفريق الفردية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنت مدير المشروع في مؤسسة تطبق التسليم الرشيق. لديك خبرة كمدير سكروم وستؤدي هذا الدور بالإضافة إلى مسؤوليات إدارة المشروع. يريد أحد أعضاء الفريق معرفة ما هو التركيز الرئيسي للقائد الخادم.\nماذا سيكون ردك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرضاء العميل وإثبات القيمة المقدمة.",
          "correct": true
        },
        {
          "text": "نمو ورفاهية الأشخاص والمجتمعات التي ينتمون إليها.",
          "correct": false
        },
        {
          "text": "إدارة توقعات أصحاب المصلحة والتواصل معهم.",
          "correct": false
        },
        {
          "text": "الإنتاجية والكفاءة لتحقيق الالتزامات التي تم التعهد بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير المشروع (ب) لاستلام المشروع من مدير المشروع (أ) مدير المشروع (ب) يبلغ مدير المشروع (ب) أن المشروع يسير وفق الجدول الزمني المحدد، فقط لأن مدير المشروع (أ) يدفع الفريق باستمرار إلى الأداء.\nما هو أول إجراء يجب أن يتخذه مدير المشروع (ب) بصفته مدير المشروع الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من حالة المخاطر.",
          "correct": true
        },
        {
          "text": "تحقق من أداء التكلفة.",
          "correct": false
        },
        {
          "text": "تحديد استراتيجية الإدارة.",
          "correct": false
        },
        {
          "text": "أخبر الفريق بالأهداف الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع مختلط. اتصل أحد أصحاب المصلحة مباشرة بأحد أعضاء الفريق وطلب إجراء تغيير. وبسبب هذا الطلب، تم تشتيت انتباه عضو الفريق عن عمله، مما تسبب في خسارة في الإنتاجية.\nما الذي يجب أن يفعله عضو الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "أبلغ صاحب المصلحة أن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى مدير المشروع.",
          "correct": true
        },
        {
          "text": "أبلغ صاحب المصلحة أن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "قم بإبلاغ مسؤول سكروم بطلب أصحاب المصلحة للتغيير وتأثير ذلك على الإنتاجية.",
          "correct": false
        },
        {
          "text": "أبلغ مسؤول سكروم الرئيسي حتى يمكن مناقشة التغيير مباشرة مع صاحب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "5\nتم تكليف فريق مشروع ببناء منتج جديد. يبني الفريق العرض التوضيحي أولاً ثم يضيف ميزات إلى المنتج الأولي. هذا مثال على أي ممارسة تقنية؟",
      "explanation": "",
      "choices": [
        {
          "text": "التطوير القائم على الاختبار (TDD)",
          "correct": true
        },
        {
          "text": "التسليم المستمر",
          "correct": false
        },
        {
          "text": "التطوير القائم على السلوك",
          "correct": false
        },
        {
          "text": "المسامير",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "55\nفي أي مرحلة من مراحل نموذج توكمان لتطوير الفريق يجب أن يركز مدير المشروع على زيادة تحفيز الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشكيل",
          "correct": true
        },
        {
          "text": "اقتحام",
          "correct": false
        },
        {
          "text": "المعيار",
          "correct": false
        },
        {
          "text": "الأداء",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير المشروع بإجراء تغييرات متعلقة بالامتثال من خلال اعتماد نهج جديد لتنفيذ المشروع. وأثناء المراجعة الخارجية للحسابات، كشفت مراجعة الحسابات أن بعض الأعمال المكونة للمشروع لم تكن مطابقة لمعايير المنظمة.\nماذا كان ينبغي لمدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ المنجزات المتوافقة فقط.",
          "correct": true
        },
        {
          "text": "تفسير واضح لإرشادات الامتثال.",
          "correct": false
        },
        {
          "text": "ترجمة متطلبات العمل المترجمة إلى تصميم.",
          "correct": false
        },
        {
          "text": "بحث اللوائح التنظيمية في القطاع العام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "56\nأي مما يلي يختلف عن الخيارات الأخرى لإدارة أصحاب المصلحة الخارجيين في المشاريع الضخمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإقناع",
          "correct": true
        },
        {
          "text": "الإنابة",
          "correct": false
        },
        {
          "text": "الأخذ والعطاء",
          "correct": false
        },
        {
          "text": "أوامر صارمة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين قائد فريق لمشروع مستمر. يعمل أعضاء الفريق معاً منذ فترة.\nكيف يجب على قائد الفريق البدء في بناء العلاقات؟",
      "explanation": "",
      "choices": [
        {
          "text": "توزيع المهام ومراقبة جودة المخرجات.",
          "correct": true
        },
        {
          "text": "تحدث عن تفضيلاتك الشخصية وتأكد من أن الفريق يتفهم نهجك.",
          "correct": false
        },
        {
          "text": "اطلب من بعض أعضاء الفريق مشاركة معلومات عن الأعضاء الآخرين للتعرف على الفريق.",
          "correct": false
        },
        {
          "text": "اسأل أعضاء الفريق مباشرةً عن الأمور الشخصية والمتعلقة بالعمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد فريق المشروع عددًا من العيوب في بعض النواتج ويعتزم حلها في أقرب وقت ممكن. سيحتاج مدير المشروع إلى تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).\nما الذي يجب على مدير المشروع القيام به قبل تقديم الطلب؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ التغييرات على الفور بسبب ضيق الوقت.",
          "correct": true
        },
        {
          "text": "إرسال طلب التغيير إلى العميل للموافقة عليه.",
          "correct": false
        },
        {
          "text": "أكمل تحليل الأثر لكل تغيير مطلوب.",
          "correct": false
        },
        {
          "text": "إرسال طلبات التغيير إلى الراعي للموافقة عليها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع متمرس بالتحضير لاجتماع استهلالي لتقييم خدمة جديدة. وقد تم تقديم وصف رفيع المستوى للخدمة\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "تطوير مصفوفة المسؤولية، والمساءلة، والاستشارة، والإبلاغ (RACI).",
          "correct": false
        },
        {
          "text": "تحديد بيان نطاق المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تقسيم العمل (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مكتب إدارة المشاريع (PMO) في إحدى الشركات بدمج المزيد من التقنيات التكيفية وتعيين مدير مشروع جديد يتمتع بخبرة في إدارة المشاريع المختلطة. ويتسم الفريق بالبطء في اعتماد المنهجية الجديدة ولم يقم بتحديث أدوات المشروع في الوقت المناسب.\nما الإجراء الذي ينبغي على مدير المشروع اتخاذه لتحسين أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل رسالة بريد إلكتروني تطلب من جميع أعضاء فريق المشروع إكمال التحديثات في نهاية اليوم.",
          "correct": true
        },
        {
          "text": "قم بإعداد دورة تدريبية لجميع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "تواصل مع المديرين الوظيفيين للحصول على الدعم.",
          "correct": false
        },
        {
          "text": "تحدث مع كل عضو من أعضاء فريق المشروع بشكل فردي حول إجراء التحديثات اللازمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "5\nيقوم مدير مشروع يعمل على تنفيذ مشروع عالمي بتعيين فريق المشروع. بعد تشكيل الفريق، ماذا ينبغي لمدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل بريدًا إلكترونيًا ترحيبيًا واستضف حدثًا تعريفيًا بالفريق مع أعضاء الفريق حتى يتعرفوا على بعضهم البعض.",
          "correct": true
        },
        {
          "text": "إرسال خطة وميثاق إدارة المشروع إلى أعضاء الفريق لتعريفهم بأهداف المشروع وإجراءاته.",
          "correct": false
        },
        {
          "text": "قم بترتيب اجتماع لأعضاء الفريق لمناقشة أي مخاوف تتعلق بالمتطلبات ونطاق المشروع.",
          "correct": false
        },
        {
          "text": "أرسل لأعضاء الفريق استبياناً لمعرفة المزيد عن كل عضو، وشارك النتائج عبر البريد الإلكتروني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مشروع لتركيب ثلاث وحدات للتصوير بالرنين المغناطيسي في أحد المستشفيات؛ وقد اجتازت وحدة واحدة اختبار القبول ووحدتان قيد الإنشاء. يطلب العميل أمر تغيير لإضافة وحدة رابعة بمتطلبات مختلفة قليلاً.\nما الذي يجب أن يفعله مدير المشروع لتقدير تسليم الوحدة الإضافية بدقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاعتماد على البيانات التاريخية من المشاريع المماثلة.",
          "correct": true
        },
        {
          "text": "قسّم العمل إلى مهام أصغر وقدّر كل مهمة على حدة.",
          "correct": false
        },
        {
          "text": "استخدام الصيغ أو النماذج الصناعية بناءً على خصائص المشروع.",
          "correct": false
        },
        {
          "text": "قارن الوحدة الجديدة بالوحدات الحالية وقم بتعديل التقديرات الحالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع طويل ومستمر يرهق فريق المشروع. ولا يستطيع مدير المشروع تمديد الجدول الزمني للمشروع بسبب مشاكل تتعلق بالموعد النهائي.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "تقديم المزيد من التقدير لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "ناقش الوضع مع الفريق.",
          "correct": false
        },
        {
          "text": "طلب موارد إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "61\nأي من الخطوات التالية تعطي اهتماماً خاصاً لعمليات اتخاذ القرارات الجماعية؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعريف المشكلة",
          "correct": true
        },
        {
          "text": "توليد حلول المشكلات",
          "correct": false
        },
        {
          "text": "من الأفكار إلى العمل",
          "correct": false
        },
        {
          "text": "تخطيط إجراءات الحل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "62\nمن المحتمل أن يتأثر مشروع صيدلاني في مرحلة البدء باللوائح التنظيمية الجديدة للسوق. ما هي فئات أصحاب المصلحة التي يجب على مدير المشروع تعيينها للهيئة التنظيمية ذات الصلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "خارجي ذو قوة/تأثير عالٍ",
          "correct": true
        },
        {
          "text": "داخلية ذات قوة/تأثير عالٍ",
          "correct": false
        },
        {
          "text": "داخلي مع مستوى دعم معادٍ/مقاوم/مستوى دعم مقاوم",
          "correct": false
        },
        {
          "text": "خارجي مع مستوى دعم معادٍ/مقاوم/مستوى دعم مقاوم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكافح مدير مشروع لمعرفة أداء فرق المشروع في بيئة رشيقة. بالنسبة لنطاق العمل نفسه، قام الفريق \"أ\" بحساب وتسليم نقطة قصة واحدة وقام الفريق \"ب\" بحساب وتسليم 125 نقطة قصة.\nما الفريق الذي يؤدي بشكل أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الفريق (أ) حيث احتسبوا نقاط قصة أقل من الفريق",
          "correct": true
        },
        {
          "text": "الفريق B لأنه احتسب نقاط قصة أكثر من الفريق",
          "correct": false
        },
        {
          "text": "الفريق الذي يكمل أكبر عدد من القصص المختارة من الأعمال المتراكمة في سباق السرعة.",
          "correct": false
        },
        {
          "text": "الفريق الذي لديه أقل قدر من العيوب في مخرجاته.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم إحدى مؤسسات البنية التحتية الكبيرة بمراجعة وتوحيد أدوات وتقنيات المشروع.\nفيما يتعلق بـ \"متى يجب اتخاذ قرار اتخاذ إجراء تصحيحي؟\"، من أي مجموعة عملية يمكن أن يأتي هذا؟",
      "explanation": "",
      "choices": [
        {
          "text": "مجموعة عملية البدء في العملية",
          "correct": true
        },
        {
          "text": "مجموعة عمليات التخطيط",
          "correct": false
        },
        {
          "text": "مجموعة العمليات المنفذة",
          "correct": false
        },
        {
          "text": "مجموعة عمليات المراقبة والتحكم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإدارة مشروع باستخدام نهج مختلط وطلب من أحد كبار أعضاء الفريق إجراء تحليل كمي للمخاطر. ورد عضو الفريق بأنه لا يملك المعرفة اللازمة لإجراء مثل هذا التحليل.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتصعيد المشكلة إلى المدير الوظيفي.",
          "correct": true
        },
        {
          "text": "اتصل بمكتب إدارة المشروع (PMO) واطلب منهم تعيين عضو آخر في الفريق لديه المعرفة اللازمة لأداء هذه المهمة للفريق.",
          "correct": false
        },
        {
          "text": "مساعدة عضو الفريق على إجراء التحليل الكمي للمخاطر من خلال التدريب والتوجيه والإرشاد والتدريب.",
          "correct": false
        },
        {
          "text": "إجراء التحليل الكمي للمخاطر لعضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "65\nيقوم مدير المشروع بمساعدة المؤسسة على الانتقال من الأساليب التقليدية إلى الأساليب الرشيقة. تعمل فرق البنية التحتية وتخزين البيانات والهندسة المعمارية للمؤسسة بشكل مختلف تمامًا عن فرق تطوير التطبيقات.\nكيف ينبغي لمدير المشروع أن يطبق أجايل في هذه المؤسسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من كل فريق في المؤسسة تطبيق نفس المنهجية الرشيقة بحيث يمكن أن يوفر حل واحد يناسب الجميع الاتساق بين جميع الفرق.",
          "correct": true
        },
        {
          "text": "تكييف التنفيذ من خلال تكييف النهج بشكل متعمد لجعله أكثر ملاءمة للبيئة المعينة والعمل في هان",
          "correct": false
        },
        {
          "text": "فرض نهج الانتقال من الأعلى إلى الأسفل من خلال مطالبة الرئيس التنفيذي بتقديم الدعم لتطبيق أجايل في كل فريق في المؤسسة.",
          "correct": false
        },
        {
          "text": "اطلب من فريق واحد تطبيق سكروم كتجربة حتى تتمكن جميع الفرق الأخرى في المؤسسة من تطبيق سكروم أيضًا من خلال التعلم من هذا الفريق.",
          "correct": false
        }
      ]
    }
  ]
}
