 {
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
    "type": "multiple-choice",
    "text": "66\nفي بيئة تطوير رشيقة، متى يجب إجراء تحليل للمخاطر في بيئة تطوير رشيقة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قبل بدء كل تكرار",
        "correct": true
      },
      {
        "text": "خلال اجتماع الاستعداد اليومي",
        "correct": false
      },
      {
        "text": "في الاجتماع الاستعراضي",
        "correct": false
      },
      {
        "text": "بعد كل اجتماع سكروم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "66\nيجري تدقيق أحد المشاريع لضمان الامتثال للسياسات التنظيمية. ما هي العملية التي يتم إجراؤها؟",
    "explanation": "",
    "choices": [
      {
        "text": "جدول المراجعة",
        "correct": true
      },
      {
        "text": "إدارة جودة الخطة",
        "correct": false
      },
      {
        "text": "مراقبة الجودة",
        "correct": false
      },
      {
        "text": "إدارة الجودة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اكتمال مشروع لإنشاء منتج جديد وطرحه في السوق، ولكن المبيعات أقل بكثير مما كان متوقعًايحدد التحليل أن المنتج غير متوافق مع الكفاءات الأساسية للمؤسسة.\nخلال أي نشاط كان ينبغي اكتشاف هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل سيناريو ماذا لو",
        "correct": true
      },
      {
        "text": "مراجعة حالة العمل",
        "correct": false
      },
      {
        "text": "تقييم الأداء الاستراتيجي",
        "correct": false
      },
      {
        "text": "تعريف النطاق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "وصل مشروع رشيق طويل الأجل إلى منتصف الطريق وتم تعيين مدير مشروع جديد لتولي المسؤولية. بالإضافة إلى مدير المشروع، تم استبدال أحد أصحاب المصلحة الحاليين بآخر لديه خبرة أكبر فيما يتعلق بتكنولوجيا المشروع.\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مناقشة توقعات أصحاب المصلحة ومراجعة خطة المشاركة وفقاً لذلك.",
        "correct": true
      },
      {
        "text": "شجع صاحب المصلحة الجديد على الاجتماع مع مالك المنتج لمراجعة المعلومات ذات الصلة.",
        "correct": false
      },
      {
        "text": "إبلاغ جميع أصحاب المصلحة بعد مراجعة خطة المشروع بالمحتويات الجديدة المضافة",
        "correct": false
      },
      {
        "text": "عقد جميع اجتماعات المراجعة السريعة القادمة بحضور أصحاب المصلحة الجدد ومراجعة خطة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "6\nيقوم أحد كبار المديرين بإبلاغ مدير المشروع بأن أداء المشروع لا يرقى إلى مستوى أداء المشاريع الأخرى. ما الذي يمكن أن يستخدمه مدير المشروع لتحسين الأداء في السلسلة التالية من التكرارات؟",
    "explanation": "",
    "choices": [
      {
        "text": "جلسة استرجاع بأثر رجعي",
        "correct": true
      },
      {
        "text": "تحليل الأعمال المتراكمة",
        "correct": false
      },
      {
        "text": "بناء الفريق",
        "correct": false
      },
      {
        "text": "تحفيز الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع في مشروع صناعي ضخم. يتوزع فريق المشروع على ستة بلدان ومناطق زمنية مختلفة. وخلال اجتماع مراجعة، لوحظ أن هناك خطأ في تواريخ المراحل الأساسية الهامة المحددة\nما هو السبب الأكثر احتمالاً لفوات المواعيد النهائية؟",
    "explanation": "",
    "choices": [
      {
        "text": "عدم الالتزام بالشراء",
        "correct": true
      },
      {
        "text": "ضعف التواصل بين الفريق الواحد",
        "correct": false
      },
      {
        "text": "سوء فهم توقعات أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "توقعات أصحاب المصلحة مرتفعة للغاية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nيتمتع صاحب المصلحة التنفيذي بسلطة اتخاذ القرار الحاسم في تنفيذ المشروع ونجاحه. كيف ينبغي أن تنعكس أهمية أصحاب المصلحة هؤلاء في خطة إشراك أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وصف مستوى دعم المدير التنفيذي وتوقعاته وعتبة المخاطر والاتصالات المناسبة لاحتياجات المشروع المختلفة.",
        "correct": true
      },
      {
        "text": "ترتيب المسؤول التنفيذي في مخطط تنظيمي وتوضيح أي تقارب أو عداء مع أصحاب المصلحة الآخرين.",
        "correct": false
      },
      {
        "text": "قم بتسمية المدير التنفيذي على أنه \"داعم\" وتأكد من تحديث البريد الإلكتروني وأرقام الهواتف وأوقات الغياب/الإجازات.",
        "correct": false
      },
      {
        "text": "وصف مشاركة المدير التنفيذي في مشاريع سابقة مماثلة من أجل تحديد مستوى المشاركة المناسب على أساس كل حالة على حدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nيريد مدير المشروع وضع استراتيجية للحوافز والمكافآت لفريق المشروع. ما هو النهج الذي ينبغي اتباعه؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسأل قسم الموارد البشرية عن الحوافز التي يجب تقديمها",
        "correct": true
      },
      {
        "text": "تحقق من توفر الميزانية من أجل تحديد مبالغ المكافآت المحددة.",
        "correct": false
      },
      {
        "text": "توفير فرصة لعرض النتائج بشكل علني.",
        "correct": false
      },
      {
        "text": "تحديد الاحتياجات المحددة لكل عضو من أعضاء الفريق لتحديد الحوافز.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتبر مدير المشروع أن الامتثال جزء من أصول عمليات المنظمة. ومع ذلك، قرر فريق المشروع إدراج الامتثال كمدخلات للعمليات ذات الصلة بدلاً من توثيق هذه القواعد كمتطلبات.\nما هي مسؤولية مدير المشروع عن الامتثال؟",
    "explanation": "",
    "choices": [
      {
        "text": "يعمل كمنسق للموارد والأنشطة",
        "correct": true
      },
      {
        "text": "إجراء عمليات التدقيق لمتطلبات الامتثال",
        "correct": false
      },
      {
        "text": "إجراء تحليلات المخاطر الخاصة بمخاطر الامتثال",
        "correct": false
      },
      {
        "text": "تغيير أصول عملية التغييرات في المنظمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة نقل بتحويل عملياتها التشغيلية والنظام الرئيسي الذي تستخدمه هذه الشركة لنقل البضائع. تم وضع بيان النطاق. تم الاتفاق على نهج تسليم متكرر من قبل جميع أصحاب المصلحة.\nما الذي يحتاج مدير المشروع إلى القيام به بعد ذلك لمساعدة الفريق على فهم العمل الذي يجب القيام به؟",
    "explanation": "",
    "choices": [
      {
        "text": "ابدأ العمل على خطة إدارة المشروع مع حزم العمل وجدول زمني مفصل ومهام العمل لأعضاء الفريق.",
        "correct": true
      },
      {
        "text": "العمل مباشرةً مع أصحاب المصلحة على هيكل تقسيم العمل (WBS) وتعيين المهام مع الجدول الزمني المطلوب لكل عضو من أعضاء الفريق لبدء العمل.",
        "correct": false
      },
      {
        "text": "اعمل مع فريق العمل على تحليل النطاق إلى WBS وحزم عمل من أجل إنشاء المخرجات والجداول الزمنية المطلوبة.",
        "correct": false
      },
      {
        "text": "قم بإنشاء خطة إدارة المتطلبات لتحديد كيفية جمع متطلبات المشروع وتحليلها وتوثيقها، ثم تعيين المتطلبات لأعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد التشاور مع أصحاب المصلحة التنفيذيين، تقرر أن يحل مدير المشروع محل أحد البائعين بينما يكون المشروع في مرحلة التنفيذ. والبائع الجديد ببساطة لديه معرفة أكبر بالمجال ولم يتم تحديده في وقت سابق، ولكن من المحتمل أن يكون البائع الجديد هو المرشح المناسب الآن.\nأي من المستندات التالية تحتوي على أفضل المعلومات للبائع الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب المعلومات (RFI)",
        "correct": true
      },
      {
        "text": "طلب عرض الأسعار (RFQ)",
        "correct": false
      },
      {
        "text": "طلب تقديم العروض (RFP)",
        "correct": false
      },
      {
        "text": "طلب التعاقد (RFC)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "73\nيحاول مدير مشروع جديد تمكين القيادة المشتركة داخل فريقه الافتراضي. أي من الخيارات التالية يجب أن يتجنبها مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "احترام كفاءات أعضاء الفريق",
        "correct": true
      },
      {
        "text": "أرخِ الزمام وتجنب \"فخ المسؤولية\"",
        "correct": false
      },
      {
        "text": "تشجيع السلوكيات القيادية",
        "correct": false
      },
      {
        "text": "الحفاظ على \"مسافة طبيعية\" مع الفريق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة متعددة الجنسيات بتطوير منتج رقمي محلياً باستخدام منصة تكنولوجية جديدة. الخبير الوحيد في هذه المنصة موجود في المقر الرئيسي للشركة، وهو مسؤول عن تقديم الدعم لمختلف البلدان.\nكيف يمكن لمدير المشروع المحلي ضمان مشاركة هذا الخبير؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصميم جدول زمني للسفر بحيث يمكن تقديم المساعدة في الوقت المناسب وفي الموقع",
        "correct": true
      },
      {
        "text": "ضم الخبير إلى الفريق باستخدام بيئة افتراضية.",
        "correct": false
      },
      {
        "text": "اطلب من راعي المشروع تعيين الخبير كعضو متفرغ في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق الاتصال بالخبير كمصدر خبرة خارجي حسب الحاجة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنت تدير مشروعًا معقدًا يضم عددًا كبيرًا من أصحاب المصلحة. وقد قررت استخدام نموذج الأهمية لتحديد أصحاب المصلحة الأكثر أهمية وتجميعهم بناءً على قوتهم وإلحاحهم وشرعيتهم.\nأي من الجوانب التالية هو الأكثر أهمية في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "المهيمن",
        "correct": true
      },
      {
        "text": "معتمد",
        "correct": false
      },
      {
        "text": "متطلب",
        "correct": false
      },
      {
        "text": "نهائي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الأسبوعي، يقوم أعضاء الفريق بمراجعة المهام التي كلف بها مدير المشروع. ويشكو بعض أعضاء الفريق من عدم وجود معلومات كافية لتقدير المدة التي سيستغرقها إكمال العمل.\nما هو السبب الأرجح لهذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "أهداف المشروع غير محددة بوضوح",
        "correct": true
      },
      {
        "text": "بيئة الأعمال ديناميكية للغاية",
        "correct": false
      },
      {
        "text": "المنافسة الداخلية بين أعضاء الفريق",
        "correct": false
      },
      {
        "text": "الأدوار والمسؤوليات غير محددة بوضوح",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تتم الموافقة على تغيير التصميم المطلوب من العميل من قبل مجلس مراقبة التغيير (CCB). ثم يكتشف مدير المشروع أن التغيير سيتسبب في تأخير المشروع لمدة ثلاثة أشهر.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "زيادة الميزانية المأذون بها، وطلب موارد إضافية",
        "correct": true
      },
      {
        "text": "إعادة تحديد نطاق المشروع ليشمل التصميم الجديد",
        "correct": false
      },
      {
        "text": "المسار السريع وتعطل الجدول الزمني",
        "correct": false
      },
      {
        "text": "إجراء تقييم دقيق للطلب وفقًا لخطة إدارة المخاطر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "76\nما هي الأداة التي ينبغي لمدير المشروع أن يدمجها لتحديد مقاومة أصحاب المصلحة الشائعة لتحديات التغيير والاستجابة لها بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "إدارة التغيير",
        "correct": true
      },
      {
        "text": "إدارة المخاطر",
        "correct": false
      },
      {
        "text": "إدارة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "إدارة الاتصالات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "77\nخلال أحد اجتماعات اللجنة التوجيهية للمشروع، أبلغ مدير المشروع أن أحد أعضاء الفريق الرئيسيين الذي كان داعماً في السابق أصبح مقاوماً للتغييرات وسلبياً تجاهها. أين ينبغي تسجيل هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "مصفوفة المسؤولية والمساءلة والتشاور والإبلاغ (RACI)",
        "correct": true
      },
      {
        "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "سجل المخاطر وسجل المشكلات",
        "correct": false
      },
      {
        "text": "تقارير أداء العمل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروعًا بنطاق يتم تسليمه جزئيًا من قبل أحد البائعين. تختلف عمليات البائع وأدواته عن عمليات وأدوات فريق المشروع، مما قد يشكل خطراً.\nكيف ينبغي لمدير المشروع التخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب فريق المشروع الداخلي على استخدام عمليات البائع وأدواته.",
        "correct": true
      },
      {
        "text": "تدريب البائع على استخدام نفس العمليات والأدوات التي يستخدمها الفريق الداخلي.",
        "correct": false
      },
      {
        "text": "وضع استراتيجية لمواءمة العمليات والأدوات الداخلية وعمليات البائعين والموردين.",
        "correct": false
      },
      {
        "text": "التوصية بإشراك بائع جديد يستخدم العمليات والأدوات الداخلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل مدير المشروع للتو مرحلة بدء المشروع ويحتاج إلى تحديد وتحليل أصحاب المصلحة. ويركز ميثاق المشروع على نطاق المشروع والموافقة على الميزانية فقط.\nما الذي يجب أن يفعله مدير المشروع لتحديد أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة الدروس المستفادة من المشاريع السابقة.",
        "correct": true
      },
      {
        "text": "مراجعة ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "قم بإجراء جلسة عصف ذهني مع فريق المشروع.",
        "correct": false
      },
      {
        "text": "راجع المخطط التنظيمي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب مالك المنتج دمج وظيفة مدمجة لبوابة المرضى في السباق القادم. وقرر الفريق إجراء جلسة تقدير التقارب لتحديد مقدار القيمة التي سيتم تقديمها\nما الدور المسؤول عن تيسير الجلسة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مالك المنتج",
        "correct": true
      },
      {
        "text": "سكروم ماستر",
        "correct": false
      },
      {
        "text": "المطور",
        "correct": false
      },
      {
        "text": "أصحاب المصلحة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل فريق مشروع مؤخرًا مشروعًا طويل الأجل باستخدام نهج تنبؤي. ثم بدأ الفريق بعد ذلك مشروعًا جديدًا مع نفس مدير المشروع، لكنهم الآن يستخدمون نهجًا رشيقًا. بعد سباق السرعة الأولي، ينتظر الفريق أن يتخذ مدير المشروع القرارات نيابة عن الفريق، كما حدث في المشاريع السابقة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مالك المنتج اتخاذ قرارات للفريق.",
        "correct": true
      },
      {
        "text": "تقديم ملاحظات إيجابية مستمرة لجميع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "ذكّر الفريق بأنهم يستخدمون نهجًا رشيقًا.",
        "correct": false
      },
      {
        "text": "تدريب الفريق على توجيه ودعم قراراتهم الخاصة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد اكتمال جمع بيانات ومعلومات أصحاب المصلحة، يبدأ تحليل البيانات التي تم جمعها. يتم رسم درجات القوة/المصلحة لكل صاحب مصلحة على مجموعة من المحاور لتوفير تصور لقوة واهتمام أصحاب المصلحة. هناك ثلاثة أصحاب مصلحة لديهم قوة منخفضة واهتمام منخفض.\nما هي الإجراءات الخاصة بهم؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب الحفاظ على رضاهم من خلال ضمان معالجة مخاوفهم ومخاوفهم بشكل مناسب.",
        "correct": true
      },
      {
        "text": "تتطلب الحد الأدنى من الجهد الإداري.",
        "correct": false
      },
      {
        "text": "يجب إطلاعهم على آخر المستجدات المتعلقة بالمشروع.",
        "correct": false
      },
      {
        "text": "يجب أن يظلوا راضين، ولكن يجب أيضاً أن يتم إشراكهم واستشارتهم في المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nحصلت مديرة مشروع للتو على مشروع جديد للتعامل معه. وهي تعمل على وثائق المشروع، وبعد قراءة ميثاق المشروع، تقوم بتجميع المخاطر كما تراها. بمجرد أن تكمل القائمة، متى يجب مراجعتها؟",
    "explanation": "",
    "choices": [
      {
        "text": "عند بدء المشروع وكلما اقترب موعد بدء المشروع وكلما اقتربت كل مخاطر",
        "correct": true
      },
      {
        "text": "أثناء تنظيم العمل وإعداده وتنفيذه.",
        "correct": false
      },
      {
        "text": "أثناء الاجتماعات الأسبوعية حيث يتم تحديد المخاطر الجديدة وإضافة",
        "correct": false
      },
      {
        "text": "بانتظام وطوال فترة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم اجتياز جميع ضوابط الجودة، وأصبح المشروع القابل للتسليم جاهزًا لإصداره للعميل. ومع ذلك، تمت الموافقة على طلب تغيير لإضافة معايير جودة جديدة\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث خطة إدارة المشروع.",
        "correct": true
      },
      {
        "text": "أوقف إصدار المنتج القابل للتسليم إلى العميل.",
        "correct": false
      },
      {
        "text": "استخدم معايير الجودة الجديدة للتسليمات المستقبلية.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مصنع صناعي، قرر المالك إضافة المزيد من السعة إلى المصنع من خلال تركيب آلة جديدة وتحديث البرامج المستخدمة في الإنتاج. ستحدث هذه الزيادة في السعة بينما لا يزال المصنع يعمل وينتج. سيتم إنجاز تحديث البرمجيات باستخدام نهج رشيق من أجل تقليل المخاطر. سيتم إنجاز عملية شراء الماكينة وتركيبها ودمجها باستخدام نهج تنبؤي.\nما هي أنواع الاتصالات التي سيتعين على مدير المشروع تصميمها في خطة إدارة الجدول الزمني لضمان التزام المشروع بالجدول الزمني المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "اجتماعات أسبوعية مشتركة مع أصحاب المصلحة المعنيين",
        "correct": true
      },
      {
        "text": "تقارير حالة مكتوبة كل أسبوعين من الجهات المعنية ذات الصلة",
        "correct": false
      },
      {
        "text": "اجتماعات فردية أسبوعية مع كل من أصحاب المصلحة المعنيين",
        "correct": false
      },
      {
        "text": "مكالمات جماعية كل أسبوعين مع أصحاب المصلحة المعنيين",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في مشروع يعد جزءًا من مبادرة تحويل الأعمال التي تؤثر على معظم الموظفين في الشركة البالغ عددهم 1، 1 موظف. ويتمثل نطاق المشروع في تحسين التعاون بين الفرق من خلال تنفيذ منصة سحابية جديدة ستحل محل أداة اتصال عمرها عامين.\nما هو عامل النجاح الأكثر أهمية؟",
    "explanation": "",
    "choices": [
      {
        "text": "جودة جيدة، يجب ألا تحتوي عملية الإطلاق على أي عيوب حرجة.",
        "correct": true
      },
      {
        "text": "واجهة مستخدم جيدة تم تطويرها بواسطة فنانين رسامين موهوبين",
        "correct": false
      },
      {
        "text": "التخطيط الجيد لإدارة التغيير وتنفيذها",
        "correct": false
      },
      {
        "text": "عملية جيدة للتحكم في التغيير مع موافقات سريعة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مشروع معقد، يقوم أحد أصحاب المصلحة بإبلاغ مدير المشروع عن أحد المتطلبات ويقترح عقد اجتماع لإبلاغ أعضاء الفريق في منتصف المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعداً لعقد اجتماع مع صاحب المصلحة وأحد أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "اطلب من صاحب المصلحة شرح المتطلبات وتنفيذها على الفور.",
        "correct": false
      },
      {
        "text": "عقد اجتماع مع جميع أعضاء الفريق لمناقشة المتطلبات.",
        "correct": false
      },
      {
        "text": "اطلب من مالك المنتج الإضافة إلى تراكمات المنتج ليتم معالجتها في التكرار التالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ أحد المشاريع المهمة، يشتكي أحد المقاولين من صعوبة التعامل مع عملية الموافقة وقد تؤخر الجدول الزمني للمشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "توظيف موارد إضافية للفريق للتخفيف من هذه المخاطر.",
        "correct": true
      },
      {
        "text": "ناقش مع الفريق لإيجاد خيارات للتخفيف من المخاطر.",
        "correct": false
      },
      {
        "text": "تصعيد الخطر إلى الإدارة العليا باعتباره أمرًا بالغ الأهمية للتسليم في الوقت المناسب.",
        "correct": false
      },
      {
        "text": "إضافة المخاطر إلى سجل المخاطر ليتم رصدها ومراجعتها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بوضع خطة إدارة الجودة لمشروع برمجيات. وأثناء استعراض الدروس المستفادة من مشاريع سابقة مشابهة، يكتشف مدير المشروع أن إعادة العمل بسبب مشاكل الجودة أدت إلى تجاوزات في التكاليف.\nما الذي يجب أن يفعله مدير المشروع لضمان معالجة الجودة طوال دورة حياة تطوير البرمجيات؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء عمليات مراجعة متكررة للتحقق بانتظام من فعالية عمليات الجودة.",
        "correct": true
      },
      {
        "text": "تعيين مورد للتركيز فقط على جودة المشروع.",
        "correct": false
      },
      {
        "text": "التأكد من ربط الجودة بمراجعات الأداء.",
        "correct": false
      },
      {
        "text": "تحديد سياسات وإجراءات الجودة الجديدة للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد وسياسي مع العديد من أصحاب المصلحة الذين لديهم أولويات متضاربة. طلبت الإدارة العليا من مدير المشروع التأكد من عدم وجود \"ضوضاء\" فيما يتعلق بالمشروع. خلال اجتماع لأصحاب المصلحة، طلب مدير المشروع من مدير المشروع سلسلة من الأسئلة لتأكيد قبول كل ناتج قبل أن يطلب قبول المشروع بأكمله.\nما الذي فعله مدير المشروع لإرضاء أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستجابة للإجراءات الإيجابية من أصحاب المصلحة لمكافأة الإجراءات",
        "correct": true
      },
      {
        "text": "تصرفت بطريقة متسقة في استخدام الكلمات والأفعال.",
        "correct": false
      },
      {
        "text": "الانخراط مع أصحاب المصلحة من خلال التعاون من أجل تحقيق الأهداف المشتركة",
        "correct": false
      },
      {
        "text": "التصرف بناءً على السلطة المخولة من الإدارة العليا",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nطلبت اللجنة التوجيهية من أحد مديري المشاريع من ذوي الخبرة في مجال العمل الرشيق تقديم مؤشر للوقت المتبقي على مشروع متوسط الحجم. ما هي الأدوات التي يمكن استخدامها لتوفير هذه المعلومات؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل وثيقة متطلبات العمل",
        "correct": true
      },
      {
        "text": "مخطط تفصيلي للإصدار",
        "correct": false
      },
      {
        "text": "نقاط القصة لقصص المستخدمين المتبقية",
        "correct": false
      },
      {
        "text": "القياسات البديلة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "انضم خريج جديد مؤخرًا إلى فريق بحث وتطوير ناضج. يشعر المرشد، الذي تم تعيينه للعمل مع الخريج، بالإرهاق بسبب العمل الإضافي الذي يقوم به الفريق وأداء الفريق وتحفيزه في انخفاض.\nكيف يمكن لمدير المشروع المساعدة في هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "حافظ على أسلوب القيادة المتساهل مع الفريق، ولكن استخدم أسلوب المعاملات لإعطاء توجيهات حازمة للخريج.",
        "correct": true
      },
      {
        "text": "اطلب من المرشد استخدام نهج القائد الخادم التعاوني لأداء الواجبات المعتادة إلى جانب دور المرشد.",
        "correct": false
      },
      {
        "text": "إلغاء خطة الموجه والتركيز على الحفاظ على تحفيز الخريج من خلال التعلم من خلال الانغماس المكثف.",
        "correct": false
      },
      {
        "text": "اطلب من ثلاثة أعضاء آخرين في الفريق مشاركة دور المرشد من أجل تقليل عبء عمل المرشد الفردي بنسبة 75%.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشارك مدير المشروع في مجموعة تركيز تنفذ تغييرات في إدارة المشروع في جميع أنحاء المنظمة. والهدف من ذلك هو تحسين فعالية المشروع ونجاحه.\nما هي العملية التي يجب أن يقترحها مدير المشروع للتغيير الدائم والناجح في المشاريع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييمات للمهارات الفردية وتوفير تدريب موجه لكل عضو من أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "مراقبة اللوائح الخارجية وتكييف ممارسات إدارة المشاريع وفقًا لذلك.",
        "correct": false
      },
      {
        "text": "تسهيل التواصل المفتوح وبناء التأييد من جميع أصحاب المصلحة في المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ خطة لإدارة التغيير في إدارة المشروع تتماشى مع أفضل الممارسات في هذا المجال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يستضيف أحد أعضاء الفريق فعالية ويدعو العديد من الزملاء من خلال تقويمات العمل الخاصة بهم. عضو آخر في الفريق، الذي لم تتم دعوته إلى الحدث، مشتت الذهن بشكل ملحوظ خلال عدة اجتماعات في الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من الشخص الذي يستضيف الفعالية أن يضع علامة خاصة عليها.",
        "correct": true
      },
      {
        "text": "قم بإعداد اجتماع مع عضو الفريق المشتت لمناقشة أي مشاكل.",
        "correct": false
      },
      {
        "text": "اطلب من الشخص الذي يستضيف الفعالية استخدام وسائل الاتصال الخاصة.",
        "correct": false
      },
      {
        "text": "أضف قسم المناسبات الاجتماعية إلى الميثاق للتعامل مع هذه الحالات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اعتاد فريق تم تشكيله حديثاً على الممارسات الرشيقة. وقد لاحظ قائد المشروع أنه على الرغم من أن أداء الفريق يتوافق مع التوقعات، إلا أن هناك ملل من ممارسات الفريق اليومية بين العديد من أعضاء الفريق.\nما الذي يجب أن يفعله قائد المشروع في هذه الحالة؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسمح للفريق بالتنظيم الذاتي واجعلهم يحللون الموقف في جلسة المراجعة والتصحيح الذاتي.",
        "correct": true
      },
      {
        "text": "تحدي الفريق لإيجاد طرق جديدة لتحقيق مستويات أعلى من الأداء لتحسين الوضع.",
        "correct": false
      },
      {
        "text": "تحدث مع أعضاء الفريق كل على حدة لتحديد ما يودون القيام به لتحسين الوضع في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من الفريق إبلاغ الإدارة العليا بالوضع واطلب منهم تقديم توصيات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "1\nما هي أنماط القيادة الأربعة لبناء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "البصيرة والانتسابية والتوجيه والمشاركة",
        "correct": true
      },
      {
        "text": "الرؤية، والانتساب، والتدريب، وتحديد الوتيرة",
        "correct": false
      },
      {
        "text": "البصيرة والانتساب والتوجيه والإرشاد والتوجيه",
        "correct": false
      },
      {
        "text": "البصيرة والانتسابية والتدريب والمياه العالية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء العمل على مشروع ما، يدرك فريق المشروع أن التحديثات الأخيرة لمركز البيانات قد تؤثر على نتائج المشروع. وحدات معينة من مخرجات المشروع غير متوافقة مع البيئة الجديدة. يحدد الفريق الخطوات المناسبة لمعالجة المشكلة.\nما هي الخطوة التالية لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب زيادة في الميزانية.",
        "correct": true
      },
      {
        "text": "إرسال طلب تغيير.",
        "correct": false
      },
      {
        "text": "تغيير الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "تحديث وثيقة المتطلبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق على مشروع تطوير منتج جديد معقد وسريع التغير. بعد تقييم حديث للعملية، قرر الفريق إضافة مجموعة أدوات رشيقة إلى النهج التنبؤي الذي يستخدمونه. تهدف هذه الإضافة إلى تحسين إنجاز المشروع ونجاحه وإنتاجيته بشكل عام.\nأي مما يلي يصف كيف يهدف هذا التغيير إلى إضافة قيمة مضافة إلى عملية التسليم والنجاح والإنتاجية بشكل عام؟",
    "explanation": "",
    "choices": [
      {
        "text": "استخدم مجموعة الأدوات الرشيقة للاستفادة من قدرة الأساليب الرشيقة على الاستجابة بفعالية للتغيير، مع الحفاظ على فوائد النهج التنبؤي لإدارة المشاريع.",
        "correct": true
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة لاستبدال جميع الأساليب التنبؤية بأساليب رشيقة جديدة، وبذلك تقلل من ضعف الإنتاجية.",
        "correct": false
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة لمقارنة الأساليب الرشيقة مع الأساليب التنبؤية، ثم اختر النهج الأفضل للمشاريع المستقبلية.",
        "correct": false
      },
      {
        "text": "استخدم مجموعة الأدوات الرشيقة واطلب من أعضاء الفريق الاختيار بين الأساليب الرشيقة والتنبؤية حتى يعملوا بشكل أكثر فعالية وإنتاجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف الطريق من المشروع، تم إبلاغ مدير المشروع بحركة السوق التي من شأنها أن تجعل نتائج المشروع غير مجدية للعميل. وقد تتسبب هذه المعلومة في إلغاء المشروع أو على الأقل إحداث تغيير كبير في نطاق المشروع والنتيجة المرجوة منه.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإعداد جميع تقارير الحالة والعروض التوضيحية للحفاظ على تركيز العميل على تنفيذ المشروع الذي تم بنجاح.",
        "correct": true
      },
      {
        "text": "إجراء مناقشة شفافة مع راعي المشروع، وتقديم الدعم بشأن تقييم الاستراتيجية إذا لزم الأمر",
        "correct": false
      },
      {
        "text": "مواصلة العمل على تنفيذ المشروع، حيث إن استراتيجية العمل ليست مسؤولية مدير المشروع.",
        "correct": false
      },
      {
        "text": "أوقف المشروع على الفور، حيث يعلم مدير المشروع أنه سيكون عديم الفائدة للعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع مع فريق Scrum الذي يتخلف باستمرار عن المواعيد النهائية. تشعر اللجنة التوجيهية بالقلق بشأن المشروع لأنه ليس من الواضح أنه سيحقق القيمة المتوقعة. بعد إجراء بعض التحليلات، يكتشف مدير المشروع وجود عدم تطابق في الكفاءات في أحد الفرق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقبّل مخاطر فقدان المشروع للمواعيد النهائية بسبب عدم التطابق.",
        "correct": true
      },
      {
        "text": "توفير التدريب المناسب للتعويض عن عدم التطابق.",
        "correct": false
      },
      {
        "text": "تحديث الجدول الزمني للمشروع ليعكس التأخير.",
        "correct": false
      },
      {
        "text": "التأكيد للفرق على أهمية الالتزام بالمواعيد النهائية المتفق عليها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد له تأثير بيئي كبير جداً. تمت الموافقة على المشروع من قبل مكتب إدارة المشاريع في المنظمة وهو الآن في مرحلة التخطيط. وقد زود راعي المشروع مدير المشروع بقائمة بجميع أصحاب المصلحة في المشروع.\nما هو النشاط التالي في خطة إدارة أصحاب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل",
        "correct": true
      },
      {
        "text": "المراقبة",
        "correct": false
      },
      {
        "text": "إشراك",
        "correct": false
      },
      {
        "text": "تحديد",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة كبيرة بالتحول من النهج التنبؤي إلى النهج الرشيق. ويواجه فريق المشروع الذي لديه معرفة بالممارسات الرشيقة صراعات كبيرة مع المديرين التنفيذيين فيما يتعلق بالعمليات التي يجب اتباعها\nكيف ينبغي حل هذه التعارضات؟",
    "explanation": "",
    "choices": [
      {
        "text": "التفاوض مع المديرين التنفيذيين والاتفاق على عملية.",
        "correct": true
      },
      {
        "text": "تدريب المديرين التنفيذيين على الممارسات الرشيقة.",
        "correct": false
      },
      {
        "text": "قم بتضمين المديرين التنفيذيين في عمليات إعادة النظر في الفريق.",
        "correct": false
      },
      {
        "text": "اطلب من المديرين التنفيذيين استخدام الممارسات الرشيقة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مدير المشروع بتحديد أصحاب المصلحة في مشروع تطوير البرمجيات: فريق المبيعات سيكون المستخدم الرئيسي لتطبيق البرمجيات الجديد؛ وسيكون قسم تكنولوجيا المعلومات مسؤولاً عن نشر وصيانة تطبيق البرمجيات الجديد؛ وراعي المشروع هو المسؤول التنفيذي المسؤول عن الموافقة على المشروع وتوفير التمويل. مدير المشروع في مرحلة التخطيط للمشروع، ويجب عليه إشراك أصحاب المصلحة.\nما هو أهم شيء يجب على مدير المشروع القيام به لبناء تفاهم مشترك؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع استهلالي مع جميع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "إنشاء سجل أصحاب المصلحة وخطة التواصل.",
        "correct": false
      },
      {
        "text": "تحديد احتياجات أصحاب المصلحة وتوقعاتهم.",
        "correct": false
      },
      {
        "text": "توثيق مخاوف ومخاطر أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نص ميثاق المشروع المعتمد على ضرورة استخدام نهج رشيق خلال جلسة الدروس المستفادة، أشار العميل إلى أن الفريق لم يتمكن من تقديم تقديرات تكلفة موثوقة للمشروع، وأنه يجب تخصيص المزيد من الوقت لتحديد النطاق خلال التكرار الأول.\nما هي الدروس التي يجب تسجيلها في مستودع الدروس المستفادة؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يتعرف العميل على النهج الرشيق مسبقاً لفهم عملية تقدير التكاليف.",
        "correct": true
      },
      {
        "text": "لا ينبغي استخدام النهج الرشيق إذا كان العميل يحتاج إلى تقديرات تكلفة موثوقة.",
        "correct": false
      },
      {
        "text": "خلال التكرار الأول للمشروع، ينبغي تخصيص وقت لتحديد النطاق وضمان إجراء تقديرات موثوقة للتكلفة أثناء التكرار الأول للمشروع",
        "correct": false
      },
      {
        "text": "يجب تضمين اتصالات العملاء في عمليات الوقوف اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع على مشروع طويل الأجل في بيئة معقدة. وينصب تركيز مدير المشروع على الحفاظ على سلامة عمل الفريق والتعاون.\nما هي استراتيجية حل النزاعات التي يجب استخدامها داخل فريق المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "حل المشكلات",
        "correct": true
      },
      {
        "text": "المساومة",
        "correct": false
      },
      {
        "text": "استيعاب",
        "correct": false
      },
      {
        "text": "الاستشارة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع مشروع مشروعًا حيويًا بالنسبة لمؤسستهم وهيئة البيئة والطاقة المحلية. وخلال اجتماع للفريق لمناقشة مخاطر المشروع، أثار الفريق مخاطرة كبيرة تتمثل في أن أحد كبار المديرين المهمين لا يشارك حاليًا في المشروع.\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذه المخاطر؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنفيذ تقارير الحالة المنتظمة.",
        "correct": true
      },
      {
        "text": "رفع هذا الخطر إلى الإدارة العليا.",
        "correct": false
      },
      {
        "text": "وضع خطة مفصلة للغاية لإدارة المشروع",
        "correct": false
      },
      {
        "text": "قم بدعوة المدير الأقدم إلى اجتماعات المشروع اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "7\nأثناء مرحلة بدء المشروع، يقوم مدير المشروع بمراجعة حالة العمل ويجد أن المعلومات غير مكتملة. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إضافة فجوة معلومات إلى سجل المخاطر.",
        "correct": true
      },
      {
        "text": "مراجعة بيان عمل المشروع (SOW) لإنشاء ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة دراسة الجدوى لتضييق نطاق المشروع وإنشاء ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة حالة العمل مع المؤسسة الراعية للتأكد من توافق المشروع مع احتياجات العمل.",
        "correct": false
        }
      ]
    }
  ]
}
