{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "يخطط فريق البحث والتطوير لبناء منشأة جديدة ستركز على تحسين المنتجات الحالية التي طورتها المؤسسة. وستكون مبادرة متعددة السنوات.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع خطة لإدارة النطاق تركز على الأهداف المتوقعة من المبادرة.",
          "correct": true
        },
        {
          "text": "إعداد وثيقة حالة عمل تغطي العائد على الاستثمار (ROI) للمبادرة.",
          "correct": false
        },
        {
          "text": "وضع خطة لإدارة الموارد لتغطية الموارد والتخطيط للطوارئ.",
          "correct": false
        },
        {
          "text": "وضع خطة لإدارة الاتصالات لتلبية احتياجات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير مشروع بوضع جدول زمني لمشروع يضم أقسامًا مختلفة. واجتمع مدير المشروع مع كل عضو من أعضاء الفريق لوضع هيكل تقسيم العمل (WBS). ومع ذلك، بعد الانتهاء من وضع هيكل تقسيم العمل، اكتشف مدير المشروع أن بعض المهام زائدة عن الحاجة.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستعانة بالخبراء المتخصصين (SMEs) لتقديم إرشادات الجدولة.",
          "correct": true
        },
        {
          "text": "تنظيم جلسات جماعية لجميع أعضاء الفريق لمراجعة WBS معًا.",
          "correct": false
        },
        {
          "text": "تحسين قنوات التواصل مع جميع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "إعداد مصفوفة إسناد المهام لتمثيل WBS.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع في فريق رشيق حالي ويقوم بالتحضير لمشروع قادم. كان المشروع الأخير الذي عمل عليه الفريق ناجحًا للغاية لدرجة أن أحد كبار أصحاب المصلحة طلب أن يستخدم الفريق نفس هيكل الحوكمة للمشروع الجديد.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "التشاور مع مكتب إدارة المشروع (PMO) للحصول على رؤيته حول حوكمة المشروع.",
          "correct": true
        },
        {
          "text": "التعاون مع الفريق وكبار أصحاب المصلحة لمناقشة تكييف الحوكمة الحالية.",
          "correct": false
        },
        {
          "text": "إبلاغ الإدارة العليا بإمكانية استخدام نفس حوكمة المشروع للمشروع الجديد.",
          "correct": false
        },
        {
          "text": "اطلب من صاحب المصلحة الأول مناقشة جميع المخاوف المتعلقة بالحوكمة مع مالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع لتحديث البنية التحتية لتكنولوجيا المعلومات في أحد البنوك. تلقى مدير المشروع مؤخرًا الموافقة على خطة إدارة التغيير في المشروع من راعي المشروع. يطلب راعي المشروع الآن أن يقوم مدير المشروع بتنفيذ جزء جديد من التكنولوجيا في الحل.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة التقنية الجديدة كمخاطر في سجل المخاطر.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تحديث خطوط الأساس للجدول الزمني والتكلفة مع التكنولوجيا الجديدة.",
          "correct": false
        },
        {
          "text": "اطلب من الجهة الراعية للمشروع شراء التقنية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأدرك بعض أعضاء الفريق خلال إحدى جلسات الاستعداد اليومية أنهم لم يكونوا جميعًا يحددون أولويات المتطلبات بنفس الطريقة. وقد يؤثر ذلك على أهداف التكرار الحالي.\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بجدولة جلسة مراجعة التكرار وتحديث الأولويات المتراكمة.",
          "correct": true
        },
        {
          "text": "اجتمع مع الفريق ومالك المنتج لتوضيح الأولويات.",
          "correct": false
        },
        {
          "text": "اطلب من راعي المشروع إعادة تحديد القيم ذات الأولوية.",
          "correct": false
        },
        {
          "text": "تحديد الأولويات بناءً على مدى إلحاح المتطلبات والمخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال آخر خمس جلسات عمل يومية، كان أحد أعضاء الفريق في مشروع هجين (تنبؤي-مرن) غامضاً بشأن ما أنجزوه وما يخططون لإنجازه.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتمع مع أعضاء الفريق للتأكد من أن لديهم فهم واضح لما هو متوقع منهم.",
          "correct": true
        },
        {
          "text": "قم بمراجعة المشكلة في الاجتماع الاستعراضي التالي وحدد الإجراء التصحيحي الذي ينبغي تنفيذه.",
          "correct": false
        },
        {
          "text": "قم بإثارة مسألة مساءلة المهام مع الفريق وأصحاب المصلحة في اجتماع مراجعة التكرار التالي.",
          "correct": false
        },
        {
          "text": "تسهيل عقد اجتماع مع الفريق بأكمله وأصحاب المصلحة لمراجعة المخاطر والعوائق التي يواجهها المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبلغ تكلفة المشروع المدرجة في الميزانية 120,000 دولار أمريكي. وفقًا للجدول الزمني، يجب أن يكون قد تم إنجاز 15% من المشروع بعد شهر واحد. وبعد مرور شهر، لم يكتمل بالفعل سوى 12% من المشروع.\nما هو مؤشر الأداء المجدول (SPI)؟",
      "explanation": "",
      "choices": [
        {
          "text": "0.6",
          "correct": true
        },
        {
          "text": "0.8",
          "correct": false
        },
        {
          "text": "0.9",
          "correct": false
        },
        {
          "text": "1.25",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة التصميم، يدرك مدير المشروع أن المشروع سيستفيد من استخدام أدوات التكيف. وقد ثبتت فعالية هذا النهج في مشاريع سابقة داخل المنظمة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من قدرات الفريق قبل إدخال الأدوات والقطع الأثرية التكيفية إلى المشروع.",
          "correct": true
        },
        {
          "text": "اتصل براعي المشروع واطلب أعضاء فريق جديد على دراية بالمشاريع التكيفية.",
          "correct": false
        },
        {
          "text": "تجميد مرحلة التصميم والبحث عن مورد خارجي لتشغيل التصميم التكراري بتكلفة إضافية.",
          "correct": false
        },
        {
          "text": "تحديث وثائق المشروع لتشمل أدوات التكيف والقطع الأثرية والتخطيط للجلسة التكرارية الأولى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتقال والانتهاء من مشروع كبير لتركيب المعدات، يتلقى مدير المشروع طلبًا من العميل لإضافة بعض التكاليف التشغيلية إلى ميزانية المشروع لأنشطة بناء الفريق. تم الانتهاء من المشروع في حدود الميزانية، ولم يتم إنفاق احتياطيات طوارئ المشروع، وستضمن أنشطة بناء الفريق الأداء الأمثل للفريق التشغيلي.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "رفض الطلب وإغلاق البيانات المالية للمشروع.",
          "correct": true
        },
        {
          "text": "تنفيذ عملية التحكم في التغيير المتكاملة.",
          "correct": false
        },
        {
          "text": "الموافقة على النفقات لضمان رضا العملاء.",
          "correct": false
        },
        {
          "text": "قم بتوثيق الطلب في مستودع الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق المشروع في المرحلة الثالثة عشرة من مشروع مكون من أربعة عشر إصداراً. وضع فريق المشروع ميزة تغيير قواعد اللعبة على الأعمال المتراكمة للإصدار التالي. تم إبلاغ مالك المنتج أن أحد المنافسين يطلق منتجًا جديدًا بميزة تشبه إلى حد كبير الميزة الموضوعة على قائمة الأعمال المتراكمة. يطالب مالك المنتج بدمج هذه الميزة التي ستغير قواعد اللعبة في الإصدار الحالي.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم اجتماع مراجعة مع فريق التطوير للتعرف على حجم العمل المطلوب.",
          "correct": true
        },
        {
          "text": "اجتمع مع مالك المنتج وأصحاب المصلحة المعنيين لمناقشة التغيير وتحليل تأثيره.",
          "correct": false
        },
        {
          "text": "إجراء التقييمات المطلوبة ورفع طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "أبلغ مالك المنتج أن هذه الميزة التي ستغير قواعد اللعبة ستتم إضافتها إلى الإصدار التالي من المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيشكو أحد أصحاب المصلحة من أن أحد مكونات المنتج ليس سهل الاستخدام. ما هي الخطوة التالية التي يجب أن يتخذها مدير المشروع مباشرة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق مما إذا كان المكون يفي بمواصفات التصميم والأداء.",
          "correct": true
        },
        {
          "text": "التعاون مع أصحاب المصلحة لتأكيد معايير القبول للمنتج.",
          "correct": false
        },
        {
          "text": "اطلب من خبير تجربة المستخدم مقابلة صاحب المصلحة وشرح تصميم المكون.",
          "correct": false
        },
        {
          "text": "رفع طلب تغيير وفقًا لمخاوف أصحاب المصلحة من المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا لمشروع تكنولوجيا المعلومات. وكان المشروع في مرحلة البدء، ووجد الفريق مشكلة توافق في البنية التحتية التقنية التي يستخدمها البائع والمنظمة.\nما الخطوة الأولية التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة بفعالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "افحص ما إذا كان هناك حل بديل.",
          "correct": true
        },
        {
          "text": "قم بتصعيد المشكلة إلى فريق البنية التحتية التقنية.",
          "correct": false
        },
        {
          "text": "تحقق من قاعدة بيانات الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "استشر راعي المشروع حول المشكلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم المشروع المختلط عملية تصميم تكرارية لتطوير المنتج. غير أن هناك فرقاً منفصلة للتصميم والتنفيذ، وهو ما يسبب القلق.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المخاوف؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء مستودع مركزي لوثائق المشروع والتحقق من صحة المنتج.",
          "correct": true
        },
        {
          "text": "اطلب أن يكون فريق التصميم مسؤولاً عن تنفيذ المشروع أيضاً.",
          "correct": false
        },
        {
          "text": "إبلاغ مكتب إدارة المشروع (PMO) بأن النهج الهجين محفوف بالمخاطر.",
          "correct": false
        },
        {
          "text": "تعزيز مهارات فريق العمل من خلال توفير التدريب على إطار عمل إدارة المشاريع التكيفية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيشعر مدير المشروع بالقلق بشأن تقديم قيمة العمل المخطط لها لأن مالك المنتج غير مشارك. ما الذي يجب أن يفعله مدير المشروع لمعالجة هذا القلق؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
          "correct": true
        },
        {
          "text": "مراجعة خطة مشاركة أصحاب المصلحة وتحديثها.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الموارد وتحديثها.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المخاطر وتحديثها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتلقى نموذج أولي لمنتج تم إطلاقه حديثاً عدداً من شكاوى العملاء. وللحد من ردود الفعل السلبية، يتوصل الفريق إلى خطة عمل. ومع ذلك، في نهاية الربع، وجد مدير المشروع أنه لم يكن هناك انخفاض كبير في الشكاوى.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "حدد أصحاب الأداء الرئيسيين في الفريق وتقديرهم بالشكل المناسب.",
          "correct": true
        },
        {
          "text": "حدد أعضاء الفريق الذين يفتقرون إلى المهارات المطلوبة وقم بتدريبهم.",
          "correct": false
        },
        {
          "text": "مراجعة مؤشرات الأداء الرئيسية للمشروع وإعادة تقييمها.",
          "correct": false
        },
        {
          "text": "أبلغ فريق الإدارة التنفيذية بالحالة واطلب المساعدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني عضو فريق موهوب للغاية وموجه نحو تحقيق النتائج من مشكلة شخصية فجأة. ونتيجة لذلك، يحدث تغيير في سلوك هذا العضو في الفريق، ويبدأ في التأثير على نواتج المشروع وكذلك على معنويات أعضاء الفريق الآخرين.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتعيين عضو الفريق في نشاط لن يؤثر بشكل كبير على المخرجات.",
          "correct": true
        },
        {
          "text": "التواصل مع عضو الفريق على انفراد والعمل معًا لوضع خطة لمعالجة المشكلة.",
          "correct": false
        },
        {
          "text": "إضافة مشكلة عضو الفريق إلى سجل مشكلات المشروع وإبلاغ جميع أصحاب المصلحة الرئيسيين.",
          "correct": false
        },
        {
          "text": "اطلب من مدير الموارد البشرية (HR) التعامل مع المشكلة ومواصلة العمل كما هو مخطط له.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع تم تعيينه حديثاً لمشروع بناء مدرسة. تخدم المدرسة طلاباً من الأحياء المجاورة ويجب أن تكون المدرسة موفرة للطاقة تماماً. يجب على مدير المشروع تقديم تقرير نهائي.\nكيف يمكن لمدير المشروع تحديد ما إذا كانت قيمة العمل المخطط لها قد تم تسليمها أم لا؟",
      "explanation": "",
      "choices": [
        {
          "text": "فحص المواصفات الفنية المعتمدة للتأكد من تطابقها مع مخرجات المنتج النهائي.",
          "correct": true
        },
        {
          "text": "التشاور مع فريق العمل والتأكد من رضا العميل عن بناء المدرسة.",
          "correct": false
        },
        {
          "text": "مراجعة ميثاق المشروع وحالة العمل لتحديد ما إذا كانت المخرجات قد حققت الفوائد المرجوة.",
          "correct": false
        },
        {
          "text": "إثبات أن مشروع بناء المدرسة تم تسليمه في الموعد المحدد وفي حدود الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتوجه أحد أعضاء فريق المشروع فجأة إلى مدير المشروع ويطلب الاستقالة من المشروع. يشعر عضو الفريق بالضيق بسبب سوء المعاملة والشكاوى المستمرة من القائد الفني. يوضح عضو الفريق أنه لم يعد مستعدًا لتحمل هذه المعاملة من القائد الفني. لم يسبق لمدير المشروع أن واجه مشاكل في الجودة مع أعضاء الفريق.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "اسمح لعضو الفريق بالاستقالة واستبداله بما أن هناك موارد إضافية متاحة.",
          "correct": true
        },
        {
          "text": "ناقش الموقف مع عضو الفريق لتحديد سبب سوء معاملة القائد الفني له.",
          "correct": false
        },
        {
          "text": "تحدث إلى القائد الفني لتحديد مدى ضعف أداء عضو الفريق.",
          "correct": false
        },
        {
          "text": "تحدث مع عضو الفريق والقائد الفني لتحليل النزاع وحلّه من خلال الوساطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لم يكمل فريق المشروع الرشيق المهام ضمن التكرار الحالي. خلال أحد الاجتماعات، يعطي راعي المشروع الفريق موعداً نهائياً لإكمال المهام.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب أن يصبح المدير الوظيفي قائدًا للفريق لضمان اتباع العمليات.",
          "correct": true
        },
        {
          "text": "قم بتعيين قائد فريق لتولي مسؤولية تخطيط التكرار في الفريق وإنجازه.",
          "correct": false
        },
        {
          "text": "إبلاغ راعي المشروع بأن الفريق مسؤول عن إدارة العمل ضمن التكرارات.",
          "correct": false
        },
        {
          "text": "تقديم المشورة للفريق للالتزام بالجدول الزمني الجديد المقدم من راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتم تعيين مدير مشروع لمشروع جديد تبلغ تكلفته عدة ملايين من الدولارات مشابه لمشروع نفذته الشركة قبل ثلاث سنوات. ما الذي يجب أن يفعله مدير المشروع لوضع تقدير تكلفة موثوق به؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد المعلمات الحرجة وتوليد تقدير بناءً على تباين المعلمات.",
          "correct": true
        },
        {
          "text": "خذ التقدير الأصلي واضربه في عامل يحدده معيار الشركة لكل سنة.",
          "correct": false
        },
        {
          "text": "استخدم التكلفة الفعلية للمشروع السابق كمرجع واحسب التكلفة التقديرية لكل مهمة وقم بتجميعها.",
          "correct": false
        },
        {
          "text": "استخدم بورصة السلع لتكلفة المواد ومعدلات العمالة لتغير التكلفة وحساب تقدير جديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع مهم مع أصحاب المصلحة الذين لديهم توقعات مختلفة للمشروع. كما أن بعض أصحاب المصلحة لديهم درجة عالية من التأثير على المشروع.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحكم في درجة تأثير أصحاب المصلحة لتتماشى بشكل أفضل مع أهداف المشروع.",
          "correct": true
        },
        {
          "text": "قم بتضمين متطلبات أصحاب المصلحة المؤثرين وتأكد من توافق أصحاب المصلحة الآخرين مع أهداف المشروع.",
          "correct": false
        },
        {
          "text": "استنباط متطلبات أصحاب المصلحة والتفاوض بشأنها وفقاً لتأثير كل صاحب مصلحة.",
          "correct": false
        },
        {
          "text": "إدارة أصحاب المصلحة بعناية وتطبيق توقعات أصحاب المصلحة دون التأثير على أهداف المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مشروع تطوير البرمجيات، أدرك الفريق أن العديد من الميزات لم تتوافق مع متطلبات الجودة. بعد تلقي التعليمات لإصلاح المشكلات، أصيب أحد أعضاء الفريق بالإحباط، مدعياً أن المتطلبات غير الواضحة هي السبب في هذه المشكلات. يجادل أعضاء الفريق الآخرون بأن الإهمال في الاختبار هو السبب الحقيقي لهذه المشكلات. ويلقي المختبرون باللوم على ضعف جودة الترميز.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعم فريق المشروع في إجراء استعراض بأثر رجعي لتحديد السبب الجذري لمشاكل الجودة.",
          "correct": true
        },
        {
          "text": "قم بإزالة المورد الأكثر إحباطًا من الفريق لأن الارتباك يؤثر على تحفيز الفريق.",
          "correct": false
        },
        {
          "text": "إجراء مراجعة للجودة في كل مرحلة من مراحل دورة حياة التطوير لتحديد مشكلات الجودة.",
          "correct": false
        },
        {
          "text": "ناقش المشكلة مع فريق الإدارة لتحديد الحلول الممكنة لتحسين الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدرك مدير مشروع مشروع تطوير برمجيات لمؤسسة مالية أن أعضاء الفريق يتأخرون بشكل غير عادي في المهام الموكلة إليهم. لم يواجه مدير المشروع هذا الأمر من قبل في مشاريع سابقة مماثلة. بعد إجراء مزيد من التحقيقات، قرر مدير المشروع أن التأخير مرتبط باستقالة أحد أعضاء الفريق ذوي الخبرة مؤخرًا.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان وجود مسار واضح المعالم للترقية.",
          "correct": true
        },
        {
          "text": "توفير التوجيه المستمر لأعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "تحديد مخاطر الكفاءة ووضع خطة للتخفيف من حدتها.",
          "correct": false
        },
        {
          "text": "التدريب الدوري المجدول لجميع أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتمل المشروع في منتصف الطريق، وعلى الرغم من مؤشر الأداء الجيد للجدول الزمني (SPI)، فقد حدد العميل العديد من المشكلات البسيطة. يمكن حل معظم المشاكل بسرعة وسهولة إذا تمكن العميل من التواصل مباشرة مع فريق التطوير. يوافق مدير المشروع على ذلك، لكن بعض أعضاء الفريق يشعرون بعدم الثقة في قدرتهم على التواصل مع العميل بشكل كافٍ.\nكيف يمكن لمدير المشروع دعم مشاركة العملاء الناجحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم أساليب تواصل الأعضاء وتقديم الملاحظات حسب الحاجة لتوجيه الفريق.",
          "correct": true
        },
        {
          "text": "تأكد من فهم جميع أعضاء فريق المشروع لأدوارهم ومسؤولياتهم المحددة.",
          "correct": false
        },
        {
          "text": "تقييم المهارات التقنية لفريق المشروع وتوفير تدريب إضافي على تطوير المنتجات.",
          "correct": false
        },
        {
          "text": "تحديث مؤشر أداء الجدول الزمني (SPI) ومراجعة جميع اتصالات فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال أحد اجتماعات الاستعداد، يكتشف مدير المشروع أن أحد مطوري البرمجيات يعاني من صعوبة في إكمال العمل لأنه يفتقر إلى الخبرة في اختبار الأتمتة، مما قد يؤثر على هدف السباق. مهندس ضمان الجودة في الفريق لديه خبرة في اختبار الأتمتة ولكنه مشغول بإعداد عرض تقديمي للموظفين الجدد.\nما الإجراء الذي من شأنه أن يزيد من فرص تحقيق هدف السباق السريع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أعد تعيين عمل الأتمتة إلى المهندس بمجرد الانتهاء من العرض التقديمي.",
          "correct": true
        },
        {
          "text": "قم على الفور بتدريب مطور البرامج على اختبار الأتمتة ثم تابع الاختبار.",
          "correct": false
        },
        {
          "text": "اطلب من مهندس ضمان الجودة مساعدة مطور البرامج في أقرب وقت ممكن.",
          "correct": false
        },
        {
          "text": "قم بإعادة جدولة اختبار الأتمتة عندما يكون مهندس ضمان الجودة متاحًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا في مشروع تحقيق. ونظراً لتعقيد المشروع، لم يكن مدير المشروع متأكداً مما إذا كانت أي لائحة تنطبق عليه.\nكيف ينبغي لمدير المشروع تحديد اللوائح التي تنطبق على المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "استشر المدير الذي يتمتع بسلطة أعلى في اتخاذ هذا القرار.",
          "correct": true
        },
        {
          "text": "اتصل بمدير مكتب إدارة المشروع (PMO) لأنه المسؤول عن تحديد اللوائح المطلوبة للمشاريع الرشيقة.",
          "correct": false
        },
        {
          "text": "حدد موعدًا لعقد اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين وفريق المشروع لفهم ما إذا كانت هناك أي لوائح قابلة للتطبيق.",
          "correct": false
        },
        {
          "text": "اطلب خطابًا موقعًا من العميل لتأكيد ما إذا كانت هناك أي لوائح تنطبق على أي من مخرجات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تُظهر الجداول متطلبات المشروع الرشيق مع العائد المتوقع على الاستثمار (ROI) ومخاطر المشروع المحددة، إلى جانب تفاصيل التحليل.\nما هو الترتيب الذي يجب أن يكون عليه ترتيب الأولويات في المنتجات المتراكمة المعدلة حسب المخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "المتطلب 3، المتطلب 1، المتطلب 2، الخطر 3.",
          "correct": true
        },
        {
          "text": "المخاطر 3، والمخاطر 1، والمخاطر 2، والمتطلبات 3، والمتطلبات 1، والمتطلبات 2",
          "correct": false
        },
        {
          "text": "المطلب 3، الخطر 3، الخطر 3، المطلب 1، المطلب 2، الخطر 2",
          "correct": false
        },
        {
          "text": "المتطلب 3، المتطلب 1، المخاطر 3، المتطلب 2، المخاطر 1، المخاطر 2",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف عملية الإصدار، تم استبدال مدير المشروع. أشارت الملاحظات التي قدمها الفريق إلى مدير المشروع الجديد إلى احتكاك الفريق الناجم عن مطالب مدير المشروع السابق المستمرة بالتسليم السريع.\nما هو النهج الذي يجب على مدير المشروع الجديد اعتماده لإرساء المصداقية بسرعة مع الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "افعل ما يحتاج الفريق إلى القيام به، واحتفظ بسجل الإجراءات، وقدم الملاحظات.",
          "correct": true
        },
        {
          "text": "ساعد الفريق على النجاح من خلال تقديم خدمة ممتازة والتزامات في الوقت المحدد وميزانية كافية.",
          "correct": false
        },
        {
          "text": "قم بتقييم ثقافة الفريق وراقبهم وتفاعل معهم.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق شرح ما هو مطلوب، وإنشاء المهام، والإبلاغ عن التقدم المحرز في تلك المهام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة تنفيذ المشروع، يتم إعادة تعيين مدير المشروع إلى مشروع آخر. ويتولى مدير المشروع الجديد مهامه وسرعان ما يدرك أن المشروع يواجه مشاكل في جودة وجدولة بعض النواتج.\nأي مما يلي يجب على مدير المشروع الجديد القيام به أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة المشروع لتعكس الجدول الزمني الجديد ومتطلبات الجودة الجديدة.",
          "correct": true
        },
        {
          "text": "مراجعة الجدول الزمني للمشروع والتركيز على تسليم المشروع في الوقت المحدد وفي حدود الميزانية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق المشروع لتقييم الوضع ووضع خطة لمعالجة المشاكل.",
          "correct": false
        },
        {
          "text": "قم بتقييم مهارات فريق المشروع واطلب من راعي المشروع توفير موارد إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يبدأ مشروع برمجيات مالية جديدة في بيئة تنافسية للغاية. لوائح الامتثال واضحة، ولكن المتطلبات غير واضحة. ويشدد العميل على أنه يحتاج إلى نتائج في أقرب وقت ممكن.\nما هو نهج التنفيذ الذي يجب أن يختاره مدير المشروع لهذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تكرار وتنقيح مراحل المشروع في تكرارات متعددة.",
          "correct": true
        },
        {
          "text": "التقدم عبر تسلسل خطي من المراحل.",
          "correct": false
        },
        {
          "text": "تبنّي التغيير والتركيز على تقديم القيمة.",
          "correct": false
        },
        {
          "text": "التركيز على تسليم المشروع على دفعات متعددة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من أجل تقليل وقت الشراء أثناء عملية تقديم العطاءات، قرر مدير المشروع التعاقد مع مقاول حالي على العمل الإضافي. وقد اشتكى مقدمو العطاءات الآخرون من هذا القرار لأنهم يعتقدون أن العملية افتقرت إلى الشفافية والإنصاف.\nما الذي كان يجب على مدير المشروع فعله لمنع حدوث ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "دعوة جميع مقدمي العطاءات المحتملين إلى اجتماع.",
          "correct": true
        },
        {
          "text": "مُنح العقد دون تفاوض.",
          "correct": false
        },
        {
          "text": "اتبع إجراءات المناقصة الخاصة بالشركة.",
          "correct": false
        },
        {
          "text": "مشاركة أهداف المشروع مع جميع مقدمي العروض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينضم مدير مشروع جديد إلى منظمة لم يكن لديها عمليات رسمية لإدارة المشروع. ويرفض بعض أعضاء الفريق المشاركة في المهام الأساسية مثل تولي مسؤولية بنود العمل في الاجتماعات.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بإعداد اجتماع خاص مع أعضاء الفريق المحددين لمناقشة فوائد إدارة المشروع.",
          "correct": true
        },
        {
          "text": "إنشاء مستند داخلي يوضح فوائد إدارة المشاريع لجميع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "استكشف فوائد إدارة المشاريع مع المسؤولين التنفيذيين في المؤسسة.",
          "correct": false
        },
        {
          "text": "قم باستضافة اجتماع مع الفريق يركز على حل المشاكل بشكل تعاوني لوضع نهج لإنجاز مهام المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتعين على مدير المشروع الحصول على الموافقة على متطلبات المشروع قبل الانتقال إلى مرحلة التسليم. وفي أثناء تنفيذ المشروع، يدرك مدير المشروع أن التقديرات الأولية لم تكن واقعية وأن المشروع سيستغرق وقتاً أطول بكثير لإكماله. وسيتعين على مدير المشروع الحصول على موافقة على متطلبات المشروع الأكثر واقعية.\nما الذي يجب على مدير المشروع القيام به للتخفيف من حدة المشكلة والحفاظ على المشروع على المسار الصحيح أثناء انتظار الموافقة؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعادة ترتيب أولويات نواتج المشروع لتمكين التسليم التدريجي على مراحل.",
          "correct": true
        },
        {
          "text": "قسّم فريق المشروع إلى وحدات متميزة تركز على مكونات مختلفة.",
          "correct": false
        },
        {
          "text": "قم باستطلاع رأي فريق المشروع لمعرفة ما إذا كان بإمكان أي شخص العمل لوقت إضافي للوفاء بالموعد النهائي.",
          "correct": false
        },
        {
          "text": "تحديث خط الأساس للجدول الزمني بحيث يستند إلى تقديرات واقعية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع جديد لديه فريق عمل منقسم بين المواقع في الموقع والمواقع الخارجية. ولاحظ مدير المشروع وجود تضارب متزايد بين شطري الفريق أثناء بدء المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "توصيل نطاق المشروع إلى جميع أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "تنظيم اجتماع وجهاً لوجه أثناء انطلاق المشروع.",
          "correct": false
        },
        {
          "text": "حدد هذا التعارض في سجل سجل المخاطر.",
          "correct": false
        },
        {
          "text": "قم بتسجيل هذا التعارض في سجل مشكلات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة التخطيط للمشروع، يواجه مدير المشروع مشكلة في تحديد أصحاب المصلحة. فبدون مدخلات من أصحاب المصلحة الصحيحين، سيكون الحصول على تعليقات المستخدمين أمراً صعباً.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة خطة مشاركة أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "إبلاغ الجهات الراعية للمشروع.",
          "correct": false
        },
        {
          "text": "ارجع إلى ميثاق المشروع لتحديد أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة وثيقة نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى فريق مشروع مشتت للتو سباقاً سريعاً بمهام معقدة قبل الموعد المحدد. أثناء الاستعراض الاستعراض، يقاطع عضو جديد في الفريق ويطلب من الجميع شرح أدوارهم وما يخططون للعمل عليه في السباق القادم.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عالج الموقف على الفور ورد على عضو الفريق الجديد مباشرة.",
          "correct": true
        },
        {
          "text": "أبلغ أعضاء الفريق أنه من الأفضل التعامل مع هذا الأمر في اجتماع آخر.",
          "correct": false
        },
        {
          "text": "اطلب من كل عضو في الفريق أن يشرح دوره وما سيعمل عليه في السباق التالي.",
          "correct": false
        },
        {
          "text": "قم بإعداد اجتماعات فردية مع كل عضو في الفريق والعضو الجديد في الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بقيادة مشروع تنفيذ جديد مع فريق مشروع عالمي. وبما أن أعضاء الفريق موجودون في مواقع جغرافية ومناطق زمنية مختلفة، يتعين على مدير المشروع أن يقرر استراتيجية مشاركة الفريق الأكثر فعالية.\nما هو الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "",
      "choices": [
        {
          "text": "وضع خطة لإدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "قم بإعداد مكالمات جماعية يومية لمتابعة العمل.",
          "correct": false
        },
        {
          "text": "اطلب من جميع أعضاء الفريق استخدام لوحة المهام عبر الإنترنت.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق مواءمة جداول عملهم.",
          "correct": false
        }
      ]
    }
  ]
}
