{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء إغلاق المشروع، يرى الفريق أن الاستعراض بأثر رجعي للسباق النهائي ليس ضروريًا لأنه لا توجد سباقات سريعة متبقية. ما هي النتيجة المفيدة المحتملة لعقد هذا الاستعراض بأثر رجعي للسباق السريع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحسن في السرعة إذا تم تشكيل الفريق نفسه في المستقبل",
          "correct": true
        },
        {
          "text": "فرص الترقية لأعضاء الفريق",
          "correct": false
        },
        {
          "text": "المعلومات التي يمكن أن تكون مفيدة للمشاريع المستقبلية",
          "correct": false
        },
        {
          "text": "نصائح للتكيف مع العمل معًا إذا حدث ذلك في المستقبل القريب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أجرى مدير المشروع تحليلاً مع أصحاب المصلحة المعنيين للتحقق من توافق المشروع مع الاستراتيجية التنظيمية وقيمة الأعمال المتوقعة. وغاب العديد من أصحاب المصلحة الرئيسيين عن جلسة التحليل ولم يتم تضمين مدخلاتهم في التحليل.\nما هي النتيجة الرئيسية لعدم حضور أصحاب المصلحة جلسة التحليل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأخرت الموافقة الرسمية على طلبات تغيير المشروع.",
          "correct": true
        },
        {
          "text": "عدم رضا أصحاب المصلحة عن مخرجات المشروع الرئيسية.",
          "correct": false
        },
        {
          "text": "قد ينتج عن ذلك تعارض في المراحل اللاحقة للمشروع.",
          "correct": false
        },
        {
          "text": "مدخلات غير متسقة بشأن الفوائد من أصحاب المصلحة الرئيسيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعلن أحد الأعضاء الرئيسيين في فريق المشروع علنًا أن عضوًا آخر في الفريق يتحدث عنه بشكل سلبي. ويهدد عضو الفريق بالاستقالة من وظيفته إذا لم يتخذ مدير المشروع إجراءً فورياً لمعالجة النزاع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "الدعوة إلى اجتماع للفريق لأن المشروع في خطر بدون عضو الفريق الرئيسي.",
          "correct": true
        },
        {
          "text": "الاجتماع مع عضو الفريق المتهم لفهم وجهة نظره.",
          "correct": false
        },
        {
          "text": "حدد موعدًا للاجتماع في المستقبل للسماح للمشكلة بالانتشار مع مرور الوقت.",
          "correct": false
        },
        {
          "text": "قرر إزالة أحد عضوي الفريق لمعالجة النزاع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب فريق القيادة في إحدى الشركات من مدير المشروع تحديثًا مخصصًا لحالة آخر تكرار لمشروع ما. قام مدير المشروع بتوجيه فريق القيادة إلى ملف المشروع. أبلغ فريق القيادة مدير المشروع أن بعض المعلومات مفقودة.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الفريق مراجعة المجلد قبل مشاركته وإضافة المعلومات الناقصة.",
          "correct": true
        },
        {
          "text": "حدد موعدًا لاجتماع الفريق لمناقشة المعلومات الناقصة مع فريق القيادة.",
          "correct": false
        },
        {
          "text": "فحص ملف المشروع بعناية قبل مشاركته مع فريق القيادة.",
          "correct": false
        },
        {
          "text": "قم بتحديث مجلد المشروع بانتظام لضمان أن تكون عناصر المشروع محدثة دائمًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يقرر راعي المشروع استبدال خبير متخصص في المشروع.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تفاوض مع الجهة الراعية للمشروع للاحتفاظ بالمشروع مع الشركة الصغيرة والمتوسطة في المشروع.",
          "correct": true
        },
        {
          "text": "التأكد من وجود نقل كافٍ للمعرفة بين الشركة الصغيرة والمتوسطة ومن يحل محلها.",
          "correct": false
        },
        {
          "text": "بيّن للمؤسسة الصغيرة والمتوسطة الجديدة أن القاعدة المعرفية للمشروع تحتوي على جميع المعلومات المطلوبة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لشرح التعارضات بين فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تلقى مدير المشروع عروض أسعار من بائعين اثنين لنفس القطع. وقد أبلغ البائع \"أ\" مدير المشروع أنه نفذ طلبًا مماثلًا قبل شهرين بسعر يقل بنسبة 2% عن التكلفة الأصلية المخطط لها. البائع (ب) لديه تاريخ من التسليم في الوقت المحدد ولكنه أعلن عن زيادة في السعر.\nكيف ينبغي لمدير المشروع تقييم هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الاتفاقيات ووثائق المشتريات الخاصة بالمورّد \"ب\" لإجباره على الاحتفاظ بالتسعير الأصلي.",
          "correct": true
        },
        {
          "text": "تقييم بنود العقد لتقليل الطلبات من البائع \"ب\"، وشرائها من البائع \"أ\" لتحسين مؤشرات المشروع.",
          "correct": false
        },
        {
          "text": "استخدم المقاييس من المورد \"أ\" لطلب تسعير أفضل من المورد \"ب\"، مع الاحتفاظ بكلا الموردين كاستراتيجية لتخفيف المخاطر.",
          "correct": false
        },
        {
          "text": "راجع معلومات أداء العمل لكلا الموردين مقابل عقودهم للعثور على المورد المفضل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتوزع فريق مشروع التكيف على مستوى العالم ويتحدث أعضاء الفريق لغات أساسية مختلفة. تُعقد الاجتماعات اليومية افتراضياً بلغة مشتركة. يدرك مدير المشروع أن هناك بعض المشاكل في التواصل. الاختلافات في النطق واللهجة والمفردات تجعل من الصعب للغاية على بعض الأعضاء فهم بعضهم البعض.\nما الذي يجب على مدير المشروع تفصيله لتحسين الاجتماع اليومي وتجنب سوء الفهم؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدم المكالمة لتلخيص حالة العمل شفهياً كما أبلغ عنها أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "استخدم لوحة المهام الإلكترونية لإعطاء تمثيل مرئي لحالة العمل والتقدم المحرز.",
          "correct": false
        },
        {
          "text": "اطلب إجراء تغيير في ميزانية المشروع لتوفير إمكانية الوصول إلى خدمة الترجمة.",
          "correct": false
        },
        {
          "text": "اطلب من جميع أعضاء الفريق تقديم تقارير عن العمل المنجز والعمل القادم والمعيقات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم إحدى المؤسسات بالاستحواذ على منتج مماثل في منتصف دورة تطوير منتج محتمل. قد يؤدي ذلك إلى تداخل في حافظة المنتجات.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم جدوى المشروع وجدواه مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "الاستمرار في تطوير المنتج لصالح المنظمة.",
          "correct": false
        },
        {
          "text": "ناقش التأثير المحتمل لعملية الاستحواذ مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "أوقف المشروع حتى يظهر مسار واضح لخارطة طريق المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيدرك مدير المشروع أن رسالة بريد إلكتروني موجهة إلى عضو معين في الفريق قد تم إرسالها عن طريق الخطأ إلى فريق المشروع العالمي بأكمله. يحتوي هذا البريد الإلكتروني على ملاحظات مهمة تتعلق بحادث وقع مؤخراً. ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجاهل الخطأ وافترض أن أعضاء الفريق سيتفهمون الموقف.",
          "correct": true
        },
        {
          "text": "اعترف بالخطأ واعتذر عن أي عواقب غير مقصودة.",
          "correct": false
        },
        {
          "text": "اطلب من مستلمي البريد الإلكتروني غير المقصودين حذف الرسالة دون قراءتها.",
          "correct": false
        },
        {
          "text": "أرسل رسالة خاصة إلى عضو الفريق تعتذر فيها عن الملاحظات الناقدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق رشيق بتطوير منتج مع قيود صارمة على الميزانية. يطلب العميل إضافة ميزة مستقلة جديدة إلى الحل قيد التطوير. يشعر مدير المشروع بالقلق من أن إضافة الميزة الجديدة ستتجاوز الميزانية.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقييم الميزة الجديدة مع العميل.",
          "correct": true
        },
        {
          "text": "رفض إضافة الميزة الجديدة.",
          "correct": false
        },
        {
          "text": "أضف الميزة الجديدة إلى تراكمات المنتج.",
          "correct": false
        },
        {
          "text": "إعادة ترتيب أولويات المنتجات المتراكمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتطلب تنفيذ مشروع بناء في منطقة نائية أن يعيش أعضاء الفريق معًا في مهاجع الشركة عندما يُطلب منهم التواجد في الموقع. يتوجه العديد من أعضاء الفريق إلى مدير المشروع للشكوى من الطريقة التي يتصرف بها أحد أعضاء الفريق بعد العمل. وقد أعربوا عن مخاوفهم من أن هذا السلوك يؤثر سلبًا على معنويات الفريق وتماسكه.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع لمناقشة المشكلة مع الفريق.",
          "correct": true
        },
        {
          "text": "خطط لجلسة بناء الفريق لمناقشة المشكلة.",
          "correct": false
        },
        {
          "text": "انقل عضو الفريق المعني إلى مهجع جديد.",
          "correct": false
        },
        {
          "text": "مراجعة معايير الفريق ومناقشتها مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لقيادة برنامج مشروع متعدد الجنسيات مع فريق عمل موزع جغرافيًا. يتواجد أعضاء الفريق في بلدان مختلفة ولديهم آراء مختلفة حول إعداد تقارير الحالة. يفضل البعض التقارير المفصلة، بينما يفضل البعض الآخر أن تكون موجزة. يرغب بعض أعضاء الفريق في إرسال تقارير حالة يومية، بينما يرغب آخرون في إرسال تقارير حالة أسبوعية.\nكيف ينبغي لمدير المشروع حل المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من الفريق الالتزام بخطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "رفع مشكلة الإبلاغ إلى الجهة الراعية للمشروع للحصول على إرشادات.",
          "correct": false
        },
        {
          "text": "اطلب من الفريق حل المشكلة فيما بينهم.",
          "correct": false
        },
        {
          "text": "تغيير القالب الحالي لإعداد تقارير الحالة لاستيعابها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء جمع المتطلبات الخاصة بنطاق المشروع، يدرك مدير المشروع أن بعض متطلبات أصحاب المصلحة تتعارض مع متطلبات المشروع.\nما الذي يجب أن يفعله مدير المشروع لتحديد نطاق واضح؟",
      "explanation": "",
      "choices": [
        {
          "text": "مساعدة أصحاب المصلحة المتأثرين في التوصل إلى توافق في الآراء.",
          "correct": true
        },
        {
          "text": "اتبع توصية الاستشاري الفني.",
          "correct": false
        },
        {
          "text": "رفع الأمر إلى راعي المشروع لاتخاذ قرار.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مع الأطراف المختلفة فقط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء سير المشروع، يتعين على الفريق معالجة المشكلات غير المتوقعة التي قد تؤثر على الجدول الزمني والميزانية. وتتطلب العديد من المشكلات حلًا فوريًا قبل أن يتسنى معالجة المشكلات المترابطة الأخرى. تشير خطة إدارة الاتصالات إلى أن العميل وأصحاب المصلحة الداخليين الرئيسيين لا يحتاجون إلا إلى تقارير شهرية.\nكيف ينبغي لمدير المشروع أن ينقل تأثير هذه المشكلات؟",
      "explanation": "",
      "choices": [
        {
          "text": "قم بتحديث سجل مشكلات المشروع لضمان تسجيل مشكلات التواصل داخلياً.",
          "correct": true
        },
        {
          "text": "الاحتفاظ بتقارير شهرية للعملاء وأصحاب المصلحة الداخليين كما هو موضح في خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "زيادة التواصل مع العميل وأصحاب المصلحة حسب الضرورة لإدارة المشكلات وتأثيرها.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات وطلب الموافقة على الخطة المنقحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتمتع فريق المشروع بإمكانية الوصول الكامل إلى جميع البيانات المتعلقة بالمشروع، بما في ذلك البيانات والمعلومات المرئية مثل مخطط جانت ومصفوفة تحديد الأولويات وخريطة القصة والمدخلات الأخرى. ومع ذلك، يطلب أحد أعضاء فريق المشروع مرارًا وتكرارًا تفاصيل أكثر دقة عن حزمة العمل مما يشير إليه مخطط جانت. يتم التأكد من أن مخطط جانت شامل وحديث، ويشعر أعضاء فريق المشروع الآخرون أن مخطط جانت الحالي مفصل بما فيه الكفاية.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء قناة اتصال جديدة مع تحديثات دقيقة.",
          "correct": true
        },
        {
          "text": "تأكد من فهم عضو الفريق لعملية استرجاع المعلومات التفصيلية.",
          "correct": false
        },
        {
          "text": "ذكّر عضو فريق المشروع بأن مخطط جانت هو الشكل المتفق عليه.",
          "correct": false
        },
        {
          "text": "استمر في تجاهل طلبات أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء الفحص النهائي لمنتج جديد، يكتشف فريق المشروع عيبًا كبيرًا في أحد المخرجات الرئيسية. ويشكل هذا العيب خطراً أمنياً على العميل الذي يتوقع البدء في استخدام الناتج في غضون أسبوعين.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء تحقيق الجودة وبدء الإجراءات التصحيحية.",
          "correct": true
        },
        {
          "text": "استخدم احتياطي الطوارئ لتغطية تكلفة العيب.",
          "correct": false
        },
        {
          "text": "مقابلة العميل لشرح سبب الخلل.",
          "correct": false
        },
        {
          "text": "أرسل للعميل رسالة اعتذار عن الإزعاج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nخلال مشروع متعدد التخصصات، يكتشف مدير المشروع أن هناك العديد من الخلافات حول التصميم بين أعضاء الفريق من مختلف التخصصات. ما الذي يجب أن يفعله مدير المشروع لضمان التنفيذ السلس للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد المسألة باعتبارها مخاطرة والتحقق من احتياطيات الميزانية المتاحة.",
          "correct": true
        },
        {
          "text": "تأكد من أن راعي المشروع على علم بالوضع الحالي.",
          "correct": false
        },
        {
          "text": "قم بالتصعيد إلى المديرين الفنيين وابحث عن حل.",
          "correct": false
        },
        {
          "text": "تيسير مناقشات الفريق لتحقيق النتائج المرجوة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يشكك أحد أصحاب المصلحة في الغرض من المشروع ويريد إيقاف المشروع مؤقتًا لتقييم عملية جديدة قد تؤثر على الناتج النهائي.\nما هو أول شيء يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدم شبكة القوة/المصلحة لتحديد تأثير أصحاب المصلحة على تنفيذ المشروع.",
          "correct": true
        },
        {
          "text": "التشاور مع راعي المشروع لتحديد الخطوات التالية والعملية الجديدة المحتملة.",
          "correct": false
        },
        {
          "text": "قم بتأجيل أي تغييرات في مشروع مستقبلي من أجل إنجاز النواتج في المشروع الحالي.",
          "correct": false
        },
        {
          "text": "إعادة النظر في معايير القبول مع أصحاب المصلحة للتأكد من أن مستوى الجودة مناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nتقوم إحدى الشركات بتنفيذ نهج رشيق لمشروع جديد. ما هو الإجراء الذي ينبغي لمدير المشروع اتخاذه لضمان عمله كقائد خادم؟",
      "explanation": "",
      "choices": [
        {
          "text": "حافظ على رقابة صارمة على الفريق وأنشطته.",
          "correct": true
        },
        {
          "text": "العمل كاحتياطي في حالة مرض أحد أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تأكد من أن الفريق يتبع جميع العمليات كما هي محددة دون تشكيك.",
          "correct": false
        },
        {
          "text": "فهم الاختناقات ودعم الفريق لإزالتها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكون المشروع في مرحلة رئيسية من التنفيذ ويكرس الجميع جهودهم لتحقيق النجاح. يقوم المدير الوظيفي فجأة بسحب أحد أعضاء الفريق الرئيسيين للاستجابة لحالة طارئة دون التواصل مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحقق من تقويم الموارد للعثور على عضو آخر في الفريق.",
          "correct": true
        },
        {
          "text": "إبلاغ راعي المشروع والإدارة التنفيذية بالحالة.",
          "correct": false
        },
        {
          "text": "التواصل مع المدير الوظيفي وطلب عودة العضو الرئيسي.",
          "correct": false
        },
        {
          "text": "راجع التأثير على المشروع وحدد موعدًا للاجتماع مع المدير الوظيفي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء حضور اجتماع الحوكمة مع الإدارة العليا، يتم إبلاغ مدير المشروع شفهيًا عن تدقيق خارجي وشيك لمشاريع مختارة. وسيتيح التدقيق للمنظمة الحفاظ على شهادة الجودة الخاصة بها.\nما الذي يجب أن يفعله مدير المشروع أولاً للتحضير للتدقيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث جميع وثائق المشروع ذات الصلة بالوضع الحالي للمشروع.",
          "correct": true
        },
        {
          "text": "قم بتعليق المشروع لضمان الامتثال الكامل لعملية التدقيق.",
          "correct": false
        },
        {
          "text": "تواصل مع المدققين لفهم نطاق التدقيق ومتطلباته.",
          "correct": false
        },
        {
          "text": "اجتمع مع الفريق وأبلغهم بنطاق التدقيق ومتطلباته.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
          "correct": true
        },
        {
          "text": "تقييم مدى صحة المخاوف وتقييم مدى توافق التكنولوجيا الحالية والمقترحة حديثاً.",
          "correct": false
        },
        {
          "text": "قابل العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
          "correct": false
        },
        {
          "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التخطيط لتسليم حل عالمي في مؤسسة متعددة الجنسيات، قام مدير المشروع والفريق بصياغة جميع بنود العمل وتحديد الأولويات والمنهجيات للتنفيذ. خلال أحد الاجتماعات اليومية، أعرب أحد أعضاء الفريق عن قلقه بشأن امتثال التكنولوجيا المستخدمة واقترح بديلاً أكثر توافقاً مع سياسات خصوصية البيانات في البلد.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب من مالك الهندسة المعمارية تقييم اقتراح عضو الفريق وتقييم مخاوف الامتثال.",
          "correct": true
        },
        {
          "text": "تقييم مدى صحة المخاوف وتقييم مدى امتثال التكنولوجيا الحالية والمقترحة حديثاً.",
          "correct": false
        },
        {
          "text": "قابل العميل واسأله عما إذا كان مرتاحاً لتطبيق التقنية المقترحة حديثاً.",
          "correct": false
        },
        {
          "text": "احصل على الدعم من قسم تكنولوجيا المعلومات (IT) فيما يتعلق بجدوى التكنولوجيا الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nيلاحظ مدير المشروع الذي يدير فريقاً كبيراً أن أعضاء الفريق لا يتفاعلون معاً، مما يؤثر على أداء المشروع وجودة نتائج المشروع. ما الذي يجب أن يفعله مدير المشروع للمساعدة في تنمية ديناميكيات الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماعات جماعية وجهاً لوجه لفهم ماهية المشكلات.",
          "correct": true
        },
        {
          "text": "قم بإخطار المشرفين على أعضاء فريق المشروع بعدم تعاونهم.",
          "correct": false
        },
        {
          "text": "إضافة نقص التواصل الجماعي كمخاطر في سجل المخاطر ومراقبة الوضع.",
          "correct": false
        },
        {
          "text": "ارجع إلى الدروس المستفادة لفهم كيفية تعامل المشاريع الأخرى مع المشكلات المماثلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سؤال\nأثناء التحقق من صحة التسليمات، يدرك مدير المشروع أن أحد أعضاء فريق المشروع استخدم نسخة قديمة من وثيقة تعريف النطاق، مما تسبب في حدوث أخطاء كبيرة. ما الذي يجب أن يفعله مدير المشروع لإدارة هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "ناقش آخر المنجزات خلال الاجتماع القادم.",
          "correct": true
        },
        {
          "text": "تحديث سجل مستندات المشروع.",
          "correct": false
        },
        {
          "text": "إجراء عملية التحكم في التغيير.",
          "correct": false
        },
        {
          "text": "مشاركة وثيقة تعريف النطاق المحدثة مع الفريق .",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تعيين مدير مشروع لمشروع تطوير تطبيقات الهاتف المحمول. ويدرك مدير المشروع أن النهج الرشيق هو الأنسب للمشروع، ولكن معظم الفريق ليس لديه خبرة في النهج الرشيق.\nماذا يجب أن يفعل مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام نهج رشيق؟",
      "explanation": "",
      "choices": [
        {
          "text": "اطلب إعادة إسناد المشروع إلى فريق مشروع يتمتع بخبرة في العمل الرشيق.",
          "correct": true
        },
        {
          "text": "اطلب استبدال أعضاء الفريق الذين لم يسبق لهم استخدام الأساليب الرشيقة.",
          "correct": false
        },
        {
          "text": "ترتيب التدريب على مبادئ وعقلية العمل الرشيق لفريق المشروع الحالي.",
          "correct": false
        },
        {
          "text": "استخدم نهجًا تنبؤيًا لأن فريق المشروع على دراية بهذا النهج بالفعل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اجتماع مشروع رشيق، يقدم أحد أعضاء الفريق تحديثًا لحالة مهمته المهمة. يقاطعه عضو جديد في الفريق عندما يسمع ذكر مهمته ويعطي تحديثًا للحالة قبل أن ينتهي عضو الفريق الأول من تحديثه.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحدث على انفراد مع عضوي الفريق بعد الاجتماع.",
          "correct": true
        },
        {
          "text": "أخبر عضو الفريق الجديد أنه يتصرف بشكل غير احترافي.",
          "correct": false
        },
        {
          "text": "وقفة لمناقشة بروتوكول الاجتماع المناسب مع الفريق.",
          "correct": false
        },
        {
          "text": "اطلب من عضو الفريق الجديد الانتظار حتى ينتهي زميله في الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يعمل في منظمة مصفوفة يدير مشروعًا من المقرر أن ينتهي خلال شهر واحد. في اجتماع المشروع اليوم، تم إبلاغ مدير المشروع أن الأخطاء التي تصادف في رمز البرنامج تتزايد باطراد. أثناء المناقشات مع قائد فريق التطوير، تم إخبار مدير المشروع أن هذا أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوت الموعد النهائي، لكن مدير المشروع يشعر بالقلق\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في الجدول الزمني للمشروع لإتاحة المزيد من الوقت للتطوير.",
          "correct": true
        },
        {
          "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أنه تم تخفيف المخاطر",
          "correct": false
        },
        {
          "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يتوافق مع متطلبات الجودة الموثقة.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير من خلال عملية التحكم في التغيير لتمديد الموعد النهائي، مما يتيح المزيد من الوقت للتطوير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكون أحد المشاريع متأخراً عن الجدول الزمني المحدد له عندما يتم تعيين عضو جديد في الفريق معروف بأدائه العالي في الفريق. وأثناء تقييم العضو الجديد في الفريق، يدرك مدير المشروع أن هذا الشخص يفتقر إلى التدريب اللازم للمشروع المحدد، لكنه يمتلك المهارات والخبرة ذات الصلة للانضمام إلى الفريق.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من تلقي عضو الفريق التدريب قبل الانضمام إلى الفريق.",
          "correct": true
        },
        {
          "text": "تكليف عضو الفريق الجديد بالأنشطة الهامة تحت المراقبة الدقيقة أثناء تلقيه التدريب.",
          "correct": false
        },
        {
          "text": "تكليف عضو الفريق الجديد بالأنشطة غير الحرجة دون مراقبة دقيقة أثناء توفير التدريب",
          "correct": false
        },
        {
          "text": "رفض إضافة عضو الفريق الجديد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بتجميع فريق يضم مزيجاً من أعضاء الفريق الجدد وذوي الخبرة. يكتشف مدير المشروع أن هناك مشاكل في تماسك الفريق. يعتقد أعضاء الفريق من ذوي الخبرة أن أعضاء الفريق الجدد يفتقرون إلى المهارات التقنية المطلوبة لأداء العمل اللازم ويتوقعون أن عليهم التعويض عن قلة خبرتهم.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم مكافآت أو حوافز أخرى لأعضاء الفريق ذوي الخبرة لتوجيه أعضاء الفريق الجدد.",
          "correct": true
        },
        {
          "text": "تحليل مهارات جميع أعضاء الفريق وتحديد الثغرات ووضع خطط لمعالجتها.",
          "correct": false
        },
        {
          "text": "إعادة تعيين أعضاء الفريق الجدد في مشاريع تتوافق بشكل أفضل مع مهاراتهم وخبراتهم.",
          "correct": false
        },
        {
          "text": "اشرح أنه من المتوقع أن يقوم أعضاء فريق المشروع المحترفون بحل المشكلات دون تدخل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق المشروع الذي يعمل على مشروع ذي أولوية عالية يحركه التغيير قد فاتته مراراً وتكراراً المواعيد النهائية للإصدار. ويحدد مدير المشروع أن هذا يرجع إلى أن أحد أعضاء الفريق من ذوي الخبرة مكلف بمشاريع متعددة ولديه نطاق عمل محدود.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الجهة الراعية للمشروع بالمشكلة.",
          "correct": true
        },
        {
          "text": "تعديل الجدول الزمني وإصدار طلب تغيير.",
          "correct": false
        },
        {
          "text": "ناقش هذه المشكلة مع فريق المشروع على الفور.",
          "correct": false
        },
        {
          "text": "تقييم عبء عمل عضو الفريق المتمرس.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين عن طريق المكالمات الهاتفية فقط، كما هو مبين في خطة إدارة الاتصالات. بعد مرور ثلاثة أسابيع على تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال المخصصة الزائدة عن الحاجة من صاحب المصلحة هذا.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استمر في التواصل عبر المكالمات الهاتفية لأنها كانت فعالة حتى الآن.",
          "correct": true
        },
        {
          "text": "اجتمع مع أصحاب المصلحة لمناقشة احتياجاتهم وتوقعاتهم في مجال التواصل.",
          "correct": false
        },
        {
          "text": "إرسال بريد إلكتروني إلى صاحب المصلحة لطلب تغيير نهج التواصل.",
          "correct": false
        },
        {
          "text": "تعيين أحد أعضاء الفريق للعمل كحلقة وصل بين مدير المشروع وأصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في المراحل الأولى من تشكيل الفريق، يكون مدير المشروع غير قادر على التركيز على المهام الرئيسية لأن أعضاء الفريق يطلبون المساعدة باستمرار لحل النزاعات المتعلقة بتفسير متطلبات العميل.\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تمكين الفريق من حل النزاعات فيما بينهم.",
          "correct": true
        },
        {
          "text": "اقضِ بعض الوقت في حل هذه النزاعات مع الفريق.",
          "correct": false
        },
        {
          "text": "استخدم لجنة حل النزاعات للمساعدة في حل هذه النزاعات.",
          "correct": false
        },
        {
          "text": "تصعيد النزاعات إلى مدير البرنامج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع لتكنولوجيا المعلومات (IT) بفريق جديد لمشروع تطوير برمجيات في بيئة رشيقة. يقدّر مدير المشروع أن المشروع سيستغرق عددًا معينًا من الأيام استنادًا إلى الخبرة السابقة في مؤسسة أخرى.\nكيف يجب على مدير المشروع التحقق من صحة هذا الافتراض وتخطيط وإدارة الجدول الزمني للمشروع بشكل صحيح؟",
      "explanation": "",
      "choices": [
        {
          "text": "إجراء مسح في المؤسسة وإنشاء بيانات للتحقق من صحة المطالبات.",
          "correct": true
        },
        {
          "text": "التقدير استناداً إلى اجتماعات مراجعة السباق السريع ومدخلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دراسة اجتماعات التخطيط السابقة لسباق السرعة وثقافة المشروع في المؤسسة.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام فريق المشروع بتسليم مخرجات المشروع، ولكن مدير المشروع يرغب في تقييم ما إذا كان المشروع قد حقق القيمة المرجوة منه للجهة الراعية.\nما هو العامل الأكثر ملاءمة لمدير المشروع لتقييمه؟",
      "explanation": "",
      "choices": [
        {
          "text": "مواءمة ما تم إنجازه مع توقعات الجهة الراعية.",
          "correct": true
        },
        {
          "text": "ما إذا كانت مخرجات المشروع قد زادت من الدخل المحتمل للجهة الراعية.",
          "correct": false
        },
        {
          "text": "ما إذا كانت فروق أداء التسليم ضمن الحدود التي حددتها الجهة الراعية.",
          "correct": false
        },
        {
          "text": "التزام المشروع بشكل عام بقيود النطاق والوقت والميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني أعضاء الفريق الرشيق من صعوبات. في حين أن هناك ثقة بين أعضاء الفريق، فإن غالبية قرارات الفريق يتخذها عدد قليل من أعضاء الفريق الأكثر خبرة.\nما الذي يجب أن يفعله مدير المشروع من أجل تمكين فريق عمل عالي الأداء؟",
      "explanation": "",
      "choices": [
        {
          "text": "ثني أعضاء الفريق ذوي الخبرة عن التحدث أولاً، والسماح للآخرين بتقديم أفكارهم.",
          "correct": true
        },
        {
          "text": "تيسير الاجتماعات لضمان مشاركة جميع أعضاء الفريق في قرارات الفريق.",
          "correct": false
        },
        {
          "text": "تدريب الفريق لضمان تقديم جميع الأعضاء للأفكار وتحقيق توافق في الآراء بين أعضاء الفريق",
          "correct": false
        },
        {
          "text": "قم بإثارة المشكلة في جلسة استرجاعية واطلب من الفريق إضفاء الطابع الرسمي على اتفاقيات الفريق الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد مشاريع تطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعرون أنه سيكون ذا فائدة كبيرة للمشروع. ومع ذلك، فإن هذا المطلب لا يتماشى مع أهداف المشروع التي وثقها صاحب العمل\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تأكد من فهم أصحاب المصلحة للغرض من المشروع.",
          "correct": true
        },
        {
          "text": "تشجيع أصحاب المصلحة على اتباع متطلبات العمل المكتوبة.",
          "correct": false
        },
        {
          "text": "تضمين المتطلبات الإضافية في المشروع وإبلاغ صاحب العمل.",
          "correct": false
        },
        {
          "text": "المسار السريع للمشروع واقتراح المتطلبات الجديدة على صاحب العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع رشيق في البلد \"أ\" مع فريق التطوير ومحلل الأعمال في البلد \"ب\"، وفريق ضمان الجودة في البلد \"ب\" خلال السباق الثاني، يتضح أن جميع حالات الاختبار قد فشلت يتأكد الميسر الرشيق من أن محلل الأعمال قد غير معايير قبول القصص وأبلغ هذه التغييرات إلى فريقه المحلي فقط.\nما الذي يجب أن ينفذه مدير المشروع الرشيق من الآن فصاعداً لمنع تكرار ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "حماية كلمة المرور على قصص المستخدمين",
          "correct": true
        },
        {
          "text": "وثائق مراقبة التغيير الموقعة",
          "correct": false
        },
        {
          "text": "إشعارات التغيير التلقائية من أداة قصة المستخدم",
          "correct": false
        },
        {
          "text": "تهيئة التراكمات المتراكمة",
          "correct": false
        }
      ]
    }
  ]
}
