{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
      {
    "type": "multiple-choice",
    "text": "تقوم شركة بتوسيع نطاق تصنيع منتجاتها إلى بلد جديد. تم تحديد تاريخ بدء تشغيل الشركة وإبلاغه على نطاق واسع، لكن فريق المشروع غير متأكد مما إذا كان هناك وقت كافٍ لتنفيذ جميع ميزات المنتج.\nما الذي يجب أن يفعله مدير المشروع لضمان وجود وقت كافٍ لتنفيذ الميزات الهامة في التاريخ الملتزم به؟",
    "explanation": "",
    "choices": [
      {
        "text": "أضف الموارد إلى فريق المشروع، حيث سيؤدي ذلك إلى زيادة السرعة وتمكين الفريق من تقديم المزيد من القيمة.",
        "correct": true
      },
      {
        "text": "التعاون مع فريق المشروع لتقدير حجم الحد الأدنى من وظائف المنتج القابل للتطبيق (MVP).",
        "correct": false
      },
      {
        "text": "قطع وثائق العمليات لأن هذا يمكن إكماله بعد تسليم المنتج وبدء التشغيل.",
        "correct": false
      },
      {
        "text": "رفع مستوى القلق إلى المستوى التنفيذي وطلب تاريخ استحقاق جديد وممكن للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قامت إحدى الشركات بتعيين مدير مشروع لتنفيذ إطار عمل مشروع تكيفي. وقد أحرز المشروع بعض التقدم، لكن الفريق يشعر بالإحباط لأن العميل لا يقدم ملاحظات أو يشارك في تحديد معايير القبول.\nما الذي يمكن أن يكون سبب هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "لا يمتلك فريق التطوير أي خبرة في إدارة مشروع تكيف.",
        "correct": true
      },
      {
        "text": "يخطط العميل لتنفيذ المشروع ولا يحتاج إلى المشاركة.",
        "correct": false
      },
      {
        "text": "عدم فهم العميل لأهمية مشاركته.",
        "correct": false
      },
      {
        "text": "لم ينتج فريق التطوير نموذجاً أولياً كاملاً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم مدير مشروع بالتحضير لمشروع استبدال نظام برمجيات على مستوى المؤسسة سيكون له تأثير كبير على عمليات الأعمال. من الضروري توفير التدريب لضمان قدرة الجميع داخل المنظمة على استخدام نظام البرمجيات الجديد بفعالية، ولكن موارد التدريب محدودة. ما هو الإجراء الأكثر فعالية الذي يجب على مدير المشروع اتخاذه لضمان نجاح التدريب لجميع أعضاء المؤسسة؟",
    "explanation": "",
    "choices": [
      {
        "text": "دمج عنصر التدريب والتوجيه التفصيلي كمنتج من مخرجات المشروع.",
        "correct": true
      },
      {
        "text": "تحديد الاحتياجات والمتطلبات المحددة لوظائف المستخدم المختلفة.",
        "correct": false
      },
      {
        "text": "توظيف مدربين إضافيين لضمان تغطية تدريبية كافية في جميع أنحاء المنظمة.",
        "correct": false
      },
      {
        "text": "حدد أولويات جهود التدريب من خلال تحديد الميزات الأكثر أهمية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع متأخر حاليًا وتجاوز الميزانية. يستخدم المشروع نهجًا تنبؤيًا مدمجًا مع التكرارات الرشيقة للجزء الأكثر أهمية من النطاق. أثناء تقييم المشروع، يلاحظ مدير المشروع أن الفريق يخشى ارتكاب الأخطاء ويسعى إلى الحصول على التقدير الفردي، بينما يفتقر إلى المساءلة.\nكيف ينبغي لمدير المشروع تحسين الإنتاجية؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة لإدارة الأداء لكل عضو من أعضاء فريق المشروع ومشاركة نتائج الأداء مع الفريق.",
        "correct": true
      },
      {
        "text": "تمكين التعاون، ووضع أهداف مشتركة، والاحتفال بالإنجازات الجماعية، مع توفير المكافآت الجماعية.",
        "correct": false
      },
      {
        "text": "قم بتعزيز الإنجاز التالي والإبلاغ عنه، ومتابعة الأداء الفردي والتنفيذ على مستوى تفصيلي.",
        "correct": false
      },
      {
        "text": "اطلب الموافقة على استبدال بعض أعضاء الفريق حتى يتمكن فريق المشروع من فهم أهمية تحقيق الأهداف.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع داخلي ويلاحظ أن رؤى وأهداف قادة الأقسام الأخرى غير واضحة. وهذا يخلق حالة من الارتباك والغموض داخل فريق المشروع، ويصبح من الصعب التمييز بين قائمة الرغبات وعناصر النطاق.\nما هي الوثيقة التي ينبغي لمدير المشروع مراجعتها لتوضيح هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "ميثاق المشروع",
        "correct": true
      },
      {
        "text": "خطة إدارة الاتصالات",
        "correct": false
      },
      {
        "text": "سجل المخاطر",
        "correct": false
      },
      {
        "text": "خطة إشراك أصحاب المصلحة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى الشركات بالانتقال من نهج الإدارة التنبؤية إلى نهج الإدارة الرشيقة للمشروع. لاحظ مدير المشروع أن أعضاء الفريق لديهم أفكار قيمة حول كيفية تحسين الإنتاجية.\nكيف يمكن لمدير المشروع الاستفادة من هذه الأفكار؟",
    "explanation": "",
    "choices": [
      {
        "text": "الاستفادة من الجلسات الاستعراضية للمشروع للمناقشات والتعلم.",
        "correct": true
      },
      {
        "text": "استخدم تخطيط التكرار لمناقشة واعتماد طرق جديدة للعمل.",
        "correct": false
      },
      {
        "text": "تطوير ومشاركة المبادئ التوجيهية لتدريب الفريق والتوجيه.",
        "correct": false
      },
      {
        "text": "الانخراط مع مالك المنتج لتسهيل التتبع السريع لعملية الانتقال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم طلب بعض مواد المشروع من الخارج. أخطر المورد فريق المشروع بأن المواد لن تصل إلى الموقع في الوقت المحدد بسبب تأخير التخليص الجمركي الذي سيؤثر على المسار الحرج.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من فريق الخدمات اللوجستية ترتيب التخليص السريع.",
        "correct": true
      },
      {
        "text": "مراجعة سجل المخاطر وتنفيذ الاستجابة للمخاطر ذات الصلة.",
        "correct": false
      },
      {
        "text": "تحديد السبب الجذري للتأخير وإضافته إلى مستندات المناقصة.",
        "correct": false
      },
      {
        "text": "تأكد من تغطية الموردين لأي تكاليف إضافية بسبب التأخير.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه فريق مشروع مشترك في موقع واحد مشاكل في التواصل والتعاون. بعض أعضاء الفريق لديهم أدوار تتطلب منهم العمل لساعات مختلفة، فبعضهم يصلون مبكراً والبعض الآخر يغادرون في وقت متأخر. في اجتماع أسبوعي عُقد مؤخراً، تغيب العديد من أعضاء الفريق.\nما هي أفضل طريقة لمدير المشروع لضمان حضور الفريق جميع الاجتماعات الضرورية؟",
    "explanation": "",
    "choices": [
      {
        "text": "شجع أعضاء الفريق على العمل في نفس ساعات العمل.",
        "correct": true
      },
      {
        "text": "ناقش الاجتماع مع أعضاء الفريق المفقودين.",
        "correct": false
      },
      {
        "text": "إنشاء مشعاع معلومات للعرض العام.",
        "correct": false
      },
      {
        "text": "جدولة اجتماعات الفريق خلال الساعات الأساسية المتداخلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم بالفعل تسليم جزء من المشروع كما هو مخطط له وفي الموعد المحدد. ومع ذلك، قد تؤثر المتطلبات غير الواضحة لبعض المتطلبات المتبقية سلباً على الإنجاز المقرر.\nكيف ينبغي لمدير المشروع التعامل مع المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد أولويات الميزات الأكثر أهمية ووضح المتطلبات الغامضة.",
        "correct": true
      },
      {
        "text": "بدء طلب تغيير للحصول على موافقة راعي المشروع على تغيير النطاق.",
        "correct": false
      },
      {
        "text": "تسجيل المشكلة وتصعيدها إلى اللجنة التوجيهية لاتخاذ قرار بشأنها.",
        "correct": false
      },
      {
        "text": "الحصول على موارد إضافية لاستكمال جميع المتطلبات في الوقت المحدد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم أعضاء فريق المشروع بإبلاغ مدير المشروع بالتحدي الذي يواجهونه. من المرجح أن يؤثر هذا التحدي على الجداول الزمنية للمشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد ما إذا كانت تحديات الفريق تؤثر على المسار الحرج.",
        "correct": true
      },
      {
        "text": "الشروع في طلب تغيير لتمديد الجدول الزمني للمشروع.",
        "correct": false
      },
      {
        "text": "العمل مع الفريق لتقييم الأثر على المشروع ككل.",
        "correct": false
      },
      {
        "text": "رفع الأمر إلى راعي المشروع لحل المشكلة بشكل مناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على ميثاق مشروع ويكتشف أن اثنين من أصحاب المصلحة الرئيسيين سينتقلان إلى إدارات أخرى ولم يتم تحديد بدلاء لهما بعد.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتعليق المشروع حتى يتم تحديد البدائل.",
        "correct": true
      },
      {
        "text": "إشراك الإدارة العليا لحل المشكلة.",
        "correct": false
      },
      {
        "text": "الحصول على الدعم من راعي المشروع لمواصلة المشروع.",
        "correct": false
      },
      {
        "text": "إجراء تحليل لتأثير التأخيرات المحتملة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لتولي مشروع قيد التنفيذ. أثناء مراجعة الجودة، اكتشف الفريق أن 40% من النواتج بها عيوب وتتطلب إعادة عمل، مع اتجاه متوقع للتدهور.\nماذا يجب أن تكون الخطوة الأولى لمدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تقييم تكلفة إعادة العمل.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الجودة.",
        "correct": false
      },
      {
        "text": "مراجعة قصص المستخدمين.",
        "correct": false
      },
      {
        "text": "إجراء تحليل السبب الجذري.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فريق افتراضي في منتصف الطريق خلال سباق سريع لمهمة معقدة ومتقدم على الجدول الزمني. خلال الاجتماع اليومي، يقاطع عضو جديد في الفريق ويطلب من الجميع وصف ما عملوا عليه قبل السباق الحالي.\nكيف ينبغي لمدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "اشكر عضو الفريق الجديد على اهتمامه ووجهه إلى وثائق المشروع.",
        "correct": true
      },
      {
        "text": "اشرح لعضو الفريق الجديد أن الاجتماع اليومي ليس أفضل وقت لهذه المناقشة.",
        "correct": false
      },
      {
        "text": "اطلب من عضو الفريق الجديد مغادرة الاجتماع لمقاطعته الاجتماع اليومي.",
        "correct": false
      },
      {
        "text": "اطلب من جميع أعضاء الفريق وضع قائمة بالمهام التي أنجزوها قبل السباق الحالي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في منظمة مصفوفة. بعد إعادة التنظيم، يتم إعادة تعيين العديد من موارد المشروع الرئيسية إلى مشروع آخر. لم يعد لدى المشروع الموارد اللازمة لإنجاز المشروع بنجاح.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "رفض الإفراج عن الموارد المعاد تعيينها حديثاً.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات.",
        "correct": false
      },
      {
        "text": "مراجعة خطط تخصيص الموارد واستخدامها.",
        "correct": false
      },
      {
        "text": "مراجعة الاحتياجات من الموارد مع المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشرف مدير المشروع على مشروع رشيق مع فريق مشروع متمرس. لا يحضر مدير المشروع عادةً اجتماعات المتابعة اليومية، لكنه يحضر الاجتماعات من وقت لآخر. بعد حضور اجتماع معين، لاحظ مدير المشروع أن الاجتماع لم يكن مثمراً.\nما الذي يجب أن يفعله مدير المشروع لتحسين الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحليل ديناميكيات هذه الاجتماعات وإزالة العوائق وتقديم الملاحظات.",
        "correct": true
      },
      {
        "text": "اطلب من الفريق إرسال محاضر الاجتماعات إلى مدير المشروع بعد كل اجتماع يومي.",
        "correct": false
      },
      {
        "text": "ابدأ بحضور الاجتماعات اليومية لتعزيز جهود التعاون مع الفريق بشكل أفضل.",
        "correct": false
      },
      {
        "text": "تفويض المسؤولية إلى مالك المنتج لتسهيل اجتماعات المراجعة اليومية المستقبلية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع عالمي مع أعضاء الفريق في عدة بلدان مختلفة. ولإدارة الاتصالات، يخطط مدير المشروع لعقد اجتماعات افتراضية وزيارات ميدانية مرة في الشهر.\nما الذي يجب على مدير المشروع القيام به بعد ذلك أثناء العمل مع هذا الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب من مدير تكنولوجيا المعلومات في كل موقع إدارة المكونات التقنية للاجتماعات الافتراضية.",
        "correct": true
      },
      {
        "text": "اطلب السير الذاتية لأعضاء الفريق وتعرّف على خبرات أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "اقتراح ووضع ميثاق للفريق يتضمن القواعد والمبادئ الواجب اتباعها.",
        "correct": false
      },
      {
        "text": "طلب ميزانية للاجتماعات الشخصية الأسبوعية مع الفريق بأكمله للسماح بالاتصال المباشر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه المشروع تأخيرًا لمدة شهر واحد، ويدرك مدير المشروع أن طلب التغيير ضروري. سيقوم مجلس مراقبة التغيير (CCB) بمراجعة طلب التغيير في اجتماعه التالي، والذي سيكون في غضون أسبوعين. ومع ذلك، إذا تأخر تنفيذ هذا التغيير لمدة أسبوعين، فإن الاضطرابات القادمة في سلسلة التوريد ستتسبب في تأخير الجدول الزمني للمشروع لمدة شهرين.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتنفيذ التغيير على الفور لتجنب الاضطرابات القادمة في سلسلة التوريد والتأخير لمدة شهرين.",
        "correct": true
      },
      {
        "text": "تنقيح طلب التغيير لدمج التأخير الإضافي لمدة شهرين بسبب الاضطرابات القادمة في سلسلة التوريد.",
        "correct": false
      },
      {
        "text": "اجتمع مع الراعي واطلب منه التواصل مع مجلس مراقبة السلوكيات وطلب موافقته الفورية.",
        "correct": false
      },
      {
        "text": "اطلب من المدير التنفيذي الموافقة على التغيير وتنفيذه لتجنب التأخير المحتمل لمدة شهرين.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قبل يوم واحد من بدء إحدى المهام، اقترح القائد الفني نهجًا جديدًا للتنفيذ يمكن أن يقلل الجدول الزمني بمقدار أسبوع واحد. ومع ذلك، إذا لم ينجح هذا النهج، ستتأخر المهمة ثلاثة أيام.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "الشروع في طلب تغيير لتقليل الجدول الزمني بمقدار أسبوع واحد.",
        "correct": true
      },
      {
        "text": "أخبر القائد الفني أن النهج الجديد غير مجدٍ.",
        "correct": false
      },
      {
        "text": "ارجع إلى مخطط الشبكة لتحديد العوامة لهذه المهمة.",
        "correct": false
      },
      {
        "text": "إبلاغ الكفيل بالتأخير المحتمل لمدة ثلاثة أيام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الافتتاحي مع راعي المشروع ومختلف أعضاء المشروع، اتضح أنه لم يكن من الضروري حضور بعض المشاركين. بالإضافة إلى ذلك، لم يكن أحد الخبراء المطلوبين على علم بالاجتماع ولم يكن حاضراً في الاجتماع.\nما الذي كان يجب أن يفعله مدير المشروع لمنع حدوث ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء منصة اتصال ثابتة لتوفير تحديثات حول المشروع لجميع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "إدارة مشاركة أصحاب المصلحة من خلال إشراك أصحاب المصلحة في المراحل المناسبة من المشروع.",
        "correct": false
      },
      {
        "text": "وضع ميثاق المشروع بما في ذلك أدوار ومسؤوليات جميع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إنشاء مصفوفة مسؤولية لإخطار أصحاب المصلحة بالاجتماعات المطلوب منهم حضورها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ينضم مدير مشروع ذو خبرة إلى مشروع جارٍ ويريد تقدير مقدار الوقت اللازم لمعالجة عدة مهام معقدة. يستخدم الفريق لوحة كانبان ولكنه منفتح على أساليب جديدة. يقترح مدير المشروع استخدام نقاط القصة.\nما هو أول شيء يجب على الفريق القيام به قبل تنفيذ هذا النهج الجديد؟",
    "explanation": "",
    "choices": [
      {
        "text": "احسب نقاط القصة للعناصر المتراكمة الجديدة فقط.",
        "correct": true
      },
      {
        "text": "قم بتقدير نقاط القصة المطلوبة للوحة المهام بالكامل.",
        "correct": false
      },
      {
        "text": "تحويل جميع عناصر العمل قيد التنفيذ (WIP) إلى نقاط قصة.",
        "correct": false
      },
      {
        "text": "قم بقياس وتتبع نقاط القصة على مدار عدة سباقات سرعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع افتراضي مع فريق عالمي للمرة الأولى ويواجه مشكلة في مشاركة أصحاب المصلحة في اجتماعات الفريق. فبعض أصحاب المصلحة لا يشاركون، والبعض الآخر يشتكي من الجدولة، والبعض الآخر لا يرد على دعوات الاجتماعات.\nما الذي يجب على مدير المشروع فعله لمعالجة هذه المشاكل وضمان سلاسة الاجتماعات؟",
    "explanation": "",
    "choices": [
      {
        "text": "السماح لأصحاب المصلحة بالمشاركة في الاجتماعات غير المتزامنة باستخدام التواصل الكتابي.",
        "correct": true
      },
      {
        "text": "أبلغ راعي المشروع بالموقف واطلب الدعم في فرض حضور الاجتماع.",
        "correct": false
      },
      {
        "text": "مراجعة الثقافة والهيكل التنظيمي لتنسيق الاجتماعات بشكل صحيح.",
        "correct": false
      },
      {
        "text": "أعد جدولة الاجتماعات في أوقات وتواريخ مختلفة حسب المناطق الزمنية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nبعد بضع عمليات تكرار، يشعر مدير المشروع أنه على الرغم من أن الفريق ينجز العمل كما هو مخطط له، إلا أن الفريق ليس مرتاحًا تمامًا لبعض العمليات الرشيقة المتبعة في المشروع. متى يجب على مدير المشروع التحدث عن ذلك وإجراء التعديلات؟",
    "explanation": "",
    "choices": [
      {
        "text": "في الاجتماع التحضيري اليومي التالي",
        "correct": true
      },
      {
        "text": "في ورشة عمل الدروس المستفادة",
        "correct": false
      },
      {
        "text": "في الاجتماع الاستعراضي القادم",
        "correct": false
      },
      {
        "text": "في اجتماع تخطيط التكرار التالي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع بأثر رجعي، أعرب بعض أعضاء الفريق عن عدم موافقتهم بشدة على كيفية تعامل مالك المنتج وسكروم الرئيسي مع بعض القضايا المتعلقة بنطاق الدورة الأخيرة.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع الأعمال المتراكمة مع مالك المنتج للتأكد من أن النطاق مناسب.",
        "correct": true
      },
      {
        "text": "جمع كل المعلومات المتاحة من الفريق ومعالجة المشكلة.",
        "correct": false
      },
      {
        "text": "حدد موعداً لعقد اجتماع مع أعضاء الفريق المحددين لمناقشة المشكلة.",
        "correct": false
      },
      {
        "text": "ناقش مخاوف الفريق مع مالك المنتج ومدير سكروم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتحقق مدير برنامج جديد من حالة المشروع. تظهر التوقعات أن المشروع متأخر قليلاً عن الجدول الزمني. ومع ذلك، ذكر مدير المشروع في التقرير أن المشروع يسير على المسار الصحيح. يطلب مدير البرنامج من مدير المشروع تفسير هذا التناقض. يشرح مدير المشروع أن التباين في التوقعات يرجع إلى تقنية تقدير جديدة.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذا التناقض؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب من مدير البرنامج استخدام أسلوب التنبؤ القديم",
        "correct": true
      },
      {
        "text": "تثقيف مدير البرنامج حول تقنية التنبؤ الجديدة",
        "correct": false
      },
      {
        "text": "مواءمة أدوات المشروع مع تقنية التقدير الجديدة وتقديمها إلى مدير البرنامج",
        "correct": false
      },
      {
        "text": "التأكد من أن مدير البرنامج لديه المعرفة اللازمة لفهم تقنيات التقدير",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم مدير مشروع رشيق بالإشراف على مشروع كانبان ويريد تقييم عوائق إنجاز المهام لمرحلة رئيسية قادمة. ما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "إنشاء مقياس أداء باستخدام حد العمل الجاري.",
        "correct": true
      },
      {
        "text": "اسأل أحد أعضاء الفريق الموثوق بهم عن المشاكل التي يواجهها الفريق.",
        "correct": false
      },
      {
        "text": "قم بمراجعة العناصر المحظورة مع الفريق أثناء اجتماعات الاستعداد.",
        "correct": false
      },
      {
        "text": "استضافة اجتماع لأصحاب المصلحة لمناقشة معوقات إنجاز المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع رشيق في المرحلة الأولى من ست مراحل تكرارية. يتواجد الفريق على مستوى العالم، لذلك تكون الاجتماعات في بيئة افتراضية. بعد الاجتماع اليومي الخامس، يدرك مدير المشروع أن جميع الأعضاء لا يشاركون بنشاط.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "اسأل أعضاء الفريق عن سبب نقص المشاركة.",
        "correct": true
      },
      {
        "text": "إشراك الفريق وتوجيهه لتشجيع جميع الأعضاء على المشاركة.",
        "correct": false
      },
      {
        "text": "اطلب من كل عضو في الفريق على حدة المشاركة في الاجتماعات المستقبلية.",
        "correct": false
      },
      {
        "text": "اسمح للفريق بإيجاد طريقته الخاصة للمشاركة الكاملة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق مشروع على مشروع تقني معقد. يقدم أحد المنافسين منتجًا بميزة جديدة، مما يجبر الفريق على إجراء تغييرات للحفاظ على منتجهم من أن يصبح قديمًا. كان البرنامج الذي كان يستخدمه الفريق قديمًا ولا يمكن أن يستوعب تطوير الميزة الجديدة ويجب استبداله ببرنامج جديد في السوق. الفريق متحمس، ولكن ليس لديهم خبرة في العمل مع البرنامج الجديد.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه الفجوة المعرفية؟",
    "explanation": "",
    "choices": [
      {
        "text": "تدريب الفريق على استخدام البرنامج الجديد.",
        "correct": true
      },
      {
        "text": "توظيف أعضاء جدد في الفريق لديهم معرفة بالبرمجيات.",
        "correct": false
      },
      {
        "text": "تجاهل التطورات التكنولوجية.",
        "correct": false
      },
      {
        "text": "ناقش ميزات المنتج الجديد مع المنافس.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعبّر أحد المطورين عن مخاوفه بشأن الوقت الذي يقضيه في عمليات الاستعداد اليومية، وتحديث القصص، وإنشاء المهام، ومراجعة التبعيات بين القصص بدلاً من تطوير التعليمات البرمجية. يؤيد أعضاء الفريق الآخرون هذا التعليق.\nما الذي يجب أن يفعله القائد الخادم بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "اطلب اقتراحات حول كيفية إدارة وقتهم بشكل أكثر فعالية.",
        "correct": true
      },
      {
        "text": "تقليل التفاعلات بين أعضاء الفريق لزيادة وقت التطوير.",
        "correct": false
      },
      {
        "text": "شرح تعريف مشعاع المعلومات لفريق المشروع.",
        "correct": false
      },
      {
        "text": "الاعتراف بإحباط المطور والتأكيد على فائدة كل نشاط.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء إغلاق مشروع ما، يجد العميل بعض العيوب في النواتج المنجزة. ماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة المخرجات مقابل معايير القبول.",
        "correct": true
      },
      {
        "text": "تمديد المشروع حتى يتم قبول جميع المخرجات.",
        "correct": false
      },
      {
        "text": "إقناع العميل بقبول المخرجات كما هي.",
        "correct": false
      },
      {
        "text": "دفع غرامة السلعة المعيبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بسبب الآثار الاقتصادية، تعلن إحدى الشركات عن تسريح وشيك للعمال. يقترب المشروع من التسليم، ويشعر الفريق بالقلق من فقدان وظائفهم. معنويات الفريق منخفضة للغاية، ويواجه مدير المشروع تأخيرات متزايدة في التسليم من الفريق.\nما الذي يجب أن يفعله مدير المشروع لمعالجة الروح المعنوية للفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "استبدل أعضاء الفريق الذين لا يقدمون الأداء الأمثل لتحسين الإنتاجية الإجمالية.",
        "correct": true
      },
      {
        "text": "تقديم تحديثات منتظمة عن حالة التسريح ومناقشة تأثيرها على الفريق والمشروع.",
        "correct": false
      },
      {
        "text": "حافظ على سرية جميع المعلومات المتعلقة بتسريح الموظفين لتجنب التسبب في مزيد من القلق.",
        "correct": false
      },
      {
        "text": "اجتمع مع فريق المشروع لطمأنتهم بأنهم لن يتم تسريحهم وأن وظائفهم آمنة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nتكشف عمليات الفحص المنتظمة مع فريق التسليم عن انخفاض الروح المعنوية وانعدام الكفاءة. ما الذي ينبغي أن يفعله مدير المشروع لمعالجة هذه المخاوف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء تقييم للمهارات.",
        "correct": true
      },
      {
        "text": "إجراء تمارين بناء الفريق.",
        "correct": false
      },
      {
        "text": "قم بإزالة جميع معوقات المشروع.",
        "correct": false
      },
      {
        "text": "إجراء تقييم الرضا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم أحد أعضاء الفريق الذي يتمتع بالخبرة والمعرفة الكافية بإبلاغ مدير المشروع بوجود تعارض مع عضو آخر في الفريق ويطلب المشورة والمساعدة. يقوم مدير المشروع بجدولة اجتماع لمناقشة النزاع مع أعضاء الفريق المعنيين.\nما الذي يجب أن يفعله مدير المشروع أثناء الاجتماع لحل النزاع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد القرار معاً.",
        "correct": true
      },
      {
        "text": "تفويض الحل من جانب واحد.",
        "correct": false
      },
      {
        "text": "افصل بين أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "حدد من الذي حرض على المشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تنفيذ المشروع، يتم استبدال أحد أصحاب المصلحة الرئيسيين بعضو جديد في الفريق لديه سلطة الموافقة. ويذكر العضو الجديد أن مخرجات المشروع لا تتماشى مع التصميم ولا يوافق عليها. ومع ذلك، بعد بضعة أسابيع، يعلم مدير المشروع أن العضو الجديد في الفريق لم يتم إبلاغه بالتغييرات أثناء التنفيذ.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب سوء التواصل هذا؟",
    "explanation": "",
    "choices": [
      {
        "text": "تنظيم اجتماع مع الراعي قبل بدء التنفيذ.",
        "correct": true
      },
      {
        "text": "تحديث سجل أصحاب المصلحة ليشمل عضو الفريق الجديد.",
        "correct": false
      },
      {
        "text": "مطالبة صاحب المصلحة السابق بعقد اجتماع مع عضو الفريق الجديد قبل مغادرته.",
        "correct": false
      },
      {
        "text": "تحديث ميثاق المشروع أثناء مرحلة التنفيذ ليشمل جميع التغييرات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق المشروع بإنشاء مصفوفة تقييم لمشاركة أصحاب المصلحة لتنظيم أنشطة إدارة أصحاب المصلحة أثناء تنفيذ المشروع. ويعلم الفريق أن أحد أصحاب المصلحة الرئيسيين على علم بالمشروع، ولكنه غير مؤيد للنتائج.\nأي نوع من أصحاب المصلحة هذا؟",
    "explanation": "",
    "choices": [
      {
        "text": "مقاوم",
        "correct": true
      },
      {
        "text": "الريادة",
        "correct": false
      },
      {
        "text": "محايد",
        "correct": false
      },
      {
        "text": "داعم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تمت الموافقة على بيان نطاق المشروع من قبل راعي المشروع. ويرغب أعضاء الفريق في تعديل هيكل تقسيم العمل (WBS) دون تغيير النطاق وإرسال طلب إلى مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع بهذا الطلب؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد التغييرات التي يجب تنفيذها وإبلاغ الفريق بها.",
        "correct": true
      },
      {
        "text": "رفض الطلب وتصعيده إلى راعي المشروع.",
        "correct": false
      },
      {
        "text": "أخبر الفريق أنه لا يمكنهم تعديل نظام WBS المعمول به.",
        "correct": false
      },
      {
        "text": "ناقش الأمر مع الفريق واتخذ قراراً بالإجماع.",
        "correct": false
        }
      ]
    }
  ]
}
