{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
     {
    "type": "multiple-choice",
    "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق المهمين فقد اهتمامه بالمشروع. أدى عدم اهتمام عضو الفريق إلى انخفاض الإنتاجية.\nكيف ينبغي لمدير المشروع معالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتصعيد هذه المشكلة إلى مدير الموارد البشرية (HR).",
        "correct": true
      },
      {
        "text": "استبدل عضو الفريق بعضو آخر أكثر اهتماماً بالفريق.",
        "correct": false
      },
      {
        "text": "حدد موعدًا للاجتماع مع عضو الفريق لتحديد السبب.",
        "correct": false
      },
      {
        "text": "زيادة رواتب أعضاء الفريق وفرص المكافآت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مراجعة التقدم المحرز في منتصف عملية التكرار، يشير مسؤول سكروم إلى وجود خطر كبير بسبب تبعية قصة المستخدم.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديث المنتج المتراكم.",
        "correct": true
      },
      {
        "text": "تحديث ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      },
      {
        "text": "تحديث سجل المشكلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في آخر اجتماع مراجعة للسباق السريع، أعلن العميل أنه بحاجة إلى تنفيذ وحدتين من الوحدات الخمس الملتزم بها للمشروع في غضون أسابيع قليلة.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "عقد اجتماع عصف ذهني.",
        "correct": true
      },
      {
        "text": "استخدام أسلوب المجموعة الاسمية.",
        "correct": false
      },
      {
        "text": "إجراء اجتماع خطة إطلاق السراح.",
        "correct": false
      },
      {
        "text": "استخدم النماذج الأولية لتحسين التصميم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nرفض أحد العملاء أحد نواتج المشروع المؤقتة. ماذا ينبغي لمدير المشروع أن يفعل؟",
    "explanation": "",
    "choices": [
      {
        "text": "راجع سبب الرفض، وراجع سبب الرفض، وتحقق من النواتج القابلة للتسليم مقابل معايير القبول.",
        "correct": true
      },
      {
        "text": "تحليل متطلبات العميل، وإعادة صياغة ما تم تسليمه بجودة مقبولة.",
        "correct": false
      },
      {
        "text": "إنشاء خطة تحسين قابلة للتنفيذ، وتنفيذها للفترة المتبقية من المشروع.",
        "correct": false
      },
      {
        "text": "توثيق رفض النواتج في سجل الدروس المستفادة ومراجعتها مع فريق تنفيذ المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم إنتاج معدات المشروع الحرجة من قبل بائع خارجي. وكشف مسح للجودة عن عدم الامتثال لبعض مواصفات المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعيين موظفي المشروع للإشراف على منشأة البائع لضمان الامتثال للمواصفات.",
        "correct": true
      },
      {
        "text": "قم بمراجعة عقد الإنتاج لتحديد ما إذا كانت المواصفات المشار إليها قد تم تضمينها.",
        "correct": false
      },
      {
        "text": "حدد موعداً لعقد ورشة عمل مع ممثلي البائعين لتقديم لمحة عامة عن مواصفات المشروع.",
        "correct": false
      },
      {
        "text": "قم بجدولة اجتماعات منتظمة مع البائع للتحكم في هذا الوضع شخصيًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يمكن أن يحقق المشروع فوائد تسويقية نهائية إذا تم تضمين معدات إضافية في نطاق المشروع. ومع ذلك، لا تزال هذه المعدات في مرحلة التطوير المبكرة ولن تكون جاهزة للوفاء بالجداول الزمنية للمشروع. ويؤيد أحد أعضاء اللجنة التوجيهية للمشروع إدراجها.\nكيف ينبغي لمدير المشروع المضي قدماً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعداد طلب تغيير النطاق لتضمين المعدات الإضافية لأنها مفيدة لفريق التسويق.",
        "correct": true
      },
      {
        "text": "تقديم أساس منطقي واضح لاستبعادها بناءً على حالة العمل وتأثيرها على الجداول الزمنية للمشروع.",
        "correct": false
      },
      {
        "text": "إجراء استبيان بين أعضاء اللجنة التوجيهية لتقييم متطلبات كل مشروع على حدة من أجل اتخاذ قرار بتوافق الآراء.",
        "correct": false
      },
      {
        "text": "مطالبة راعي المشروع بتصعيد المشكلة إلى عضو اللجنة التوجيهية لتجنب تأخير الموافقة على المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف المشروع، يدرك مدير المشروع أن هناك حاجة إلى مجموعة محددة من المهارات لإكمال تطوير المشروع. ولسوء الحظ، لا يمتلك أي من أعضاء الفريق المهارات اللازمة.\nما هي الخطوة الأولى التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة تنظيم فريق المشروع ليشمل الأشخاص الذين يتمتعون بالمعرفة والمهارات اللازمة.",
        "correct": true
      },
      {
        "text": "راجع الجدول الزمني والميزانية للنظر في التدريب أو الاستعانة بمصادر خارجية أو بدائل أخرى.",
        "correct": false
      },
      {
        "text": "تنظيم تدريب مناسب لفريق المشروع لسد الفجوة المعرفية.",
        "correct": false
      },
      {
        "text": "البحث عن طرق بديلة لتحقيق أهداف المشروع بدون المهارات المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يقود مشروع تطوير برمجيات معقد. ولا يستطيع فريق المشروع الاتفاق على العملية التي يجب استخدامها عند حل مشكلة معينة.\nما هو النهج الذي يجب أن يتبعه مدير المشروع للمساعدة في الوصول إلى توافق في الآراء بين أعضاء الفريق؟",
    "explanation": "",
    "choices": [
      {
        "text": "مارس سلطة الخبراء وحدد الطريق إلى الأمام للفريق.",
        "correct": true
      },
      {
        "text": "قم بتحديث مصفوفة المسؤولية والمساءلة والتشاور والإبلاغ (RACI) وإسناد العمل إلى فريق مختلف.",
        "correct": false
      },
      {
        "text": "تعيين قائد فريق جديد لديه خبرة في حل مشاكل تطوير البرمجيات المماثلة.",
        "correct": false
      },
      {
        "text": "تسهيل عقد اجتماع وتشجيع أعضاء الفريق على التوصل إلى حلول محتملة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تعاقد عميل مع شركة لإدارة مشروع كبير في بيئة مرنة مع العديد من المقاولين من الباطن. يقوم العميل بإعطاء أوامر مباشرة للمقاولين من الباطن، بدلاً من مدير مشروع المقاول. وقد أدى ذلك إلى نشوب نزاع داخل الفريق.\nما الذي يجب أن يفعله مدير المشروع لمنع حدوث هذا الموقف مرة أخرى؟",
    "explanation": "",
    "choices": [
      {
        "text": "إبقاء الفريق على اطلاع دائم بتوقعات العميل.",
        "correct": true
      },
      {
        "text": "قم بدعوة العميل إلى اجتماع التخطيط للفريق.",
        "correct": false
      },
      {
        "text": "أخبر الفريق بتجنب النزاعات مع العميل.",
        "correct": false
      },
      {
        "text": "اطلب من العميل عدم إعطاء أوامر مباشرة للمقاولين من الباطن.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع بتسليم مشروع معقد لعميل لديه مدير مشروع خاص به. مدير مشروع العميل هو صانع القرار الوحيد للمشروع ولكنه ليس السلطة المالية المفوضة. بالنسبة لكل قرار مالي، يجب على مدير مشروع العميل أن يسعى للحصول على موافقة سلطة أعلى. وقد تسببت هذه الخطوة الإضافية في تأثيرات كبيرة على إدارة الموارد والتكلفة ووقت تسليم المشروع.\nكيف يمكن لمدير المشروع حل هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإثارة هذه المشكلة في تقرير حالة المشروع ربع السنوي.",
        "correct": true
      },
      {
        "text": "إضافة المشكلة إلى تقرير الدروس المستفادة.",
        "correct": false
      },
      {
        "text": "رفع المشكلة إلى اللجنة التوجيهية للمشروع.",
        "correct": false
      },
      {
        "text": "ناقش المشكلة مع مدير مشروع العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد إرسال تقرير حالة مشروع حديث عبر البريد الإلكتروني، يعلم مدير المشروع أن عدداً من المستلمين لم يعودوا مشاركين في المشروع. يحتاج مدير المشروع إلى التحقق من قائمة التوزيع لتقارير الحالة المستقبلية.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الجدول الزمني وتحديثها.",
        "correct": false
      },
      {
        "text": "مراجعة وتحديث مصفوفة توزيع المسؤوليات.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة الموارد وتحديثها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "كما هو متفق عليه في بداية المشروع التنبؤي، يجب مشاركة جميع المعلومات الصادرة مسبقًا مع مدير المشروع. أثناء المشروع، كان أحد قادة الفريق يتواصل مباشرة مع الراعي متجاوزًا مدير المشروع. ونتيجة لذلك، تم نقل معلومات غير مصفاة إلى الجهة الراعية، ولم تتم مشاركة المعلومات المهمة من الفريق مع مدير المشروع.\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "تذكير قائد الفريق بإبلاغ مدير المشروع دائمًا قبل تقديم المعلومات إلى أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تحدث إلى قائد الفريق لمعرفة ما إذا كان لديه أي مشاكل شخصية مع مدير المشروع.",
        "correct": false
      },
      {
        "text": "قم بتعديل اتفاقيات الفريق للحصول على موافقة مدير المشروع قبل إرسال أي اتصال.",
        "correct": false
      },
      {
        "text": "تحدث إلى الكفيل لمعرفة ما شاركه قائد الفريق مع الكفيل مباشرةً.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه مدير مشروع مشاكل مع المدير الوظيفي لأحد أعضاء فريق المشروع. وقد أعطى المدير الوظيفي لعضو الفريق مهمة أخرى وأخبر عضو الفريق أن المشروع السابق يجب أن يكون له أولوية أقل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "تصعيد المشكلة إلى الإدارة العليا.",
        "correct": true
      },
      {
        "text": "قم بتوصيل أهمية المشروع إلى الفريق.",
        "correct": false
      },
      {
        "text": "قم بإحالة المدير الوظيفي إلى ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "اطلب موارد إضافية لمشروعك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيطلب أحد رعاة المشروع الرئيسيين تقارير مرحلية شهرية ويعين شخصًا للاتصال والتواصل مع مدير المشروع. وبعد فترة وجيزة، يبدأ مسؤول الاتصال بطلب تقارير أسبوعية ويطلب أن تحتوي على تفاصيل إضافية. وعلى الرغم من تقديم هذه التقارير المتكررة والمفصلة للغاية، يكتشف مدير المشروع أن راعي المشروع يشتكي من عدم استلام التقارير المرحلية الشهرية.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتجميع جميع التقارير السابقة وتلخيصها وإرسال الملخص مباشرةً إلى راعي المشروع.",
        "correct": true
      },
      {
        "text": "حدد موعداً لعقد اجتماع مع راعي المشروع والشخص المسؤول عن الاتصال لمعالجة ثغرات التواصل.",
        "correct": false
      },
      {
        "text": "شرح محتوى وتواتر تقديم التقارير المرحلية إلى جهة الاتصال وراعي المشروع.",
        "correct": false
      },
      {
        "text": "تزويد راعي المشروع بإمكانية الوصول الكامل إلى لوحة معلومات إدارة المشروع الخاصة بالشركة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التخطيط لسباق السرعة، حدد فريق رشيق ومالك المنتج أن الفريق يجب أن يكون قادراً على إنهاء خمس قصص للمستخدمين. ومع ذلك، خلال السباق السريع، عمل الفريق على أكثر من خمس قصص لكنه لم يكمل أي قصص على الإطلاق.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "توضيح الأولويات مع الفريق.",
        "correct": true
      },
      {
        "text": "إنشاء قصص أصغر في المستقبل.",
        "correct": false
      },
      {
        "text": "مراجعة تعريف المنجز (DoD).",
        "correct": false
      },
      {
        "text": "تحديث خطة إصدار المنتج.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع في مشروع رشيق أن العديد من أصحاب المصلحة يتخطون اجتماعات تخطيط ومراجعة التكرار. يعترف بعض أصحاب المصلحة بأنهم لا يرون قيمة الاجتماعات ويفضلون عدم المشاركة. يواجه المشروع خطر التأخر عن الجدول الزمني بسبب عدم مشاركة أصحاب المصلحة.\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "مراجعة خطة إدارة الاتصالات وتحديثها.",
        "correct": true
      },
      {
        "text": "تحديد الثغرات وتوجيه أصحاب المصلحة بشأن النهج التكراري.",
        "correct": false
      },
      {
        "text": "سجل مراجعة التكرار وشاركها مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "بناء مصفوفة RACI ووضع خطة تدريب لأصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع بناء طريق سريع مدته خمس سنوات في عامه الثالث من التنفيذ عندما يتلقى مدير المشروع شكوى من مجموعة من المجتمع المحلي. المجموعة مستاءة لأنهم لاحظوا أن مسار الطريق السريع قد تغير وأصبح الآن أقرب إلى منازلهم. أدى هذا النزاع إلى تعطيل البناء وتعريض المشروع للخطر.\nما الذي كان ينبغي على مدير المشروع فعله لتجنب هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وضع خطة طوارئ للتخفيف من تأثير المعارضة المجتمعية.",
        "correct": true
      },
      {
        "text": "إنشاء مجلس مراجعة داخلي لدمج أنشطة ضمان الجودة.",
        "correct": false
      },
      {
        "text": "عقد اجتماعات مجتمعية لإبقاء أصحاب المصلحة على علم بالتقدم المحرز والتغييرات.",
        "correct": false
      },
      {
        "text": "ضمان أن يكون تخطيط المشروع سريًا وموثقًا بشكل جيد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدرك مدير المشروع أن بعض أعضاء الفريق المعينين حديثًا لم يكونوا منتجين كما هو متوقع. المشروع له جدول زمني صارم للغاية، ومشكلة الإنتاجية الأقل من المتوقع تعرض المشروع للخطر.\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "توفير تدريب إضافي لأعضاء الفريق الجدد.",
        "correct": true
      },
      {
        "text": "إجراء تظليل وظيفي ضمن فريق المشروع.",
        "correct": false
      },
      {
        "text": "وضع حوافز إنجاز معالم المشروع.",
        "correct": false
      },
      {
        "text": "إخطار الفريق بضرورة تحسين الإنتاجية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم إحدى الشركات بإنشاء تطبيق جديد لمستخدميها. أكمل الفريق الرشيق مرحلة البدء ويقوم بإجراء عمليات التكرار لاستكمال التخطيط والتنفيذ. ومع ذلك، يريد أحد أصحاب المصلحة تغيير ترتيب المخرجات لإظهار جوانب جديدة من التطبيق لأصحاب المصلحة.\nكيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتضمين أصحاب المصلحة في التخطيط للسباق السريع لضمان تعيين الأولويات الصحيحة.",
        "correct": true
      },
      {
        "text": "استخدم مؤشرات الأداء الرئيسية (KPIs) للتحقق من أن المشروع يسير وفق الجدول الزمني المحدد.",
        "correct": false
      },
      {
        "text": "اطلب من صاحب المصلحة تقديم طلب تغيير وتقديمه إلى مجلس مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "اشرح لصاحب المصلحة أن تعديل الجدول الزمني الآن سيزيد من مخاطر التسليم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تلقى مدير المشروع للتو خبرًا يفيد باعتماد لائحة تنظيمية جديدة ويتوقع أن يتم تسليم المشروع متوافقًا مع هذه اللائحة الجديدة. وقد تم توثيق ذلك في السابق كعنصر مخاطرة ذات احتمال منخفض وأثر متوسط.\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "إعادة النظر في سجل المخاطر وتحديث التصنيف والاستجابة.",
        "correct": true
      },
      {
        "text": "قم بتحديث سجل المشكلات وتطبيق الإجراءات التصحيحية.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة المشروع.",
        "correct": false
      },
      {
        "text": "الشروع في طلب تغيير اللائحة المحدثة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في إطار التحضير لاجتماع مع الرئيس التنفيذي لإحدى المؤسسات، يطلب مدير المشروع من أحد أعضاء الفريق إعداد تقرير شهري للرئيس التنفيذي. قدم الرئيس التنفيذي صيغة محددة لهذه التقارير في بداية المشروع. في اليوم السابق للاجتماع، يقوم مدير المشروع بمراجعة التقرير ويكتشف أنه لم يتم تنسيقه بالشكل الذي حدده الرئيس التنفيذي.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "طلب التقرير من عضو الفريق في وقت سابق للتأكد من أنه بالصيغة المطلوبة.",
        "correct": true
      },
      {
        "text": "طلب من المدير التنفيذي توفير متطلبات تنسيق أكثر تفصيلاً لإنشاء تقارير الحالة الشهرية.",
        "correct": false
      },
      {
        "text": "يستخدم الاتصال التفاعلي لتأكيد إقرار عضو الفريق بالصيغة المحددة.",
        "correct": false
      },
      {
        "text": "تعديل خطة إدارة الاتصالات لتشمل متطلبات تنسيق التقرير الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع متمرس بتوجيه مدير مشروع جديد تم تعيينه لمشروعه الأول. وبينما يستعد مدير المشروع الجديد للمشروع، يشعر مدير المشروع الجديد بالارتباك بسبب عدد أصحاب المصلحة الذين حددهم الفريق.\nما الذي يجب أن يطلبه مدير المشروع المتمرس من مدير المشروع الجديد أن يفعله بعد ذلك؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بإجراء تحليل لأصحاب المصلحة لتحديد الأهمية النسبية.",
        "correct": true
      },
      {
        "text": "تصنيف أصحاب المصلحة الرئيسيين باستخدام سجل المصنفات.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة الاتصالات مع تفضيلات أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديد أولويات أصحاب المصلحة بناءً على سجل أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "استعرض أحد العملاء منتجًا وطلب ميزات إضافية لم تكن موجودة في وثائق المتطلبات. تم بالفعل تحسين حدود العمل الجاري (WIP) للفرق العاملة على مكونات العمل المختلفة.\nكيف يجب أن يبدأ مدير المشروع في حل متطلبات العميل؟",
    "explanation": "",
    "choices": [
      {
        "text": "بناء المنتج وفقًا لمتطلبات العميل المتفق عليها مسبقًا.",
        "correct": true
      },
      {
        "text": "ناقش جدوى الميزات الجديدة وتأثيرها مع مالك المنتج.",
        "correct": false
      },
      {
        "text": "تقسيم العمل على الميزات الإضافية مع فرق المكونات الحالية.",
        "correct": false
      },
      {
        "text": "إصدار زيادات في الميزات الإضافية للتحقق من صحة العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم أحد أعضاء فريق المشروع بإبلاغ مدير المشروع بأن جميع العناصر قد اكتملت وأن الفريق جاهز للانتقال إلى التكرار التالي. يراجع مدير المشروع لوحة التكرار ويلاحظ وجود عناصر غير مكتملة. ينتهي التكرار اليوم، ولن تكتمل العناصر الناقصة في الوقت المحدد.\nما الذي كان ينبغي على مدير المشروع القيام به لضمان اكتمال جميع العناصر المتراكمة في الوقت المحدد؟",
    "explanation": "",
    "choices": [
      {
        "text": "تم التحقق من صحة العناصر المتراكمة المتراكمة التي تم التحقق من صحتها باستخدام تعريف المنجز (DoD).",
        "correct": true
      },
      {
        "text": "جداول زمنية أطول للتسليم المجدولة لدورات تكرار المشروع.",
        "correct": false
      },
      {
        "text": "طلب أن يقوم الفريق بالإبلاغ عن التقدم المحرز خلال عمليات الاستعداد اليومية.",
        "correct": false
      },
      {
        "text": "اطلب من أعضاء الفريق عرض أعمالهم بمجرد أن تصبح جاهزة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع أسبوعي للفريق، قام مدير المشروع بمراجعة التقدم المحرز في المهام، ووجد أن أحد كبار أعضاء الفريق لم يتبع الخطة. فقد أدى المهام حسب تفضيلاته الشخصية، دون التواصل مع مدير المشروع. يعتبر عضو الفريق الأقدم خبيرًا وموردًا مهمًا للمشروع.\nكيف ينبغي لمدير المشروع معالجة هذا الأمر؟",
    "explanation": "",
    "choices": [
      {
        "text": "ناقش ذلك مع المورد شخصياً، ثم قم بتحديث خطة إدارة الموارد إذا لزم الأمر.",
        "correct": true
      },
      {
        "text": "ناقش ذلك مع المدير الوظيفي، ثم قم بتحديث خطة إدارة الموارد إذا لزم الأمر.",
        "correct": false
      },
      {
        "text": "ناقش ذلك مع المدير الوظيفي، ثم قم بتحديث ميثاق الفريق إذا لزم الأمر.",
        "correct": false
      },
      {
        "text": "ناقش ذلك مع المورد شخصياً، ثم قم بتحديث ميثاق الفريق إذا لزم الأمر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nأثناء عرض المنتج، يقترح أحد أصحاب المصلحة أن المنتج لا يلبي التوقعات. ما هي الأداة التي يجب أن يستخدمها مدير المشروع لتقييم اقتراح صاحب المصلحة؟",
    "explanation": "",
    "choices": [
      {
        "text": "وصف الحد الأدنى للمنتج القابل للتطبيق (MVP)",
        "correct": true
      },
      {
        "text": "تعريف تم (DoD)",
        "correct": false
      },
      {
        "text": "تعريف الجاهزية (DoR)",
        "correct": false
      },
      {
        "text": "معايير القبول في قصة المستخدم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء التنفيذ، يقدم العميل طلب تغيير للحفاظ على القيمة التجارية للمشروع، والتي كانت مهددة بسبب تغيير تنظيمي حكومي تم تنفيذه مؤخرًا. يقوم مدير المشروع بتحليل التغيير، الذي سيتطلب إعادة صياغة 50% من نواتج المشروع وسيترتب عليه تكاليف إضافية للعميل.\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتقديم طلب التغيير إلى مجلس مراقبة السلع الاستهلاكية حيث سيكون العميل مرتاحًا لاستيعاب جميع التكاليف الإضافية.",
        "correct": true
      },
      {
        "text": "تقديم طلب التغيير إلى لجنة التغيير، وتقديم المشورة إلى اللجنة للنظر في رفض الطلب بسبب تأثيره.",
        "correct": false
      },
      {
        "text": "قم بتقديم طلب التغيير إلى مجلس مراقبة التغييرات وشرح سبب الطلب، بما في ذلك تحليل تأثير التكلفة.",
        "correct": false
      },
      {
        "text": "تقديم طلب التغيير لإظهار التغيير على أنه ليس له أي تأثير، ثم المضي قدمًا دون إخطار مجلس مراقبة السلع الأساسية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيقوم أحد أعضاء فريق مشروع التطوير بإبلاغ مدير المشروع بأن نظام التشغيل لن يتم تثبيته في الوقت المحدد بسبب تأخر المورد في الترقية. ما الذي ينبغي لمدير المشروع أن يفعله أولاً؟",
    "explanation": "",
    "choices": [
      {
        "text": "تحديد تأثير الموقف.",
        "correct": true
      },
      {
        "text": "قم بتعديل الجدول الزمني ليعكس الوضع.",
        "correct": false
      },
      {
        "text": "إبلاغ أصحاب المصلحة بالمشكلة.",
        "correct": false
      },
      {
        "text": "اطلب من فريق المشروع إجراء عصف ذهني للحل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nصاحب مصلحة خارجي له تأثير كبير على المشروع، حيث إن لديه القدرة على الموافقة على التغييرات في نطاق المشروع والجدول الزمني والميزانية أو رفضها. ما النهج الذي يجب أن يتبعه مدير المشروع مع أصحاب المصلحة هؤلاء؟",
    "explanation": "",
    "choices": [
      {
        "text": "التواصل مع أصحاب المصلحة وفقاً لخطط إدارة مشاركة أصحاب المصلحة والاتصالات.",
        "correct": true
      },
      {
        "text": "اطلب ملاحظات من أصحاب المصلحة بحيث يلبي المشروع توقعات أصحاب المصلحة ويمكن تسليمه كما هو مخطط له.",
        "correct": false
      },
      {
        "text": "أضف صاحب المصلحة إلى سجل المخاطر وحدد مستوى التأثير الذي يمكن أن يحدثه صاحب المصلحة على أهداف المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ أصحاب المصلحة بفوائد المشروع الرئيسية وإطلاعهم على آخر المستجدات بشأن تقدم المشروع والإنجازات البارزة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تواجه إحدى الشركات حاليًا تجاوزًا في التكاليف وتحتاج إلى سيولة للتغلب على الأزمة المالية. هناك مشروع مهم قيد التنفيذ ومن المتوقع أن يحقق عائدًا نقديًا معقولاً للشركة، ومع ذلك، فإن المشروع تجاوز الميزانية. وتحتاج الإدارة العليا إلى تقييم مدى توافق المشروع مع الأهداف التنظيمية وتطلب من مدير المشروع تقديم تقرير حول هذه المسألة.\nما الذي يجب أن يفعله مدير المشروع لإعداد تقرير للإدارة؟",
    "explanation": "",
    "choices": [
      {
        "text": "فحص المستندات وتقييمها لاكتساب رؤى واستخلاص معلومات مفيدة.",
        "correct": true
      },
      {
        "text": "مقارنة النتائج الفعلية بالنتائج المخططة من خلال تحليل الفروق بين الأداء الفعلي والقيم المدرجة في الميزانية.",
        "correct": false
      },
      {
        "text": "تحديد وتحليل الأنماط أو الاتجاهات أو التغيرات في البيانات خلال فترة زمنية محددة.",
        "correct": false
      },
      {
        "text": "تقييم الجدوى الاقتصادية للمشروع، من خلال مقارنة التكاليف بالفوائد التي تتوقعها الإدارة العليا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "سؤال\nيعمل مدير مشروع على تطبيق جديد لإدارة الرعاية الصحية. سيغادر أحد أعضاء الفريق المنظمة وسيتولى عضو جديد في الفريق مهامه. يشعر عضو الفريق الجديد بالقلق من أن عدة أجزاء من التطبيق الجديد لا يمكن اختبارها بعد، على الرغم من توقيع عضو الفريق المنتهية ولايته. كيف ينبغي لمدير المشروع معالجة هذا الوضع؟",
    "explanation": "",
    "choices": [
      {
        "text": "ثق بتوقيع عضو الفريق المنتهية ولايته واستمر في المشروع كما هو مخطط له.",
        "correct": true
      },
      {
        "text": "قم بإجراء مراجعة شاملة للأجزاء غير المختبرة من التطبيق قبل المتابعة.",
        "correct": false
      },
      {
        "text": "أبلغ عضو الفريق الجديد أن الاختبار سيحدث في مرحلة لاحقة من المشروع.",
        "correct": false
      },
      {
        "text": "تأكد من قيام عضو الفريق المنتهية ولايته بإنشاء وثيقة نقل المعرفة لعضو الفريق الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد لمشروع رشيق مستمر. يبدأ المشروع الآن دورة التكرار الثانية التي تستغرق 4 أسابيع. يجد مدير المشروع أن هناك اختلافات كبيرة في الرأي داخل فريق المشروع، مما يؤدي إلى انتكاسات كبيرة للمشروع.\nما الذي يجب على مدير المشروع فعله للمساعدة في التغلب على الخلافات وإعادة المشروع إلى مساره الصحيح؟",
    "explanation": "",
    "choices": [
      {
        "text": "تعزيز الحوار بين أعضاء الفريق في اجتماعات المراجعة القادمة للمساعدة في حل المشكلة.",
        "correct": true
      },
      {
        "text": "حدد موعدًا لنشاط جماعي في الخارج للسماح للأشخاص بالتعرف على بعضهم البعض بشكل أفضل والشعور بالراحة في الحديث.",
        "correct": false
      },
      {
        "text": "اسمح للفريق بالتنظيم الذاتي قبل التكرار التالي لحل المشكلة.",
        "correct": false
      },
      {
        "text": "تواصل مع مديريهم الوظيفيين حتى يتمكنوا من التحدث مع أعضاء الفريق وحل المشكلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه فريق المشروع، الموزع في ثلاثة بلدان مختلفة، صعوبة في ترتيب الاجتماعات. كما أن أعضاء الفريق غير واضحين بشأن متطلبات المشروع ويواجهون صعوبة في الحصول على إجابات لأسئلتهم.\nما الذي يجب القيام به لزيادة نجاح المشروع؟",
    "explanation": "",
    "choices": [
      {
        "text": "العمل بشكل مستقل حتى يصبح من الضروري دمج العمل.",
        "correct": true
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات وزيادة تبادل المعلومات.",
        "correct": false
      },
      {
        "text": "زيادة وتيرة اجتماعات الفريق لمناقشة أي أسئلة.",
        "correct": false
      },
      {
        "text": "طرح الأسئلة على المدراء الوظيفيين لحل المشكلات في الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تتبنى إحدى المؤسسات نهجًا رشيقًا لتلبية متطلبات عملائها. وقبل ذلك، كانت المنظمة تعمل قبل ذلك مع موارد متخصصة ومديري مشاريع متخصصين تم تعيينهم للمشروع لفترة زمنية محددة.\nما الذي يجب على المنظمة تغييره لتبني النهج الرشيق لتخطيط الموارد بشكل أفضل؟",
    "explanation": "",
    "choices": [
      {
        "text": "يجب أن يطلب مالك المنتج تعيين متخصصين في الفريق فقط عند الحاجة إليهم.",
        "correct": true
      },
      {
        "text": "يجب أن يتكون الفريق من اختصاصيين ومتخصصين قادرين على التكيف مع المتطلبات المتغيرة.",
        "correct": false
      },
      {
        "text": "يجب أن يقرر الفريق الرشيق متطلبات العميل التي سيتم تطويرها وتسليمها.",
        "correct": false
      },
      {
        "text": "يجب تقليل مشاركة العملاء من أجل تجنب الاضطرابات والارتباك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بالإشراف على مشروع مشتريات لشركة لديها فريق مخصص لإدارة المشتريات يتولى جميع العقود. ويحدد التقرير الفصلي ستة عقود لا تتماشى مع أهداف الشركة.\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
    "explanation": "",
    "choices": [
      {
        "text": "احتفظ بالعقود الستة على الرغم من عدم توافقها.",
        "correct": true
      },
      {
        "text": "اقتراح إنهاء جميع العقود غير المتوائمة.",
        "correct": false
      },
      {
        "text": "اطلب من راعي المشروع مراجعة العقود.",
        "correct": false
      },
      {
        "text": "مطالبة العميل بمراجعة العقود.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "واجه مشروع تطوير منتج مشاكل في التصميم. ونتيجة لذلك، قرر الفريق تغيير نهج مرحلة تصميم المنتج من نهج تنبؤي إلى نهج تكراري.\nما الذي يجب أن يفعله مدير المشروع لضمان الانتقال السلس بين المناهج؟",
    "explanation": "",
    "choices": [
      {
        "text": "حدد موعدًا لورشة عمل مع الفريق للتخطيط للتكرارات القادمة.",
        "correct": true
      },
      {
        "text": "العمل مع الفريق لإنشاء موقع الفريق ومقتنيات المنتج.",
        "correct": false
      },
      {
        "text": "اجتمع مع مدير المنتج لتحليل قصص المستخدمين القادمة.",
        "correct": false
      },
      {
        "text": "اعمل مع مدير المنتج لتحديد عدد التكرارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع لمراجعة المشروع، أبلغ أحد المستخدمين النهائيين أن أجهزة الكمبيوتر الشخصية التي تم توفيرها للاختبار تعاني من تدهور في الأداء.\nما هي الإجراءات الثلاثة الفورية التي يجب على مدير المشروع اتخاذها لمعالجة هذه المشكلة؟",
    "explanation": "",
    "choices": [
      {
        "text": "قم بتسجيل المشكلة في سجل المشكلات.",
        "correct": true
      },
      {
        "text": "تغيير نطاق المشروع.",
        "correct": false
      },
      {
        "text": "تعيين ملكية المشكلة.",
        "correct": false
      },
      {
        "text": "شراء أجهزة كمبيوتر شخصية جديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "على الرغم من أن المشروع يعمل ضمن حدوده الزمنية ونطاقه وميزانيته، إلا أن مدير المشروع يعلم أن راعي المشروع غير راضٍ عن التقدم المحرز فيه.\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
    "explanation": "",
    "choices": [
      {
        "text": "إجراء مراجعات وتقييمات متكررة لتحديد أي مخاطر محتملة ومعالجتها.",
        "correct": true
      },
      {
        "text": "مواءمة أهداف المشروع مع توقعات ومتطلبات الجهة الراعية للمشروع.",
        "correct": false
      },
      {
        "text": "التواصل بانتظام مع راعي المشروع لتقديم التحديثات ومعالجة أي مخاوف.",
        "correct": false
      },
      {
        "text": "تنفيذ تدابير رقابية صارمة لضمان الوفاء بمراحل المشروع الرئيسية ونواتجه.",
        "correct": false
        }
      ]
    }
  ]
}
