{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "A project team received training on the technology involved with a project deliverable. In nine months of working on the project, several team members have been replaced. Productivity has slowed because new team members are not familiar with the technology and the project schedule is at risk of delay. What should the project manager do?",
      "explanation": "The correct solution is to meet with the whole team and ask the existing members to train the new members because this option is the fastest and most efficient to get through the problem without delays or increased costs. Utilizing the expertise of existing members to enhance cohesion within the team and save time and resources is better than starting a long formal training or bringing in new members.\n\nOther options are ineffective as a first step: Negotiating with the project sponsor to increase the budget is a late and costly option. Issuing a change request to recruit new members is impractical because it causes additional delays and affects team cohesion. Facilitating a workshop with a subject matter expert is a good idea but it's expensive and time-consuming, so it's not the best option at first.",
      "choices": [
        {
          "text": "Meet with the entire team and ask existing members to train the new team members.",
          "correct": true
        },
        {
          "text": "Negotiate an increase in budget with the project sponsor for additional training for the new team members.",
          "correct": false
        },
        {
          "text": "Issue a change request for new team members already trained in the relevant technology.",
          "correct": false
        },
        {
          "text": "Facilitate a workshop with a subject matter expert to familiarize team members with the technology.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The day before construction is scheduled to begin, the project manager learns that the structure blueprint was not accepted by the customer. What should the project manager do first to ensure that the project timeline is met?",
      "explanation": "The correct solution is to meet with the client as soon as possible to discuss modifications to the scheme. This step directly addresses the problem and helps to reach an agreement or urgent correction before it affects the start of construction work. Since the schedule is threatened, the immediate solution is to communicate directly with the customer to determine exactly what is required and avoid delays.\n\nWrong options explained:\n- Start building by appointment while reviewing the plan with the customer at the same time: This is an irresponsible and dangerous option because starting work without formal approval may result in rework and additional costs.\n- Discuss the process of accepting output components with the customer:  This is a very general option and does not address the current immediate problem.\n- Review the stakeholder engagement plan and expectations: While important in the long run, it is not the appropriate action as a first step in a crisis situation that requires immediate intervention with the customer.",
      "choices": [
        {
          "text": "Meet with the customer as soon as possible to discuss changes to the blueprint.",
          "correct": true
        },
        {
          "text": "Begin construction as scheduled while simultaneously reviewing the blueprint with the customer.",
          "correct": false
        },
        {
          "text": "Discuss the process of deliverable component acceptance with the customer.",
          "correct": false
        },
        {
          "text": "Review the stakeholder engagement plan and stakeholder expectations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that the project team will miss a milestone because team member A has not completed the task requirements needed by team member B. When meeting with team member A, what should the project manager do?",
      "explanation": "The correct solution is to identify any obstacles that hinder the completion of tasks and see if member A needs help. This step represents a supportive and analytical leadership style, where the project manager investigates the root causes of non-achievement and provides the necessary support, whether it is training or removing obstacles.\n\nWrong choices explained:\n- A: Not responsible, transferring responsibility without addressing the cause is not an effective solution.\n- C: A quick but superficial solution, which does not address the problem at its root.\n- D: To avoid the problem, the member must be helped, not eliminated or replaced.",
      "choices": [
        {
          "text": "Direct team member A to turn over the responsibilities for completing the task requirements to team member B.",
          "correct": false
        },
        {
          "text": "Identify any obstacles to meeting the task requirements and determine if team member A needs help completing them.",
          "correct": true
        },
        {
          "text": "Ask team member A to work directly with team member B to complete the requirements in order to meet the milestone.",
          "correct": false
        },
        {
          "text": "Ask team member A to recommend a replacement who can complete the task requirements.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A technology project has members of a project team from multiple countries. The stakeholders have stated that this arrangement will keep the project within budget. However, the project manager believes that the stakeholders have not accounted for issues that might arise that could affect the success of the project.nnWhat should the project manager do to record this concern?",
      "explanation": "The correct solution is to document the risks in the risk log. What the project manager mentioned is the possibility of a future problem such as timing or communication issues, and these fall under risk management because they have not yet occurred.\n\nWrong choices explained:\n- B: Modifying the stakeholder interaction plan is not appropriate because the concern here is about potential risks and not about stakeholder interaction.\n- A: Recording the information in the issue log is not appropriate because the problem has not yet occurred, it is only a possibility.\n- D: Updating the resource management plan does not address the concern about potential risks indicated by the project manager.",
      "choices": [
        {
          "text": "Document the risks in the risk register.",
          "correct": true
        },
        {
          "text": "Revise the stakeholder engagement plan.",
          "correct": false
        },
        {
          "text": "Capture the information in the issues log.",
          "correct": false
        },
        {
          "text": "Update the resource management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two stakeholders inform the project manager that the status of a critical project phase was not communicated to them. Although the project phase is in these stakeholders' area of interest, the stakeholders have only recently been identified. What should the project manager do first?",
      "explanation": "The correct solution is to conduct a stakeholder analysis and update the stakeholder registry. The reason is that new stakeholders have recently been identified, and it is important to identify their interests and level of influence and ensure that they are formally included in the communication plan. Updating the stakeholder register allows their expectations to be managed and ensures their inclusion in upcoming communications.\n\nExplanation  of the wrong choices:\n- Review the communication management plan: An important step but it comes after knowing who the new stakeholders are and updating the record.\n- Identify new ways to send project status reports: A subsequent action after updating the stakeholder record.\n- Schedule a project status meeting and invite new stakeholders:  useful but not the first step before updating and evaluating stakeholders' roster.",
      "choices": [
        {
          "text": "Review the communications management plan.",
          "correct": false
        },
        {
          "text": "Perform a stakeholder analysis and update the stakeholder register.",
          "correct": true
        },
        {
          "text": "Identify new ways to send project status reports to all stakeholders.",
          "correct": false
        },
        {
          "text": "Schedule a status meeting and invite the two new stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project in the execution phase is on track and within budget. A key stakeholder requests a change in communication frequency. They want to discontinue receiving weekly status reports and instead be notified only if an issue arises that requires their attention.nnWhat should the project manager do?",
      "explanation": "The correct solution is to modify the communication management plan to reflect the stakeholder's request. The communications management plan defines how to communicate with stakeholders, frequency of reports, type of information, and how it is communicated. When there is a formal request from a key stakeholder to change the frequency of communication, this plan should be updated to ensure that their expectations are met and communication is effective.\n\nWrong choices:\n- Review the stakeholder engagement plan to determine the extent of that party's involvement: An important step but not the first action after the change request, because the stakeholder engagement plan focuses on the level of stakeholder participation and not the specific method of communication.\n- Ask other stakeholders if they also want to reduce the number of notifications: It can lead to delays and confusion, as each stakeholder has their own preferences and must be respected individually.\n- Meeting with the stakeholder to discuss the amount and type of information to communicate: While the discussion is useful, the first practical step is to formally modify the communications plan as requested.\n\nModifying the communication plan ensures that the change is documented, which facilitates follow-up and reduces confusion. The change must be implemented quickly to avoid sending non-information Desirable affect stakeholder satisfaction. Effective communication with stakeholders contributes to the success and satisfaction of the project.",
      "choices": [
        {
          "text": "Review the stakeholder engagement plan to ascertain the stakeholder's involvement.",
          "correct": false
        },
        {
          "text": "Ask the other stakeholders if they would also like less frequent notifications.",
          "correct": false
        },
        {
          "text": "Revise the communications management plan to reflect the stakeholder's request.",
          "correct": true
        },
        {
          "text": "Meet with the stakeholder to discuss the amount and type of information that should be communicated.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project with an aggressive timeline that requires fast time to market because a competitor is working on a similar product. The project team cannot meet the go live date, and there are no other internal resources that can assist with the project.nnHow should the project manager mitigate this risk?",
      "explanation": "The correct solution is to look for external resources that can help achieve the desired run date. When internal resources are insufficient or unavailable, outsourcing is an effective strategy to reduce the risk of delays and ensure deadlines are met. This allows additional expertise to be provided or increased production capacity without the need for permanent hiring or team restructuring.\n\nErrors in other options:\n- Require the team to remove obstacles that prevent them from meeting the operational date:  While removing obstacles is important, the problem here is a lack of resources, and this option does not address the root cause.\n- Ask the project sponsor to set a new run date based on available resources: Changing the date should be a last option after trying to mitigate the risk, not the first step.\n- Ask the team to focus only on the basic features and stick to the run date:  Reducing the scope of work (minimization) may be a valid strategy but it is not mentioned here as an option, and without additional resources, it may not be enough to meet the appointment.\n\nIn short, outsourcing is the most appropriate solution to mitigate the risk of delays in this context.",
      "choices": [
        {
          "text": "Look for external resources who can assist in meeting the required go live date.",
          "correct": true
        },
        {
          "text": "Ask the team to remove the obstacles preventing them from meeting the go live date.",
          "correct": false
        },
        {
          "text": "Ask the project sponsor to set a new go live date based on available resources.",
          "correct": false
        },
        {
          "text": "Ask the team to focus only on the critical features and meet the go live date.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is formally closing a project that has been completed. Why should the project manager document final project activities?",
      "explanation": "The primary reason for documenting the final activities of the project is to collect and document lessons learned and archive historical information. This helps organizations improve future operations by leveraging the experience gained, and is an important part of knowledge management. In addition, this ensures that important documents that may be used in future projects or performance review are preserved.\n\nWrong choices:\n- Recording client case studies and references: This is not the primary function of documenting final activities.\n- Recording final project performance indicators and quality analysis: While this information is important, it is part of the technical reports and not the primary reason for documenting the final activities.\n- Allow the customer to submit invoices and receive the final payment receipt: these are financial procedures and are not part of documenting the final activities of the project.",
      "choices": [
        {
          "text": "To record case studies and customer references",
          "correct": false
        },
        {
          "text": "To log final project performance metrics and quality analysis",
          "correct": false
        },
        {
          "text": "To provide lessons learned and archive historical information",
          "correct": true
        },
        {
          "text": "To allow the customer to submit invoices and get a receipt of final payment",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Two key stakeholders, who are also members of the change control board (CCB), complain they were not aware of an extension to the project schedule. The project manager knows that the extension was necessary to add value to the project.nnWhat should the project manager have done to avoid this issue?",
      "explanation": "In managing change within projects, especially when it comes to changes that affect the schedule, communication with key stakeholders is absolutely essential. These stakeholders are also members of the Change Control Board (CCB), which means they should be aware of all the steps that affect the project.\n\nThe main error in the case is not consulting them before submitting a formal change request. This may cause frustration for them and lead to problems with communication and trust.\n\n- Why is consultation important?\nConsultationensures that stakeholders understand and agree to the reasons for the change before completing the process. This enhances transparency and helps reduce future objections or issues.\n\n- Why are other options wrong?\n- Submitting a change request without consultation: leads to a lack of transparency and angers stakeholders.\n- Conducting a what-if analysis: This is a good technical step but not the right start in communicating with stakeholders.\n- Asking the project sponsor about a time margin: It is not directly related to informing stakeholders.",
      "choices": [
        {
          "text": "Submitted a change request to the entire CCB without discussing it first with the stakeholders.",
          "correct": false
        },
        {
          "text": "Run a what-if analysis to determine the impact of the change.",
          "correct": false
        },
        {
          "text": "Asked the project sponsor if there was any float in the project schedule.",
          "correct": false
        },
        {
          "text": "Consulted the stakeholders before following the established change process.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an iteration review, the definition of done (DoD) was not met.nnWhat is an appropriate way for the project manager to proceed?",
      "explanation": "When  the definition of Done (DoD) is not met, it means that the output or features did not meet the specific requirements that make the work complete. The correct course of action is to identify the root cause of this problem with the team during the Retrospective meeting, and then propose a plan to address the deficiencies to ensure continuous improvement.\n\n- Why the right choice?\nThis approach is analytical and collaborative, encouraging the team to identify problems and work to improve performance and quality.\n\n- Why are other options wrong?\n- Request for Charter Update and Reappointment of Authorities: A formal and heavy procedure that does not address the immediate issue.\n- Request to develop new features: May result in adding unwanted work without understanding the underlying cause.\n- Submit a change request with additional budget: Financial changes should not be requested without radically identifying and resolving the problem first.",
      "choices": [
        {
          "text": "Ask the project sponsor to update the project charter and reassign the authorities and responsibilities.",
          "correct": false
        },
        {
          "text": "Request that the project team develop new features to replace the features that were rejected.",
          "correct": false
        },
        {
          "text": "Determine the root cause with the team in the retrospective meeting and suggest plan to address the deficiencies.",
          "correct": true
        },
        {
          "text": "Send a new change request to the change control board (CCB) for approval, adding budget to the baseline.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A sponsor proposes a project scope change that is popular with the project team and key stakeholders. What should the project manager do?",
      "explanation": "The project manager must follow the formal change management process to ensure that the amendment is properly documented, reviewed, and approved before it is implemented.\n\n- Why the right choice?\nThe change management process maintains control over the scope of the project and prevents random changes that may affect the schedule or budget.\n\n- Why are other options wrong?\n- Inform stakeholders: Just reporting is insufficient without following the formal process.\n- Project requirements update: occurs only after formal approval.\n- Modification of the structure of the workload: After approval and formal updating of the scope.",
      "choices": [
        {
          "text": "Follow the change management process.",
          "correct": true
        },
        {
          "text": "Notify stakeholders of the change.",
          "correct": false
        },
        {
          "text": "Update the project requirements.",
          "correct": false
        },
        {
          "text": "Modify the work breakdown structure (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An external provider is late with the delivery of a finished item. As a measure of goodwill, and to maintain the project's schedule, the provider offers to bear the cost of renting a temporary system.nnSince no schedule slippage will occur, what should the project manager do next?",
      "explanation": "Although the proposed solution does not affect the schedule, it represents a change in costs, resources or procedures, so an integrated change control process must be applied.\n\n- Why the right choice?\nAny change (even if it seems to have no impact on the output) must go through this process to ensure that it is documented, reviewed, and the necessary approvals obtained.\n\n- Why are the other options wrong?\n- Resource insertion in WBS:  Inserted only after the change is approved.\n- No action: Conflicts with systematic change policies.\n- Project documents updated: only after formal approval of the change.",
      "choices": [
        {
          "text": "Account for this additional resource in the work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Take no further actions because there is no schedule slippage.",
          "correct": false
        },
        {
          "text": "Conduct the Perform Integrated Change Control process.",
          "correct": true
        },
        {
          "text": "Update the project documents.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager resumes a project in its execution phase. During a project status meeting, a team member reports an issue shared by a stakeholder.nnWhat should the new project manager do first?",
      "explanation": "When a new project manager takes over and a reported issue arises, the first systematic step is to refer to the Issue Log  to confirm whether the issue is already documented, understand its context and act on the information provided.\n\n- Why the right choice?\nReturning to the problem log provides the basis for making decisions based on accurate and historical data.\n\n- Why are other options wrong?\n- Address the issue immediately: It may lead to ill-considered decisions without sufficient understanding.\n- Stakeholder Plan Review: Not directly related to the current issue.\n- Update the risk plan: The current problem is not a potential risk but an existing event.",
      "choices": [
        {
          "text": "Review the issue log.",
          "correct": true
        },
        {
          "text": "Immediately address the issue.",
          "correct": false
        },
        {
          "text": "Review the stakeholder engagement plan.",
          "correct": false
        },
        {
          "text": "Update the risk management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A vendor submits a high-level project schedule for a three-year project, including a detailed design-phase schedule. What does this describe?",
      "explanation": "This example reflects rolling wave planning, a gradual technique in which nearby activities are planned in great detail, while distant activities are generally planned. Details are gradually updated as the project progresses.\n\n- Why is this the right choice?\nBecause the vendor provided a detailed schedule for an existing stage (design) only, while keeping the rest of the project high-level, this is the essence of progressive planning.\n\n- Why are other options wrong?\nDecomposition  : Refers to the division of the scope of work and not to staged scheduling.\nExpert  judgment:  A technique used to make decisions based on experience, not a time-planning method.\n  Templates: Tools that help in documentation or planning, but are not a method of dividing the schedule.",
      "choices": [
        {
          "text": "Rolling wave planning",
          "correct": true
        },
        {
          "text": "Decomposition",
          "correct": false
        },
        {
          "text": "Expert judgment",
          "correct": false
        },
        {
          "text": "Templates",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "To handle a change in requirements, a project team needs to be motivated and flexible to reprioritize tasks. What leadership style would help the team to perform well in changing and uncertain conditions?",
      "explanation": "Collaborative Leadership is best suited in changing and uncertain environments. It focuses on empowering the team, encouraging innovation, and facilitating interaction among members to achieve common goals.\n\n- Why the right choice?\nBecause a collaborative approach fosters motivation and continuous learning, and gives the team space to reprioritize and adapt to changes.\n\n- Why are other options wrong?\n• The directive approach focuses on controlling and commanding, and is less effective in environments that need flexibility.\n• Documentation does not directly address the change in requirements.\n• Adapting the vision is strategic, but agile leadership is more effective in managing the team during day-to-day changes.",
      "choices": [
        {
          "text": "A collaborative approach will boost motivation, learning, growth, and innovation around a project vision.",
          "correct": true
        },
        {
          "text": "A directive approach will boost team confidence by ensuring that team members only work on the tasks suited to their qualifications.",
          "correct": false
        },
        {
          "text": "A collaborative approach will ensure that project procedures are well-documented and complete enough to cover all situations.",
          "correct": false
        },
        {
          "text": "A directive approach will prepare the team for frequent changes by adapting the project vision to new directions.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After success in a particulary challenging project phase, a project manager reassigned a high-performing team member to a more strategic task.  This is an example of what?",
      "explanation": "This example shows the use of  the recognition method, which is an important element in team management and performance motivation. When a project manager notices outstanding performance, rewarding this effort by assigning the person to more important tasks is a form of appreciation and motivation.\n\n- Why is this the right choice?\nBecause reassigning a team member to a more strategic task is a kind of moral reward that recognizes their effort and superiority.\n\n- Why are other options wrong?\n• Risk acceptance: unrelated to assignment or performance.\n• Mentorship: involves providing guidance and advice, not a new assignment.\n• Change in scope: related to the scope of work in the project, not to human resources.",
      "choices": [
        {
          "text": "Recognition",
          "correct": true
        },
        {
          "text": "Risk acceptance",
          "correct": false
        },
        {
          "text": "Mentorship",
          "correct": false
        },
        {
          "text": "Scope change",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project where requirements are fixed and the workflow is planned for the full development lifecycle. Additionally, the customer involvement is at specific milestones and testing happens post-build.nnWhich methodology should a project manager use for this project?",
      "explanation": "Predictive methodology is used when the requirements are clear and fixed from the beginning, and the project is implemented in a linear sequence (e.g., planning, designing, building, and testing). This model is often known as 'Waterfall'.\n\n- Why is this the right choice? Because the project is based on fixed requirements, customer interaction is limited, and tests are carried out after the construction phase, all of this reflects the characteristics of the predictive methodology.\n\n- Why are other options wrong?\n•  Agile: Requires constant interaction with the customer, successive iterations, and adaptation to change.\n•  Hybrid methodology: Combines agile and predictive, but the question clearly indicates the application of a linear sequence without elements of agile method.\n•  Continuous Improvement: It is a concept of continuous process improvement, not a project management methodology.",
      "choices": [
        {
          "text": "Agile",
          "correct": false
        },
        {
          "text": "Hybrid",
          "correct": false
        },
        {
          "text": "Predictive",
          "correct": true
        },
        {
          "text": "Continuous Improvement",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager has identified all internal and external stakeholders in a project. The project manager now has to determine the best stakeholder engagement approach.nnWhat should the project manager do first?",
      "explanation": "The right choice is to conduct a stakeholder analysis. Stakeholder analysis is the essential step to understanding who the stakeholders are, what their interests are, and their level of impact on the project. This analysis helps identify appropriate strategies to interact with them effectively to ensure their support for the project.\n\nThe Create SWOT analysis option is not directly related to stakeholder management, but is used to analyze the strengths, weaknesses, opportunities, and threats of the project.\n\nOption Develop a multi-criteria decision-making analysis that is used to make complex decisions rather than to determine how to interact with stakeholders.\n\nThe Fishbone Diagram design option is used to analyze the causes of problems and not to identify stakeholder strategies.",
      "choices": [
        {
          "text": "Conduct a stakeholder analysis.",
          "correct": true
        },
        {
          "text": "Create a SWOT analysis.",
          "correct": false
        },
        {
          "text": "Develop a multicriteria decision analysis.",
          "correct": false
        },
        {
          "text": "Design a fishbone diagram.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recently joined an organization that is implementing a portfolio of strategic initiatives aimed at enhancing profitability. The project manager reviews a past project's business case with the project sponsor to ensure that the project was aligned with the organization's goals and to learn from its successes and failures.nnWhich of the following project outcomes would be considered most successful in the context of this organization's strategic initiatives?",
      "explanation": "The right choice is to execute the project on time, within budget, and achieve a 5% increase in expected sales of the product. This option reflects the achievement of the three main objectives: time, cost, and value added (increased sales), which indicates real strategic success.\n\nThe project was executed on a 25% lower budget, but took 20% longer shows a delay in time despite cost savings, which can negatively affect profitability.\n\nThe project was implemented within budget, and approved for closure by the PMO does not show a clear added value for the organization.\n\nOption The project was delivered early, entered the market ahead of competitors, and exceeding the budget by 10% indicates cost overrun, which can affect profitability.",
      "choices": [
        {
          "text": "The project was delivered under budget by 25%, and the overall duration was 20% longer than initially scheduled.",
          "correct": false
        },
        {
          "text": "The project was delivered on budget, and the project management office (PMO) approved the project closure.",
          "correct": false
        },
        {
          "text": "The project was delivered early, entered the market before the competition, and exceeded the budget by 10%.",
          "correct": false
        },
        {
          "text": "The project was delivered on schedule, within budget, and yielded a 5% increase in projected product sales.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, the project manager realizes that a team member is not completing tasks in accordance with the project management plan. What is the first action the project manager should take?",
      "explanation": "The right option is to talk with a team member to find out the reasons for poor performance. This procedure helps the project manager understand the obstacles or problems that the member faces, whether personal, technical, or environmental, enabling him to provide appropriate support to solve the problem and improve performance.\n\nWrong choices:\n- Building a matrix team to review relationships in all project teams: An indirect procedure that does not address the current issue.\n- Ask all team members to focus more on the project:  A generic, unspecified request that does not address the true cause of poor performance.\n- Reassigning uncompleted tasks to another team member: May exacerbate the problem without understanding the root cause of poor performance.",
      "choices": [
        {
          "text": "Build a matrix team to review the relationships on all project teams.",
          "correct": false
        },
        {
          "text": "Ask all the team members to focus more on the project.",
          "correct": false
        },
        {
          "text": "Reassign the uncompleted tasks to another team member.",
          "correct": false
        },
        {
          "text": "Engage the team member to determine the reasons for poor performance.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier of a critical component for a construction project notifies the project manager that the component will be significantly late. Because this risk had been identified during project planning, the cost baseline contains an adequate contingency reserve.nnWhat should the project manager do next?",
      "explanation": "The correct option is to select a resource that can provide the component within the reserve value.\n\nDetailed explanation:\n- This delay was previously identified as a risk during the planning phase, and the contingency reserve is dedicated to addressing these risks to avoid budget overruns.\n- Using the alternative resource within the reserve value allows the delay to be addressed without the need to request a formal change or cost increase.\n- This procedure helps maintain the project schedule and minimize the negative impact.\n\nErrors in other options:\n- A component request from another vendor with a change request to the Change Control Board (CCB) is currently unnecessary because the reserve is in place to address this.\n- The review of the risk response plan, the statement of work, and the penalty clause is important but must be done after practical action has been taken.\n- Updating the schedule and repository of lessons learned is a next step and is not a priority at this moment.",
      "choices": [
        {
          "text": "Identify a supplier that can provide the component within the amount of the reserve.",
          "correct": true
        },
        {
          "text": "Order the component from another supplier and submit a change request to the change control board (CCB).",
          "correct": false
        },
        {
          "text": "Review the risk response plan and the statement of work for the next steps and a penalty clause for late delivery.",
          "correct": false
        },
        {
          "text": "Update the project schedule and the lessons learned repository.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the execution phase, and product testing is almost complete. A team member proposes that the testing can be fast-tracked by removing some of the tests. The team member believes this will help to finish the job earlier and give the project more float.nnWhat should the project manager do?",
      "explanation": "The correct option is to reject the team member's proposal.\n\nDetailed explanation:\n- Removing some tests can lead to quality risks, and the release of an incomplete or defective product, which may cost the project more time and resources in the long run.\n- The extra time (float) in the table does not necessarily mean that the quality of the work must be sacrificed.\n-  The project manager is responsible for ensuring product quality and adhering to the specified test standards.\n- The proposal can be discussed or a study requested from the Quality Manager, but the initial rejection is the correct measure to maintain the quality of the project.\n\nOther options:\n- Requesting more information or discussing the proposal may be useful, but the first step should protect the quality of the project.\n- Asking the quality manager to study the proposal can be later if there are compelling reasons, but it is not the first step.",
      "choices": [
        {
          "text": "Request more information from the team member.",
          "correct": false
        },
        {
          "text": "Reject the team member's proposal.",
          "correct": true
        },
        {
          "text": "Discuss this proposal with the project team.",
          "correct": false
        },
        {
          "text": "Ask the quality manager to consider the proposal.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following represents levels of risk attitude?",
      "explanation": "The right choice is risk-averse, risk-neutral, risk-tolerant, risk-seeking.\n\nDetailed explanation:\n- Risk tolerance expresses how individuals or organizations deal with potential risks.\n- Risk avoidance means refusal to take risks and unwillingness to take risks.\n- Risk neutral means no inclination either to accept or avoid risk.\n- Risk tolerant means accepting risks while minimizing them to an acceptable extent.\n- Risk-seeking means seeking risk for greater gains or opportunities.\n\nErrors in other options:\n- Conservative, moderate, liberal are levels of general attitudes in other areas but are not common descriptions of risk situations.\n- Reduce risk, avoid, transfer, and accept risk are risk management strategies, not psychological attitudes or risk attitudes.\n- High, medium, low Describe risk risk levels rather than attitudes toward risk.\n- Positive, negative, indifferent describe general trends but are not accurate classifications of risk situations.",
      "choices": [
        {
          "text": "Conservative, moderate, and liberal",
          "correct": false
        },
        {
          "text": "Risk-averse, risk-neutral, risk-tolerant, risk-seeking",
          "correct": true
        },
        {
          "text": "Risk-mitigating, risk-avoiding, risk-transferring, risk-accepting",
          "correct": false
        },
        {
          "text": "High, medium, and low",
          "correct": false
        },
        {
          "text": "Positive, negative, and indifferent",
          "correct": false
        }
      ]
    },
   {
  "type": "multiple-choice",
  "text": "A project manager completed plans for a project and submitted all documents for approval but did not allocate time for delays in obtaining approvals. In addition to selecting a risk owner to address this potential risk, what should the project manager have done?",
  "explanation": "The correct answer is: Developed specific actions to implement the agreed-upon risk response strategy, including primary and backup strategies.\n\nExplanation:\n- Allocating time for potential approval delays is part of robust risk management.\n- Appointing a risk owner is a step forward, but it must be complemented by detailed plans to act on the risk if it occurs.\n- Having a primary (Plan A) and contingency (Plan B) ensures continuity if the risk materializes.\n\nWhy the other options are incorrect:\n- Escalation without a defined response plan may not be timely or effective.\n- Reducing work estimates without adjusting scope, resources, or timeline is unrealistic and could cause project failure.\n- Real options analysis is a useful tool, but it must follow the establishment of concrete mitigation strategies.",
  "choices": [
    {
      "text": "Asked the risk owner to escalate with approvers so that approvals are obtained as soon as possible.",
      "correct": false
    },
    {
      "text": "Adjusted the project plans by lowering work completion estimates so that the work can be completed on time despite the delay.",
      "correct": false
    },
    {
      "text": "Developed specific actions to implement the agreed-upon risk response strategy, including primary and backup strategies.",
      "correct": true
    },
    {
      "text": "Used a real options analysis to perform an economic analysis of alternative risk response strategies.",
      "correct": false
    }
  ]
},
    {
      "type": "multiple-choice",
      "text": "A project manager is conducting risk identification based on high-level scope and expert judgement.nnWhat information in the project charter could support risk identification?",
      "explanation": "The right choice is stakeholder interest.\n\nDetailed explanation:\n- The project charter contains basic information that helps identify potential risks.\n- Stakeholder interest helps the project manager understand who may be affected by or affected by the project, highlighting risks related to the expectations and impacts of these parties.\n-  A summary of project roles and responsibilities provides information on the management structure but does not directly explain the risks.\n- Detailed requirements and scope are usually in other documents and not in the project charter, and are important for project planning but less useful for identifying risks at the start-up stage.\nCommunication matrices manage communication channels but are not a direct source of risk identification.\n\nErrors in other options:\n- Every other option focuses on an important part of project management, but does not provide specific information to identify risks in the first phase.",
      "choices": [
        {
          "text": "Summary of project roles and responsibilities",
          "correct": false
        },
        {
          "text": "Detailed requirements and scope",
          "correct": false
        },
        {
          "text": "Project communication matrices",
          "correct": false
        },
        {
          "text": "Stakeholder interest",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learned that the project deliverables will not meet the quality requirements unless a change is made to a component. After issuing a formal change request, the project manager emailed details of the change to all stakeholders. Most stakeholders received the information promptly and are fully aware of the change. However, the project manager finds out that some stakeholders did not receive the email or did not read it.nnWhat could the project manager have done to prevent this?",
      "explanation": "The correct option is to review the communication management plan.\n\nDetailed explanation:\n-  The communication management plan specifies how, when, and by whom it receives information related to the project.\n- Relying solely on e-mail may not be sufficient to ensure that the information is accessible to or aware of all stakeholders.\n- Reviewing the plan allows the identification of alternative or additional communication channels to ensure that information is received effectively.\n- Other options do not address the problem of communication directly or comprehensively.\n\nExplain other options:\n- Prepare a detailed report on work performance: useful but does not solve the problem of communication with stakeholders.\n- Meeting with the project sponsor: may help, but not the first solution to ensure correct communication.\n- Asking stakeholders about their knowledge of technology: Not related to the problem of communication about change.",
      "choices": [
        {
          "text": "Reviewed the communications management plan.",
          "correct": true
        },
        {
          "text": "Developed a detailed work performance report.",
          "correct": false
        },
        {
          "text": "Met with the project sponsor to discuss communication.",
          "correct": false
        },
        {
          "text": "Questioned the stakeholders about technological literacy.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project sponsor is risk averse and is therefore concerned about negative impacts on the project. To help with this concern, the project team identifies four project risks and then evaluates both the probability of occurrence and the impact of the risk if it occurs. The team uses a 1-5 scale, 1 being the lowest and 5 being the highest.nnn n n Riskn Probabilityn Impactn n 3n 3n 5n 1n n 2n 2n 4n n dn 4n 4n nnnBased on the table, in what order should the project manager rank these risks (high to low) for risk management purposes?",
      "explanation": "To prioritize risk management by risk, the risk level is calculated by multiplying the probability by impact for each risk:\n\n- Risk A: 3 × 3 = 9\n- Risk B: 5 × 1 = 5\n- Risk C: 2 × 4 = 8\n- Risk D: 4 × 4 = 16\n\nTherefore, the risk should be ranked by value from high to low:\nd (16), a (9), c (8), b (5).\n\nExplanation:\n- This arrangement helps the project manager to focus first on the risks with the highest impact and probability.\n- Classifying risks in this way facilitates making decisions based on the priority of effective risk management.\n\nExplanation of the wrong choices:\n- Options that start with risk B prioritize low-impact risks, which is not suitable for effective risk management.\n-  The risk ranking is based on the product of probability and impact and not on probability or impact only.",
      "choices": [
        {
          "text": "B, A, D, C",
          "correct": false
        },
        {
          "text": "B, C, A, D",
          "correct": false
        },
        {
          "text": "D, A, C, B",
          "correct": true
        },
        {
          "text": "C, D, A, B",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been made aware of a recent weather event that could potentially impact the project. Forecasters are unable to predict the path or strength of the event. Any delays would extend the project's finish date and cause cost overruns.n What should the project manager do first?",
      "explanation": "The first correct step is to review the pre-existing risk log, as this event is likely to have been identified as a potential hazard and planned how to deal with or monitor it. Reviewing the risk log helps the project manager make informed decisions and assess the team's readiness for this event.\n\n- Why is this the right choice?\nBecause the event is a potential hazard and not an existing issue, you should refer to the risk log for planned actions or update them.\n\n- Why are other options wrong?\n- Inform stakeholders and update budget: a next step after the risk assessment, not the first action.\n- Take preventive action based on new information: Not possible without a thorough risk assessment and preparation.\n- Record the event in the Issue log: The event has not yet become a problem, so it should not be recorded as a problem record.",
      "choices": [
        {
          "text": "Notify the stakeholders and revise the budget.",
          "correct": false
        },
        {
          "text": "Take preventive action based on new information.",
          "correct": false
        },
        {
          "text": "Check the risk register for more risk information.",
          "correct": true
        },
        {
          "text": "Record information about the event in the issue log.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that in-house resources are insufficient to produce a critical component of a deliverable. This poses a significant threat. The quality of the component is integral to the project, and the in-house resources cannot guarantee high-quality output. In response to this threat, the project manager decides to outsource the production of the component by contracting a third-party vendor.n Which threat response strategy did the project manager use?",
      "explanation": "The strategy used here is mitigation, where the project manager decided to reduce the risk of not achieving the required quality by hiring an external supplier who can deliver higher quality. Mitigation means taking action to reduce the likelihood or impact of a risk.\n\n- Why is this the right choice?\nBecausethe manager did not accept the risk as it is, did not strengthen or escalate it, but took practical action to reduce the possibility of negative impact.\n\n- Why are other options wrong?\n- Acceptance: means taking the risk without taking action, which is not true here.\n- Reinforcement: means increasing the chances of the risk occurring or impact, which is inappropriate.\n- Escalation: It means transferring risk management to a higher destination, which is not what happened.",
      "choices": [
        {
          "text": "Accept",
          "correct": false
        },
        {
          "text": "Mitigate",
          "correct": true
        },
        {
          "text": "Enhance",
          "correct": false
        },
        {
          "text": "Escalate",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A technology project for a multinational bank is in the testing stage. The project manager learns that a security breach has exposed the personal data of thousands of end users. The project sponsor suspends work while the cause is investigated. The threat of a security breach was identified during the risk management planning process, and the impact is significant.n What should the project manager do?",
      "explanation": "When a major security breach classified as an issue occurs, the project manager should update the issue log to reflect this new event, and also review the risk response strategy in the risk log to see if the planned actions are effective or need to be modified.\n\n- Why is this the right choice?\nBecause the security breach has become an actual problem and must be dealt with as such with the relevant documentation updated.\n\n- Why are other options wrong?\n- Refer to the stakeholder engagement plan: Not the first step to dealing with the security breach.\n- Perform a decision tree analysis: It may be useful later but the first step is to update the records.\n- Meeting with the project sponsor: A next step after documenting the issue and reviewing the strategy.",
      "choices": [
        {
          "text": "Refer to the stakeholder engagement plan to determine the risk owner.",
          "correct": false
        },
        {
          "text": "Perform a decision tree analysis to calculate the optimal path to resolution.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to negotiate a new requirements management plan.",
          "correct": false
        },
        {
          "text": "Update the issue log and review the risk response strategy outlined in the risk register.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An electronic company plans to launch a new line of smart home devices. The devices will require a wide variety of skills to produce. However, the company's current production team does not have all of the necessary skills. What is the most comprehensive way for the project manager to identify and address the potential risks of delivering the new product?",
      "explanation": "High-level risk assessment is a comprehensive technique that a project manager can use to identify all potential risks that a project may face, including a lack of skills in the team. This assessment can include technical, organizational, and HR-related risks and allow plans to address them comprehensively.\n\n- Why the right choice?\nBecause it allows for a thorough understanding of potential risks rather than focusing on only a specific aspect.\n\n- Why are other options wrong?\n- Modifying the scope of the project: It may be a later solution but it does not help identify risks.\n-  Quality control requirements review: focused on quality and does not cover all types of risks.\n- Analysis of the production process of competitors: It may help improve processes but is not a direct method of identifying risks.",
      "choices": [
        {
          "text": "Revise the project scope",
          "correct": false
        },
        {
          "text": "Review quality control requirements",
          "correct": false
        },
        {
          "text": "Assess high-level risks",
          "correct": true
        },
        {
          "text": "Analyze the competitor's production process",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new  project manager is assigned to replace a project manager who has resigned. During the initial assessment of project documentation, the new project manager discovers that the risk register has not been updated for several weeks. The project manager's next step be to consult the risk management plan. Why?",
      "explanation": "Referring to the risk management plan helps the new project manager understand the method the previous manager used to classify and prioritize risks. This is essential to understand current priorities and deal with risks in a systematic manner consistent with the project management style.\n\n- Why the right choice?\nBecause the risk management plan contains risk assessment and ranking criteria, enabling the new manager to accurately understand the current risk management status.\n\n- Why are other options wrong?\n- Determine the number of times risks have appeared in the past: Not directly related to the risk management plan.\n- Know how often the risk register is updated: only procedural information and does not help in the risk assessment.\n- Determining the level of acceptable uncertainty: Part of the risk assessment but not the main reason for returning to the plan.",
      "choices": [
        {
          "text": "To determine how often risks have emerged in the past.",
          "correct": false
        },
        {
          "text": "To understand how the previous manager prioritized risks.",
          "correct": true
        },
        {
          "text": "To learn how often the risk register must be updated.",
          "correct": false
        },
        {
          "text": "To ascertain the level of uncertainty acceptable for the project",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the first team meeting, the project manager uses the risks noted in the project charter as a starting point for developing the risk register. After identifying the risks, what should the project team do next?",
      "explanation": "After identifying the risks, the next step is to assess these risks by creating a probability and impact matrix. This matrix helps prioritize risks based on how likely they are to occur and their impact on the project, enabling the team to focus on the most important risks and plan for their response effectively.\n\n- Why the right choice?\nBecause creating a probability and impact matrix is a standard method for assessing and prioritizing risks.\n\n- Why are other options wrong?\n- Management reserve calculation: is carried out after risk assessment and identification of response strategies.\n- Development of emergency response strategies: comes after risk assessment and classification.\n- Conduct of identification and classification activity: already done in the previous stage.",
      "choices": [
        {
          "text": "Calculate the management reserve.",
          "correct": false
        },
        {
          "text": "Develop contingent response strategies.",
          "correct": false
        },
        {
          "text": "Populate a probability and impact matrix.",
          "correct": true
        },
        {
          "text": "Perform identification and categorization activity.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is reviewing work performance data in preparation for the close project process. The data reveals that one of the deliverables was not accepted. The estimated work required to complete acceptance of the deliverable will delay the project completion date by two months.nnWhat should the project manager do next?",
      "explanation": "When it is discovered that the project output is unacceptable and requires additional work that leads to a delay in the schedule, the project manager must issue a formal change request to modify the schedule. This procedure is done through the Change Control Board (CCB) to ensure that the change is reviewed and approved within the formal project management processes.\n\n- Why is the right choice?\nIssuing a change request is the correct procedure to manage delays that affect the project baseline and require formal approval.\n\n- Why are other options wrong?\n- Allocation of contingency reserve: This is not done without formal review and schedule update.\n- Schedule update and work performed: Not possible before the change is approved.\n- Update the watch list in the risk log: This is a secondary step and does not address the actual delay.",
      "choices": [
        {
          "text": "Allocate the contingency reserve to procure resources needed for completion.",
          "correct": false
        },
        {
          "text": "Update the schedule and perform the work.",
          "correct": false
        },
        {
          "text": "Issue a change request for review by the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Update the watch list in the risk register.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A major project deliverable is completed. What should the project manager and team do to confirm that specifications have been met?",
      "explanation": "Upon completion of a key output, the project manager and team must perform quality control to ensure that the output meets the specifications and requirements specified in the project plan. Quality control involves checking products or outputs to verify their compliance with standards, and detecting and correcting defects before delivering the output.\n\n- Why the right choice?\nBecause quality control ensures that the outputs conform to the required standards and specifications.\n\n- Why are the other options wrong?\n-  Process organizational asset validation: supporting documentation and does not reflect product verification.\n- Quality audit reports: results reports, not actual verification activity.\n- Scope verification: focuses on determining what to include, not checking the quality of outputs.",
      "choices": [
        {
          "text": "Check the organizational process assets.",
          "correct": false
        },
        {
          "text": "Validate the quality audit reports.",
          "correct": false
        },
        {
          "text": "Verify the scope.",
          "correct": false
        },
        {
          "text": "Perform quality control.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The client agreed to the standards that would be used to assess final deliverables prior to hand-off, but is now asking for improvements because the deliverables do not meet the standards. Which document should the project manager consult to resolve this issue?",
      "explanation": "When the client requests improvements to the outputs due to their non-conformity with the agreed standards, the project manager should refer to the quality management plan. This plan contains the standards, processes, and methods for verifying the quality of the outputs that have been agreed upon with the customer.\n\n- Why the right choice?\nBecause the quality management plan determines how to measure and evaluate the quality of outputs, which helps resolve disputes about the conformity of the product to standards.\n\n- Why are other options wrong?\n-  The scope management plan focuses on defining what will be delivered, but does not specify quality standards.\n- Requirements documentation describes what the customer needs, but does not specify detailed evaluation criteria.\n-  The project charter sets out objectives and authorities, but does not contain details of quality standards.",
      "choices": [
        {
          "text": "Scope management plan",
          "correct": false
        },
        {
          "text": "Quality management plan",
          "correct": true
        },
        {
          "text": "Requirements documentation",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project deliverable does not meet the functional requirements necessary to meet stakeholder needs. As a result, the customer refuses to accept the deliverable.nnHow would define the quality metrics have helped the project manager avoid this situation?",
      "explanation": "Defining quality metrics means defining what characteristics the output must have and how to measure these characteristics to ensure that functional requirements are met. These metrics help to verify the quality of the output before presenting it to the customer and thus reduce the likelihood of rejection.\n\n- Why the right choice?\nQualitymetrics clearly define product characteristics and explain methods of measuring them, allowing accurate quality control.\n\n- Why are other options wrong?\n- The test management plan focuses on job verification but does not cover the definition of comprehensive metrics.\n-  The workflow structure (WBS) does not define quality standards but focuses on the division of work.\n-  The requirements plan is not associated with procurement in cases of failure.",
      "choices": [
        {
          "text": "The test management plan would have evaluated the deliverable according to quality metrics before final acceptance.",
          "correct": false
        },
        {
          "text": "Quality metrics specified in the work breakdown structure (WBS) would have identified compliance specifications.",
          "correct": false
        },
        {
          "text": "Quality metrics would have described the attributes of the deliverable and how to measure them.",
          "correct": true
        },
        {
          "text": "Quality metrics in the requirements plan would have allowed for a new procurement process in case of component failure.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After sponsor approval of a project, the project manager invites the sponsor, selected team members, and other stakeholders to a meeting. The major purpose of the meeting is to define how formal acceptance of the completed project deliverables will be obtained.nnWhat document will be developed as the final output of this meeting?",
      "explanation": "The goal of the meeting is to determine how to obtain formal acceptance of the output, and this requires updating or developing a domain management plan that explains how to document acceptance and how to deal with changes associated with the scope.\n\n- Why the right choice?\nDomain management plan defines the procedures and processes related to the formal identification and acceptance of the scope.\n\n- Why are other options wrong?\n- A change log is a record that tracks changes but is not a domain acceptance document.\n-  A stakeholder registry focuses on stakeholder interaction and not domain acceptance.\n- A requirements management plan focuses on documenting requirements but is not a domain acceptance document.",
      "choices": [
        {
          "text": "Change log.",
          "correct": false
        },
        {
          "text": "Stakeholder register.",
          "correct": false
        },
        {
          "text": "Scope management plan.",
          "correct": true
        },
        {
          "text": "Requirements management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has been closed and customer care needs to measure customer satisfaction with the deliverables.nnWhat should be done next?",
      "explanation": "After the project is closed, it is important to evaluate the project outputs and customer satisfaction to ensure that the objectives and delivery quality are achieved. Evaluating project outputs and reviewing client feedback helps to understand strengths and weaknesses, and provides a basis for improving future projects.\n\n- Why the right choice?\nBecause it reflects the performance and output evaluation step based on the customer's feedback after delivery.\n\n- Why are other options wrong?\n- Negotiating an additional contract that is not related to the satisfaction measurement.\n- A meeting to discuss lessons learned is important but comes after the customer satisfaction assessment.\n- The closing review for each stage is part of the internal processes and is not related to the customer satisfaction measurement.",
      "choices": [
        {
          "text": "Negotiate additional contract with customer for similar service.",
          "correct": false
        },
        {
          "text": "Schedule meeting with stakeholders and customer to discuss lessons learned.",
          "correct": false
        },
        {
          "text": "Evaluate project deliverables and review customer feedback documents.",
          "correct": true
        },
        {
          "text": "Audit project success by reviewing closing documentation for each project phase.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer is concerned that the current project deliverable will not fulfill stated project requirements. What could be done to alleviate customer concerns?",
      "explanation": "To alleviate the customer's concern about the outputs, it is important to review the previously agreed acceptance criteria and ensure that the outputs meet these criteria. Involving the product owner in this review enhances communication and confirms understanding between the team and the customer.\n\n- Why the right choice?\nBecause reviewing the acceptance criteria with the product owner helps to address concerns directly and effectively.\n\n- Why are other options wrong?\n- Reminding the customer of the requirements may not calm his anxiety if acceptance is not actually verified.\n- Recording anxiety as a risk needs a response plan and does not directly relieve anxiety.\n- Managing anxiety while reviewing each exit is a task but without reviewing the acceptance criteria may be insufficient.",
      "choices": [
        {
          "text": "Schedule a meeting to remind the customer of requirements previously communicated to the team.",
          "correct": false
        },
        {
          "text": "Document the customer's concern as a risk in the risk register and plan accordingly.",
          "correct": false
        },
        {
          "text": "Manage the concern at the review of each deliverable with the customer.",
          "correct": false
        },
        {
          "text": "Ask a product owner to review the acceptance criteria previously discussed with the customer.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with stakeholders to identify the steps that must be completed as part of a task. The project manager needs to be able to verify that team members have completed all the steps required when performing a frequently performed task.nnWhat should the project manager use?",
      "explanation": "In the case of repetitive tasks that require specific steps to be performed on a regular basis, a checklist is used to ensure that all steps are completed correctly and regularly.\n\n- Why the right choice?\nThe checklist is a simple and effective tool to ensure that all steps in the repetitive task are completed, reducing errors and increasing accuracy.\n\n- Why are other options wrong?\n- A flowchart used to visualize the flow of processes and not to verify that steps have been completed.\n- The histogram is used to analyze data and not to follow steps.\n- Facilitation is a session leadership technique, not a task tracking tool.",
      "choices": [
        {
          "text": "Flowchart",
          "correct": false
        },
        {
          "text": "Checklist",
          "correct": true
        },
        {
          "text": "Histogram",
          "correct": false
        },
        {
          "text": "Facilitation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has not been performing user acceptance tests on a deliverable because the product has been working as expected in other projects. However, after implementation, the product is not operational.nnWhat should the project manager do to identify the source of the problem?",
      "explanation": "When a bug appears after implementation even though no user acceptance test has been conducted, the project manager should use root cause analysis to accurately determine the root cause of the problem and work to fix it.\n\n- Why the right choice?\nRoot cause analysis focuses on identifying the true causes of the problem rather than just treating the symptoms.\n\n- Why are other options wrong?\n- A review of the quality metrics document may not reveal the true cause.\n- The scatter scheme is used for variable relationships and not for analyzing the causes of the problem.\n- The audit focuses on verifying compliance with procedures but is not a root cause analysis tool.",
      "choices": [
        {
          "text": "Review the quality metrics document.",
          "correct": false
        },
        {
          "text": "Develop a scatter diagram.",
          "correct": false
        },
        {
          "text": "Conduct a root cause analysis.",
          "correct": true
        },
        {
          "text": "Perform an audit.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A manufacturing company receives customer complaints that a product is defective. A project sponsor has said that these complaints might be outliers.nnWhat should the project manager use to investigate the cause and quantity of defects in this product?",
      "explanation": "A histogram is a statistical tool used to display the distribution of data, such as the number and types of defects, which helps the project manager understand the prevalence and pattern of defects.\n\n- Why the right choice?\nThe frequency graph displays the quantity and types of defects in a visual way that helps to analyze them accurately.\n\n- Why are other options wrong?\n- Flowcharts are used to illustrate the flow of operations and not to analyze quantitative data.\n- The convergence chart is used to organize ideas and problems but is not a quantitative analysis tool for defects.\n- The control diagram is used to monitor processes over time and not to directly determine the number or causes of defects.",
      "choices": [
        {
          "text": "Flowcharts",
          "correct": false
        },
        {
          "text": "Affinity diagram",
          "correct": false
        },
        {
          "text": "Control chart",
          "correct": false
        },
        {
          "text": "Histogram",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company needs to compare customer satisfaction results with organizations that are industry leaders in customer care. What should the project manager use to measure performance?",
      "explanation": "Benchmarking is the process of measuring the performance of a company or project and comparing it with industry best practices or with leading competitors to improve performance.\n\n- Why the right choice?\nBenchmarking helps identify performance gaps and achieve continuous improvement.\n\n- Why are other options wrong?\n- Mind mapping is a tool for organizing ideas, not measuring performance.\n- Interviews are used to collect information and are not a performance comparison tool.\n- Convergence charts are used to organize information and not to analyze performance.",
      "choices": [
        {
          "text": "Benchmarking",
          "correct": true
        },
        {
          "text": "Mind mapping",
          "correct": false
        },
        {
          "text": "Interviews",
          "correct": false
        },
        {
          "text": "Affinity diagrams",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is conducting product testing and has identified several quality issues. The project manager wants to identify and address the root cause.nnWhat should the project manager do?",
      "explanation": "When the project manager encounters frequent quality issues, using the fish chart (Ishikawa/Fishbone Diagram) helps analyze the root cause of the problem.\n\n- Why the right choice?\nFish chart is used to identify and analyze the root causes of a problem by dividing possible causes into categories such as equipment, processes, people, materials, environment, etc.\n\n- Why are other options wrong?\n- The convergence diagram is used to organize ideas and not to identify root causes.\n- The frequency graph shows the distribution of the frequency of problems rather than cause-and-effect relationships.\n- The matrix diagram is used to show relationships between different elements, but it is not used for causal analysis.",
      "choices": [
        {
          "text": "Analyze the results of an affinity diagram.",
          "correct": false
        },
        {
          "text": "Analyze the results of a histogram.",
          "correct": false
        },
        {
          "text": "Analyze the results of a fishbone diagram.",
          "correct": true
        },
        {
          "text": "Analyze the results of a matrix diagram.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "You are the project manager on a project delivered by a Scrum team. The project sponsors are not familiar with the Scrum framework and were invited to attend the first Sprint Review. They ask you to describe the scope of this event.\n\nWhich of the following are the goals of the Sprint Review? (Choose 3)",
      "explanation": "A Sprint Review meeting is a formal event held at the end of each sprint to inspect what has been achieved, get feedback from stakeholders, and determine the next direction based on progress.\n\n- Why the right choices?\n- Presenting what the team has accomplished and comparing it to the goal of the sprint is one of the goals of the meeting.\n- Collaborating with stakeholders to get their feedback helps improve the product and plan for the next sprint.\n- Reviewing progress towards the overall product goal ensures that the work aligns with the project vision.\n\n- Why are other options wrong?\n- Analysis of team performance is done in the Sprint Retrospective  meeting and not in the Sprint Review.\n- Discussing the team's personal challenges is not a goal of the formal meeting, but can be discussed in separate internal sessions.",
      "choices": [
        {
          "text": "Demonstrate what was completed during the Sprint and discuss how it meets the Sprint Goal.",
          "correct": true
        },
        {
          "text": "Collaborate with stakeholders to gather feedback and discuss the next steps.",
          "correct": true
        },
        {
          "text": "Review progress toward the overall product or project goal.",
          "correct": true
        },
        {
          "text": "Analyze team performance and identify internal process improvements.",
          "correct": false
        },
        {
          "text": "Discuss personal challenges team members faced during the Sprint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to close out a project and does not have time to update the lessons learned register.nnWhat could be a consequence of this failure to act?",
      "explanation": "Updating the record of lessons learned is an essential part of the project closure phase. This log helps organizations improve performance and avoid repeat errors in future projects.\n\n- Why the right choice?\nFailure to update this record may result in missing out on valuable opportunities to avoid similar issues later, losing the organization the opportunity to learn and continuously improve.\n\n- Why are other options wrong?\n- Work performance data collected during implementation and is not directly related to project closure.\n- The project management plan is in the early stages and does not occur at the end of the project.\n- Failure to update lessons learned does not directly lead to stakeholder refusal to participate in subsequent projects.",
      "choices": [
        {
          "text": "Work performance data would be incomplete and unavailable for analysis.",
          "correct": false
        },
        {
          "text": "Opportunities to prevent similar problems in future projects could be missed.",
          "correct": true
        },
        {
          "text": "The project management plan could be inaccurate and misleading.",
          "correct": false
        },
        {
          "text": "Key stakeholders would refuse to engage in future projects.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Project completion will be delayed because an essential component will not be delivered on time. What should the project manager do?",
      "explanation": "When faced with a potential delay, the project manager must first assess the impact of that delay on the schedule, cost, scope, and quality of the project.\n\n- Why the right choice?\nAssess the impact before taking any action to ensure that the decision will be based on careful analysis of risks and consequences, not on an ill-considered reaction.\n\n- Why are other options wrong?\n- Consulting and adjusting before understanding the impact may lead to ill-considered decisions.\n- Reviewing the scope plan does not directly address the problem of delay.\n- Verification of penalties is a subsequent step after the impact assessment and not the first action.",
      "choices": [
        {
          "text": "Consult with stakeholders and revise the project schedule to reflect the delay.",
          "correct": false
        },
        {
          "text": "Review the scope management plan to understand how acceptance of project deliverables could still be obtained.",
          "correct": false
        },
        {
          "text": "Check the procurement contract for penalties that can be imposed on the supplier of the component.",
          "correct": false
        },
        {
          "text": "Evaluate the impact of the delay before deciding what actions are necessary.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to close a project phase. What step should project manager take?",
      "explanation": "Closing the phase of the project requires making sure that its objectives are achieved as planned. Therefore, reviewing the project management plan helps to ensure that all required activities have been completed and that the outputs meet the criteria.\n\n- Why the right choice?\nReview the project management plan shows whether the phase goals have actually been achieved, which is the essential step before moving on to the next stage or closing.\n\n- Why are other options wrong?\n- Agreeing on outputs may be part of acceptance, but it is not enough to close the entire phase.\n- Comparing outputs to the project charter is important but it is about closing the project as a whole, not just the phase.\n- Reviewing assumptions and constraints is broader than just staged closing.",
      "choices": [
        {
          "text": "Ensure deliverables have full buy-in according to decision process established for phase.",
          "correct": false
        },
        {
          "text": "Compare project deliverables with project charter and request customer sign off.",
          "correct": false
        },
        {
          "text": "Review high-level strategic and operational assumptions and constraints with stakeholders.",
          "correct": false
        },
        {
          "text": "Review project management plan to ensure phase objectives have been met.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project was cancelled during its initiation phase due to lack of adequate resources. What should the project manager do?",
      "explanation": "When canceling a project at any stage, it is important to follow the formal regulatory procedures to close the project in an orderly manner. Referring to the closing guidelines ensures that all required steps are met.\n\n- Why the right choice?\nCompany's project closure guidelines contain the procedures and policies to be followed to ensure the formal and proper completion of the project.\n\n- Why are other options wrong?\n- Informing the team is important, but it is part of the communication plan and not enough alone.\n- Performing a risk analysis is not useful at this stage after the cancellation decision has been made.\n- Reassigning resources should take place after the project is officially closed, not as a first priority.",
      "choices": [
        {
          "text": "Inform all team members according to guidelines in the communications management plan.",
          "correct": false
        },
        {
          "text": "Refer to the company's project closure guidelines.",
          "correct": true
        },
        {
          "text": "Perform a risk analysis to determine the impact of terminating the project.",
          "correct": false
        },
        {
          "text": "Reassign all resources and reallocate budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project stakeholder is identified who has interest in, but little authority or influence on, the project. How should the project manager handle this stakeholder?",
      "explanation": "In stakeholder analysis, they are categorized based on level of authority, influence and interest. For stakeholders who have a high interest but low influence or authority, the most appropriate strategy is to 'Keep Informed'.\n\n- Why the right choice?\nProviding them with information when needed is a practical way to satisfy their interest while avoiding spending resources on involving them unnecessarily, commensurate with their limited impact.\n\n- Why are other options wrong?\n- 'Working closely with him' is an approach used for high-impact stakeholders.\n- 'Follow-up and response' is suitable for those with medium impact.\n- 'Involve him in periodic updates' is more suitable for high-impact and high-interest stakeholders.",
      "choices": [
        {
          "text": "Provide information to the stakeholder as needed.",
          "correct": true
        },
        {
          "text": "Work closely with the stakeholder to proactively address their concerns.",
          "correct": false
        },
        {
          "text": "Keep track of the stakeholder and respond to their needs.",
          "correct": false
        },
        {
          "text": "Include the stakeholder on standard updates and keep them satisfied.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recognizes the need to improve team dynamics and knowledge sharing during a megaproject.nnWhat should the project manager do?",
      "explanation": "In complex and large projects, the need for effective collaboration and knowledge sharing increases. One of the best approaches is to facilitate open discussions within the team.\n\n- Why the right choice?\nFacilitatingopen discussions allows the team to share challenges, promotes transparency, and motivates members to contribute their ideas and expertise. This helps address organizational or individual problems before they escalate.\n\n- Why are other options wrong?\n- Organizing skills sessions is good, but it does not guarantee dialogue or addressing challenges.\n- Assigning new members to difficult tasks without support can impair performance.\n- The orientation program may be effective, but the quickest and most comprehensive solution is a group dialogue in which everyone participates.",
      "choices": [
        {
          "text": "Conduct knowledge-sharing sessions where experienced team members present their expertise.",
          "correct": false
        },
        {
          "text": "Assign junior team members tasks that push their skill level and offer minimal support.",
          "correct": false
        },
        {
          "text": "Implement a formal mentoring program with structured goals and regular meetings.",
          "correct": false
        },
        {
          "text": "Facilitate open team discussions to identify and address individual challenges and concerns.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager compiling a list of project stakeholders discovers an interested stakeholder with little to no authority. How should they manage this stakeholder?",
      "explanation": "In stakeholder management, the 'power versus interest' model is used to classify them. Stakeholders with high interest and low authority are advised to keep them informed.\n\n- Why the right choice?\nBecausethis party has an interest in the project, they should be informed of what is going on without having to involve them deeply, which keeps communication flowing without draining resources.\n\n- Why are other options wrong?\n- 'Keep it satisfied' is used for those with high authority and low interest.\n- 'Close management' applies to those with high influence and high interest.\n- 'Monitor' is suitable for those with low interest and authority.",
      "choices": [
        {
          "text": "Keep satisfied.",
          "correct": false
        },
        {
          "text": "Manage closely.",
          "correct": false
        },
        {
          "text": "Monitor.",
          "correct": false
        },
        {
          "text": "Keep informed.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project stakeholder has been missing scheduled facilitation workshops and has delegated assigned tasks to another member of the stakeholder community. What should the project manager do to engage this stakeholder?",
      "explanation": "When there is a weakness in a stakeholder's engagement, the first step is to check whether their roles and responsibilities are clear and understandable. Charter review helps to redefine each party's obligations.\n\n- Why the right choice?\nReviewroles as defined in the project charter highlights stakeholder responsibilities and resets expectations.\n\n- Why are other options wrong?\n- Explaining the differences in tasks does not solve the underlying problem.\n- Asking the program manager to intervene is an unnecessary escalation at this stage.\n- Pairing him with a team member as an appropriate mentor in case of poor competence, not poor commitment.",
      "choices": [
        {
          "text": "Review with the stakeholder the roles and responsibilities of everyone involved as specified in the project charter.",
          "correct": true
        },
        {
          "text": "Explain to the stakeholder the differences among the tasks assigned to each project team member.",
          "correct": false
        },
        {
          "text": "Ask the program manager to brief this stakeholder and to require the stakeholder's attendance at all relevant meetings.",
          "correct": false
        },
        {
          "text": "Pair the stakeholder with a more experienced team member who can act as a mentor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While executing a project that is nearly behind schedule, a project manager must commission a new piece of equipment. Two local parties who will be impacted by this commission ask that the project be stopped immediately because they were not given an opportunity to provide project approval.nnHow would implement a stakeholder engagement plan have helped the project manager avoid this situation?",
      "explanation": "The stakeholder engagement plan aims to identify all parties involved in the project and identify strategies for their inclusion in a timely manner. If local parties had been identified as stakeholders in the plan, they would have been included in official communication channels and received the necessary information to express their opinions or agreement in advance.\n\n- Why the right choice? Because the inclusion of affected parties in the communication plan within the stakeholder engagement plan ensures that they are informed and engaged.\n\n- Why are other options wrong?\n - The use of conflict management techniques assumes the existence of an actual conflict, not a preventive means.\n - Their signature on the project charter is not always required, and may not be possible.\n - Negotiation techniques are applied only after communication, and are not a substitute for their inclusion in advance.",
      "choices": [
        {
          "text": "By using the conflict management techniques described in the plan, the project manager could have gotten approval from the local parties.",
          "correct": false
        },
        {
          "text": "Including the local parties in the plan would have ensured their sign-off and approval of the project charter.",
          "correct": false
        },
        {
          "text": "By understanding the local parties' expectations, the project manager could have used appropriate negotiating techniques to engage them.",
          "correct": false
        },
        {
          "text": "By identifying the local parties as stakeholders, they would have been included in relevant communications.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder refuses to sign off on a product because it does not meet the expectations outlined in the project scope. What should the project manager have done to avoid this situation?",
      "explanation": "Stakeholder engagement management requires their continuous involvement throughout the project lifecycle, especially key stakeholders who influence the final acceptance of outputs. Gathering continuous feedback ensures that outputs are aligned with their expectations and that the scope or design is adjusted when needed.\n\n- Why the right choice? Because collecting opinions on an ongoing basis allows for early detection of gaps between expectations and scope.\n\n- Why are other options wrong?\n - Risk assessment for threats or opportunities, not acceptance expectations.\n - Conflict management techniques are used when an actual problem occurs.\n - Involve only in the testing phase too late to modify the scope or product.",
      "choices": [
        {
          "text": "Solicited stakeholder feedback throughout the life cycle of the project.",
          "correct": true
        },
        {
          "text": "Conducted risk assessments based on the stakeholder's expectations.",
          "correct": false
        },
        {
          "text": "Implemented conflict management techniques during sign-off.",
          "correct": false
        },
        {
          "text": "Involved the key stakeholder during the testing phase.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project schedule requires that two teams work simultaneously on separate parts of a complex project. The two parts of the project are dependent on each other. The project manager needs to ensure there are no conflicts when the outputs from the two teams are combined.nnWhat should the project manager do to manage any potential conflicts first?",
      "explanation": "When different teams are working on interconnected parts of a project, regular coordination is essential to avoid conflicts when merging outputs. Weekly meetings provide a platform to exchange progress, challenges, technical and integration developments between teams.\n\n- Why the right choice?\nOrganizing weekly meetings between the two teams allows continuous follow-up and identification of any problems or differences early.\n\n- Why are other options wrong?\n- Prioritizing the critical path does not resolve conflicts between teams, but rather about scheduling.\n- Reviewing lessons learned is important, but it is not enough as an initial measure to manage conflicts in real time.\n- Stakeholder engagement is beneficial for public support, but does not address day-to-day technical coordination between teams.",
      "choices": [
        {
          "text": "Set up weekly meetings between the teams to monitor each other's work.",
          "correct": true
        },
        {
          "text": "Prioritize conflict resolution for the part of the project that is on the critical path.",
          "correct": false
        },
        {
          "text": "Review the lessons learned register to anticipate potential conflicts and plan their resolution.",
          "correct": false
        },
        {
          "text": "Engage project stakeholders to ensure their support through any conflicts as they arise.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is developing a project charter, but a key stakeholder is failing to provide information about the expected project benefits. Why should the project manager meet with the project sponsor about this issue?",
      "explanation": "The project sponsor is the executive officer who has the authority to support the project at the political and strategic level. When a project manager faces resistance or lack of cooperation from an important stakeholder, the project sponsor can intervene to address policy issues or urge parties to cooperate.\n\n- Why the right choice?\nBecause the project sponsor has influence within the organization to address internal issues that hinder the progress of the project, especially when it relates to vital information such as expected benefits.\n\n- Why are other options wrong?\n- Managing tacit knowledge is not the primary role of the sponsor.\n- Change in the stakeholder community is done in collaboration with the stakeholders themselves, not through the Change Board (CCB).\n- Disciplinary actions are not the responsibility of the project sponsor, but usually the responsibility of human resources.",
      "choices": [
        {
          "text": "The project sponsor is the key person responsible for managing both tacit and explicit project knowledge.",
          "correct": false
        },
        {
          "text": "The project sponsor is the party who can address internal political and strategic issues that can affect project quality.",
          "correct": true
        },
        {
          "text": "The project sponsor can request that the change control board (CCB) make a change in the stakeholder community.",
          "correct": false
        },
        {
          "text": "Disciplinary actions regarding stakeholders are managed by the project sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An intern is replacing a critical resource midway through a sprint. To help the intern get up to speed, the project manager assigns a senior engineer in the team as the intern's mentor. Two months later, the project goes into critical status, delaying the release milestone by a month.nnWhat should the project manager have done to avoid this scenario?",
      "explanation": "When a critical resource is replaced by an intern, it is a significant risk to project performance. It is the responsibility of the project manager to analyze the impact on the schedule and take preventive measures. The best option here is to negotiate additional time to adjust the schedule to suit the capabilities of the new resource.\n\n- Why the right choice? Because negotiating additional time gives the trainee and mentor enough time without pressure, and reduces the likelihood of delay.\n\n- Why are other options wrong?\n - Convincing the critical resource to stay may not be possible.\n - Requesting an experienced resource may not always be an option.\n - Allocating time for routing is useful, but does not address the time need resulting from lack of experience.",
      "choices": [
        {
          "text": "Convinced the critical resource to remain on the project.",
          "correct": false
        },
        {
          "text": "Requested an experienced resource as a replacement.",
          "correct": false
        },
        {
          "text": "Negotiated additional time to complete the project.",
          "correct": true
        },
        {
          "text": "Allocated additional time for mentoring.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager joins a project during the delivery of a critical milestone. This project has multiple stakeholders, and each has a different level of interest. The project manager needs to determine how much detail to provide to the stakeholders about the delivery.nnWhich document should the project manager refer to?",
      "explanation": "The stakeholder engagement plan is used to determine the levels of influence and interest of stakeholders, and appropriate communication strategies for each category. This plan helps determine the type of information, the level of detail, and the frequency of communication for each stakeholder.\n\n- Why the right choice? Because the stakeholder engagement plan contains a detailed analysis of the levels of impact and need for information.\n\n- Why are other options wrong?\n –  The communications plan specifies the means and redundancy rather than the detailed content assigned to each party.\n –  The stakeholder register contains general information, but does not specify the level of detail required.\n – The project management plan is a comprehensive document, but it does not address the strategy for allocating details to each party.",
      "choices": [
        {
          "text": "Communications management plan",
          "correct": false
        },
        {
          "text": "Stakeholder register",
          "correct": false
        },
        {
          "text": "Stakeholder engagement plan",
          "correct": true
        },
        {
          "text": "Project management plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project review, the construction manager reports that the concrete production rate has changed over the last three months. They would like to have an idea of what to expect in the next three months.nnWhat analysis should be conducted?",
      "explanation": "The appropriate analysis for this type of situation is trend  analysis. This type of analysis uses historical data to determine the pattern or direction in which performance is going, allowing a prediction of what will happen in the future if conditions continue as they are.\n\n- Why the right choice?\n - Trend analysis shows changes in performance over time, such as concrete production, and helps with future forecasts.\n\n- Why are other options wrong?\n – Earned value analysis focuses on progress against budget and schedule rather than time trends.\n – Critical path analysis identifies activities that affect the duration of the project, and is not used to anticipate performance changes.\n – Cost-benefit analysis is used to assess whether initiatives are worth the cost, not to predict performance.",
      "choices": [
        {
          "text": "Earned value analysis",
          "correct": false
        },
        {
          "text": "Critical path analysis",
          "correct": false
        },
        {
          "text": "Trend analysis",
          "correct": true
        },
        {
          "text": "Cost-benefit analysis",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After a review meeting, a scrum master repeats the importance of quality, focusing especially on the Cost of Change. Which of the following is the scrum master not referring to?",
      "explanation": "In  Agile methodologies like Scrum, the focus is on reducing the cost of change through early detection of problems. The official here talks about the quality and the impact of defects on the project. The option that the administrator doesn't indicate is to support more features, because it's not about product quality or cost of change.\n\n- Why the right choice?\n - Support for more features is related to scope or functionality, not quality or cost of change.\n\n- Why are other options wrong?\n - Reducing the defect remediation cycle is an essential element in quality improvement.\n - Repairing defects discovered after delivery is one of the most expensive activities, and should be avoided.\n - Reducing technical debt is an important part of Scrum's quality management.",
      "choices": [
        {
          "text": "Shorten the defect cycle time.",
          "correct": false
        },
        {
          "text": "Fix escaped defects.",
          "correct": false
        },
        {
          "text": "Support more features.",
          "correct": true
        },
        {
          "text": "Reduce the technical debt.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies that the work started by the project team is inconsistent with industry regulations.nnWhat should the project manager update?",
      "explanation": "When a work is found to be in non-regulatory form, this is an **issue** affecting the progress of the project and may require corrective action. Therefore, the project manager must update the Issue Log** to document this issue, determine its impact, and follow up on solutions.\n\n- Why the right choice?\n - The case log is used to document unexpected issues that occur during execution.\n\n- Why are other options wrong?\n -  The assets of organizational processes are not updated by the project manager but by the organization.\n - Business performance data is the result of implementation and is not used to document problems.\n - The project management plan can be modified later if the issue requires a change in plan, but it is not the first thing that happens.",
      "choices": [
        {
          "text": "Organizational process assets",
          "correct": false
        },
        {
          "text": "Work performance data",
          "correct": false
        },
        {
          "text": "Issue log",
          "correct": true
        },
        {
          "text": "Project management plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project which has many risks identified in the risk register. The current sprint deals with a critical aspect of the project. During the iteration, an identified risk occurs which ceases project development. The project manager logs the risk occurrence.nnWhat should the project manager do next?",
      "explanation": "When a risk occurs in the agile project, especially if it affects progress, the project manager must take immediate action to mitigate the impact. **Increasing the frequency of communication** with the team and stakeholders and leveraging their support is the most effective approach in the Agile  environment to deal with crises.\n\n- Why the right choice?\n - Agile focuses on collaboration and rapid response, so increasing communication and collaboration with stakeholders is crucial.\n\n- Why are other options wrong?\n - Designate a member responsible for communications that does not address the current risk.\n -  The retrospective meeting occurs after the session, and is not used to solve immediate problems.\n - Deferring work is not the first solution when a risk occurs; you should try to deal with it first.",
      "choices": [
        {
          "text": "Raise the frequency of communications and leverage stakeholders to assist in resolving issues.",
          "correct": true
        },
        {
          "text": "Assign responsibility for the communication management plan to a senior team member.",
          "correct": false
        },
        {
          "text": "Invite the stakeholders to the next retrospective meeting and inform them of the issue.",
          "correct": false
        },
        {
          "text": "Delay development of the critical aspect to the next sprint and work on items currently in the backlog.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key project team member is leaving the organization at the halfway point of the project. What should the project manager do first?",
      "explanation": "When a key team member leaves, the first step a project manager should take is to **assess the impact of that member's loss on the project**. This assessment helps in understanding the impact on the schedule, the quality of work, and the resources available, thus effectively identifying the next steps.\n\n- Why the right choice?\n - Impact assessment provides a basis for making informed decisions about resource compensation or rescheduling.\n\n- Why are other options wrong?\n - Meeting with the team to redistribute the burden may be later after an impact assessment.\n - Working with the functional manager to find a replacement is a next step after the impact assessment.\n - Reassessing roles and configuration You need to assess the impact of the loss first.",
      "choices": [
        {
          "text": "Meet with remaining team members to reassign workloads.",
          "correct": false
        },
        {
          "text": "Work with the functional manager to find a replacement.",
          "correct": false
        },
        {
          "text": "Evaluate the impact of the loss of the team member on the project.",
          "correct": true
        },
        {
          "text": "Reassess the resource roles and team composition.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During an agile retrospective session, several team members mentioned that they were confused about the iteration's progress. What should the project manager do to avoid this confusion?",
      "explanation": "If team members are confused about the progress of the course, the project manager should clarify the situation by **instructing the team to review the Iteration Board** that visually and directly displays the status of the tasks, enhancing everyone's understanding of the progress of the work.\n\n- Why the right choice?\n - The course board is a visual tool that helps the team clearly track the progress of tasks.\n\n- Why are other options wrong?\n -  Daily status reporting may not be as effective as direct interaction with visual tools.\n - Asking the team to review the work list does not give a comprehensive picture as the board does.\n - Deferring problem handling for a later session delays resolution and does not address the current confusion.",
      "choices": [
        {
          "text": "Coach the team to review the iteration board.",
          "correct": true
        },
        {
          "text": "Prepare a daily project status report and share it with the team.",
          "correct": false
        },
        {
          "text": "Ask the team to refer to the iteration backlog report.",
          "correct": false
        },
        {
          "text": "Address the issue at the next retrospective session.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a new software development project and has met with the customer to discuss their requirements. The customer has provided the project manager with a list of requirements, but did not differentiate the technical requirements from the customer requirements.nnWhich of the following requirements should the project manager classify as a customer requirement?",
      "explanation": "Customer requirements are the characteristics or functions that the customer needs from the product or service, often related to user experience and satisfaction. In this question:\n\n-  The software must be easy to use and navigate is a requirement of the customer because it reflects the needs of the end user of the software.\n\n- Other requirements such as the ability to process transactions at a certain speed, use encryption algorithms, or work on multiple operating systems are technical requirements concerned with how the system is implemented internally.\n\nTherefore, the correct choice is the customer's requirement that expresses ease of use.",
      "choices": [
        {
          "text": "The software should be able to process 1000 transactions per second.",
          "correct": false
        },
        {
          "text": "The software should use a secure database encryption algorithm.",
          "correct": false
        },
        {
          "text": "The software should be able to run on a variety of operating systems.",
          "correct": false
        },
        {
          "text": "The software should be easy to use and navigate.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During acceptance testing of a deliverable, some senior stakeholders complain that a feature essential to their department was not included. What should the project manager have done to prevent this?",
      "explanation": "This problem occurs due to a lack of clarity of project scope or mismanagement of stakeholder requirements. \n\n-  The correct solution is to analyze the project charter and develop a scope management plan, because the project charter defines the boundaries of the project, and the requirements of stakeholders must be managed within the scope plan to ensure that all important requirements are included and exclusions are avoided.\n\n- Other options such as reference to lessons learned, a change management plan or prototype are important but do not address the fundamental problem of clearly defining the scope.",
      "choices": [
        {
          "text": "Consulted lessons learned from similar projects to adapt processes",
          "correct": false
        },
        {
          "text": "Prepared a change management plan and logged changes during project implementation",
          "correct": false
        },
        {
          "text": "Analyzed the project charter and developed a scope management plan",
          "correct": true
        },
        {
          "text": "Prepared a prototype and conducted a product demo with stakeholders",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager has been assigned to a project during its execution stage. During a review of the work breakdown structure (WBS), the project manager discovers that some deliverables were overlooked. The project manager needs to ensure that no work is left out of the project scope and no extra work is performed.nnWhat should the project manager do next?",
      "explanation": "When a project manager detects that some output has been ignored in the workload structure (WBS), they must first update the  WBS by adding the missing works or outputs. \n\nThis step ensures that all required work is included in the scope of the project, preventing the exclusion of necessary work or the execution of excess work. Then, project metrics such as schedule and cost must be recalculated to include new changes.\n\n- Asking stakeholders may be helpful, but the first step is to update WBS.\n- Merging lower-level outputs without review may cause work exclusion.\n- Requesting a change via PMO may be necessary later if the change calls for it, but it is not the first step.",
      "choices": [
        {
          "text": "Add the work to the WBS and recalculate the project metrics.",
          "correct": true
        },
        {
          "text": "Ask the stakeholders if these deliverables need to be added to the WBS.",
          "correct": false
        },
        {
          "text": "Roll up the lower-level deliverables into higher-level work already accounted for in the WBS.",
          "correct": false
        },
        {
          "text": "Initiate a Change Control Request with the project management office (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project sponsor questions whether some detailed capabilities in the product design match the scope according to the project charter. What should the project manager use to manage this?",
      "explanation": "The Requirements Traceability Matrix is a key tool that helps the project manager track every requirement from the project charter to the outputs of design, implementation and delivery. This tool ensures that all capabilities and characteristics in the design are compatible with the scope of the specified project.\n\n-  The expert referee is used for consultation but is not a tracking tool.\n-  The prototype helps in product visualization but does not provide systematic tracking.\n-  The context diagram defines the boundaries of the system but does not link the requirements to the products.",
      "choices": [
        {
          "text": "Expert judgment",
          "correct": false
        },
        {
          "text": "Requirements traceability matrix",
          "correct": true
        },
        {
          "text": "Prototype",
          "correct": false
        },
        {
          "text": "Context diagram",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is using an agile delivery approach for a project. The team members and business stakeholders are unfamiliar with formal requirements prioritization methods and are inexperienced with agile delivery approaches. The project manager wants to ensure that the critical business requirements will be planned and delivered.nnWhat prioritization technique should the project manager use?",
      "explanation": "In an Agile environment, where prioritization can be multilateral and unclear, it is best to use an agreed mathematical model to prioritize requirements objectively and clearly. This allows priorities to be distributed based on specific criteria and accepted by the team and stakeholders.\n\n-  Taking everyone's opinions in a disorderly manner may lead to unclear results.\n- Gathering and understanding needs is important but does not set priorities accurately.\n- Reaching a common understanding is an ongoing process but not a prioritization technique per se.",
      "choices": [
        {
          "text": "Get the opinion of all team members and business stakeholders.",
          "correct": false
        },
        {
          "text": "Use a mathematical model defined by the team members and stakeholders.",
          "correct": true
        },
        {
          "text": "Collect the needs of the team members and business stakeholders.",
          "correct": false
        },
        {
          "text": "Reach a common understanding with the team members and stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A functional manager has been making changes to a project outside of the established management plan. The functional manager recently went straight to the project sponsor to request another change.nnWhat should that project manager do?",
      "explanation": "The correct answer is 'inform the job manager that all changes must go through the change control process'. The reason is that the project manager is responsible for implementing approved operations for changing the scope, and they may not be allowed to be overridden. \n\n- 'Determines whether the Change Control Committee (CCB)  should review changes' is incorrect because the changes have already occurred outside the formal process.\n- 'Modify the project management plan to allow flexibility' is inappropriate because it legitimizes uncontrolled behavior.\n-'Meeting with the project sponsor to discuss the changes' is not enough without addressing the root and is the job manager bypassing the change process.",
      "choices": [
        {
          "text": "Determine if the change control board (CCB) needs to review the changes.",
          "correct": false
        },
        {
          "text": "Tell the functional manager that all changes must go through the change control process.",
          "correct": true
        },
        {
          "text": "Modify the project management plan to allow flexibility in the change control procedures.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to discuss details about the requested changes.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The change control board (CCB) has evaluated and approved several change requests in a timely manner in the last several weeks. However, implementation of the changes is taking more time than anticipated.nnWhat should the project manager do?",
      "explanation": "The correct answer is 'Monitor the implementation of changes to make sure that change management procedures are followed'. This means that the role of the project manager does not stop at approval, but includes following up on implementation and ensuring compliance with plans.\n\n- 'Change control system modification' is incorrect because it does not address implementation delays.\n- 'Obtaining additional resources' is inappropriate before understanding the root cause of the delay.\n- 'Conducting a risk analysis' may be later, but the first step is actual follow-up to implementation.",
      "choices": [
        {
          "text": "Revise the change control system to allow only critical changes to be raised.",
          "correct": false
        },
        {
          "text": "Acquire additional resources to ensure the project milestones are met.",
          "correct": false
        },
        {
          "text": "Perform a detailed risk analysis to determine the impact of the time required to implement the changes on the success of the project.",
          "correct": false
        },
        {
          "text": "Monitor implementation of the changes to ensure that change management procedures are being followed.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager for a complex project discovers that a certain team member has missed several targets. What should the project manager do?",
      "explanation": "The correct answer is 'discuss the problem with the member and offer to help if necessary'. Because the best approach at the beginning is direct dialogue to understand the reasons and provide the necessary support.\n\n- 'Check if it is related to another project' is not entirely wrong, but it does not solve the problem directly.\n- 'Sanctions' is ineffective as a first step and may increase tension.\n- 'Ask the job manager to intervene' may be later if the problem is not resolved, but direct dialogue first is most appropriate.",
      "choices": [
        {
          "text": "Determine if the team member has been assigned to a concurrent project.",
          "correct": false
        },
        {
          "text": "Impose a penalty for each day the team member misses a target.",
          "correct": false
        },
        {
          "text": "Ask the team member's functional manager to address the issue.",
          "correct": false
        },
        {
          "text": "Discuss the issue with the team member and offer any needed assistance.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager working on an agile project discovers that the allocated budget and resources are insufficient to cover the estimated total cost. The PMO recommended the development of requirements prioritization model.nnWhat should the project manager take into consideration in the model?",
      "explanation": "The correct answer is: 'Cost and associated risks'. In an agile environment, when resources are limited, it is important to prioritize based on value versus cost, taking into account the risks.\n\n- 'Cost, associated risks, and company culture' is incorrect because company culture is not a direct factor in prioritization.\n- 'Associated risks and company culture' ignores cost and is a central element in decision-making.\n- 'Associated cost constraints' is not an accurate or approved term for prioritization.",
      "choices": [
        {
          "text": "Cost, associated risk, and company culture.",
          "correct": false
        },
        {
          "text": "Associated risk and company culture.",
          "correct": false
        },
        {
          "text": "Cost and associated risk.",
          "correct": true
        },
        {
          "text": "Associated cost impediments.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a hybrid project. The team performance has been suffering and multiple team members have identified one of the stakeholders as a constant obstacle. They say that the stakeholder regularly asks team members for status updates and tries to implement project changes directly through the project team.nnHow can the project manager improve project performance?",
      "explanation": "The correct answer is: 'Meeting with the project sponsor to address and remove obstacles and obstacles in front of the team'. The project sponsor has the authority to engage with intervening stakeholders and ensure team focus.\n\n- 'Identifying the stakeholder as a source of risk' does not address the problem radically but only documents it.\n- 'Requiring the team to direct requests to the project manager' is a superficial solution, and may increase pressure on the team.\n- 'Working with PMO to remove the stakeholder' is impractical because the stakeholder is part of the project and cannot be excluded in this way.",
      "choices": [
        {
          "text": "Identify the stakeholder as a risk in the risk register and work with the team on a mitigation strategy.",
          "correct": false
        },
        {
          "text": "Have the team direct all project requests from the stakeholder to the project manager.",
          "correct": false
        },
        {
          "text": "Work with the project management office (PMO) to remove the stakeholder from the project.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to address and remove impediments and obstacles for the team.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team is working on a project using a hybrid approach, and they are facing a lot of obstacles and blockers from some stakeholders. What should the project manager do to improve project performance?",
      "explanation": "The correct answer is: 'Addressing and removing obstacles and obstacles facing the team'. In hybrid projects, it is the responsibility of the project manager to remove barriers that affect performance and hinder progress.\n\n- 'Adding obstacles to the case log and risk management plan' does not solve the problem, only documents it.\n- 'Requiring stakeholders to communicate with the project manager only' may limit collaboration without addressing the core of the problem.\n- 'Enabling team members to remove obstacles themselves' is not always appropriate, especially if the obstacles are related to stakeholders with authority.",
      "choices": [
        {
          "text": "Add blockers to the issue log and risk management plan.",
          "correct": false
        },
        {
          "text": "Ask stakeholders to communicate with the project manager and not directly with the team.",
          "correct": false
        },
        {
          "text": "Empower the team members to remove obstacles and blockers.",
          "correct": false
        },
        {
          "text": "Address and remove obstacles and blockers for the team.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager has been assigned to a global project team. In the next few days, the project team must create a resource breakdown structure (RBS) for the project. However, the resource management plan states that the RBS should be created and reviewed only at the beginning of the project.nnWhat should the project manager do first?",
      "explanation": "The correct answer is: 'Update resource management plan'. Since the current document does not allow the creation or modification of RBS at this stage, the plan must be modified to align with the reality of the current project.\n\n- 'Update project management plan' is not the appropriate step because the problem is directly related to the resource plan.\n- 'Updating resource breakdown structure' is only possible after modifying the plan that governs it.\n- 'Updating the workload structure (WBS)' has nothing to do with the problem because it concerns the scope of the work and not the resources.",
      "choices": [
        {
          "text": "Update the resource management plan.",
          "correct": true
        },
        {
          "text": "Update the project management plan.",
          "correct": false
        },
        {
          "text": "Update the resource breakdown structure.",
          "correct": false
        },
        {
          "text": "Update the work breakdown structure.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "The project team is defining certifications, technical competencies, and soft competencies for people, machinery, advance visualization software, workstations for physicians, and other supplies for a complex project that must be implemented in 5 months.nnIf the project team uses a resource breakdown structure (RBS), how will it help to organize and visualize the resources? (Choose three).",
      "explanation": "The correct answers are: 'by hierarchy', 'by source', and 'by category'.\n\n- The hierarchy helps to organize resources logically from top to bottom.\n- Sorting by source separates resources by origin, such as human resources or equipment.\n- Classification by category links resources to similar categories, making them easier to manage.\n\n- 'By type' is inaccurate as a separate classification in RBS, because it may interfere with the category or source.\n- 'By last name' is illogical in organizing resources because it does not reflect related properties or classifications.",
      "choices": [
        {
          "text": "By hierarchy",
          "correct": true
        },
        {
          "text": "By source",
          "correct": true
        },
        {
          "text": "By category",
          "correct": true
        },
        {
          "text": "By type",
          "correct": false
        },
        {
          "text": "By last name",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is delayed due to resource availability, which puts the project budget at risk. Which document should the project manager use to review and update resources?",
      "explanation": "The correct document is the resource allocation structure (RBS) because it helps organize resources structurally and allows the project manager to review and update the resources required for the project.\n\n-  The requirements tracking matrix is about requirements tracking, not resource-specific.\n-  The workshift structure (WBS) organizes the scope of work, not resources.\n-  The assigning responsibilities matrix defines responsibilities, not resource review.",
      "choices": [
        {
          "text": "Requirements Traceability Matrix",
          "correct": false
        },
        {
          "text": "Work Breakdown Structure",
          "correct": false
        },
        {
          "text": "Resource Breakdown Structure",
          "correct": true
        },
        {
          "text": "Responsibility Assignment Matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager identifies conflicts among local and virtual team members' understanding of the deliverables. How can the project manager resolve these conflicts?",
      "explanation": "Collaborating with team members to address conflicts is the right choice because it encourages open dialogue, exchange of views, and reaching a collective consensus.\n\n- Asking the project sponsor to meet with the team may not solve the problem effectively because it does not focus on dialogue between members.\n- Hosting a mediation session may be useful but it is not the first step.\n- Focusing only on points of agreement ignores the differences that need to be resolved.",
      "choices": [
        {
          "text": "Ask the project sponsor to meet with the team",
          "correct": false
        },
        {
          "text": "By collaborating with team members to address the conflicts",
          "correct": true
        },
        {
          "text": "Host a mediation session that brings a degree of satisfaction to all team members",
          "correct": false
        },
        {
          "text": "By emphasizing areas of agreement rather than areas of difference",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is slightly ahead of schedule. However, the project manager was informed that a critical deliverable will not be available on time.nnIf the project manager is able to crash the deliverable that is behind what would the impact be?",
      "explanation": "The correct answer is the costs and risks will rise.\n\n- Why is the choice correct?\nAccelerating work typically requires additional resources such as overtime or additional equipment, which increases costs. Time pressure can also lead to errors or other problems, increasing the risks associated with the project.\n\n- Why are other options wrong?\n- Project assurance issues will occur but they are not the direct impact expected from acceleration.\n- Costs and risks will decrease contrary to reality because acceleration usually increases cost and risk.\n- Re-work will be performed that are not necessarily a direct result of accelerating the work, and may occur for other reasons.",
      "choices": [
        {
          "text": "Project warranty issues would result.",
          "correct": false
        },
        {
          "text": "Project costs and risks would decrease.",
          "correct": false
        },
        {
          "text": "Project costs and risks would increase.",
          "correct": true
        },
        {
          "text": "Rework would need to be performed.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project has an approved project baseline schedule of 180 days and the baseline budget is US$250,000. After 21 days, the project has spent US$60,000 and earned value is US$75,000.nnWhat is the cost performance index (CPI) for this project?",
      "explanation": "The correct answer is 1.25.\n\n- Why is the option correct?\nCPI  is calculated by dividing earned value (EV) by actual cost (AC). Here: CPI = 75,000 ÷ 60,000 = 1.25, indicating that the project is achieving higher value than the cost paid, which is evidence of cost efficiency.\n\n- Why are other options wrong?\n- 0.8 and 0.75 are less than 1, which means a lower performance than expected and this is incorrect according to the data.\n- 1.02 does not match the correct calculation based on the given figures.",
      "choices": [
        {
          "text": "0.8",
          "correct": false
        },
        {
          "text": "0.75",
          "correct": false
        },
        {
          "text": "1.25",
          "correct": true
        },
        {
          "text": "1.02",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that a functional manager is assigning a two-week task in another project to a team member. Loss of this resource for two weeks will jeopardize the project schedule.nnWhat should the project manager do?",
      "explanation": "The correct answer is to review the resource management plan to determine how to negotiate with the job manager.\n\n- Why is this correct?\nBecause the resource management plan explains how resources are allocated and how to deal with schedule and task conflicts, it can therefore be used as a basis for negotiating with the job manager to resolve the problem.\n\n- Why are other options wrong?\n- A change request to the Change Control Committee is inappropriate because no formal change has been requested yet.\n- Meeting with the project sponsor may be later, but it is not the first step.\n- Appointing another team member without evaluating resources and impact may cause other problems.",
      "choices": [
        {
          "text": "Review the resource management plan to determine how to negotiate with the functional manager.",
          "correct": true
        },
        {
          "text": "Submit a change request to the change control board (CCB) to obtain a replacement resource from another department.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to discuss the priority levels of the two projects.",
          "correct": false
        },
        {
          "text": "Assign another team member to perform the work of the team member who will be missing for two weeks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What should a project manager consult to get resources assigned to a project?",
      "explanation": "The correct answer is the resource management plan.\n\n- Why is this correct?\nThe resource management plan explains how resources are allocated and managed throughout  the project lifecycle.\n\n- Why are other options wrong?\n- An expert referee is a method, not a document.\n-  The  RACI matrix clarifies responsibilities but is not directly related to resource allocation.\n- Resource requirements only indicate what is required but are not a resource allocation document.",
      "choices": [
        {
          "text": "Expert judgment",
          "correct": false
        },
        {
          "text": "RACI matrix",
          "correct": false
        },
        {
          "text": "Resource management plan",
          "correct": true
        },
        {
          "text": "Resource requirements",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a business transformation project at a company facing significant financial challenges due to a declining market share. The project manager's stakeholders are skeptical of the need for change and are reluctant to invest in the project. What should the project manager do to demonstrate the urgency and benefits of the change?",
      "explanation": "The correct answer is to develop a feasibility study that quantifies the benefits of the project and links it to the company's objectives because this study provides an in-depth and clear analysis of the financial and non-financial benefit of the project. \n\n-  Through this study, concrete data and figures are presented showing how the project will contribute to improving the company's financial position and increasing its market share, helping stakeholders overcome doubts and concerns.\n- The feasibility study enhances confidence in the project and clarifies the expected return, which facilitates investment decision-making.\n\nWhy are other options less suitable?\n- Creating a detailed communication plan is an important part of communication but does not provide objective proof of benefits.\n- Delegating tasks and providing resources deals with implementation, not with convincing stakeholders.\n- Regular meetings with stakeholders improves dialogue but may not be sufficient if it is not supported by strong evidence of project feasibility.",
      "choices": [
        {
          "text": "Create a detailed communication plan outlining project goals, milestones, and benefits.",
          "correct": false
        },
        {
          "text": "Delegate tasks and provide necessary resources to team members for success.",
          "correct": false
        },
        {
          "text": "Hold regular stakeholder meetings to keep them updated and address their questions.",
          "correct": false
        },
        {
          "text": "Develop a business case quantifying project benefits and aligning with company goals.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is developing a breakthrough product in a highly competitive and rapidly evolving market. The project manager acknowledges that, due to the significantly competitive environment, the definition of done (DoD) is likely to shift. What should the project manager do to ensure the project's successful delivery of value?",
      "explanation": "The correct answer is to implement robust procedures to track and report project progress.\n\n- Why: In a competitive and rapidly changing environment, it is necessary to have continuous monitoring and evaluation mechanisms to ensure that the product is in line with changing market demands and renewed expectations from stakeholders.\n- Tracking and reporting procedures allow deviations or changes to be detected early, enabling the team to quickly adapt to new requirements or adjust the completion definition in line with market priorities.\n\nWhy are other options inappropriate?\n- Expanding schedule and budget may delay delivery and cost the project additional resources that are not guaranteed.\n- Allocating additional resources without a clear plan may lead to inefficiency and high costs without ensuring product quality.\n- Restricting the scope of the project can reduce the value of the product and make it unsuitable for the changing market, negatively affecting commercial success.",
      "choices": [
        {
          "text": "Implement robust project tracking and reporting procedures.",
          "correct": true
        },
        {
          "text": "Expand the project timeline and budget to address potential risks.",
          "correct": false
        },
        {
          "text": "Allocate additional resources to expedite product development.",
          "correct": false
        },
        {
          "text": "Restrict project scope and focus on meeting project deadlines.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key stakeholder requests new features to be added to a product during the project implementation phase. The stakeholder insists that the new features will add value to the product.nnWhat should the project manager do first?",
      "explanation": "The correct answer is to evaluate and review the impact of changes on the project budget and schedule because any new addition can affect the project scope, resources, schedule, and budget.\n\n- Impact assessment helps the project manager understand the feasibility of the change, and ensure that the change does not threaten the success of the project.\n- This procedure allows for an informed decision to be made before any change is implemented.\n\nOther options are less suitable because:\n. Meeting with the project sponsor may be a subsequent step after the evaluation.\n- Reviewing the stakeholder engagement plan does not solve the immediate problem of evaluating the change.\n- Implementing the change directly without an assessment may lead to risks and negative impact on the project.",
      "choices": [
        {
          "text": "Meet with the project sponsor to discuss the benefits of the new features.",
          "correct": false
        },
        {
          "text": "Review the stakeholder engagement plan to determine the key stakeholder's level of involvement.",
          "correct": false
        },
        {
          "text": "Assess and review how the changes will impact the project budget and schedule.",
          "correct": true
        },
        {
          "text": "Implement the change and document the outcome in the lessons learned repository.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is a part of a large business transformation project. The project's main goal is to increase production and create capacity to bring new products to the market. The project manager notices during a lunch break that employees are discussing the changes introduced by the project and are afraid that they will result in staff layoffs, even though it is not true.nnWhich groups should the project manager contact to address this concern and ensure that the project meets its goal? (Choose 3).",
      "explanation": "The correct answers are:\n\n- Human Resources (HR) Department to request support in addressing the problem: Because HR is responsible for managing employee concerns and communicating about changes that affect them.\n-  Change Manager to modify the communication management plan: Because it is responsible for directing the communication plan and making sure that messages fit the situation and remove concerns.\n- Functional managers for employees to seek support in explaining the change: Because they communicate directly with employees and can clarify changes and provide support.\n\nWhy is the option of functional managers for employees to include the problem in the performance appraisal incorrect?\n- Because including concerns in performance appraisal may increase stress and fear in employees, and does not address the real cause of the fears.\n\nThe sponsor's choice to request executive support and reinforce clarification may be useful but is not a priority to directly address employee concerns in this case.",
      "choices": [
        {
          "text": "The human resources (HR) department to ask for support to resolve the issue",
          "correct": true
        },
        {
          "text": "The change manager to revise the communications management plan",
          "correct": true
        },
        {
          "text": "The employees' functional managers to include the issue in their performance reviews",
          "correct": false
        },
        {
          "text": "The employees' functional managers to ask for support in explaining the change",
          "correct": true
        },
        {
          "text": "The sponsor to ask for executive support and reinforcement",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the implementation phase of a project, the project manager receives news that a team lead will be leaving the organization. The project sponsor has been made aware and has suggested a replacement. What is the first action the project manager should take in response to this change?",
      "explanation": "The correct answer is to review the basic plans of the project to assess the impact of the change.\n\n- Why: The project manager must first understand the impact of the team leader's departure on the schedule, resources, and scope of work, by reviewing basic plans such as the resource plan and the project management plan.\n- This evaluation helps determine if additional adjustments or actions are needed.\n\nWhy are other options not suitable?\n- Determining the level of competence of the proposed resource is an important step but comes after understanding the impact of the change.\n- Documenting the change according to the change management plan should be done after the impact assessment and approval of the change.\n- Modifying the communication management plan is a subsequent procedure that reflects the changes after the appropriate decision has been made.",
      "choices": [
        {
          "text": "Determine the competence levels of the suggested new resource.",
          "correct": false
        },
        {
          "text": "Review the project baselines to assess the impact of the change.",
          "correct": true
        },
        {
          "text": "Document the change according to the change management plan.",
          "correct": false
        },
        {
          "text": "Edit the communications management plan to reflect the change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the development of a project management plan, the project team inadvertently omitted an essential component required for a product. The team quickly developed a workaround, but during a quality compliance review, the project management office (PMO) determined that the workaround was not effective.nnWhat should the project manager do?",
      "explanation": "The correct answer is to follow the formal Integrated Change Control process and submit a change request to the Change Control Committee (CCB).\n\n- Reason: The workaround is ineffective, so you must return to the formal change control process to ensure that any modification is systematically studied, evaluated, and approved by the Change Control Committee.\n- This procedure preserves the integrity of the project and ensures that the changes are properly documented.\n\nWhy are other options inappropriate?\n- Designing a modified model of the alternative solution may be useful later, but it must be done after the formal approval of the change.\n- Reviewing the requirements tracking matrix is an important step, but not the first solution when there is a problem with the proposed solution.\n- Conducting a qualitative risk analysis is important but should be part of the change control process and not a substitute for it.",
      "choices": [
        {
          "text": "Design a revised prototype of the workaround with a new modification to resolve the issue.",
          "correct": false
        },
        {
          "text": "Review the requirements traceability matrix to determine the business value of the missing component.",
          "correct": false
        },
        {
          "text": "Follow the formal integrated change control process to submit a change request to the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Perform a qualitative risk analysis to assess the impact of designing a \nreplacement for the workaround.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A software development project is in the testing phase. New government regulation requires that additional documentation be delivered under the contract.nnWhat should the project manager do first?",
      "explanation": "The correct answer is: submit a change request.\n\n- Reason: The new government regulation represents an external change that affects the scope of the project. According to integrated change management, a **formal change request** must be submitted to the Change Control Committee (CCB) to assess the impact of the change on scope, schedule, cost, and quality.\n- The contract or requirements cannot be modified without going through the formal change procedures to ensure compliance and documentation.\n\nWhy are other options inappropriate?\n- Terminating the project is a radical and unjustified decision at this stage; organizational change does not require discontinuation but adaptation.\n- Updating the timeline projections may be required later, but should only occur after the change request has been evaluated and accepted.\n- Reviewing the project budget is the next step after assessing the financial impact of the change, but it is not the first step.",
      "choices": [
        {
          "text": "Terminate the project.",
          "correct": false
        },
        {
          "text": "Submit a change request.",
          "correct": true
        },
        {
          "text": "Update the schedule forecast.",
          "correct": false
        },
        {
          "text": "Review the project budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer representative asks the project manager for a new product feature. Which document should the project manager consult?",
      "explanation": "The correct answer is: Change Management Plan.\n\n- Why: Requesting a new feature from the customer is a change in the scope of the project, and must be handled through the formal change management procedures according to the PMBOK Guide.\n-  The change management plan outlines the steps needed to deliver changes, the responsible entities (such as CCB), and how to assess the impact of the change on scope, time, and cost.\n\nWhy are other options incorrect?\n- Domain management plan: Describes how to define and document the scope, but does not explain how to handle changes after it is approved.\n-  RACI matrix: Used to define responsibilities, not to manage changes.\n- Requirements tracking matrix: Helps keep track of approved requirements, but does not provide a mechanism for accepting or rejecting new changes.",
      "choices": [
        {
          "text": "Scope management plan",
          "correct": false
        },
        {
          "text": "Change management plan",
          "correct": true
        },
        {
          "text": "RACI matrix",
          "correct": false
        },
        {
          "text": "Requirements traceability matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is leading a large business transformation project that involves the entire organization. The project manager is working on the communications management plan.nnWhich two elements should the project manager consider while planning communications? (Choose 2).",
      "explanation": "The correct answers are: collect feedback and multiple communication channels.\n\n- When planning communications, the project manager must think about how to ensure that messages are delivered effectively to all parties involved, which requires the use of various channels that suit each party's preferences.\n- Collecting feedback also helps to evaluate the effectiveness of communication and adjust its methods to ensure that messages are clear and understandableOther options such as key messages, goals, and values are important but are determined later, not direct planning priorities.\nThe best communication channel is misleading, because best practices require the use of multiple channels, not just one.",
      "choices": [
        {
          "text": "Key messages",
          "correct": false
        },
        {
          "text": "Objectives and values",
          "correct": false
        },
        {
          "text": "Collecting feedback",
          "correct": true
        },
        {
          "text": "Multiple communication channels",
          "correct": true
        },
        {
          "text": "Best communication channel",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the project planning phase, the stakeholders neglected to document an essential system feature. The client realizes the oversight during an initial review of the deliverables.nnWhat should the project manager do?",
      "explanation": "The correct answer is: determine the effect of the omission and submit a change request to the Change Control Committee (CCB).\n\n- This omission is a change in scope after implementation begins, so the formal change management process must be followed.\n- The change may not be entered directly or the price negotiated without going through the procedures adopted to assess the impact on scope, time and cost.\n\nThe option to review the procurement management plan is irrelevant, as the feature is not part of the contracts.\nNegotiating a price reduction or price adjustment without a formal assessment violates change management practices.",
      "choices": [
        {
          "text": "Review the procurement management plan to determine if the missed feature can be added to the final deliverables.",
          "correct": false
        },
        {
          "text": "Determine what effect overlooking the feature will cause and submit a change request to the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Ask the project sponsor to authorize a price discount for the client.",
          "correct": false
        },
        {
          "text": "Work with the customer to agree on a new price to compensate for the omission.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After reviewing the project management plan with key stakeholders, the project manager was told that an 18-month release plan was unacceptable and the product should launch in six months.nnWhat should the project manager do first?",
      "explanation": "The correct answer is: analyze the impact of shrinking the timeline on project scope, budget, and resources.\n\n- When faced with a drastic change in the timeline like this, the first step that the project manager should take is to conduct an impact analysis to determine the extent to which the scope of work, cost, resources, and quality of results are affected.\n- Based on the analysis, alternatives such as reducing scope or increasing resources can be discussed.\n\nOther options such as hiring additional resources or negotiating directly are not appropriate decisions without a full understanding of the impact of change.",
      "choices": [
        {
          "text": "Analyze the impact of the shortened timeline on the project scope, budget, and resources.",
          "correct": true
        },
        {
          "text": "Renegotiate the project scope with the stakeholders to reduce the amount of work to be done.",
          "correct": false
        },
        {
          "text": "Hire additional resources to help complete the project on time.",
          "correct": false
        },
        {
          "text": "Work with the stakeholders to agree on a new release date that is more realistic.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project involving seven partners is falling behind schedule. The steering committee decides that all conflict resolution attempts must be sped up and requests that the project manager remove the requirement for all parties to make concessions.nnWhat should the project manager do?",
      "explanation": "The correct answer is: the abolition of the compromise technique.\n\n The compromise method is based on each party making concessions in order to reach an agreement, but since the steering committee requested the removal of concessions, this means that this method is no longer acceptable. Therefore, the project manager should stop using this method and focus on other, more effective methods such as cooperation or enforcement.\n\nThe withdrawal/avoidance option does not require concessions but aims to postpone the conflict. De-escalation/assimilation means that one party is conceding and not both. Imposition does not depend on concessions but on imposing a unilateral solution.",
      "choices": [
        {
          "text": "Eliminate the withdraw/avoid technique.",
          "correct": false
        },
        {
          "text": "Eliminate the smooth/accommodate technique.",
          "correct": false
        },
        {
          "text": "Eliminate the force/direct technique.",
          "correct": false
        },
        {
          "text": "Eliminate the compromise/reconcile technique.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex software project. Two team members must team up and work together on a critical module of the project. Before long, the two team members begin to argue and these arguments are impeding progress. How should the project manager resolve this conflict?",
      "explanation": "The correct answer is: schedule a group meeting to discuss the problem publicly and reach a solution.\n\nThe best practice in managing conflicts within a team is to deal with them directly through collaboration. Holding a group meeting helps the team understand the causes of disagreement and address them in a collaborative way that enhances the team's performance.\n\nIgnoring the conflict can increase tension. Separating tasks does not address the root cause. Organ transplantation is an excessive procedure that is only recommended if cooperative solutions have been exhausted.",
      "choices": [
        {
          "text": "Ignore the conflict and hope that they can work it out on their own.",
          "correct": false
        },
        {
          "text": "Assign them to work separately on different tasks to avoid further conflicts.",
          "correct": false
        },
        {
          "text": "Schedule a team meeting to discuss the issues openly and find a resolution.",
          "correct": true
        },
        {
          "text": "Reassign one of them to a different project to eliminate the conflict entirely.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a meeting with project stakeholders, two stakeholders have a disagreement regarding how a software component is being developed. The disagreement escalates as the stakeholders raise their voices.nnWhat should the project manager do in this situation?",
      "explanation": "The correct answer is: determine the cause of the dispute, try to calm the situation and focus on finding a common solution.\n\nWhen a sharp conflict arises between stakeholders during the meeting, the role of the project manager is to calm down directly and then try to understand the roots of the disagreement and work on a solution that satisfies both parties without escalation.\n\nEnd the meeting without a solution that leaves the conflict in place. Voting is not suitable for emotional disputes. Escalating the problem to the sponsor at this stage is considered haste and weakness in managing disputes.",
      "choices": [
        {
          "text": "Adjourn the meeting and meet with the other stakeholders on how to proceed.",
          "correct": false
        },
        {
          "text": "Identify what is causing the conflict, attempt to de-escalate the situation, and focus on finding a common solution.",
          "correct": true
        },
        {
          "text": "Take detailed notes of both stakeholders' positions and ask the remaining stakeholders to vote on the best option.",
          "correct": false
        },
        {
          "text": "Inform the sponsor about the conflict and ask them to find a solution.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is acting as a scrum master in a hybrid project and is dealing with a conflict between team members. What strategy should be used to handle this conflict?",
      "explanation": "The correct answer is: organize disputes into two categories: structural and personal.\n\nScrum Master needs to understand the nature of the conflict to determine the appropriate way to deal with it. Structural conflicts are related to roles or processes, while interpersonal conflicts are related to relationships and communication.\n\nClassifying conflicts into positive and negative is ineffective because it does not provide a radical solution. Placing conflicts in a visual list can embarrass individuals. Discussing them in a daily standing meeting is inappropriate to the nature of that meeting.",
      "choices": [
        {
          "text": "Place conflicts on a shared conflict list and ensure it is visible.",
          "correct": false
        },
        {
          "text": "Sort conflicts into two groups: positive and negative.",
          "correct": false
        },
        {
          "text": "Review conflicts during the daily standup.",
          "correct": false
        },
        {
          "text": "Organize conflicts into two categories: structural and interpersonal.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that the project team is involved in an ongoing conflict with an overseas supplier team. The conflict is beginning to impact the performance of the project team.n After reviewing the team charter, what should the project manager do next?",
      "explanation": "The correct answer is: Organize a virtual meeting with the vendor team to address and resolve the conflict.\n\nAfter reviewing the team charter that clarifies the code of conduct and communication obligations, direct action must be taken to resolve the dispute. Organizing a virtual meeting with the vendor team allows open communication, identifying points of disagreement, and reaching an agreed solution that improves performance.\n\nOther options such as in-person meeting or email sending do not provide the dynamic interaction required to resolve the conflict quickly and efficiently. Sending a purchase agreement does not address the practical or cultural dispute that causes the dispute.",
      "choices": [
        {
          "text": "Meet with the manager of the supplier team in person to find a resolution.",
          "correct": false
        },
        {
          "text": "Organize a virtual meeting with the supplier team to address and resolve the conflict.",
          "correct": true
        },
        {
          "text": "Send a copy of the procurement agreement to the manager of the supplier team.",
          "correct": false
        },
        {
          "text": "Send an email to the manager of the supplier team explaining the issue and asking for a response.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the initial planning phase of a complex development project, a project team has identified several stakeholders, including the project sponsor, end-users, regulatory authorities, and the development team. What should the project manager do to ensure that they have a thorough understanding of the various degrees of influence these stakeholders have on project requirements?",
      "explanation": "The correct answer is: Hold a workshop with stakeholders to discuss and prioritize project requirements collectively.\n\nHolding a workshop is a collaborative requirements gathering tool that allows gathering multiple perspectives, setting expectations, prioritizing, and building collective consensus. This method is best used in complex projects that require technical and organizational consensus.\n\nInterviewing or sending questionnaires may be appropriate in some cases, but it does not reflect the interactivity required at this stage. Reviewing previous projects is useful but does not give a current or accurate understanding of each stakeholder's impact.",
      "choices": [
        {
          "text": "Conduct one-on-one interviews with each stakeholder to gather their input and preferences.",
          "correct": false
        },
        {
          "text": "Send a questionnaire to stakeholders to gather their feedback on project requirements.",
          "correct": false
        },
        {
          "text": "Hold a stakeholder workshop to discuss and prioritize project requirements collectively.",
          "correct": true
        },
        {
          "text": "Review historical project documents to identify stakeholder influence patterns.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager's last IT transformation project was canceled due to a misalignment of a business process with the accounting department. A similar project will begin soon, and a process alignment activity will be planned to identify potential scope changes.nnWhat should the project manager do to ensure a collaborative and incremental approach to the process alignment work is utilized?",
      "explanation": "The correct answer is: Plan for early iterations in the project that allow multiple stakeholders to agree on process modification steps.\n\nWhen implementing complex projects such as digital transformation, it is important to integrate stakeholders from the outset in formulating solutions through early iterations or development cycles. This ensures that the proposed solutions are aligned with business needs, and prevents subsequent project cancellation.\n\nIdentifying external experts or planning for immediate or delayed adaptation does not guarantee effective internal participation and does not reflect the nature of the progressive iterative development advocated by Agile and PMI.",
      "choices": [
        {
          "text": "Identify an external expert team to research and apply best practices in adapting businesses to IT transformation.",
          "correct": false
        },
        {
          "text": "Plan for an early, two-week activity where impacted units work together to finalize adaptations to the business processes.",
          "correct": false
        },
        {
          "text": "Plan for iterations early in the project to allow cross-functional stakeholders to agree on steps to adapt the business processes.",
          "correct": true
        },
        {
          "text": "Plan for iterations late in the project to allow cross-functional stakeholders to adapt the processes according to delivered work.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "When a project manager finishes the Identify Stakeholders process, which of the following is the main output?",
      "explanation": "The correct answer is: a record containing the name, area of interest, and level of positive or negative impact of each stakeholder.\n\n The official product of the stakeholder identification process is the  Stakeholder Register, which includes key information such as name, position, interests, level of influence, and appropriate strategy for engaging them. This log is an essential input to the stakeholder engagement planning process.\n\nThe option for change requests concerns other processes such as project implementation. The stakeholder engagement plan is not produced at this stage but at a later stage. Updates to project documents occur after the record is identified, not in lieu of it.",
      "choices": [
        {
          "text": "A registry with the name, area of interest, and level of positive or negative influence that each stakeholder will have on the project, among others",
          "correct": true
        },
        {
          "text": "A document with change requests for the product, project management plan, or project documents",
          "correct": false
        },
        {
          "text": "A stakeholder engagement plan that identifies the strategies and actions required to promote productive involvement of stakeholders in decision making and execution",
          "correct": false
        },
        {
          "text": "Project documents updates, such as the assumption log, issue log, and risk register",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product owner has been attending daily standups but seems focused only on the budget and costs of each iteration. When addressing these inquiries, the project manager explains the rationale of the spend and the impact on the product development. The product owner does not seem interested in the rationale, only in the amount spent.nnWhat should the project manager do in this scenario?",
      "explanation": "The correct answer is: meet with the product owner to make them aware of the value of the project, not just its cost.\n\nIt is important that the project manager helps the product owner understand how costs relate to value realized, such as progress in accomplishing features or achieving business goals. Focusing only on numbers without considering added value can lead to unbalanced decisions.\n\nModifying daily meetings or sending detailed reports may temporarily satisfy their financial curiosity, but they do not address the root of the problem: the owner's lack of strategic understanding. Daily meetings are not intended to review the budget in detail.",
      "choices": [
        {
          "text": "Adjust the daily standups to first address the budget, then discuss the project status once the product owner leaves the meeting.",
          "correct": false
        },
        {
          "text": "Modify the communications management plan to send daily budget status updates to the product owner.",
          "correct": false
        },
        {
          "text": "Meet with the product owner to educate them on the value delivered by the project, not just the cost of development.",
          "correct": true
        },
        {
          "text": "Breakout the budget to reflect daily spend and provide this to the product owner to address their concerns.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A marketing team has identified the target audience for their company's new website. This audience is varied and geographically disperse, but the marketing team wants to compile a statistical analysis quickly.nnWhat tool or technique should the project manager use to gather this information?",
      "explanation": "The correct answer is: questionnaire.\n\nQuestionnaires are one of the best tools to collect quantitative and statistical information from a wide and geographically dispersed audience in a short time. They can be designed with closed questions that facilitate analysis using statistical tools.\n\nFocus groups and interviews are qualitative rather than statistical, and require more time and direct organization. Benchmarking does not collect data from the audience, but rather uses external data to compare performance or practices.",
      "choices": [
        {
          "text": "Focus groups",
          "correct": false
        },
        {
          "text": "Questionnaire",
          "correct": true
        },
        {
          "text": "Interview",
          "correct": false
        },
        {
          "text": "Benchmarking",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Stakeholders in a multinational project are experiencing cross-cultural misunderstandings. A seemingly small cultural misinterpretation during the planning phase resulted in the failure to approve the project management plan. What should the project manager have done to avoid this situation?",
      "explanation": "The correct answer is: hold a workshop with stakeholders before the first meeting to develop a common language of communication.\n\nIn multicultural projects, it is important to establish a language that is understandable and acceptable to all, not only in terms of the language used, but in terms of style, symbols, expectations, and cultural context. The workshop helps build trust and reduce interpretive gaps early.\n\nMonitoring communication or reviewing cultural errors are subsequent reactions rather than effective proactive actions. Avoiding misunderstandings should be done before they happen, not after them.",
      "choices": [
        {
          "text": "Reviewed the lessons learned register to understand previous cultural mistakes made by the organization.",
          "correct": false
        },
        {
          "text": "Researched common cultural mistakes made when dealing with stakeholders from the countries involved with the project.",
          "correct": false
        },
        {
          "text": "Monitored direct and indirect communication during initial interactions to minimize the chance of a misunderstanding.",
          "correct": false
        },
        {
          "text": "Held a workshop with the stakeholders before the initial meeting to develop a common communication language.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "How does a project manager increase the likelihood of a project being a success?",
      "explanation": "The correct answer is: Get the support of stakeholders from the start.\n\nGetting the commitment and support of key stakeholders promotes alignment around goals, facilitates the removal of barriers, and helps in effective decision-making throughout the project lifecycle. This is one of the most important success factors according to PMI research.\n\nThe option to create a large budget reserve may be seen as unjustified inflation. Overestimating efficiency may create unrealistic expectations. Changing the governance committee continuously harms stability and strategic direction.",
      "choices": [
        {
          "text": "Over-estimating resource competencies needed for project delivery.",
          "correct": false
        },
        {
          "text": "Get stakeholders buy-in from the start.",
          "correct": true
        },
        {
          "text": "Constantly changing the membership of the governance team.",
          "correct": false
        },
        {
          "text": "Create a large budget contingency.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the middle of a three-year-long project, the company committee overseeing the project becomes uncertain about whether the final outcome will meet their expectations and provide the anticipated value. As the project manager, what proactive step can you take to address the committee's concerns and ensure that the project delivers the expected value?",
      "explanation": "The correct answer: a statement of the scope of the project because it details what final deliverables will be delivered and what is outside the scope. This statement is a key input to the project charter because it explains the key results required. While the feasibility study assesses the feasibility of implementing the project in terms of value or return, it does not contain a detailed description of the outputs. The agreements describe the obligations of the parties but are not designed to explain the results. The project schedule is developed later during planning and not in the project charter.",
      "choices": [
        {
          "text": "Extend the project timeline to allow for more thorough testing.",
          "correct": false
        },
        {
          "text": "Develop a prototype to present to the committee.",
          "correct": true
        },
        {
          "text": "Increase the project budget to accommodate potential changes.",
          "correct": false
        },
        {
          "text": "Update the project schedule with detailed milestones.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team meeting is focused on examining if the business value and vision for a project are being delivered by all parties. During the meeting, it was discovered that a few team members were unaware of the project's vision and business value.n What should the project manager do to ensure everyone is aware of the vision and business value the project is expected to bring moving forward?",
      "explanation": "The correct answer: obtaining the approval of the project charter, as the project manager may only start planning, allocating resources or inviting meetings after obtaining official authorization from the sponsor or higher authority. This consent makes the charter an official document. The starting meeting is held later after approval. Risk register development and WBS are processes within the project plan, conducted after the start of the planning phase rather than before, and therefore do not precede the approval of the charter.",
      "choices": [
        {
          "text": "Schedule regular meetings between the team and senior management to remind them what the vision and business value are.",
          "correct": false
        },
        {
          "text": "Tell the team members to refer to the company vision statement and other high-level strategy documents for clarity.",
          "correct": false
        },
        {
          "text": "Hold the team accountable as they have had ample time to become aware of the project vision and business value.",
          "correct": false
        },
        {
          "text": "Engage with the team regularly regarding the business case and ensure that all doubts are addressed properly and cleared.",
          "correct": true
        }
      ]
    },
    {
  "type": "multiple-choice",
  "text": "A development project's earned value is US$640,000, and the planned value is US$800,000. What should the project manager do to control this variance?",
  "explanation": "The correct answer is: Use project performance measurement and decide on corrective actions. Since the earned value (EV) is less than the planned value (PV), the project is behind schedule. The project manager should use tools such as schedule performance index (SPI = EV/PV) and variance analysis to assess the situation and then take corrective actions such as adjusting resources or schedules to bring the project back on track. The other options either bypass analysis or misallocate funds without a clear corrective plan.",
  "choices": [
    {
      "text": "Calculate the earned value and change the project baseline to reflect the latest project status.",
      "correct": false
    },
    {
      "text": "Reallocate US$160,000 to project tasks that are behind schedule.",
      "correct": false
    },
    {
      "text": "Use project performance measurement and decide on corrective actions.",
      "correct": true
    },
    {
      "text": "Release US$160,000 to the supplier to fast-track the project so that it is completed on time and within budget.",
      "correct": false
    }
  ]
},
    {
      "type": "multiple-choice",
      "text": "A project manager has identified a misalignment with the strategic and business objectives in the project charter and recognizes the need for realignment.nnWhat should the project manager do?",
      "explanation": "Correct answer: Discuss the problem during the regular stakeholder feedback meeting and take action to address it. This action ensures that the decision is made based on a collective and comprehensive assessment within the governance of the project. A team member may not be dismissed directly without evaluating performance in accordance with the established procedures. Acknowledging the problem or justifying the member to the user does not address the root cause. The decision should be based on the analysis and involvement of stakeholders, not just an emotional response to the end user's request.",
      "choices": [
        {
          "text": "Review with the project team and make corrections in the project charter.",
          "correct": false
        },
        {
          "text": "Review with the stakeholders and make corrections in the project charter.",
          "correct": false
        },
        {
          "text": "Escalate to the project sponsor so they can provide support and final approval.",
          "correct": true
        },
        {
          "text": "Submit a formal change request to correct and update the project charter.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager just started managing agile projects. The project manager realizes that due to the lack of a clear definition of project objectives and definition of done (DoD), their colleague's projects have had many difficulties. Sponsors keep asking for more features and the project is yet to be completed.nnWhat should the project manager do to avoid these issues?",
      "explanation": "The correct answer: For the effective performance of the team, feedback is provided regularly and continuously. In hybrid projects that mix agile and predictive, project success depends on speed of adaptation and continuous improvement. Regular feedback allows behavior modification, quality of deliveries, and enhanced collaboration between team members and stakeholders. Limiting yourself to internal meetings or predetermined timings is not in line with the hybrid environment that requires constant repetition and interaction. Providing feedback only after each delivery is limited because teams need performance information continues to evolve.",
      "choices": [
        {
          "text": "Arrange meetings to ensure every task to complete the project is included in the project management plan.",
          "correct": false
        },
        {
          "text": "Convince the project sponsor to incorporate quality experts so the product can be tested and accepted as completed.",
          "correct": false
        },
        {
          "text": "Convince the product owner to approach the team and define project objectives.",
          "correct": false
        },
        {
          "text": "Schedule meetings with key stakeholders to build the agile project charter and set clear expectations for the project.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company contracts a software vendor to implement and customize a new software application and assigns a project manager to initiate and lead the project. Which of the following inputs to the project charter describes the key deliverables?",
      "explanation": "Correct answer: Share feedback and performance results. In a  continuous delivery environment, team members feel motivated when the criteria for success are clear and are given a periodic evaluation of their performance. Ambiguity leads to frustration and lack of self-confidence, which impairs productivity. Sharing regular feedback helps build clarity, motivate the team, and guide individuals toward improvement. Explaining the general rules or offering incentives is not enough if performance is not linked to real results. Team building strategies are important but come as a later stage to support a clear environment Forecasts and assessments.",
      "choices": [
        {
          "text": "Business case",
          "correct": false
        },
        {
          "text": "Agreements",
          "correct": false
        },
        {
          "text": "Project scope statement",
          "correct": true
        },
        {
          "text": "Project schedule",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After completing the project charter, the project manager sends it to the project stakeholders. What should the project manager do before starting the project planning process?",
      "explanation": "Correct answer: Get project charter approval.\n\n- Why is this the correct answer?\nBecause the project charter does not become binding or formal until it is approved by the concerned authorities such as the sponsor or senior management. Without this approval, the project manager is not entitled to start the planning process.\n\n- Why are the other answers wrong?\n• A project start-up meeting is usually held after the project plan is completed, not before.\n•  The development of the risk register takes place during the planning phase.\n•  The establishment of a work breakdown structure (WBS) is also part of the planning, and only begins after the project charter is approved.",
      "choices": [
        {
          "text": "Conduct the project's kick-off meeting.",
          "correct": false
        },
        {
          "text": "Develop the risk register.",
          "correct": false
        },
        {
          "text": "Create the work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Obtain project charter approval.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager is developing a resource management plan but is unfamiliar with skill sets required by the project. How would engage SMEs help the project manager create a resource management plan?",
      "explanation": "The correct answer: by enabling the project manager to identify the skills required to achieve the project objectives.\n\n- Why is this the correct answer?\nSubject matter experts (SMEs) have technical or specialized expertise that enables them to identify the human and technical skills needed by the project. This is necessary for the identification and allocation of resources.\n\n- Why are the other answers wrong?\n• Showing how to identify organizational assets is not the purview of SMEs.\n• Understanding power relationships is more related to organizational structure, not skills identification.\n• Virtual team management is about resource management but is not directly related to identifying the required skills.",
      "choices": [
        {
          "text": "By showing the project manager how to determine organizational process assets.",
          "correct": false
        },
        {
          "text": "By helping the project manager to understand authority relationships specified in project organization chart.",
          "correct": false
        },
        {
          "text": "By enabling the project manager to determine the required skill sets to meet project objectives.",
          "correct": true
        },
        {
          "text": "By enabling the project manager to manage virtual teams of skilled personnel.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During one of the final incremental deliveries of a project, the end user informed the project leader that they are not satisfied with the outcome and asked to remove a team member which is causing an unfavorable outcome.nnWhat should the project leader do?",
      "explanation": "Correct answer: Discuss the issue during the regular stakeholder feedback meeting and take action to resolve it.\n\n- Why is this the correct answer?\nBecause making individual decisions based on only one request may lead to other problems in the project. These matters should be discussed formally and systematically in ad hoc meetings, so that all parties are heard and the situation is fairly assessed. This method supports transparency and good governance.\n\n- Why are other options wrong?\n• Acknowledging the problem and promising to solve it without discussion within the team may lead to ill-considered decisions.\n• Informing the end user that the member is a key element with the promise of solving the problem lacks a real remedy of the situation.\n• Removing the member directly without internal evaluation may weaken the team and create a sense of injustice or transparency.",
      "choices": [
        {
          "text": "Acknowledge the fact, and promise the end user the issue will be resolved.",
          "correct": false
        },
        {
          "text": "Inform the end user that this is a key member, and promise the issue will be resolved.",
          "correct": false
        },
        {
          "text": "Remove the team member as requested to not delay the acceptance.",
          "correct": false
        },
        {
          "text": "Discuss the issue during the regular stakeholder feedback meeting and take action to resolve the issue.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "For a hybrid project, when should feedback be provided?",
      "explanation": "Correct answer: For effective team performance, feedback is provided regularly and continuously.\n\n- Why is this the correct answer?\nIn hybrid projects that combine predictive and agile elements, team successes rely heavily on process improvement and continuous learning. Continuous feedback enables the team to adapt and improve performance quickly and gradually.\n\n- Why are other options wrong?\n• Linking feedback to a performance measurement plan only may make it constrained and inflexible.\n• Limiting the responsibility for feedback to the project manager obscures the role of the team and stakeholders.\n• Waiting for each delivery to provide feedback means wasting opportunities for improvement in the work.",
      "choices": [
        {
          "text": "The timing for feedback depends on the performance measurement plan set by the project lead at the start of the project.",
          "correct": false
        },
        {
          "text": "The project manager is responsible for communicating feedback during internal meetings.",
          "correct": false
        },
        {
          "text": "With each delivery, the project leader is supposed to receive feedback from the stakeholders and share it with the team.",
          "correct": false
        },
        {
          "text": "For the effective performance of the team, feedback is provided on a regular and continuous basis.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Working in a continuous delivery environment, a project leader notices that one of the key team members is experiencing low morale, affecting the project delivery and causing a serious delay in the project schedule. While discussing the issue with the team member, the project leader discovers the team member's attitude is because of uncertainty in relation to the performance review set of criteria.nnWhat should the project leader have done to avoid this situation?",
      "explanation": "Correct answer: Share feedback and performance results.\n\n- Why is this the correct answer?\nBecause clarifying performance expectations and sharing performance appraisal results on an ongoing basis contributes to keeping team morale high and prevents misunderstandings that lead to decreased productivity.\n\n- Why are other options wrong?\n• Explanation of ground rules does not cover the aspect of performance appraisal.\n• Informing the team about rewards and incentives alone does not address the problem of lack of clarity about performance.\n• Defining team-building strategies is important, but in this context the cause of the problem is performance evaluation and not teamwork.",
      "choices": [
        {
          "text": "Explain the ground rules of the team.",
          "correct": false
        },
        {
          "text": "Inform the team about incentives and rewards.",
          "correct": false
        },
        {
          "text": "Share feedback and performance results.",
          "correct": true
        },
        {
          "text": "Define the team-building strategies.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A marketing team is developing ideas in order to revamp an existing product. The marketing executive reaches out to the project manager to make sure that necessary measures are in place for a successful launch.nnWhat should the project manager focus on?",
      "explanation": "Correct answer: Identify and coordinate performance indicators that will help evaluate the success of delivery.\n\n- Why is this the correct answer?\nBecause successful launch requires clear KPIs to monitor performance, quality, and results after launch.\n\n- Why are other options wrong?\n• The scope management plan is important but does not focus on the success of the launch.\n• The change management plan is necessary but the context here is about evaluating success.\n• Periodic updates help with follow-up but are not sufficient to evaluate the final performance.",
      "choices": [
        {
          "text": "Ensuring that the scope management plan is in place to cover all related objectives.",
          "correct": false
        },
        {
          "text": "Ensuring that the team is also focused on the overall change management plan.",
          "correct": false
        },
        {
          "text": "Planning for regular project updates to cover the status of critical deliverables.",
          "correct": false
        },
        {
          "text": "Determining and aligning performance indicators that will help in assessing successful delivery.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a functional organization, a product analyst is assigned to a short-duration application development effort. The analyst expresses concerns about the task and asks the project manager to provide the support of a peer with expertise in this domain.nnWhat should the project manager do?",
      "explanation": "Correct answer: Ensure that periodic meetings are held between the analyst and the other member throughout the execution of the task.\n\n- Why is this the correct answer?\nBecause ongoing technical support enhances analyst confidence and ensures knowledge transfer without disrupting the project or replacing people.\n\n- Why are other options wrong?\n• Reassigning the task may create a new load and affect the balance.\n• Enrolling the analyst in a training program may not be practical in a short-term project.\n• Moving work after the start of implementation causes a loss of continuity and affects quality.",
      "choices": [
        {
          "text": "Recognize the analyst's concerns and reassign the task to another team member.",
          "correct": false
        },
        {
          "text": "Enroll the analyst in a capacity-building program, and keep this analyst assigned to the task.",
          "correct": false
        },
        {
          "text": "Ask the analyst to use skills to develop the tool, then move development to another team member.",
          "correct": false
        },
        {
          "text": "Make sure the analyst has regular pairing meetings with the other team member throughout task execution.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A recently assigned project manager is working on detailing out all requirements and estimating each task required to complete the implementation of a healthcare system across three countries. The project manager needs this information to create the project schedule.nnWhat approach is the project manager using?",
      "explanation": "Correct answer: Traditional).\n\n- Why is this the right choice?\nBecause the project relies on defining all requirements in detail in advance, which reflects the characteristics of the traditional approach that focuses on full advance planning before implementation.\n\n- Why are other options wrong?\n•  Agile: It does not require all requirements to be determined in advance but depends on continuous repetition and adjustment.\n•  Steel Thread: Used to test a system across multiple layers and not for detailed planning.\n•  Rolling Wave: It is based on a detailed layout of nearby parts only, not the entire project.",
      "choices": [
        {
          "text": "Agile",
          "correct": false
        },
        {
          "text": "Traditional",
          "correct": true
        },
        {
          "text": "Steel Thread",
          "correct": false
        },
        {
          "text": "Rolling Wave",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key supplier has become unavailable and the project manager has found a replacement that will meet project approval. Bringing the new supplier onboard will add 10 days to the project timeline. However, a key stakeholder does not want to extend the schedule. The new supplier must be used to move to the execution phase.nnWhat should the project manager do?",
      "explanation": "The correct answer: inform the stakeholder that the current schedule will require updates, and continue periodic reviews to discuss these updates.\n\n- Why is this the right choice?\nBecause the project manager is required to be transparent and communicated, stakeholders must be informed of the impact of changes in a formal and structured manner.\n\n- Why are other options wrong?\n• Meeting with the stakeholder alone is not enough if the schedule is not officially updated.\n• Speeding up tasks may not always be possible and needs analysis.\n• Restarting over is not necessary but rather an exaggeration of the procedure.",
      "choices": [
        {
          "text": "Meet with the stakeholder to explain that using the new supplier will increase the timeline but will meet the overall project goals.",
          "correct": false
        },
        {
          "text": "Let the stakeholder know that the current schedule will require updates, and continue with periodic reviews to discuss the updates.",
          "correct": true
        },
        {
          "text": "Inform the stakeholder that there will be a 10-day delay in the schedule to onboard the new supplier, but critical path tasks will be fast tracked.",
          "correct": false
        },
        {
          "text": "Communicate to the stakeholder that using the new supplier will require a restart at the beginning of the next planning phase.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is uncertain about the duration of a new phase and consults three groups of subject matter experts (SMEs). The first group advises that the phase can be complete in 20 days. The second group identifies some risks that could extend the duration up to 35 days. The third group proposes a new approach that can shorten the time to 11 days.nnWhat is the estimated duration for the new phase?",
      "explanation": "Correct answer: 21 days.\n\n- Why is this the correct choice?\nBecause the question is based on the PERT method, which uses three estimates:\n(optimistic + 4 predicted × + pessimistic) ÷ 6 = (11 + 4×20 + 35) ÷ 6 = 21\n\n- Why are the other options wrong?\nBecause it does not reflect the exact mathematical calculation using the PERT formula, which helps in estimating a realistic average duration when there is uncertainty.",
      "choices": [
        {
          "text": "19 days",
          "correct": false
        },
        {
          "text": "21 days",
          "correct": true
        },
        {
          "text": "23 days",
          "correct": false
        },
        {
          "text": "25 days",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "There are three main work packages in a new product development project. Work package A must be delivered one week before work package C starts, and work package C will start at the same time that work package B begins.nnWhat is the relationship between work packages A and B?",
      "explanation": "Correct answer: Finish-to-Start).\n\n- Why is this the correct choice?\nBecause package A must end before package C starts, and since package C starts at the same time as package B, there is a basic temporal relationship: A expiration is necessary for B to start. This type of relationship is most common in project management and indicates that finishing the first task is a condition for starting the second task.\n\n- Why are other options wrong?\n• Finish to Finish: This means that both packages must end around the same time, which does not apply here.\n• Start to start: Means that the two packages start together, but given the relationship depends on the end of  A, not its beginning.\n• Start to Finish: A rare relationship means that starting a task is linked to the termination of another task, which does not make sense here according to the scenario.",
      "choices": [
        {
          "text": "Finish-to-start (FS)",
          "correct": true
        },
        {
          "text": "Finish-to-finish (FF)",
          "correct": false
        },
        {
          "text": "Start-to-start (SS)",
          "correct": false
        },
        {
          "text": "Start-to-finish (SF)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project management organization has a project that leverages waterfall for the requirements gathering phase and agile for development and testing phases. Not everyone on the project team is familiar with both approaches and the project encounters delays due to project team uncertainty.nnWhat should have been done to prevent this scenario?",
      "explanation": "Correct answer: Schedule daily parking meetings to keep the team informed and address issues immediately.\n\n- Why is this the right choice?\nBecause the hybrid environment needs constant communication even with teams that do not have full experience with all methodologies. Daily stand-ups promote rapid information exchange and detect problems and constraints immediately instead of letting them accumulate.\n\n- Why are other options wrong?\n• Team training on the benefits of hybrids: Good but takes time, while in the project the goal was to address an immediate problem.\n• Role distribution: This may isolate members and weaken joint collaboration.\n• Adopt a single approach: reduce the flexibility of the project and oppose the hybrid idea at all.",
      "choices": [
        {
          "text": "Train the project team on the benefits of hybrid project management.",
          "correct": false
        },
        {
          "text": "Have the project team members familiar waterfall be responsible for the requirements gathering phase and those familiar with agile handle development and testing phases.",
          "correct": false
        },
        {
          "text": "Schedule daily standup meetings to keep the team informed of progress and address issues as they occur.",
          "correct": true
        },
        {
          "text": "Request that the PMO leverage either waterfall or agile for the full project as the team cannot be trained in time for the project to succeed.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is in the halfway point of an agile project comprised of 100 user stories broken down into five iterations. Each user story is worth US$50. The actual expenditure is US$2,000 and 50 user stories have been delivered.nnWhich statement is true?",
      "explanation": "Correct answer: The project is below budget and on time.\n\n- Account:\n50 Story × $50 = $2500 earned value.\nBut what was spent only is $2000, which means that the team accomplished more than it spent:\nCPI = EV / AC = 2500 / 2000 = 1.25\nSo the team is working better than expected (below budget).\n\n- By schedule:\nIf the project has 100 stories on 5 iterations = 20 stories per iteration. Delivering 50 stories means they are ahead of the table.\n\n- Why are the other options wrong?\n• Project overbudgeted and delayed: False because financial performance is positive.\n• Project within budget: Inaccurate because it is better than budget.\n• Project below budget and ahead of schedule: Not completely guaranteed according to the data, so the most accurate option according to PMI is (below budget and on time) since the time did not mention a specific delay or progress.",
      "choices": [
        {
          "text": "The project is over budget and behind schedule.",
          "correct": false
        },
        {
          "text": "The project is under budget and on schedule.",
          "correct": true
        },
        {
          "text": "The project is on budget and on schedule.",
          "correct": false
        },
        {
          "text": "The project is under budget and ahead of schedule.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is using a predictive approach for the development of a particular component as defined in the scope management plan. Due to regularly changing regulatory requirements, the development team has requested to utilize agile approaches.nnWhat should the project manager do about the development team's request?",
      "explanation": "Correct answer: Analyze the requirements that will be handled under the required policy.\n\n- Why is this the correct choice?\nBecause before making any decision regarding a change in the methodology, the project manager must understand the nature of the requirements that have changed: Do they require rapid iterations? Do you need constant adjustments due to changes in regulations? Requirements analysis is the first step to ensure that the decision to switch to the Agile methodology is justified and based on real needs.\n\n- Why are other options wrong?\n• Escalation of request for financial resources: It does not make sense to request additional resources before it is certain that the methodology must be changed.\n• Refer the request to the PMO: PMO is not responsible for making the technical decision at this stage, but its role is after analysis.\n• Sponsor approval request: The sponsor is consulted after preparing clear justifications based on the analysis, not before.",
      "choices": [
        {
          "text": "Escalate the request for additional financial resources.",
          "correct": false
        },
        {
          "text": "Analyze the requirements that will need to be addressed under the requested method.",
          "correct": true
        },
        {
          "text": "Forward the request to the project management office (PMO) to amend the organizational process assets.",
          "correct": false
        },
        {
          "text": "Ask the project sponsor to obtain approval for implementation of the new approach.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In order to identify and assess the hindering and enabling factors that may affect project delivery as a result of the organization's specific environment, a project manager undertakes an environmental scan.nnWhich of the following combinations represents some of the factors that will be considered in this scan?",
      "explanation": "The right answer: laws and regulations, market trends, and new technology.\n\n- Why is this the right choice?\nBecause these elements are among the institutional environmental factors (EEFs) that affect the project: \n• Laws and regulations: may prevent or impose certain conditions on the project.\n• Market trends: affect the feasibility of the project.\n• New technology: may open opportunities or force updates.\n\n- Why are other options wrong?\n• Research and publications: These are secondary sources of information and are not a direct part of the environmental survey.\n• Seminars and exhibitions: external learning and marketing activities and not a direct impact on the project environment.\n• New technology with seminars: inaccurate mixing, because seminars are not an institutional environmental factor per se.",
      "choices": [
        {
          "text": "Laws and regulations, market trends, and new technology.",
          "correct": true
        },
        {
          "text": "Published research, articles, and journals.",
          "correct": false
        },
        {
          "text": "Seminars, exhibitions, and upcoming conferences.",
          "correct": false
        },
        {
          "text": "New technology, seminars, and webinars.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the design process for a multinational construction project, the project manager conducted a cost-benefit analysis based on current foreign exchange rates. The risk of changes to the exchange rate had been recorded in the risk register. During the project implementation phase, the exchange rate has fallen to such a degree the project manager believes the project might not be successful.nnWhat should the project manager do as a proactive action?",
      "explanation": "The correct answer: perform a new cost-benefit analysis.\n\n- Why is this the right choice?\nBecause the financial situation has changed substantially due to the depreciation of the exchange rate, the project must be revalued based on the new circumstances. It is this new analysis that will show whether the project is still feasible or needs to be modified or discontinued.\n\n- Why are other options wrong?\n• Update risk management plan: Update the plan a subsequent step after re-analysis, not before confirming the magnitude of the impact.\n• Escalate the issue to the sponsor: Escalation is possible only after there is accurate data from a new analysis.\n• Request for a change to increase the budget: a hasty step and not based on a comprehensive analysis of the new situation.",
      "choices": [
        {
          "text": "Update the risk management plan.",
          "correct": false
        },
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        },
        {
          "text": "Submit a budget increase change request.",
          "correct": false
        },
        {
          "text": "Conduct a new cost-benefit analysis.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A stakeholder for a hybrid project expresses frustration at the number of iteration review meetings that they are expected to attend.nnWhat should the project manager do in this situation?",
      "explanation": "The right answer: educate the stakeholder about hybrid project methodologies and how regular reviews increase product value and reduce overtime.\n\n- Why is this the right choice?\nBecause an essential part of hybrid project management is to continuously engage stakeholders to ensure alignment with their changing needs and to constantly check product quality. If the stakeholder does not understand the usefulness of these meetings, this may lead to misunderstanding or poor cooperation later. Thus, the project manager needs to educate the stakeholder, not just meet his request directly, so that the project does not lose an important element of quality.\n\n- Why are other options wrong?\n• Discuss the preferred level of participation of the stakeholder: It may give the false impression that attending meetings is optional, which is contrary to the nature of the hybrid approach that relies on continuous interaction.\n• Preparing a meeting with everyone: a complex and unnecessary step at this stage. The problem is only one individual.\n• Recording this in the risk register: not a technical or administrative risk, but a matter of awareness and management of expectations.",
      "choices": [
        {
          "text": "Educate the stakeholder on hybrid methodologies and how regular reviews both increase product value and reduce additional work.",
          "correct": true
        },
        {
          "text": "Discuss the stakeholder's preferred level of engagement and adjust the stakeholder engagement plan accordingly.",
          "correct": false
        },
        {
          "text": "Set up a meeting with all stakeholders to identify which meetings individual stakeholders should attend and update the stakeholder engagement plan accordingly.",
          "correct": false
        },
        {
          "text": "Note this in the risk register and work with the sponsor to identify appropriate mitigation and response.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager wants to recruit another team member to replace an architect who recently resigned. What document should be consulted for this change?",
      "explanation": "Correct answer: Organizational assets of the organization (OPA).\n\n- Why is this the right choice?\nBecause OPA contains policies and procedures related to recruitment and resource assignment, such as:\n• Staff selection criteria.\n• Internal and external recruitment policies.\n• Remuneration and contracting rules.\nTherefore, before appointing any new member, the project manager should review these policies to ensure that the appointment is made in accordance with the company's internal laws.\n\n- Why are other options wrong?\n• Stakeholder register: Does not contain data related to staff recruitment.\n• Project management plan: may contain team structure but not procedures for replacing members.\n•  Assignment of responsibilities  (RAM) matrix: Specifies who is responsible for what, but does not provide recruitment and replacement mechanisms.",
      "choices": [
        {
          "text": "Stakeholder register",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Responsibility assignment matrix (RAM)",
          "correct": false
        },
        {
          "text": "Organizational process assets (OPA)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Following project approval, a project team is assigned and the project management plan is created.nnWhat should the project manager do next?",
      "explanation": "Correct answer: Kickoff meeting with the team and stakeholders.\n\n- Why is this the right choice?\nBecause the kickoff meeting is the official step to start the implementation of the project. Through this meeting:\n•  Project objectives are emphasized.\n•  Project management plan is reviewed.\n• Clarify roles and responsibilities.\n• Address any ambiguities in the team and stakeholders.\nWithout this meeting, overlapping roles or misunderstandings about priorities may occur.\n\n- Why are other options wrong?\n• Develop a detailed schedule: usually during the preparation of the project management plan and not afterwards.\n• Start of purchases: An executive step that occurs after the kickoff meeting.\n• Perform individual performance reviews: This is done later during project performance monitoring, not as a first step after the project is approved.",
      "choices": [
        {
          "text": "Hold a kickoff meeting with the project team and stakeholders.",
          "correct": true
        },
        {
          "text": "Develop a detailed project schedule.",
          "correct": false
        },
        {
          "text": "Initiate procurement processes for required resources.",
          "correct": false
        },
        {
          "text": "Conduct individual performance reviews.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A newly formed project team features members from several countries and continents, with significant age differences and a variety of social circles. How should the project manager address this challenge?",
      "explanation": "The right answer: Help the team discover how their different perspectives can expand their skills and enhance team productivity.\n\n- Why is this the right choice?\nBecause diversity in modern teams is a strength, not a weakness. A successful project manager is one who invests this diversity to foster creativity and solve problems in multiple ways. This method fosters an environment of mutual respect rather than dividing the team by backgrounds.\n\n- Why are other options wrong?\n• Assign a delegate to each group: Foster division rather than collaboration.\n• Commit the team to a diversity and inclusion cycle: A useful tool but not enough on its own to solve diversity challenges.\n• Confrontation intervention planning: defensive rather than proactive action, and it is better to focus on building an understanding team before problems arise.",
      "choices": [
        {
          "text": "Help the team discover how their different perspectives can expand their skill sets and strengthen team productivity.",
          "correct": true
        },
        {
          "text": "Appoint a delegate for each ethnic/social group to contribute to inclusive decision making.",
          "correct": false
        },
        {
          "text": "Require all team members to attend a virtual class on diversity and inclusion.",
          "correct": false
        },
        {
          "text": "Plan to intervene authoritatively if confrontations occur between incompatible team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the early stages of a project, two key stakeholders have different opinions about a project's goals. Why should the project manager negotiate an agreement between the two stakeholders?",
      "explanation": "Correct answer: to get project charter approval.\n\n- Why is this the right choice?\nBecause the project charter is the official document that defines the objectives of the project and is approved by the main stakeholders. If there is disagreement between them, the charter can only be adopted after an agreement has been reached between them. Negotiation is the most appropriate technique at this stage.\n\n- Why are other options wrong?\n• Understanding the capacity of stakeholders: an analytical step, but it does not resolve the dispute.\n• Involving them in conflict resolution: Part of the negotiation, but the main goal is to reach agreement.\n• Allowing them to discuss opinions: It is not enough in itself, because the important thing is to end the disagreement and agree.",
      "choices": [
        {
          "text": "To understand the stakeholders' ability to influence the project's direction",
          "correct": false
        },
        {
          "text": "To obtain approval of the project charter",
          "correct": true
        },
        {
          "text": "To engage the stakeholders in the conflict resolution",
          "correct": false
        },
        {
          "text": "To allow the stakeholders to discuss their opinions at the kick-off meeting",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project to design and develop new equipment is in the planning stage. The project team has little experience with the new features and functions of this equipment and has subsequently received training.nnHow can the project manager maximize the effectiveness of the team's training activities for this project?",
      "explanation": "Correct answer: Include peer-to-colleague guidance in the training plan on new features and functionality.\n\n- Why is this the right choice?\nBecause traditional training may not be enough to understand the subtleties. Mentoring between colleagues promotes continuous learning and allows for practical and realistic sharing of experiences within the team during daily work.\n\n- Why are other options wrong?\n• Invite an expert: useful but not enough, especially after the formal training.\n• Schedule a demo: useful as a start but does not provide ongoing support.\n• Appoint a job manager: adds a management layer that may not be necessary in this case, especially since the goal is to develop technical skills within the team.",
      "choices": [
        {
          "text": "Invite a subject matter expert (SME) to show the team how the features and functions are used.",
          "correct": false
        },
        {
          "text": "Include peer-to-peer mentoring of the new features and functions in the project training plan.",
          "correct": true
        },
        {
          "text": "Schedule a proof of concept presentation of the features and functions during the training activities.",
          "correct": false
        },
        {
          "text": "Assign a functional manager to work with the team to make sure they understand the equipment's features and functions.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the company cafeteria, a project manager overhears an unengaged stakeholder mocking the style of language used in the project manager's status report.nnWhat should the project manager do?",
      "explanation": "The correct answer: meet with the stakeholder in private to find out how to make communication more attractive to them.\n\n- Why is this the right choice?\nBecause effective communication with stakeholders requires understanding their needs and preferences. Even if this person is not directly involved, it is best to listen to their opinion and see if the reports can be improved in a way that works for everyone.\n\n- Why are other options wrong?\n• Request advice from the PR officer: An exaggerated step for such a simple situation.\n• Stop sending status reports: It harms the principle of transparency.\n•  Social contract update: An exaggerated formal act of informal observation.",
      "choices": [
        {
          "text": "Meet with the stakeholder privately to find out how to make communication more engaging.",
          "correct": true
        },
        {
          "text": "Ask the company's public relations officer for tips on how to make written communications more captivating.",
          "correct": false
        },
        {
          "text": "Stop sending the status reports to the stakeholder and use only direct email to communicate with them.",
          "correct": false
        },
        {
          "text": "Update the project social contract to prohibit disrespectful communications when referring to project members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A sales manager is overpromising deliverables beyond the contractual scope. In order to resolve the disagreement, the project manager wishes to find someone with a higher ranking in the sales department who is favorable to the project.nnWhat project data should the project manager consult?",
      "explanation": "Correct answer: Stakeholder Power/Interest Network.\n\n- Why is this the right choice?\nThe Authority/Attention Network shows who has influence within the organization and who cares the most about the project, allowing the project manager to choose the right person to support him in correcting things with the sales department.\n\n- Why are the other options wrong?\n• Communication management plan: Defines channels but does not show influence.\n• Resource allocation structure: focuses on the distribution of work and resources, not influence.\n• Organizational assets: may contain information, but the authority network is more specific for this purpose.",
      "choices": [
        {
          "text": "Stakeholder power/interest grid",
          "correct": true
        },
        {
          "text": "Communications management plan",
          "correct": false
        },
        {
          "text": "Resource breakdown structure",
          "correct": false
        },
        {
          "text": "Organizational process assets",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which leadership behavior is least likely to boost motivation in an Agile project team?",
      "explanation": "Correct answer: Order the team to use a new productivity tool immediately.\n\n- Why is this the right choice?\nLeadership in Agile is based on self-empowerment and consultation, not imposition. Issuing direct orders goes against Agile's culture of fostering collective decision-making, experimentation, and adaptation.\n\n- Why are other options wrong?\n• Voting on a new method: Enhances interaction.\n• Assign individual tasks: Accepted depending on team conditions.\n• Volunteer Request: Encourages self-initiative.",
      "choices": [
        {
          "text": "Instruct the team to immediately use a new productivity tool.",
          "correct": true
        },
        {
          "text": "Ask the team to vote if a new work method should be adopted.",
          "correct": false
        },
        {
          "text": "Assign individual team members to the tasks in the backlog.",
          "correct": false
        },
        {
          "text": "Ask for a volunteer to run a customer satisfaction survey.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What is an example of directive leadership as opposed to collaborative leadership?",
      "explanation": "Correct answer: Act as the team's only authoritarian source of information.\n\n- Why is this the right choice?\nBecause directive leadership relies on issuing orders and relying on a single source of decisions and information, where the leader is the only axis. This is the opposite of collaborative leadership, which relies on involving the team in decision-making.\n\n- Why are other options wrong?\n• Accept and learn from team mistakes: Collaborative behavior that promotes self-learning.\n• Trust team members to take initiatives: Part of collaborative leadership.\n• Encourage the team to share ideas for improvement: also within collaborative leadership.",
      "choices": [
        {
          "text": "Act as an authoritative single source of information for the team.",
          "correct": true
        },
        {
          "text": "Accept and learn from mistakes in the team.",
          "correct": false
        },
        {
          "text": "Trust team members to take initiatives.",
          "correct": false
        },
        {
          "text": "Encourage the team to share ideas for improvement.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After preparing the project management plan, a project manager schedules a meeting with key stakeholders to finalize the planning phase. The project manager is now preparing for the executing phase.nnWhat should the project manager do next?",
      "explanation": "Correct answer: Implement the project plan.\n\n- Why is this the right choice?\nBecause after the planning phase is closed, the project manager becomes responsible for starting the implementation of the approved plan, which includes working on deliverables.\n\n- Why are other options wrong?\n• Project definition and project charter creation: done before the planning phase.\n• Ensure that all deliverables are completed: This is part of monitoring and closing, not the beginning of implementation.\n• Risk remediation: is done continuously but not as a first step immediately after planning.",
      "choices": [
        {
          "text": "Define the project and create the project charter.",
          "correct": false
        },
        {
          "text": "Put the project plan into action.",
          "correct": true
        },
        {
          "text": "Ensure all deliverables are completed.",
          "correct": false
        },
        {
          "text": "Address risks to make sure the project is on track.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is overseeing the development and launch of a new product. In order to comply with the Project Management Office (PMO)'s guidelines, the project manager is required to ensure a Benefits Realization Plan outlining the business value to be delivered is created. The project manager is currently documenting the Roles and Responsibilities for this task in the form of a RACI chart.nnWho will be accountable for ensuring the project brings value to the organization?",
      "explanation": "Correct answer: Project sponsor.\n\n- Why is this the right choice?\nBecause the project sponsor is the authority holder in the project and is responsible for linking the project to the business objectives and ensuring the expected return. The project manager manages the implementation, but the value guarantee falls within the sponsor's responsibility.\n\n- Why are the other options wrong?\n• Project Manager: Manages implementation and delivery but is not the decision-maker in commercial values.\n• Solution Architect: Responsible for the technical side, not commercial values.\n• Steering Committee: monitors and supports but does not bear direct responsibility like a sponsor.",
      "choices": [
        {
          "text": "Project sponsor",
          "correct": true
        },
        {
          "text": "Project manager",
          "correct": false
        },
        {
          "text": "Solution architect",
          "correct": false
        },
        {
          "text": "Steering committee",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After going through a project earned value exception report, a project manager notices that two tasks are flagged both with a Cost Performance Index (CPI) of 0.5. Which is the correct deduction the project manager should make from this report?",
      "explanation": "Correct answer: Each task spent twice the amount allocated to it at this point.\n\n- Detailed explanation:\n The cost performance indicator (CPI) is the ratio of earned value to actual cost.  A  CPI of 0.5 means that the project gets half the value for each unit of cost, meaning that the actual cost is high compared to the earned value. In other words, double the planned budget is spent.\n\n- Other options error reason:\n• Half of the budget to be spent or half of the allocated amount: CPI means > 1, not 0.5.\n• Quarter budget:  means CPI = 0.25, less than 0.5.",
      "choices": [
        {
          "text": "Each task has spent twice the budgeted amount it should have at this point",
          "correct": true
        },
        {
          "text": "Each task has spent half the amount (budget) it should have at this point",
          "correct": false
        },
        {
          "text": "Each task has spent half the budgeted amount it should have at this point",
          "correct": false
        },
        {
          "text": "Each task has spent a quarter the amount (budget) it should have at this point",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project meeting, a project manager is made aware that team members find it very difficult to verify completed deliverables for compliance as no reference documents exist with the information on specifications and the related customer needs. The team decides to document clear acceptance criteria to address this.nnWhich document can be used to identify and relate the specific customer needs in this instance?",
      "explanation": "Correct answer: Requirement traceability matrix.\n\n- Detailed explanation:\n A requirement traceability matrix is a tool that connects customer requirements with deliverables, products, or tests to ensure that each requirement is met. It helps keep track of meeting each need and make sure no requirement is missing.\n\n- Reason for error Other options:\n• Feasibility study: Explains the reason for the project and does not document requirements.\n• Project charter: Defines the objectives of the project but does not contain the details of the requirements.\n• Matrix assignment of responsibilities: Specifies who is responsible for what but does not specify the requirements of the client.",
      "choices": [
        {
          "text": "Business case",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": false
        },
        {
          "text": "Requirement traceability matrix",
          "correct": true
        },
        {
          "text": "Responsibility assignment matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a complex project with diverse stakeholders and a strict regulatory environment. The project team is struggling to consistently achieve compliance with project processes, leading to delays and rework.nnWhat should the project manager do to effectively motivate the team to comply with project processes?",
      "explanation": "The correct answer: Organize team workshops to identify and address compliance challenges collaboratively.\n\n- Detailed explanation:\nMotivate the team to commit to project processes requires involving them in understanding the challenges and working to solve them jointly, which promotes shared responsibility and reduces resistance. Collaborative workshops help build a common understanding and motivate the team to commit.\n\n- Other options error reason:\n• Provide individual rewards: It may be a temporary stimulus but it does not solve the root of the problem.\n• Recurring audit system: It may cause tension and increase resistance.\n• Develop a persuasive vision: important but not enough alone without the team's participation in solutions.",
      "choices": [
        {
          "text": "Offer individual performance-based bonuses for exceeding compliance targets.",
          "correct": false
        },
        {
          "text": "Implement a system of frequent audits and compliance checks.",
          "correct": false
        },
        {
          "text": "Develop and communicate a compelling vision and rationale for the overall project goals.",
          "correct": false
        },
        {
          "text": "Facilitate team workshops to collaboratively identify and address compliance challenges.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team just completed a major milestone and is now on track to deliver the project ahead of the due date. The project manager is pleased and would like to use rewards to keep team cohesion and productivity on the rise.nnWhich of the following types of rewards will improve team cohesion and productivity for the remainder of the project?",
      "explanation": "The correct answer: Provide a collective reward to all project participants to maintain productivity and cohesion.\n\n- Detailed explanation:\nGroup rewards enhance team spirit and encourage everyone to work collaboratively to maintain high performance. It motivates members to support each other and build a positive work environment, which increases team cohesion and productivity.\n\n- Other options error reason:\n• Rewards for team leaders only The rest of the members may feel marginalized and reduce motivation.\n• Individual rewards for the most productive may create negative competition and break up the team.\n• Rewards for defaulting members only may encourage reliance on rewards rather than improving overall performance.",
      "choices": [
        {
          "text": "Provide a team reward to all involved in the project in order to sustain productivity and cohesion",
          "correct": true
        },
        {
          "text": "Provide rewards to all team leaders only so that they can keep driving their respective teams in a cohesive and productive manner",
          "correct": false
        },
        {
          "text": "Provide individual rewards to the most productive team members in order to sustain productivity and team cohesion",
          "correct": false
        },
        {
          "text": "Provide individual rewards to the struggling team members only in order to encourage them and increase productivity and team cohesion",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team member assigned to a new project will be required to report on all project tasks progress to the project manager while his current line manager will be responsible for his career growth and development.nnWhich of the following describes the project organization structure?",
      "explanation": "Correct answer: Matrix.\n\n- Detailed explanation:\nIn a matrix structure, an employee has a functional manager responsible for his professional development, and a project manager responsible for his or her project-related tasks. This model allows resources to be shared between projects and departments, and provides greater flexibility in resource allocation.\n\n- Other options error reason:\n• Functional structure: The employee has only a functional manager and there is no project manager.\n• Purely project structure: Employees belong only to projects and there are no functional managers.\n• Interfunctional structure: refers to multifunctional teams working jointly, but it is not a formal organizational structure.",
      "choices": [
        {
          "text": "Matrix",
          "correct": true
        },
        {
          "text": "Projectised",
          "correct": false
        },
        {
          "text": "Functional",
          "correct": false
        },
        {
          "text": "Cross-functional",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team is working on a new product development project. The product owner has requested a new change to accommodate recent technology requirements as a result of changes in the market environment.nnWhich of the following should the project manager do next?",
      "explanation": "Correct answer: Ensure that the change request is added to the  backlog.\n\n- Detailed explanation:\n In  the Agile methodology, change requests are handled by adding them to the Backlog to be evaluated and prioritized within the next iterations. This allows for flexibility and orderly change management without disrupting the current workflow.\n\n- Other options error reason:\n• Execute change immediately: May disrupt current planning and lose control over priorities.\n• Register a change request and create a board of directors: This method belongs to traditional methodologies and not Agile.\n• Reject change: Contradicts Agile's principle of adapting to change to create value.",
      "choices": [
        {
          "text": "Go ahead and implement the change immediately",
          "correct": false
        },
        {
          "text": "Log a change request document and set up a change control board",
          "correct": false
        },
        {
          "text": "Ensure the change request has been added to the product backlog",
          "correct": true
        },
        {
          "text": "Reject the change as it may cost more money and delay the project",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with an agile team on project delivery. While planning, what should the team focus on to ensure the project objectives are met?",
      "explanation": "Correct answer: arrange delivery evaluation as the final step to quality assurance.\n\n- Detailed explanation:\nIn an Agile environment, ensuring the quality of deliverables is a team priority. Arranging a delivery evaluation as a final step ensures that all requirements and stories have been met in accordance with agreed quality standards before the product or features are delivered to the customer or end user.\n\n- Other options error reason:\n• Organizing workshops with stakeholders and the project team is important but part of communication processes and does not alone guarantee the achievement of project objectives.\n• Verifying the product owner's signature on all user stories is an administrative procedure but does not cover the quality of delivery or Achieve the full goal.\n• Ensure that there is a definition of completion (DoD) in every user story that is important, but it is part of the development phase and not a final guarantee that the project objectives will be fully achieved.",
      "choices": [
        {
          "text": "Organize workshops with business stakeholders and the project team.",
          "correct": false
        },
        {
          "text": "Verify that the product owner signs off on all user stories.",
          "correct": false
        },
        {
          "text": "Verify that each user story has a definition of done (DoD).",
          "correct": false
        },
        {
          "text": "Arrange for a deliverable evaluation as the final quality assurance (QA) checkpoint.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex project, involving multiple stakeholders with diverse priorities, requires long and challenging negotiations to finalize the project agreement. The project manager must facilitate setting the right priorities for these crucial negotiations.nnWhat should the project manager do first?",
      "explanation": "The correct answer: Define clear success criteria for the project.\n\n- Detailed explanation:\nBefore entering into complex negotiations between stakeholders, it is essential that the project manager sets clear criteria for the success of the project to be agreed upon by the parties involved. These criteria serve as a reference to guide discussions and help identify critical priorities that are in the interest of the project as a whole.\n\n- Other options are wrong:\n• Developing a detailed risk profile is important but comes later and does not resolve priority disputes.\n• Organizing a brainstorming session with all stakeholders may be useful, but it may not be the first step before establishing clear criteria for success.\n• Conducting one-on-one interviews with stakeholders can provide insights, but it does not replace clearly and jointly defining the criteria for success.",
      "choices": [
        {
          "text": "Develop a detailed risk register.",
          "correct": false
        },
        {
          "text": "Organize a brainstorming session with all stakeholders.",
          "correct": false
        },
        {
          "text": "Define clear project success criteria.",
          "correct": true
        },
        {
          "text": "Conduct individual interviews with key stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with multiple stakeholders and competing priorities. What should the project manager do with respect to the stakeholders to achieve a better project result?",
      "explanation": "The correct answer: Identify and seek stakeholder consensus on project objectives and delivery.\n\n- Detailed explanation:\nIn complex projects where priorities vary, it is essential that the project manager unifies views by agreeing on the core objectives of the project. This alignment minimizes conflicts and ensures that all stakeholders are working towards the same goals, improving the chances of project success.\n\n- Other options are wrong:\n• Maintaining relationships and understanding is important but not enough without actual consensus on goals.\n• Meeting personal interests may lead to compromises that may harm the project.\n• Encouraging stakeholders to accept a single point of view may provoke resistance and increase conflicts rather than consensus.",
      "choices": [
        {
          "text": "Identify and seek stakeholder consensus on project objectives and deliverables.",
          "correct": true
        },
        {
          "text": "Preserve the relationships and rapport with the stakeholders.",
          "correct": false
        },
        {
          "text": "Meet the personal interests of the stakeholders.",
          "correct": false
        },
        {
          "text": "Encourage the stakeholders to accept the proposed viewpoint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with multiple stakeholders and competing priorities. During a meeting with the stakeholders, the project manager conducted a brainstorming session to facilitate reaching consensus.nnWhat did the project manager do to reach a state of general consensus?",
      "explanation": "Correct answer: Focus on finding a solution that meets the needs of stakeholders.\n\nDetailed explanation:\nThe project manager focused on finding a solution that meets the needs of all stakeholders to achieve overall consensus. This approach ensures that everyone accepts the results and minimizes conflicts, supporting the success of the project.\n\nError Reason for Other Options:\nFocus on maintaining relationships and understanding is important but not enough without finding practical solutions.\nFocus on meeting personal interests may lead to unbalanced outcomes and favor some parties at the expense of the project.\nFocus on pushing stakeholders to accept the proposed vision may create resistance and conflict rather than consensus.",
      "choices": [
        {
          "text": "Focused on preserving relationships and rapport with stakeholders.",
          "correct": false
        },
        {
          "text": "Focused on finding a solution to meet the needs of stakeholders.",
          "correct": true
        },
        {
          "text": "Focused on meeting the personal interests of stakeholders.",
          "correct": false
        },
        {
          "text": "Focused on pushing stakeholders to accept the proposed view.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project that requires expertise in negotiation skills. What should the project manager do to persuade the stakeholders to accept the proposed viewpoint?",
      "explanation": "Correct answer: Understand the possible reasons for the disagreement.\n\nDetailed explanation:\nTo understand the possible reasons for the disagreement allows the project manager to address the real concerns of stakeholders, and build an effective dialogue that leads to acceptance of the proposed point of view.\n\nReason for the error of other options:\nDiscussing the feasibility study alone may not be enough to convince everyoneScheduling and precautionary measures are important but do not address the causes of disagreement.\nAssessing the risk of negotiation failure is important but does not resolve existing differences.",
      "choices": [
        {
          "text": "Discuss the business case for the project.",
          "correct": false
        },
        {
          "text": "Establish the schedule and contingency measures.",
          "correct": false
        },
        {
          "text": "Understand the reasons for potential disagreement.",
          "correct": true
        },
        {
          "text": "Assess the risk of unsuccessful negotiation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is writing the lessons learned at the end of the sprint. They explicitly declare their willingness to improve their expertise using the retrospective approach.nnBased upon the agile manifesto, what should the team focus on?",
      "explanation": "Correct answer: dialogue.\n\nDetailed explanation:\nThe review approach in agile focuses on open dialogue between team members to discuss successes and challenges with the aim of continuous improvement.\n\nOther options are wrong:\nCompetition, argumentation, and defense may hinder effective communication and increase conflicts rather than foster collaboration and improvement.",
      "choices": [
        {
          "text": "Competing",
          "correct": false
        },
        {
          "text": "Debating",
          "correct": false
        },
        {
          "text": "Defending",
          "correct": false
        },
        {
          "text": "Conversing",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is helping their organization transition from using predictive methods to agile methods. The leadership team complains to the project manager that less work is being done after the agile approaches were implemented.nnHow should the project manager respond to the leadership team?",
      "explanation": "Correct answer: Explains that low productivity is initially expected as teams try to understand and adapt to agile.\n\nDetailed explanation:\nWhen transitioning to agile methods, it's normal for teams to experience a temporary drop in productivity as a result of adapting to new methods and different work styles. This challenge is temporary, and as time passes and experience improves, productivity returns to rise.\n\nOther options error reason:\nAskingfor explanation for the reason for the decline may create unnecessary stress.\nImposing a uniform sprint on the entire organization may not be suitable for all teams.\nDiscontinuing the application of agile due to frustration prevents the long-term benefits of the methodology from being leveraged.",
      "choices": [
        {
          "text": "Ask all team leads to explain why less work has been done since the agile implementation began.",
          "correct": false
        },
        {
          "text": "Explain a decrease in productivity is expected in the beginning as teams try to understand and adjust to agile approaches.",
          "correct": true
        },
        {
          "text": "Enforce 2-week sprints across the organization so all teams deliver at the same agile cadence.",
          "correct": false
        },
        {
          "text": "Stop implementing agile if the organization is not making any improvements and people are becoming frustrated.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. The project sponsor asks the project manager whether agile supports entering a fixed-price contract with the customer instead of a time-and-materials contract. The customer needs a fixed-price contract to support their concrete business goals.nnWhat should the project manager's response to the sponsor be?",
      "explanation": "Correct answer: agree to use a fixed-rate contract because agile does not prevent it.\n\nDetailed explanation:\nThe agile methodology is flexible enough to be used with fixed-rate contracts, as long as expectations and scope are clearly agreed. Agile focuses on collaboration and adaptation, but does not prevent the use of different types of contracts.\n\nOther options error cause:\nSayingthat agile does not support contracts at a fixed price is incorrect.\nFocusing only on time and physical contracts reduces the adaptability of agiles.\nForcing a customer into a time and physical contract may create unnecessary tensions.",
      "choices": [
        {
          "text": "Inform the customer that agile does not support fixed-price contracts, as it favors customer collaboration over contract negotiation.",
          "correct": false
        },
        {
          "text": "Inform the customer that agile supports only time-and-materials contracts, as scope is not fixed in agile.",
          "correct": false
        },
        {
          "text": "Agree with the customer to move forward with fixed-price contract, as there is no such restriction in agile.",
          "correct": true
        },
        {
          "text": "Influence the customer to use a time-and-materials contract, as the cost overrun of this contract lies with the customer.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager leaves an ongoing project and is replaced by a new project manager. What should the new project manager do first to help ensure the success of the project?",
      "explanation": "Correct answer: Recognize the project objectives as defined in the project charter.\n\nDetailed explanation:\nUnderstanding the project objectives of the project charter is the basis for understanding the scope and objectives of the project and ensuring that the work continues properly. This step helps the new manager make informed decisions and follow up on the progress of the project.\n\nError Reason for other options:\nProblemlog consultation and lessons learned are important but come after understanding the basic objectives.\nAdjusting the schedule and budget should be done based on a full understanding of the project.\nMeeting with stakeholders is important but not the first step without understanding the objectives.",
      "choices": [
        {
          "text": "Become familiar with the project goals as specified in the project charter.",
          "correct": true
        },
        {
          "text": "Consult the issues log and lessons learned register kept by the former project manager.",
          "correct": false
        },
        {
          "text": "Modify the project schedule and budget to include knowledge transfer activities.",
          "correct": false
        },
        {
          "text": "Meet with key stakeholders and update the communications strategy as necessary.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager learns that a new law will go into effect that will regulate the type of products the company can manufacture. The company is planning to launch a new product in the next few weeks that would not comply with the new regulations. The project manager meets with the sponsor and stakeholders to discuss the changes.nnWhat should the project manager do next?",
      "explanation": "Correct answer: Update the project charter to reflect the results of the meeting.\n\nDetailed explanation:\nAfter a meeting with the sponsor and stakeholders about organizational changes affecting the project, the project charter should be updated to reflect changes in the scope and objectives of the project. This ensures formal documentation of the amendments that have been agreed upon and guides the project according to the new regulations.\n\nOther options error reason:\nLayout launch without modification may lead to conflicts with regulations.\nModify the product only without updating the charter lacks formal documentation.\nCanceling the launch may be an early decision before evaluating alternatives.",
      "choices": [
        {
          "text": "Update the project charter to reflect the results of the meeting.",
          "correct": true
        },
        {
          "text": "Plan to launch the product on time without modification but update the risk management plan.",
          "correct": false
        },
        {
          "text": "Plan to modify the product to meet the new regulations before the law goes into effect.",
          "correct": false
        },
        {
          "text": "Advise the sponsor and stakeholders to cancel the launch until the product can be modified to meet the new regulations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to compare the effectiveness of corrective actions taken during the current project to actions taken in a similar project in order to generate ideas for improvement. What should the project manager use?",
      "explanation": "Correct answer: benchmarking.\n\nDetailed explanation:\nBenchmarking is a tool used to compare current processes or results with best practices in other similar projects or organizations in order to identify areas for improvement and generate new ideas.\n\nOther options error reason:\nProcess analysis focuses on internal processes and not comparison with other projects\nExpert judgment is based on expert opinions and not direct comparison.\nQuality audit focuses on compliance with standards and does not compare performance with other projects.",
      "choices": [
        {
          "text": "Process analysis",
          "correct": false
        },
        {
          "text": "Expert judgment",
          "correct": false
        },
        {
          "text": "Benchmarking",
          "correct": true
        },
        {
          "text": "Quality audits",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. An experienced architect on the team mentions that it is important to create a detailed solution design document upfront based on the complexity of the project. One of the team members says that it is against the agile principles to spend time in upfront documentation. How should the project manager handle this situation?",
      "explanation": "Correct answer: Allow the engineer to create the pre-detailed design document as per the project requirements.\n\nDetailed explanation:\nAgile encourages only appropriate and rigid documentation that serves the team and the project, not excessive documentation. If the complexity of the project requires a detailed design document to ensure the quality of the solution, adapt to this instead of rigidly enforcing agile rules.\n\nOther options error reason:\nTrainingmay be useful but does not necessarily resolve the conflict.\nRequiring phased design creation may complicate matters.\nAsking for guidance from the sponsor due to different understanding of agile may hinder progress.",
      "choices": [
        {
          "text": "Provide agile training to the architect and work with the project team to perform conflict resolution.",
          "correct": false
        },
        {
          "text": "Allow the architect to create the solution design documentation upfront as required for the project.",
          "correct": true
        },
        {
          "text": "Agree with the team member and ask the architect to create the design in iterations over a period of time.",
          "correct": false
        },
        {
          "text": "Seek guidance from the project sponsor since agile does not support comprehensive documentation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project where a vendor is engaged. The project team has a dependency on the vendor to complete some work first. However, the vendor is constantly failing to complete their work on time.nnHow should the project manager mitigate this risk?",
      "explanation": "Correct answer: Create an integrated project schedule with the vendor and hold regular checkpoints with them.\n\n- Detailed explanation:\nWhen the project relies on an external party (vendor) and there is a frequency of delays for deliverables, the most appropriate action according to the PMBOK  manual is to merge the work schedules with the vendor and make periodic checkpoints. This allows performance to be tracked and more flexible on time, enhances communication and reduces the likelihood of delays without the project manager's knowledge.\n\n- Other options error reason:\n• Adding only a time reserve may cover the delay but does not address the underlying issue.\n• Eliminating the vendor directly without evaluating alternatives may result in greater delays and additional costs.\n• Requesting additional resources from the vendor does not guarantee a sustainable solution if a system and coordination are not pursued.",
      "choices": [
        {
          "text": "Create an integrated project schedule with the vendor and keep regular checkpoints with the vendor.",
          "correct": true
        },
        {
          "text": "Get approval from the project sponsor to add a contingency buffer to the project, and inform the vendor about it.",
          "correct": false
        },
        {
          "text": "Remove this vendor immediately, and start the request for proposal (RFP) process for new vendor selection.",
          "correct": false
        },
        {
          "text": "Ask the vendor to add new resources, and approve overtime for existing resources to deliver their work on time.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project where a vendor is engaged in a fixed price contract. Even though the project requirements and timelines have been clearly defined and shared with the vendor, the project sponsor is worried about cost overrun.nnHow should the project manager respond to the sponsor?",
      "explanation": "Correct answer: inform the sponsor that the risk of cost overruns has been transferred to the seller.\n\n- Detailed explanation:\nIn Fixed Price Contract, the seller is responsible for bearing the additional costs if the agreed work exceeds the value specified in the contract. According to PMP, this type of contract is used to stabilize the cost and reduce the financial risk to the entrepreneur.\n\n- Other options error reason:\n• Discussing the issue with the team does not help because the risk is not internal but related to the contract.\n• A reserve financing request that violates the nature of the fixed-price contract.\n• Issuing a new RFP is unjustified as long as the seller is legally bound by the contract.",
      "choices": [
        {
          "text": "Inform the project sponsor that the risk of cost overrun is transferred to the vendor.",
          "correct": true
        },
        {
          "text": "Discuss this issue in the next team meeting and ask team members for feedback.",
          "correct": false
        },
        {
          "text": "Ask the project sponsor to provide contingency funding to mitigate the risk.",
          "correct": false
        },
        {
          "text": "Issue a request for proposal (RFP) to identify potential vendors if the issue materializes.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager needs to contract with a provider for a large government project. Project guidelines mandate that all potential providers have the same understanding of the procurement process.nnWhat should the project manager hold to ensure compliance with the guidelines of the project?",
      "explanation": "Correct answer: Bidder Conference.\n\n- Detailed explanation:\n A bidder conference is a meeting in which all potential suppliers or vendors are invited to obtain the same information related to the project and purchase. This process ensures transparency and fairness, and prevents presentations based on an erroneous or incomplete understanding. This is part of PMBOK's procurement management processes.\n\n- Other options error reason:\n• Direct negotiations contradict the principles of transparency in government projects.\n• Individual meetings may lead to non-standardized information between suppliers.\n• Meeting with the procurement team does not achieve the main objective, which is to standardize the understanding of all suppliers.",
      "choices": [
        {
          "text": "Direct negotiations with providers of similar past projects",
          "correct": false
        },
        {
          "text": "Bidder conference",
          "correct": true
        },
        {
          "text": "Individual meetings with each potential provider",
          "correct": false
        },
        {
          "text": "Procurement team video conference",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The production of a key component in a construction project is outsourced to a third-party vendor. The vendor informs the project manager that due to component shortages, the product will arrive in variable quantities and during a longer delivery schedule.nnWhat should the project manager do to address this issue?",
      "explanation": "Correct answer: Review the terms of delivery of the external supplier as specified in the contract.\n\n- Detailed explanation:\nIn the PMBOK Procurement Department, when the supplier is notified of a change in schedule or quantities, the first formal action is to review the terms of the contract to see if there are conditions that determine how such cases will be handled. This procedure ensures that the agreed legal obligations are acted upon, whether by imposing penalties or requesting formal amendments.\n\n-  The reason for the error of the other options:\n• Meeting with the sponsor to discuss the sanctions is a next step and not the first step, because the penalties are specified in the contract.\n• Modifying the stages of the project without reviewing the contract may expose the project to legal risks.\n• Searching for alternative suppliers before ascertaining the legal status with the current supplier is considered a jump on the procedures.",
      "choices": [
        {
          "text": "Meet with the project sponsor to discuss penalties that can be imposed because of the changes.",
          "correct": false
        },
        {
          "text": "Adjust the project phases to match the delivery schedule of this critical component.",
          "correct": false
        },
        {
          "text": "Review the third-party vendor's terms of delivery as specified in the vendor contract.",
          "correct": true
        },
        {
          "text": "Review the procurement plan for contract cancellation procedures while researching alternate suppliers.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier has been awarded a firm fixed price (FFP) contract to provide various materials for a construction project. The supplier has received all necessary documents relating to material standards and specifications. By contract, the supplier must deliver all materials to the construction site on a specific date.nnWhen the materials arrive at the site on time, why should the project manager inform the inspections group?",
      "explanation": "Correct answer: to ensure that the materials comply with the standards and specifications of the contract.\n\n- Detailed explanation:\nEven if the materials are delivered on time, in accordance with the principles of quality management in projects according to PMBOK, it is necessary to ensure that these materials conform to the specifications and contract. The inspection process ensures that the supplier adheres to the required standards before using the materials in the project, which prevents rework or problems later.\n\n- Other options error reason:\n• Informing the team member of receipt is not sufficient and does not replace the inspection.\n•  The finance department pays after the quality of the materials is ascertained, not before.\n• The purchasing department may report later, but the priority of the inspection team is to ensure quality first.",
      "choices": [
        {
          "text": "To inform the team member responsible for the materials to pick them up",
          "correct": false
        },
        {
          "text": "To provide the finance department with documentation needed to pay the supplier's invoice",
          "correct": false
        },
        {
          "text": "To advise the procurement department that the contract has been fulfilled",
          "correct": false
        },
        {
          "text": "To ensure that the materials comply with the contract standards and specifications",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "What may cause leaders to ignore the Shared Leadership Potential in their teams? (Choose 2)",
      "explanation": "The correct answers: overconfidence in their own role, fear that they will become unnecessary.\n\n- Detailed explanation:\nIn modern leadership environments, especially in agile projects, the distribution of leadership among team members is encouraged. However, some leaders may oppose this:\n\n• Excessive confidence in their own role makes the leader feel that he or she is the only valid source of decisions.\n• Fear of becoming unnecessary leads some not to empower the team, fearing loss of control or function.\n\n- Other options are wrong:\n• Providing autonomy and control is a positive principle and does not lead to ignoring possibilities.\n• Trust in the team promotes, not hinders shared leadership.",
      "choices": [
        {
          "text": "Over-confidence in their own role",
          "correct": true
        },
        {
          "text": "Providing autonomy and control",
          "correct": false
        },
        {
          "text": "Fear of becoming dispensable",
          "correct": true
        },
        {
          "text": "Trusting the team",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following reduces complexity on any project?",
      "explanation": "Correct answer: Team members use an agreed process to complete the work.\n\n- Detailed explanation:\nWhen clear processes and procedures are agreed to complete work within the team, ambiguity is reduced and the method of work is standardized, which facilitates coordination and reduces the need to rework or intervene to resolve differences due to different methods.\n\n- The reason for the error of other options:\n• Team members working within different time zones increases complexity due to the different timings.\n• The presence of multiple global offices means geographical distribution that can lead to difficulties in coordination.\n•  The diversity of cultural backgrounds sometimes leads to differences in ways of working and communicating, which increases complexity.",
      "choices": [
        {
          "text": "Team members are represented by diverse time zones",
          "correct": false
        },
        {
          "text": "Team members come from multiple global offices",
          "correct": false
        },
        {
          "text": "Team members have a variety of cultural backgrounds",
          "correct": false
        },
        {
          "text": "Team members use an agreed upon process to get the work done",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading an environmental project and realizes that they missed an influential foreign stakeholder. After the project manager contacted the stakeholder, the stakeholder requested a copy of the project documents in their local language.nnWhat should the project manager do next?",
      "explanation": "Correct answer: Update the stakeholder registry.\n\n- Detailed explanation:\nAccording to the PMBOK Guide, stakeholder management requires that the stakeholder register be constantly updated when new information or special requirements arise. When a stakeholder requests documents in a particular language, this affects the communication and risk management plan, and must be formally documented.\n\n- Other options error reason:\n• Escalating the issue to the project sponsor is not necessary at this stage.\n• Informing the stakeholder that documents are not available in another language may lead to communication failure.\n• Ignoring the request is a violation of the stakeholder management principle.",
      "choices": [
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        },
        {
          "text": "Tell the stakeholder that the documents are available only in the performing organization's language.",
          "correct": false
        },
        {
          "text": "Update the stakeholder register.",
          "correct": true
        },
        {
          "text": "Ignore the request and continue working.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with resources from multiple countries. What should the project manager develop to ensure the resources have access to the information they need?",
      "explanation": "Correct answer: Communication Management Plan.\n\n- Detailed explanation:\nThe CMP is the main document that specifies how, when, and where information reaches all parties involved in the project. This includes communication channels, frequency of meetings, language used, and shared documents.\n\n- Other options error reason:\n• Organizational asset (OPA) does not provide a detailed plan for the project itself.\n•  The Institutional Framework (OPM)  addresses the organization's overall methodology rather than the specifics of a particular project.\n•  The horizontal hierarchical focus relates to the structure of the organization, and does not specifically address the flow of information.",
      "choices": [
        {
          "text": "Organizational process asset (OPA) addressing organizational culture and structure.",
          "correct": false
        },
        {
          "text": "Organizational project management (OPM) framework.",
          "correct": false
        },
        {
          "text": "Communications management plan.",
          "correct": true
        },
        {
          "text": "Horizontal hierarchical focus.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager for an agile project finds that the project team is having communication issues, resulting in delays during the sprints.nnWhat should the project manager do first to resolve the issue?",
      "explanation": "Correct answer: Update your communication management plan.\n\n- Detailed explanation:\nIn agile projects, communication is an essential element to maintaining efficient workflows. When communication problems arise, the first step is to review and update your communication management plan to fit the team's new reality. This plan defines communication channels, timing, tools used, and each person's roles.\n\n- Other options error reason:\n• Sharing a regression chart helps track performance, but it doesn't address the communication issue itself.\n• Setting up daily standing meetings may already exist, but the problem here is bigger and requires updating the entire plan.\n• Addressing the issue in the backreview may be long overdue, and the priority here is immediate action.",
      "choices": [
        {
          "text": "Update the communication management plan.",
          "correct": true
        },
        {
          "text": "Share the burndown chart with the team.",
          "correct": false
        },
        {
          "text": "Set up daily standup meetings.",
          "correct": false
        },
        {
          "text": "Address this issue during the retrospective meeting.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is consolidating project documentation such as videos, pictures, audio, to ensure the team is sharing out project experiences. Where should this information be placed?",
      "explanation": "Correct answer: Lesson Learned.\n\n- Detailed explanation:\n Lessons Learned Register is where you collect all the information that may benefit the team or other projects in the future. This includes not only text documents, but also media such as images, videos, and audio, documenting how the project was implemented and what was learned.\n\n- Other options error reason:\n• The knowledge sharing log is not supported as an official tool in the PMP methodology.\n•  The risk log is risk-only and does not include this type of document.\n•  The problem log addresses issues of the project in progress and not the knowledge documentation.",
      "choices": [
        {
          "text": "Lessons learned register.",
          "correct": true
        },
        {
          "text": "Knowledge sharing register.",
          "correct": false
        },
        {
          "text": "Risk register.",
          "correct": false
        },
        {
          "text": "Issue log.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a project in a competitive market. The product must constantly be adapted based on changing market conditions and consumer expectations. The project team continuously develops and shares explicit knowledge, but the project manager would like to include tacit knowledge as well.nnWhat approach should the team take to gather tacit knowledge?",
      "explanation": "The correct answer: Create a platform for consumers to share their experiences.\n\n- Detailed explanation:\n Tacit Knowledge is knowledge that is difficult to write or document, such as customer experiences, feelings, and impressions. An effective way to gather this knowledge is through platforms that allow consumers to share their experiences directly. This can include forums, interactive surveys, or online reviews.\n\n- Other options error reason:\n• Transfer knowledge in the form of written evidence that relates to explicit knowledge and not implicit.\n• Training sessions with external companies that do not collect user experiences.\n• Continuous review of product requirements and performance is data analysis, not tacit knowledge gathering.",
      "choices": [
        {
          "text": "A real-time transfer of knowledge in the form of a manual.",
          "correct": false
        },
        {
          "text": "Arrange coaching sessions with an external data company.",
          "correct": false
        },
        {
          "text": "Continuously review product requirements and performance.",
          "correct": false
        },
        {
          "text": "Create a platform for consumers to share their experiences.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is not considered during project/phase closure?",
      "explanation": "Correct answer: Fast-tracking\n\n- Detailed explanation:\nDuring the closure of the project or phase, the focus is on activities that ensure the formal termination of the work such as celebrating the team, reviewing success factors, and transferring knowledge.  Fast-tracking is a technique used during project execution to reduce project duration through overlapping activities, and has nothing to do with the closure phase.\n\n- Other options error reason:\n- Team celebration ideas: important to appreciate the team's efforts and boost morale.\n- Critical success factors: reviewed to assess the extent to which they have been achieved.\n- Knowledge transfer: Documented experiences and lessons learned.",
      "choices": [
        {
          "text": "Team celebration ideas",
          "correct": false
        },
        {
          "text": "Critical Success Factors",
          "correct": false
        },
        {
          "text": "Fast-tracking",
          "correct": true
        },
        {
          "text": "Knowledge transfer",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is performed in project/phase closure?",
      "explanation": "Correct answer: Schedule and hold a meeting for lessons learned\n\n- Detailed explanation:\nLessons learned meeting takes place at the project closing stage to collect experiences and information from all participants in order to improve the performance of future projects.\n\n- Other options error reason:\n- Project start meeting: takes place at the beginning of the project.\n-  Change monitoring meeting: takes place during project execution.\n- Project Status Meeting: Occurs during the project and not at closing.",
      "choices": [
        {
          "text": "Schedule and conduct a project kickoff meeting.",
          "correct": false
        },
        {
          "text": "Schedule and conduct a lessons learned meeting.",
          "correct": true
        },
        {
          "text": "Schedule and conduct a change control meeting.",
          "correct": false
        },
        {
          "text": "Schedule and conduct a project status meeting.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is not part of the Validate Release in Transition phase?",
      "explanation": "Correct answer: Publish registration\n\n- Detailed explanation:\nVersion verification focuses on ensuring the quality and correct delivery of the product to the end user, including deployment testing, stakeholder engagement and satisfaction questionnaires. Deployment registration is an administrative step that occurs after version verification.\n\n- Other options error reason:\n- Deployment testing: necessary to ensure that the system is working.\n- Active participation of stakeholders: ensures their acceptance of the product.\n- Stakeholder satisfaction questionnaire: to ensure that the product meets expectations.",
      "choices": [
        {
          "text": "Production deployment testing.",
          "correct": false
        },
        {
          "text": "Active stakeholder participation.",
          "correct": false
        },
        {
          "text": "Stakeholder satisfaction survey.",
          "correct": false
        },
        {
          "text": "Log the deployment.",
          "correct": true
        }
      ]
    }
  ]
}