{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "Two project managers are working on resourcing their respective projects. Both project managers identified the same subject matter expert (SME) as being beneficial to their project. Project A is using a predictive approach and Project B is using an agile approach.nnTo which project should the SME be allocated?",
 "explanation": "The right solution is to assign the expert to Project B because the agile approach relies on self-organizing teams that need direct and continuous technical support to maximize value via short iterations and incremental delivery. Having SME with the team enhances quality and flexibility. \n\nOther options are incorrect because Project A (predictive approach) is based on a pre-detailed plan and does not need the same level of real-time interaction with SME. Resource allocation in the experience of the project manager is not an approved standard for resource management. Also, prioritizing advance planning in Project A goes against Agile's value-driven and flexible nature.",
      "choices": [
        {
          "text": "The SME should be assigned to Project A because project planning was based on the support of the SME.",
          "correct": false
        },
        {
          "text": "The SME should be assigned to Project B because success in an agile project is determined by technical excellence.",
          "correct": false
        },
        {
          "text": "The SME should be assigned to the project with the less experienced project manager to improve the likelihood of success.",
          "correct": false
        },
        {
          "text": "The SME should be assigned to Project B because agile approaches prioritize flexibility and adaptability.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A senior stakeholder was invited to a sprint review meeting and asked a project team member to describe the final product that the project will deliver. The team member was unable to respond and deferred the question to a more senior member of the team.nnWhat should have been done differently in this situation?",
 "explanation": "The correct solution is for the team member to direct the stakeholder to question the product owner because the product owner is responsible for clarifying the details and objectives of the final product according to the Scrum Guide and PMBOK. The product owner has the vision, the plan, and the authority to decide on product requirements.\n\nOther options are incorrect: Asking Scrum Master is inappropriate because he is not responsible for the details of the product but for the processes. Deferring the question is not practical because the Sprint  review aims for prompt and transparent communication. The project manager is not part of Scrum's official roles and is not responsible for determining product details.", 
      "choices": [
        {
          "text": "The team member should have advised the stakeholder to ask the scrum master.",
          "correct": false
        },
        {
          "text": "The team member should have advised the stakeholder to ask the product owner.",
          "correct": true
        },
        {
          "text": "The stakeholder should have held their questions until the next sprint review meeting.",
          "correct": false
        },
        {
          "text": "The stakeholder should have directed their questions to the project manager.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a software development project, a stakeholder wants to add a major requirement, which they feel will be a great benefit to the project. However, this requirement is not aligned to the project objectives that the business owner has documented.nnWhat should the project manager do next?",
      "explanation": "The right solution is to ensure that the stakeholder understands the objective of the project as this is in line with the stakeholder management process as per PMBOK. The goal is to sensitize stakeholders so that requirements outside the scope of the project are not proposed. Any change should only be made through change management processes.\n\nOther options are incorrect: Stakeholder encouragement is not enough without formal clarification of objectives. Introducing the requirement without review contradicts domain management. Accelerating the project while proposing new requirements is illogical and threatens the success of the project.", 
      "choices": [
        {
          "text": "Ensure the stakeholder understands the purpose of the project.",
          "correct": true
        },
        {
          "text": "Encourage the stakeholder to follow the written business requirements.",
          "correct": false
        },
        {
          "text": "Include the additional requirement into the project and inform the business owner.",
          "correct": false
        },
        {
          "text": "Fast-track the project and suggest the new requirement to the business owner.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a hybrid project, a project manager reviews the project team's performance and realizes that the team's velocity is not fast enough to meet the next review gate goal. What should the project manager do?",
 "explanation": "The correct answer is: Use daily meetings to assess obstacles and problems.\n\nDaily meetings help identify obstacles that affect team performance on an ongoing basis, and allow problems to be addressed before they escalate. This procedure is best suited to improve performance without having to change the scope or duration of the project.\n\nOther options are incorrect: Removing items from the product record affects the scope and must be done through formal procedures. Increasing the duration of Sprint is unacceptable because the duration of Sprint is fixed. Submit a change request to modify objectives Used only when they cannot be achieved after attempting internal processing.",
      "choices": [
        {
          "text": "Prioritize the contents of the backlog and remove some stories.",
          "correct": false
        },
        {
          "text": "Increase the sprint duration to allow the team more time.",
          "correct": false
        },
        {
          "text": "Use the standup meeting to assess impediments and problems.",
          "correct": true
        },
        {
          "text": "Create a change request to modify the review gate goals.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is developing a project management plan. The project duration is set for three months due to regulatory compliance and dependency on senior staff.nnWhich two project objectives should be defined well enough to be included in the project management plan? (Choose two)",
      "explanation": "The correct answers are: develop detailed process maps, identify training needs, and create a development plan.\n\nThe project management plan should include objectives that are directly related to the scope of the project and the required deliverables within the specified time period. The objectives related to process maps and training plans are related to the achievement of clear and measurable results.\n\nOther options are incorrect because they are not directly related to project deliverables or are considered long-term goals and do not affect the success of the project within its specified framework.",
      "choices": [
        {
          "text": "Improve the processes and reduce rework by keeping senior staff turnover to a minimum level.",
          "correct": false
        },
        {
          "text": "Develop detailed process maps to align operational activities with the new software system.",
          "correct": true
        },
        {
          "text": "Enhance the development process by redesigning new templates for the design documentation.",
          "correct": false
        },
        {
          "text": "Reduce the company's environmental footprint by using detailed recycling guidelines for all employees.",
          "correct": false
        },
        {
          "text": "Identify training needs and create a development plan to complete the delivery in three months.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the first meeting about a road construction project, the project manager reminds the team of the importance of observing all rules when carrying out their duties and interacting with stakeholders. Later in the project, team members start coming to meetings late and do not follow other ground rules.nnTo ensure the project outcomes and schedule are not affected, what should the project manager do next?",
 "explanation": "The correct answer is: Address the issue with specific team members who violated the rules.\n\nIt is the responsibility of the project manager to deal with performance issues directly with the concerned members to correct behavior and ensure that the workflow continues effectively.\n\nOther options are incorrect: Removing members is an escalatory step and is inappropriate unless repair attempts fail. Promoting committed members is an unrelated action that resolves the issue. Allowing the team to investigate each other creates an unhealthy environment and affects the collective spirit.",
      "choices": [
        {
          "text": "Address the issue with the specific team members who violated the ground rules.",
          "correct": true
        },
        {
          "text": "Remove the team members who violated the ground rules.",
          "correct": false
        },
        {
          "text": "Promote all team members who do not violate any ground rules.",
          "correct": false
        },
        {
          "text": "Allow the team to investigate any team members who violate the ground rules.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a mobile application development project. The project manager realizes that an agile approach is better suited for the project, but most of the team is not experienced in agile approaches.nnWhat should the project manager do next if the organization is open to using an agile approach?",
      "explanation": "The correct answer: Organize training around the principles and mindset of the agile approach for current team members.\n\nCause: When applying a new approach such as Agile within a team that doesn't have enough experience, the first step is to empower the team through training and capacity building. This is in line with team development management, where coaching is a way to increase team skills and improve performance, without the need to change or replace the team.\n\nWhy other options are wrong:\n- Requesting to reassign the project to an experienced team: It is not always a realistic option and means abandoning the current team instead of developing it.\n- Requesting the replacement of team members: Causes the project to be disrupted and the organization loses opportunities to develop the skills of its employees.\n- Using a predictive approach:  contradicts the requirements of the project, especially if Agile is the most technically and practically appropriate.",
      "choices": [
        {
          "text": "Request that the project be reassigned to a project team with agile experience.",
          "correct": false
        },
        {
          "text": "Ask to replace the team members who have never used agile approaches.",
          "correct": false
        },
        {
          "text": "Arrange training on agile principles and mindset for the existing project team.",
          "correct": true
        },
        {
          "text": "Use a predictive approach since the project team is already familiar with that approach.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to the complex nature of a predictive project, an organization decides to use an agile approach for a project phase. A team member does not really understand the agile approach and keeps allocating tasks to the rest of the team members. After a while, the team is not able to adjust by itself and conflicts arise, delaying the deliverables.nnWhat should the project manager do?",
      "explanation": "Correct answer : Reaffirm Agile's principles and roles to create a structure that the team can use.\n\nCause: When a team moves from a traditional approach to Agile and a misunderstanding of roles occurs, the best action is to return to the basic principles and explain how the team is self-organized, and explain the difference between the distribution of tasks by individuals and the mechanism of work in Agile.\n\nWhy are other options wrong:\n- Team member replacement: hasty solution, and first try to raise awareness and training.\n- Wait until the team can resolve the conflict: This may increase the conflict without clear results.\n- Take control of the Sprint record : contradicts the principle of self-organizing the team and turns the project manager into a micromanager.",
      "choices": [
        {
          "text": "Replace the team member with someone who has agile experience.",
          "correct": false
        },
        {
          "text": "Wait until the team is finally able to solve the conflict by itself and reorganize.",
          "correct": false
        },
        {
          "text": "Reaffirm the principles and roles of agile to create structures that the team can use.",
          "correct": true
        },
        {
          "text": "Take control of the sprint backlog and assign tasks to the team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A multi-year project is underway when a key resource announces that they are retiring. The project manager is concerned about the impact on the project and has identified that several critical tasks will be affected.nnWhat should the project manager do?",
      "explanation": "Correct answer: Collaborate with the resource manager to identify and train an appropriate replacement.\n\nCause: When a key resource is lost, the project manager must take proactive steps to ensure business continuity. Collaborating with resource management allows a qualified replacement to be found before the current person leaves, preserving knowledge within the team and providing a smooth transfer of tasks.\n\nWhy are other options wrong:\n- Request to work overtime: Exhausts the team and does not solve the problem in the long run.\n- Inform stakeholders directly: This is a negative behavior that shows a failure to manage the problem instead of addressing it.\n- Encourage the supplier to postpone their retirement:  An impractical and unreliable solution in risk management plans.",
      "choices": [
        {
          "text": "Require the remaining team members to work additional hours to complete the impacted tasks.",
          "correct": false
        },
        {
          "text": "Advise the stakeholders that the resource's tasks will not be completed on time.",
          "correct": false
        },
        {
          "text": "Collaborate with the resource manager to identify and train an appropriate replacement.",
          "correct": true
        },
        {
          "text": "Encourage the retiring team member to postpone retirement to avoid disrupting the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is handling multiple projects in five different countries and is issued a new directive on workplace attire and office arrangements. This has been met with resistance in three countries, resulting in a series of misunderstandings, resentment, and potential legal issues.nnWhat should the project manager have done to better handle this situation?",
      "explanation": "The correct answer: assess the cultural and personal characteristics of different countries before issuing a general directive.\n\nInterpretation: In projects implemented across multiple international environments, stakeholder management and resource management take into account cultural, social and legal differences between countries. Issuing standardized directives without assessing local characteristics may lead to internal resistance and legal issues as in this scenario. The project manager should have previously assessed the impact of the policies on each country to ensure their relevance and acceptance.\n\nWhy other options are wrong:\n- Request clarification and exceptions from senior management: A subsequent rather than proactive action, which means that the problem has already occurred.\n- Determining socioeconomic status: is not the main criterion here, because the objection was cultural and legal.\n- Getting a list of personal preferences: Impractical in complex multi-country environments and goes beyond project management to a detailed management level that is not specific to the project.",
      "choices": [
        {
          "text": "Asked senior management for clarity and exceptions before issuing a general directive to all countries.",
          "correct": false
        },
        {
          "text": "Evaluated the cultural and personal traits in the various countries before issuing a general directive.",
          "correct": true
        },
        {
          "text": "Determined the socioeconomic status of the team members before issuing a widespread directive.",
          "correct": false
        },
        {
          "text": "Obtained a list of personal preferences from the team members before issuing a broad directive.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An events company is planning a new event for a client that holds biannual conferences. The project is being managed by a new project manager who has reviewed the lessons learned log from the last event and is concerned that a past issue may reoccur.nnHow should the project manager proceed?",
      "explanation": "Correct answer: identify the root cause of the problem and consult with stakeholders.\n\nExplanation: The project manager is responsible for making sure that the same mistakes that occurred previously are not repeated. Reviewing the record of lessons learned is a correct start, but to deal effectively, you must look for the root cause that led to this problem in the past, and then consult with key stakeholders to ensure that appropriate and preventive solutions are in place. This is in line with risk management and knowledge management in the project.\n\nWhy are other options wrong:\n- Addressing the problem if it arises during planning: Reactive, not preventive, and does not prevent its recurrence.\n- Conference rescheduling suggestion: Acting exaggerated before assuring that it is really necessary.\n- Implementing the same strategies: This exposes the project to the same previous errors without any improvement.", 
      "choices": [
        {
          "text": "Identify the root cause and consult with stakeholders.",
          "correct": true
        },
        {
          "text": "Handle the issue if it arises during the event planning.",
          "correct": false
        },
        {
          "text": "Recommend rescheduling the upcoming conference.",
          "correct": false
        },
        {
          "text": "Implement the same strategies used in the last event.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During sign-off for a strategic project that resulted in additional costs, a project manager was unable to justify the additional expense in relation to the business value realized with the successful implementation. What should the project manager have done to avoid this situation?",
      "explanation": "The correct answer: Measure and track the benefits identified in the feasibility study throughout the project life cycle.\n\nExplanation: In Benefits Realization Management, it is essential that the project manager not only estimates the benefits at the beginning of the project, but also keeps track of those benefits and measures them continuously during implementation and even after the project is closed. This ensures that there is clear data to support any additional expenses and proves the value actually realized.\n\nWhy other options are wrong:\n- Provide only an initial assessment: Not enough because it loses credibility if the actual results are not measured.\n- Perform a post-implementation reassessment: A very late and impractical step, especially if objections arise during implementation.\n- Share only intangible benefits:  These benefits may be real but they are not enough to justify the additional costs without support in numbers.",
      "choices": [
        {
          "text": "Presented an evaluation of the potential benefits identified in the initial business case as enough to justify additional expense costs.",
          "correct": false
        },
        {
          "text": "Measured and tracked the project benefits identified in the business case throughout the project life cycle.",
          "correct": true
        },
        {
          "text": "Performed a reassessment of the current state of the organization after project implementation to show the benefits realized.",
          "correct": false
        },
        {
          "text": "Shared nonfinancial or intangible benefits such as customer satisfaction and good reputation as indicators for showing the value realized.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager takes over a construction project. Upon reviewing the project management plan, the project manager realizes that the health and safety requirements have not been adequately addressed. The project manager has serious concerns and wants to address this inadequacy.nnWhat is the primary concern in this situation?",
 "explanation": "Correct answer: The project must comply with all legal and regulatory requirements and responsibilities.\n\nDetailed explanation:\nIn construction projects, health and safety are one of the most important elements that cannot be compromised, because non-compliance with their standards and laws exposes the project to serious legal risks that include fines, work stoppages, and even lawsuits. These risks are not limited to financial impact, but extend to the impact on the organization's reputation and stakeholder relations.\n\nThe primary focus is on legal and regulatory compliance, as this forms the basis on which any health and safety action is built. Any shortcoming in this aspect exposes the project to major problems, and makes other things such as schedule or quality of work less important in comparison.\n\nDetail options:\n- Not addressing health and safety issues can damage customer trust and project reputation: Partially true, but this is a secondary effect. The most important is legal compliance.\n-  The schedule may be compromised when implementing additional safety measures:  This may happen, but it is secondary and should not affect compliance with safety standards.\n- The project manager knows that it is necessary to achieve the specified performance indicators: performance indicators are important, but they do not exceed the importance of legal health and safety.",
      "choices": [
        {
          "text": "Failing to address health and safety issues could damage the client's trust and reputation.",
          "correct": false
        },
        {
          "text": "The project must comply with all legal and regulatory requirements and responsibilities.",
          "correct": true
        },
        {
          "text": "The project timeline may be jeopardized by implementing additional safety measures.",
          "correct": false
        },
        {
          "text": "The project manager knows that it is crucial to meet the established performance metrics.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A construction project has progressed for about 18 months, and the schedule performance index (SPI) is 0.68. The project manager intends to complete the project as planned without additional cost.nnWhat should the project manager do to complete the project on time?",
      "explanation": "Correct answer: Speed up the schedule by running tasks in parallel (Fast track).\n\nDetailed explanation:\nThe Timesheet Performance Indicator (SPI) is less than 1 means that the project is behind schedule. To return the project to the table, there are several strategies:\n- Fast tracking: Perform activities that were planned sequentially in parallel or nested. This helps reduce time without significantly increasing costs, but increases the risk of overlapping tasks.\n- Crashing: Increase resources to speed up tasks, but this usually leads to an increase in costs.\n\nSince the question requirement is no additional costs, Fast tracking is the most appropriate solution.\n\nBreakdown options:\n. Accelerating the schedule by increasing resources (Crash): leads to increased cost, which is undesirable.\n- Reducing project scope: requires formal review and change management, and does not guarantee that the project is completed on time.\n- Reducing project quality: unacceptable because it affects project outcomes and acceptance.",
      "choices": [
        {
          "text": "Crash the schedule.",
          "correct": false
        },
        {
          "text": "Fast track the schedule.",
          "correct": true
        },
        {
          "text": "Reduce the project scope.",
          "correct": false
        },
        {
          "text": "Reduce the project quality.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The sponsor for a multimillion-dollar project has just called the project manager for a crisis meeting. The client submitted a formal request to drastically compress the schedule in order to meet a legal deadline.nnWhat should the project manager do to prepare for the meeting?",
      "explanation": "Correct answer: Prepare a change impact assessment report for review at the meeting.\n\nDetailed explanation:\nRequest to drastically reduce the schedule A material change request needs to be carefully evaluated before any executive action can be taken. The project manager is responsible for:\n- Analyze the impact of this demand on project scope, costs, quality, resources, and risks.\n- Evaluate the current schedule and how it can be adjusted in the best way (Fast tracking or Crashing) while understanding the implications of each option.\n- Prepare a clear and objective report to be presented to the sponsor and stakeholders to help them make a decision.\n\nPerform any modification without careful evaluation that may lead to unexpected problems and failure to achieve the goal.\n\nBreakdown options:\n- Start Fast tracking or Crashing directly: Not suitable without studying the impact.\n- Implement change directly: Lacks systematic management and puts the project at risk.\n- Analysis of accelerator tools only: Not enough without a comprehensive change impact report.", 
      "choices": [
        {
          "text": "Initiate procedures to fast-track the project.",
          "correct": false
        },
        {
          "text": "Implement the required changes to the project schedule.",
          "correct": false
        },
        {
          "text": "Analyze tools to crash the project activities.",
          "correct": false
        },
        {
          "text": "Prepare a change impact assessment report for review.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The lead sales manager and team are unable to submit a project status report on time for the new sales report integration project. Additionally, the report does not meet the expectations highlighted in the group review meetings.nnWhat should the project manager do first?",
      "explanation": "Correct answer: Evaluate the team's understanding of the work plan by asking for their feedback.\n\nExplanation: If the status report is not submitted on time and expectations are not met, the first logical step is to understand whether the team has a clear understanding of the work plan and the objectives of the report. There may be a lack of understanding or communication leading to unsatisfactory performance. After evaluation, the project manager can determine if there is a need for retraining or clarification of responsibilities.\n\nWhy other options are wrong:\n- Making sure the plan is documented and shared is important, but it comes after making sure the team has a practical understanding.\n- Increasing team meetings may increase stress without addressing the real cause.\n- Giving more time without knowing the real problem can lead to repeated failure.", 
      "choices": [
        {
          "text": "Evaluate the team's understanding of the action plan by requesting their feedback.",
          "correct": true
        },
        {
          "text": "Confirm the plan is documented and shared among the team and stakeholders.",
          "correct": false
        },
        {
          "text": "Increase the frequency of the team meetings for the status report submission.",
          "correct": false
        },
        {
          "text": "Ensure that team members are provided with more time to deliberate and plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is involved in a project where requirements are constantly evolving.nnWhat should the project manager do to achieve success?",
      "explanation": "Correct answer: Provide regular updates and request approval of results from the product owner.\n\nExplanation: In an environment where requirements are constantly changing, constant communication with the product owner is very important to ensure that the project aligns with business expectations. Providing regular updates ensures transparency, minimizes surprises, and provides an opportunity for ongoing approvals that help guide the project properly.\n\nWhy are other options wrong:\n- Working with the team on the right track is important, but it is not enough without communication with the product owner.\n- Providing a relaxed atmosphere that helps the team but does not address changing requirements.\n- Process documentation is important, but approval from the product owner is a priority in this context.", 
      "choices": [
        {
          "text": "Provide regular updates and request deliverable-based approvals from the product owner.",
          "correct": true
        },
        {
          "text": "Work with the team to ensure they are on track and delivering on schedule.",
          "correct": false
        },
        {
          "text": "Maintain a comfortable working atmosphere to improve team cohesion.",
          "correct": false
        },
        {
          "text": "Ensure documentation and processes are filed appropriately and update the product owner.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to redesign a store's point-of-sale system. The team is currently testing the new functionality when a key stakeholder proposes a change. The change can bring a significant benefit and increase customer satisfaction, but it also requires more resources.nnactions What should the project manager take?",
      "explanation": "Correct answer: Document proposed changes and assess their impact on time, cost, and resources.\n\nExplanation: Changes that require additional resources may significantly affect project scope, timeline, and cost. The project manager should follow change management procedures by documenting the proposed change, analyzing its overall impact, and then submitting it for review and approval by stakeholders before implementation. This maintains control over the project and prevents random adjustments that may lead to budget overruns or delays.\n\nWhy other options are wrong:\n- Stopping testing immediately may stop progress for no apparent reason.\n- Continuing testing while discussing the change may lead to a conflict of priorities.\n- Deferring and not reviewing changes may miss an opportunity to improve customer satisfaction and project development.", 
      "choices": [
        {
          "text": "Stop the testing and schedule a meeting to review the proposed changes with the resources.",
          "correct": false
        },
        {
          "text": "Complete testing while the project manager meets with the key stakeholder to review the proposed changes.",
          "correct": false
        },
        {
          "text": "Document the proposed changes and assess any impact on time, cost, and resources.",
          "correct": true
        },
        {
          "text": "Postpone the proposed changes and allow the team to complete the testing and implementation activities.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is currently behind schedule when a new team member, known for their high performance, is assigned to the team. While assessing the new team member, the project manager realizes that the individual lacks training for the specific project but has the skills and relevant experience to join the team.nnWhat should the project manager do?",
      "explanation": "Correct answer: Assign the new member to non-critical tasks without close monitoring and provide training.\n\nDetailed explanation:\nIf a new member has high general experience and skills but lacks project-specific training, assigning them directly to critical tasks may expose the project to significant risks due to their lack of familiarity with the specifics. Therefore, he is assigned to less sensitive tasks first to ensure that the work is stable and does not affect the schedule.\nIn parallel, it provides him with the necessary training to be qualified to take on more important tasks later.\n\nWhy are other options wrong:\n- Ensure that the member receives training before joining: This may cause unnecessary delays, especially in a delayed project.\n- Assign him to critical tasks with careful monitoring:  Despite monitoring, critical tasks require full knowledge and this may cause errors.\n- Refusal to add the new member: irrational, because the member has valuable experience and must benefit from it.",
      "choices": [
        {
          "text": "Ensure that the team member receives training before joining the team.",
          "correct": false
        },
        {
          "text": "Assign the new team member to critical activities under close monitoring while they receive training.",
          "correct": false
        },
        {
          "text": "Assign the new team member to noncritical activities without close monitoring while training is provided.",
          "correct": true
        },
        {
          "text": "Decline the addition of the new team member to the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is responsible for leading a product release that has aggressive go-to-market timelines. A total of 600 story points is estimated with a velocity of 60 points per iteration. A team of up to 12 members has been assigned to this project.nnWhich statement about this scenario is true?",
 "explanation": "Correct answer: The speed of 60 points in each cycle represents the minimum amount of work, and 12 members represent the maximum team size.\n\nDetailed explanation:\nIn the context of Agile projects, speed refers to the amount of work that the team can accomplish in a single Sprint cycle. A speed of 60 points means that the team accomplishes at least 60 work points per cycle.\nTeam size 12 is usually the recommended upper limit for team members to ensure effective communication and good coordination. Larger teams may suffer from communication complexities and reduced productivity.\n\nWhy are other options wrong:\n- Considering that a speed of 60 points means that the project is under control, this is not enough without comparing with the workload and project requirements.\n- Not considering 12 members The correct maximum team size in the  Agile context.\n- Linking team size to the concept of direct project control is a wrong simplification.",
      "choices": [
        {
          "text": "A velocity of 60 points per iteration represents the minimum work to be done, and 12 team members represent the maximum size of the team.",
          "correct": true
        },
        {
          "text": "A velocity of 60 points per iteration means the project is under control, and 12 team members mean that the project is out of control.",
          "correct": false
        },
        {
          "text": "A velocity of 60 points per iteration means the project is under control, and 12 team members represent the maximum size of the team.",
          "correct": false
        },
        {
          "text": "A velocity of 60 points per iteration represents the minimum work to be done, and 12 team members means the project is under control.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While attending a governance meeting with upper management, a project manager is verbally informed about an impending external audit of selected projects. The audit will enable the organization to maintain its quality certification.nnWhat should the project manager do first to prepare for the audit?",
 "explanation": "Correct answer: Contact auditors to understand the scope and requirements of the audit.\n\nDetailed explanation:\nThe first step to preparing for any external audit is to understand the nature of the audit, its scope, and the evidence or documents that the auditors will require. Early communication with auditors enables the project manager to identify potential weaknesses, prepare the team, and direct efforts towards the required areas.\n\nAct quickly and clearly at this stage helps to reduce surprises and ensure that the project adheres to the required standards.\n\nWhy other options are wrong:\n- Updating all documents is important but a next step after understanding the audit requirements.\n- Stopping the project is unnecessary and may cause unjustified disruptions.\n- A meeting with the team to inform them is useful, but it should take place after the scope and requirements of the audit have been accurately defined.",
      "choices": [
        {
          "text": "Update all relevant project documentation with the current status of the project.",
          "correct": false
        },
        {
          "text": "Put the project on hold to ensure full compliance with the auditing process.",
          "correct": false
        },
        {
          "text": "Contact the auditors to understand the scope and requirements of the audit.",
          "correct": true
        },
        {
          "text": "Meet with the team and inform them of the scope and requirements of the audit.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An information technology (IT) project manager was assigned a new team for a software development project in an agile environment. The project manager estimates that the project will take a certain number of days based on past experience in another organization.nnHow should the project manager validate this assumption and properly plan and manage the project schedule?",
      "explanation": "In an agile environment, it is not only based on the experience of the project manager, but the entire team must be involved to estimate the duration of the project.\n\n- Why the right choice?\nUsing team estimates across story points and monitoring achievement speed gives a realistic estimate that reflects the capabilities of the current team.\n\n- Why are other options wrong?\n- Conduct an internal survey: Gives general data but not assigned to the new team.\n- Estimate based on a Sprint review: It depends on actual performance and not on advance planning.\n- Studying previous meetings and cultural context: does not give an accurate picture of the current capabilities of the team.",
      "choices": [
        {
          "text": "Conduct a survey in the organization and generate data to validate claims.",
          "correct": false
        },
        {
          "text": "Estimate based on sprint review meetings and stakeholder input.",
          "correct": false
        },
        {
          "text": "Study previous sprint planning meetings and the organization's project culture.",
          "correct": false
        },
        {
          "text": "Ask the team members to estimate the number of story points and observe team velocity.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A global, cross-functional team has been assembled to deliver a multinational initiative. What should the project manager do to ensure that there is full team participation throughout the project?",
      "explanation": "When managing global teams, the main challenge is different time zones and cultures.\n\n- Why the right choice?\nCoordinate time zones and agree on meeting times ensures everyone attends and enhances communication, especially when there are differences in geography.\n\n- Why are other options wrong?\n- Ensure that the program is available in multiple languages: It may be useful but does not guarantee that everyone participates in meetings.\n- Translation of project documents: A supportive measure but does not address the problem of direct attendance.\n- Provide guidance on tools and practices: important for organization, but direct communication remains the critical element to ensure actual participation and daily follow-up.",
      "choices": [
        {
          "text": "Coordinate time zone information and agree to meeting times.",
          "correct": true
        },
        {
          "text": "Ensure software is delivered in multiple languages.",
          "correct": false
        },
        {
          "text": "Translate the project documentation.",
          "correct": false
        },
        {
          "text": "Provide guidance on common tools and practices.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager communicates with a key stakeholder via phone calls only, as indicated in the communication management plan. Three weeks into the execution of a project, the project manager begins receiving an increasing amount of redundant ad-hoc communication requests from that stakeholder.nnHow should the project manager address this issue?",
      "explanation": "A change in the communication pattern usually indicates that the needs of the stakeholder are not met as per the original agreement.\n\n- Why the right choice?\nDirect meeting with the stakeholder allows understanding its real reasons and needs and updating the communication plan to suit the new situation, which maintains trust and clarity.\n\n- Why are other options wrong?\n- Continuing to call only: may result in loss of stakeholder trust or missing important information.\n- Send email: does not give flexibility for discussion and understanding about details.\n- Appointing a team member as a mediator: reduces transparency and complicates lines of communication rather than simplifying them.",
      "choices": [
        {
          "text": "Continue with phone call communication as it has been effective so far.",
          "correct": false
        },
        {
          "text": "Meet with the stakeholder to discuss their communication needs and expectations.",
          "correct": true
        },
        {
          "text": "Send an email to the stakeholder requesting a change in communication approach.",
          "correct": false
        },
        {
          "text": "Assign a team member to act as a liaison between the project manager and the stakeholder.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team working on a high-priority, change-driven project has repeatedly missed release deadlines. The project manager identifies that this is due to the fact that an experienced team member is assigned to multiple projects and has limited bandwidth.nnWhat should the project manager do?",
      "explanation": "When a team fails to meet deadlines, you must first analyze the underlying cause.\n\n- Why the right choice?\nEvaluating a team member's workload helps to understand the real capacity available to them and determine if the work allocation needs to be adjusted.\n\n- Why are other options wrong?\n- Inform sponsor directly: A hasty step without collecting clear data.\n- Modify the schedule and submit a change request: based on assumptions and not on actual analysis.\n- Discuss the problem with the team immediately: may lead to inaccurate conclusions without an objective assessment of the workload.",
      "choices": [
        {
          "text": "Report the issue to the project sponsor.",
          "correct": false
        },
        {
          "text": "Adjust the schedule and issue a change request.",
          "correct": false
        },
        {
          "text": "Discuss this issue with the project team immediately.",
          "correct": false
        },
        {
          "text": "Evaluate the workload of the experienced team member.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a product acceptance test for a software project, the project sponsor tells the project manager that the software will only pass if the theme color is changed from red to blue. The project manager reviewed the planning documents and confirmed that the theme color should be red. The sponsor insists that the color be changed to blue.nnWhat should the project manager do next?",
      "explanation": "In such cases, changes must be handled through official channels.\n\n- Why the right choice?\nRequest a formal change that preserves the rights of both parties and ensures that the decision is documented and reviewed by the concerned parties according to the agreed process.\n\n- Why are the other options wrong?\n- Inform the sponsor of the acceptance of the color as is: may lead to future disputes and weaken the relationship.\n- Directly approve the color change: It harms the control of the project scope.\n- Request from the procurement department to change the color: Override the authority of the project manager without formal procedures.",
      "choices": [
        {
          "text": "Suggest that the project sponsor submit a formal change request to change the requirement for the theme.",
          "correct": true
        },
        {
          "text": "Tell the project sponsor to accept the theme because the contract clearly states it should be red.",
          "correct": false
        },
        {
          "text": "Agree with the project sponsor and change the theme color as requested to avoid potential conflict.",
          "correct": false
        },
        {
          "text": "Request that procurement change the theme color to blue to align with the project sponsor's expectations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager observes that team members are not collaborating or being proactive. What should the project manager have done at the beginning of the project to achieve a better project environment?",
      "explanation": "Poor collaboration within the team is often due to ignoring the assessment of team dynamics from the start.\n\n- Why the right choice?\nConduct an assessment of team dynamics that helps determine the style of work, communication, and distribution of roles based on personalities and competencies.\n\n- Why are other options wrong?\n- Allocate tasks directly: may lead to unbalanced distribution.\n- Facilitate additional meetings: a subsequent rather than preventive measure.\n- Splitting the project into additional rounds: does not solve the behavioral problem among members.",
      "choices": [
        {
          "text": "Conducted an assessment of team dynamics.",
          "correct": true
        },
        {
          "text": "Assigned all tasks at the beginning of the project.",
          "correct": false
        },
        {
          "text": "Facilitated additional team meetings.",
          "correct": false
        },
        {
          "text": "Split the project into more iterations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the end of the first phase of a stadium expansion project, the project manager realizes they will be running behind schedule for the next project phase. The delay is due to new safety requirements that must be adhered to. Stakeholders are frustrated that they were not aware of the potential safety requirement changes.nnWhat should you have done to avoid this situation and ensure that stakeholders are aware of potential disruptions?",
      "explanation": "When managing a long and complex project such as a stadium expansion, it is important to anticipate risks that may affect the schedule.\n\n- Why the right choice?\nImplement a risk assessment process at the beginning of the project that allows the identification of potential delays, such as safety requirements, and the development of a proactive plan to deal with them.\n\n- Why are other options wrong?\n- Increasing the financial reserve: Helps cover costs but does not guarantee stakeholder awareness.\n- Holding regular meetings only: an interactive method, not a preventive.\n- Requesting additional resources when the problem arises: Delayed reaction, and does not prevent the problem from occurring in the first place.",
      "choices": [
        {
          "text": "Increase the project's contingency reserve to accommodate unforeseen safety-related issues.",
          "correct": false
        },
        {
          "text": "Hold regular communication meetings with the site supervisor to stay updated on safety requirements.",
          "correct": false
        },
        {
          "text": "Implement a proactive risk assessment process during project initiation to identify potential safety-related delays.",
          "correct": true
        },
        {
          "text": "Request additional resources and personnel to address safety concerns as they arise.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager realizes that the team needs training on a specific technology that is required in the project. What should the project manager do to mitigate this risk?",
      "explanation": "Training is a risk in technical projects if it is not handled from the beginning.\n\n- Why the right choice?\nEvaluating team knowledge and looking for appropriate training options is the proactive solution to ensure team readiness and not delay the project later.\n\n- Why are other options wrong?\n- Hiring an expert provider: An expensive solution that may not build team capabilities.\n- Create a line in the risk log: A management step only and does not actually address the risk.\n- Addressing gaps when they arise: A delayed reaction method, leading to delays and possibly cost increase.",
      "choices": [
        {
          "text": "Assess the team's knowledge of the technology and look for recommended training options.",
          "correct": true
        },
        {
          "text": "Contract with an expert provider to do the piece of work that uses that specific technology.",
          "correct": false
        },
        {
          "text": "Create an item in the risk log and notify the sponsor.",
          "correct": false
        },
        {
          "text": "Fix any training gaps as they arise during the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a long-term project with a duration of three years. Which approach should the project manager take to address near-term activities, while long-term work is planned at a high level and detailed later?",
      "explanation": "In long-term projects, it is difficult to fully plan from the outset due to possible changes.\n\n- Why the right choice?\nRolling wave planning allows focusing on nearby activities in greater detail, while distant works remain generally planned and detailed later.\n\n- Why are other options wrong?\n- Team focus and fast delivery: does not address long-term needs.\n- Sponsor involvement only: an important step but not a comprehensive plan.\n- Scheduling workshops: sets appointments but does not provide a flexible detailed plan.",
      "choices": [
        {
          "text": "Focus on acquiring a team and deliver as soon as possible.",
          "correct": false
        },
        {
          "text": "Engage the sponsor in the validation and prioritization processes.",
          "correct": false
        },
        {
          "text": "Perform workshops with the client for delivery dates.",
          "correct": false
        },
        {
          "text": "Validate the requirements and perform rolling wave planning.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a kick-off meeting, the sponsor informs the project team that they can not attend any meetings for the first half of the project. The sponsor would like to assign a replacement.nnWhat should the project manager do?",
      "explanation": "When the sponsor is not available, it is necessary to ensure continuity of support and decision-making for the project.\n\n- Why the right choice?\nAnalysis of the impact of the absence of the sponsor helps to understand the magnitude of the impact on the project, and to work with the sponsor to identify an appropriate alternative that ensures the continuity of formal decision-making.\n\n- Why are other options wrong?\n- Request that the substitute be an authority-holder: This is part of the solution but not the first step.\n- Schedule a direct meeting with the alternative: You must first make sure that the alternative is the most suitable person.\n- Escalate the matter: An exaggerated step as long as the sponsor is willing to appoint a replacement.",
      "choices": [
        {
          "text": "Request that the replacement holds substantial influence and decision-making authority.",
          "correct": false
        },
        {
          "text": "Set up a meeting with the replacement sponsor as soon as possible to discuss the upcoming agenda.",
          "correct": false
        },
        {
          "text": "Request the full attention of the sponsor and escalate this issue to the project management office (PMO).",
          "correct": false
        },
        {
          "text": "Analyze the impact of the change and work with the sponsor to identify a suitable replacement.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company in the financial industry is kicking off a new hybrid project to be in compliance with new government regulations. The team has established a reliable velocity of 65 story points per iteration. Every iteration lasts 2 weeks. The sponsor wants to know when the project will be done if there are 1,040 story points remaining.nnHow many months will it take to complete the project?",
      "explanation": "To calculate the duration of the project, the sum of the remaining story points is divided by the speed.\n\n- Why the right choice?\n1040  65 = 16 repetitions. Since each repetition is two weeks, the total is 32 weeks, which is approximately 8 months.\n\n- Why are the other options wrong?\n- 2 months, 4 months, 16 months: either less or more than the real duration based on the mathematical calculation clear above.",
      "choices": [
        {
          "text": "2 months",
          "correct": false
        },
        {
          "text": "4 months",
          "correct": false
        },
        {
          "text": "8 months",
          "correct": true
        },
        {
          "text": "16 months",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has just taken over an ongoing project. The previous project manager resigned from the organization. During a review of the project documentation, the project manager realizes there are major deviations in the procurement process used by the previous project manager to engage service providers currently working on the project.nnWhat should the project manager do next?",
      "explanation": "When an administrative violation or significant deviation in operations is detected, you must act professionally and transparently.\n\n- Why the right choice?\nMarking the problem and presenting it to senior management allows it to be addressed through official channels without creating unnecessary tension with the parties involved.\n\n- Why are other options wrong?\n- Contact the previous manager: may not be available or not give the appropriate solution.\n- Contact service providers directly: It is not the competence of the project manager alone.\n- Reporting to the Ethics Committee: A significant escalation that may be unnecessary before the senior management assessment.",
      "choices": [
        {
          "text": "Call the previous project manager to understand the rationale for the abnormal procurement process.",
          "correct": false
        },
        {
          "text": "Contact the service providers to discuss the deviation and demand that they resolve the issue.",
          "correct": false
        },
        {
          "text": "Report the service providers and the previous project manager to the ethics committee of the organization.",
          "correct": false
        },
        {
          "text": "Flag the abnormal procurement process as a critical issue for the attention of senior management.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is tasked with addressing the product owner's concerns about the delivery of the minimum viable product (MVP) in sprint four. Which of the following metrics should the project manager use?",
 "explanation": "In an agile enterprise environment, specific metrics are used to track progress.\n\n- Why the right choice?\nBurndown Rate reflects the team's progress in completing the remaining work compared to the remaining time, which helps assess the likelihood that the  MVP  will be completed in the specified time frame.\n\n- Why are other options wrong?\n- Scheduled Performance Index (SPI) and Timeline Cost Index (SCI): They are used more in the Earned Value (EVM) methodology than agile projects.\n- Qualitative risk analysis: an analysis tool, not a direct measure of the speed of delivery.",
      "choices": [
        {
          "text": "Scheduled Performance Index (SPI)",
          "correct": false
        },
        {
          "text": "Schedule Cost Index (SCI)",
          "correct": false
        },
        {
          "text": "Burndown Rate",
          "correct": true
        },
        {
          "text": "Qualitative Risk Analysis",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager in a manufacturing company was notified of a failure of the delivered machinery during the initial tests. The machine failed to comply with standard design specifications, resulting in malfunctions and safety concerns.nnWhat should the project manager do first to address the issue?",
      "explanation": "When experiencing equipment failure during tests, the causes must be systematically analyzed.\n\n- Why the right choice?\nReview the initial testing and implementation procedures helps to ascertain if there is a defect in the test method or if the results are real and reflect a problem with the product.\n\n- Why are other options wrong?\n- Assessment of environmental and individual factors: to be done later if no direct cause is detected.\n- Evaluation of technical documentation: an important step, but it comes after confirming the correctness of the test procedures.\n- Verification of connections: not the first action when there is a concrete technical problem.",
      "choices": [
        {
          "text": "Review the initial testing procedure and execution.",
          "correct": true
        },
        {
          "text": "Assess the environmental and individual factors.",
          "correct": false
        },
        {
          "text": "Evaluate the technical documentation of the machine.",
          "correct": false
        },
        {
          "text": "Check the communications between the stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is kicking off a new hybrid project to be in compliance with government regulations. The team has established a velocity of 50 story points per iteration. Every iteration lasts 1 week. The sponsor wants to know when the project will be done if there are 1,500 story points remaining.",
      "explanation": "To calculate the duration of the project, the remaining story points are divided by the speed.\n\n- Why the right choice?\n1500  50 = 30 repetitions. Since each iteration is one week, this is equivalent to 30 weeks.\n\n- Why are the other options wrong?\n- 15 weeks, 4 weeks, 1 week: incorrect calculations that do not match the speed data and the total number of points.",
      "choices": [
        {
          "text": "30 weeks",
          "correct": true
        },
        {
          "text": "15 weeks",
          "correct": false
        },
        {
          "text": "4 weeks",
          "correct": false
        },
        {
          "text": "1 week",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A scrum team is using a hybrid approach with 2-week sprints. The minimum viable product (MVP) release is at the end of the current sprint, and the team has completed the must have and should have features; however, some of the other priority features are still in development. The project manager is preparing the monthly report for the steering committee.nnWhat should the project manager recommend?",
      "explanation": "In agile software development projects, especially using the Scrum framework, it is important to understand that the Minimum Releaseable Product (MVP) focuses on delivering core value that meets minimum customer requirements. The product is released even if all minor or less-priority features have not yet been completed, ensuring faster customer feedback and continuous improvements in subsequent versions.\n\n- Why the right choice?\nComplete the iteration review and release the releaseable product with the completed features allows the team to focus on delivering the present value and gives an opportunity for stakeholders to evaluate the product based on what has already been achieved. This reinforces the principle of continuous delivery in agile projects and reduces unnecessary delays.\n\n- Why are other options wrong?\n- Rescheduling the release review until all agreed features are complete delays value delivery and violates the principles of agility.\n- Updating the project management plan to include only completed features may result in unjustified changes in the scope of the project and loss of proper documentation.\n- Requesting additional resources may be unnecessary at this stage and may cause an increase in costs without ensuring a direct benefit.", 
      "choices": [
        {
          "text": "Reschedule the MVP release review until all the agreed-on features have been completed.",
          "correct": false
        },
        {
          "text": "Update the project management plan to include in the release only the features completed.",
          "correct": false
        },
        {
          "text": "Complete the sprint review and release the MVP with the completed features.",
          "correct": true
        },
        {
          "text": "Estimate the effort required and submit a change request to add more resources to the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While validating deliverables, a project manager realizes that one of the project team members used an older version of the scope definition document, causing substantial errors. What should the project manager do to manage this situation?",
      "explanation": "When an older version of the domain definition document is used, overlap and incompatibilities occur that lead to implementation errors that can negatively affect the quality of deliverables and customer satisfaction.\n\n- Why the right choice?\nImplementing a change control process is the formal and structured step to address the issue. Through this process, errors can be documented, corrected, and formal approvals can be obtained for required modifications, preserving the integrity of the project and preventing the recurrence of errors.\n\n- Why are other options wrong?\n- Discussing deliverables during the next meeting is insufficient to effectively address the error and does not provide formal tracking.\n- Updating only the document record without performing a formal process may leave gaps and increase the risk of future errors.\n- Sharing the updated version with the team is a preventive measure but does not address the error in current deliverables and does not prevent its recurrence.",
      "choices": [
        {
          "text": "Discuss the latest deliverables during the next meeting.",
          "correct": false
        },
        {
          "text": "Update the project document register.",
          "correct": false
        },
        {
          "text": "Perform a change control process.",
          "correct": true
        },
        {
          "text": "Share the updated scope definition document with the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the daily standup meeting, one of the team members informs the team that a user story that was initially part of the sprint planning has become invalid due to a recently announced policy change. What should the project manager do in response to this situation?",
 "explanation": "In an agile work environment, adapting to change is a fundamental principle to ensure the success of the project and deliver continuous value. When requirements or circumstances change, such as modifying a policy that affects a user story, this must be handled flexibly and effectively.\n\n- Why the right choice?\nClosing a user story that is no longer valid due to a policy change prevents wasting time and resources on work that is invaluable or incompatible with the new project requirements. It also clarifies the change to all team members and allows them to focus on the current priority tasks.\n\n- Why are other options wrong?\n- Removing a user story from the sprint and scheduling it for the next sprint may cause unnecessary work to be performed if the story is no longer meaningful.\n- Informing stakeholders not to edit pledged stories is contrary to the principle of flexible adaptation to variables.\n- Removing the story and requesting that the current sprint speed up does not address the root cause of the problem and may lead to undue pressure on the team.", 
      "choices": [
        {
          "text": "Close the user story related to the policy change and explain that it is no longer valid.",
          "correct": true
        },
        {
          "text": "Remove the user story from the current sprint and schedule it for the next sprint.",
          "correct": false
        },
        {
          "text": "Notify the stakeholders that user stories committed for a sprint cannot be modified.",
          "correct": false
        },
        {
          "text": "Remove the user story from the sprint and ask the team to expedite the completion of the current sprint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a new project. Two key project resources have a disagreement regarding a requirement. The project manager wants to understand both points of view, but one resource is not willing to meet with the project manager.nnWhat should the project manager do?",
 "explanation": "In project management, disputes between members are common, and their resolution requires reference to agreed rules to ensure integrity and transparency.\n\n- Why the right choice?\nRefer to team rules and project vision helps the project manager to deal with conflict in an objective and structured manner, and encourages the resolution of disputes within agreed frameworks, which enhances cooperation and trust within the team.\n\n- Why are other options wrong?\n- Escalating the problem to the project sponsor can show a weakness in the project manager's conflict management skills.\n- Accepting the position of a higher-ranking vendor may cause a sense of injustice or bias among members.\n-  The  OPA audit is not appropriate here because it does not resolve personal conflicts or disputes between resources.",
      "choices": [
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        },
        {
          "text": "Accept the position of the senior project resource.",
          "correct": false
        },
        {
          "text": "Review the organizational process assets (OPAs).",
          "correct": false
        },
        {
          "text": "Refer to the team's ground rules and project vision.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager is assigned to a project in the execution phase. The project just completed the deliverables for the first phase. During a workshop to review the scope for the second phase of the project, a couple of stakeholders complain that they were not informed of the benefits already delivered.nnWhat should the project manager do to resolve this issue?",
      "explanation": "Effective stakeholder communication is essential for project success and stakeholder satisfaction.\n\n- Why the right choice?\nRecord the issue in the case log, discuss it with the change manager, and update the communication management plan ensures that the issue is addressed systematically and in coordination with the relevant team, while improving future communication to meet stakeholder expectations.\n\n- Why are other options wrong?\n- Escalating the issue to the steering committee or sponsor without trying to resolve it internally may delay or complicate management.\n- Updating the risk management plan does not directly address the communication problem.",
      "choices": [
        {
          "text": "Escalate the issue to the steering committee because the sponsor should have informed stakeholders.",
          "correct": false
        },
        {
          "text": "Escalate the issue to the sponsor because the question came from some of the senior stakeholders.",
          "correct": false
        },
        {
          "text": "Record the issue in the issue log, discuss it with the change manager, and update the communications management plan.",
          "correct": true
        },
        {
          "text": "Record the issue in the register, review the stakeholder matrix, and update the risk management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager for a building project has been informed that a required permit from the local government has not yet been obtained. Applying for the permit will delay project delivery by 21 days at a cost of US$40,000. The fine for not having the permit in place is US$1,900 a day.nnWhat should the project manager do?",
      "explanation": "In risk management, options should be evaluated based on cost, legal benefit, and compliance.\n\n- Why the right choice?\nApplying for a permit and delaying the delivery of the project by 21 days is the best option because the daily fine will accumulate and become more expensive than the delay, in addition to that non-compliance may lead to greater legal problems affecting the project and its future.\n\n- Why are the other options wrong?\n- Ignoring the permit requirements exposes the project to significant legal and financial risks.\n- Attempting to negotiate an exemption may not be feasible or effective, and may delay the project further.\n- Allocating the fine amount as additional expenses underestimates the legal risk and does not address the root cause of the problem.",
      "choices": [
        {
          "text": "Apply for the permit and delay project delivery by 21 days.",
          "correct": true
        },
        {
          "text": "Ignore the permit requirement and continue with the project.",
          "correct": false
        },
        {
          "text": "Attempt to negotiate with the local government for a pardon.",
          "correct": false
        },
        {
          "text": "Allocate the fine amount as an additional project expense.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working in a regulated industry, and the team is working on a project where the requirements are prioritized in a backlog. The minimum viable product (MVP) for the launch has been defined. The project manager learns the regulatory body for the project requires a prototype for inspection before that product can be launched. The prototype is not part of the MVP definition.nnWhat should the project manager do next?",
 "explanation": "In projects that require regulatory compliance, it is necessary to include organizational activities in the business plan to ensure that legal requirements are met and product launch is not delayed.\n\n- Why the right choice?\nTalking with the product owner to prioritize compliance activities in the product record (Backlog) helps ensure that the required prototype is considered within the delivery plan, without making drastic changes to the definition of  MVP, while maintaining business priorities and focusing on value.\n\n- Why are other options wrong?\n- Identifying missing requirements, directly listing work, and assigning the team may lead to unstructured and unagreed changes within the team.\n- Rescheduling a product launch may cause unnecessary delays if priorities are handled correctly.\n- Creating a new definition for an MVP is a major change that may cause complications in planning and communication with the team.",
      "choices": [
        {
          "text": "Speak with the product owner to prioritize compliance activities in the backlog to submit a prototype to the regulatory body.",
          "correct": true
        },
        {
          "text": "Identify the missing requirements, prioritize the missing regulatory work directly into the backlog, and assign the work to the team.",
          "correct": false
        },
        {
          "text": "Reschedule the launch of the product until the team can produce a prototype for inspection, as required by the regulatory body.",
          "correct": false
        },
        {
          "text": "Create a new MVP definition that contains the scope requirements for the required prototype and prioritize that scope with the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is close to completion, and the customer wants to celebrate the success by sharing a business case about the benefits created by the project. The project manager and team feel apprehensive about sharing a business case at this stage.nnWhat is the most appropriate action for the project manager to take?",
 "explanation": "Managing customer expectations is important to maintain a professional and effective relationship.\n\n- Why the right choice?\nAcknowledging the client's request while emphasizing the limitations of the case study at this stage shows respect for the client's wishes while making it clear that the time or information available may not be enough to create an integrated case study, maintaining transparency and preventing unrealistic expectations.\n\n- Why are other options wrong?\n- Collaborating to create a case study without proper preparation may lead to poor results that negatively affect the reputation of the project.\n- Referring the client to the project team may cause confusion in responsibilities and show a lack of communication from the project manager.\n- Inform the client that the preparation of the case study requires additional resources that may be understood as unnecessary rejection or complexity.",
      "choices": [
        {
          "text": "Collaborate with the customer to create a business case highlighting project benefits.",
          "correct": false
        },
        {
          "text": "Acknowledge the request but emphasize the limitations of a business case at this stage.",
          "correct": true
        },
        {
          "text": "Refer the customer to the project team for details on the benefits created by the project.",
          "correct": false
        },
        {
          "text": "Inform the customer that a business case would require additional work and resources.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been working on an internal project for the organization's project management office (PMO). The project was initially sponsored by a PMO leader who has since been replaced. The new leader does not see much value in the project.nnWhat should the project manager do?",
      "explanation": "Maintaining leadership care and support is critical to the success of the project.\n\n- Why the right choice?\nUsing the benefits tracked throughout the project to demonstrate the value of the project provides concrete evidence to the new leader about the importance of the project and enhances the chances of continued support and care.\n\n- Why are other options wrong?\n- Organizing a new starting meeting may not be enough to convince the new leader if clear data is not provided.\n- Relying solely on previous data may not be sufficient if it is not communicated effectively.\n- Continuing the project without addressing the position of the new leader may result in loss of support or subsequent cancellation of the project.",
      "choices": [
        {
          "text": "Organize a second project kick-off meeting with the new PMO leader and the project team.",
          "correct": false
        },
        {
          "text": "Use the previous data to obtain sponsorship from the new PMO leader because the project was effective.",
          "correct": false
        },
        {
          "text": "Use the benefits that the project manager has been tracking throughout the project to prove the project's value.",
          "correct": true
        },
        {
          "text": "Continue the project as planned because it has already been approved and is in progress.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is currently in progress. The project manager has been notified of a new process that may be helpful if it is incorporated into the project.nnWhat should the project manager do?",
      "explanation": "When receiving a new idea or process during project execution, it is important to evaluate the value that this process adds before taking any action.\n\n- Why the right choice?\nDetermine the usefulness of change first helps the project manager understand how the new process affects project goals and results before implementing it, preventing unnecessary changes or causing complications.\n\n- Why are other options wrong?\n- Evaluating how to integrate the process without understanding its usefulness may waste time and effort.\n- Issuing a priority order to make the change before the evaluation may cause disruptions and increase risk.\n- Modifying the requirements document without specifying the benefit may lead to unjustified changes.",
      "choices": [
        {
          "text": "Evaluate how the new process can be incorporated.",
          "correct": false
        },
        {
          "text": "Issue a priority order for the change.",
          "correct": false
        },
        {
          "text": "Determine the benefit of the change.",
          "correct": true
        },
        {
          "text": "Modify the requirements document for the change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a design workshop for a new robot, the engineers ask the project manager about safety and environmental protocols for its operating procedures.nnWhat should the project manager do?",
      "explanation": "Providing accurate and reliable information to the team is essential for the success of the project and ensuring compliance with the standards.\n\n- Why the right choice?\nProvide the team with organizational process assets and the project charter ensures that engineers receive formal guidelines and approved standards that must be adhered to in design and operation.\n\n- Why are other options wrong?\n- Hiring a specialized engineer may be costly and unnecessary if organizational assets are available.\n- Consulting lessons learned documentation may not fully cover current requirements.\n- Benchmarking may take longer and does not provide the immediate information required.",
      "choices": [
        {
          "text": "Hire a specialized engineer to support the design team.",
          "correct": false
        },
        {
          "text": "Provide the team with the organizational process assets and the project charter.",
          "correct": true
        },
        {
          "text": "Look into lessons learned documentation for similar projects.",
          "correct": false
        },
        {
          "text": "Run a benchmark with similar plants to capture their compliance constraints.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project planning session, the project manager is trying to define a release plan to achieve consistent value delivery and customer buy-in. A senior stakeholder suggests having a release at the end of the project to make sure the customer sees all of the product features at once.nnWhat should the project manager do?",
 "explanation": "Gradual product delivery through repeated versions allows customer feedback to be collected and product improvement continuously.\n\n- Why the right choice?\nSuggesting product delivery over multiple iterations enhances customer satisfaction by meeting their needs on an ongoing basis and avoiding the risks associated with delivery delays.\n\n- Why are other options wrong?\n- Requesting a release schedule proposal based on feature complexity may be insufficient without focusing on value and feedback.\n- Proposing specific versions without flexibility may not meet project developments.\n- Creating release plans for each feature separately may cause administrative complexities and disrupt workflow.",
      "choices": [
        {
          "text": "Ask the project team to propose a release schedule based on the complexity of specific product features.",
          "correct": false
        },
        {
          "text": "Recommend three releases with one at the beginning, one in the middle, and one at the end of the project.",
          "correct": false
        },
        {
          "text": "Create release plans for each time a product feature is delivered to conduct quality testing and reviews.",
          "correct": false
        },
        {
          "text": "Propose that the product be delivered over the course of multiple iterations to gather customer feedback.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After nine months, a project concludes its first phase with the release of a new product to the customer. The client is dissatisfied and states that many key features are missing.nnWhat should the project manager do first in order to address this issue?",
      "explanation": "In case the client is dissatisfied with missing features, the project manager must first review the project plan and scope to determine whether the missing features were included within the original scope.\n\n- Why the right choice?\nReview the project plan helps to understand whether the missing features were previously agreed upon or added later, which identifies the appropriate next steps to deal with the problem.\n\n- Why are the other options wrong?\n- Evaluating features with the client and developing a listing plan without understanding the exact scope may lead to misunderstandings.\n- Requesting additional funding or restarting the project may be early and unjustified before the problem is accurately understood.",
      "choices": [
        {
          "text": "Evaluate the missing features with the client and develop a plan to include them in the next nine-month project phase.",
          "correct": false
        },
        {
          "text": "Review the project plan to determine if the missing features were part of the original scope or if they were added later.",
          "correct": true
        },
        {
          "text": "Request additional funding in order to reduce the current release cycle timeline so the team can deliver value sooner.",
          "correct": false
        },
        {
          "text": "Restart the project by implementing an agile life cycle and incorporate the creation of a minimum viable product (MVP).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager working in a matrix organization is managing a project that is scheduled to be completed in one month. At today's project meeting, the project manager was informed that errors encountered in the software code are steadily increasing. During discussions with the development team lead, the project manager is told that this is normal when trying to stay on schedule. The development team is pressing to move on so a deadline is not missed, but the project manager is concerned.nnWhat should the project manager do?",
 "explanation": "When product quality problems arise, it is important for the project manager to verify that the project is not compromising on quality standards.\n\n- Why the right choice?\nQuality metric inspection helps the project manager assess whether a project meets documented quality standards, and then take appropriate action if there are deviations.\n\n- Why are other options wrong?\n- Updating the workload structure and extending the schedule without quality assessment may lead to undue delays.\n- Pushing the team to continue may increase errors and negatively affect the product.\n- Requesting a change to extend the deadline may be necessary later, but the situation must first be carefully assessed.",
      "choices": [
        {
          "text": "Update the work breakdown structure (WBS) and extend the durations in the project schedule to allow more development time.",
          "correct": false
        },
        {
          "text": "Direct the team to continue development to avoid missing the deadline, noting that the risk has been mitigated.",
          "correct": false
        },
        {
          "text": "Examine the quality metrics to determine if the project is complying with the documented quality requirements.",
          "correct": true
        },
        {
          "text": "Submit a change request through the change control process to extend the deadline, allowing more time for development.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An organization has a policy requiring all project managers to conduct a standardized audit of another project manager's project once a month. After an audit review, team members complained that the auditor was not fairly reviewing their deliverables. The project manager reviewed the audit results and agreed with the findings.n What should the project manager do to address this situation?",
      "explanation": "It is important to explain why audits are being conducted to maintain transparency and fairness.\n\n- Why the right choice?\nClarifying that audits are conducted based on uniform standards enhances trust among team members and justifies the procedures followed.\n\n- Why are other options wrong?\n- Reducing the frequency of audits or using case meetings instead may reduce the necessary oversight.\n- Reporting references without sufficient evidence may cause unexplained administrative problems.",
      "choices": [
        {
          "text": "Request that mandatory audits be conducted less frequently.",
          "correct": false
        },
        {
          "text": "Use status meetings to review deliverables instead of formal audits.",
          "correct": false
        },
        {
          "text": "Explain that audits are conducted based on standardized measures.",
          "correct": true
        },
        {
          "text": "Report the project manager who conducted the unfair audit.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The headquarters of a multinational company is in Europe, with many regional offices in other countries around the world. The operations director of a regional office decides to establish a project management office (PMO). A project manager has been selected to manage the project, which is in its initial phase. The project manager needs to align stakeholder expectations with the benefits of the project process and the business strategy.n Which document should the project manager develop for this purpose?",
 "explanation": "The project charter document is the one that formally clarifies the project's objectives, scope, and key stakeholders, as well as the project's relevance to the organization's goals and strategy.\n\n- Why the right choice?\nCharter is the core document that creates consensus among stakeholders and outlines the expected benefits of the project.\n\n- Why are other options wrong?\n- Feasibility analysis examines the potential of a project but does not align current expectations.\n- The benefits management plan focuses on tracking benefits after the project is approved.\n-  The project management plan is detailed for implementation and is not used as a preliminary founding document.",
      "choices": [
        {
          "text": "Business case",
          "correct": false
        },
        {
          "text": "Benefits management plan",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": true
        },
        {
          "text": "Project management plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A majority portion of a local company was recently sold to an international company. The new parent company is mandating the use of health, safety, and environmental (HSE) regulations for all projects in the local company.nnWhat should the project managers do to remain compliant?",
 "explanation": "In this scenario, the project manager must communicate directly with the  HSE  team to understand the impact of the new regulations on projects. This ensures:\n-  An accurate understanding of new regulatory requirements.\n- Early collaboration to modify project plans in compliance with regulations.\n- Reduce the risk of non-compliance that may cause fines or delays.\n\nOther options are not suitable because:\n- Waiting to receive information from functional management means delays and lack of quick response.\n- Requesting the appointment of a new member without in-depth understanding may not address the problem.\n- Talking with the sponsor for clarification is not enough to address the practical effects of the new regulations.",
      "choices": [
        {
          "text": "Wait for the functional department responsible for HSE regulations to communicate the process change.",
          "correct": false
        },
        {
          "text": "Ask the functional department responsible for HSE regulations to assign a new team member.",
          "correct": false
        },
        {
          "text": "Speak with the project sponsor to get clarification about the new HSE regulations.",
          "correct": false
        },
        {
          "text": "Meet with the HSE team to understand the impact of the new regulations on the projects.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is finishing a project and the sponsor is requesting insights on benefits realization. How can the project manager calculate project outcomes value?",
 "explanation": "To correctly calculate the value of project results, the project manager must evaluate the qualitative and quantitative benefits of the project, and this includes:\n- Qualitative benefits such as improving customer satisfaction, or enhancing the company's image.\n- Quantitative benefits such as increasing profits or reducing costs.\n\nOther options are less accurate because:\n- Only pricing of tangible benefits does not take into account intangible benefits.\n- Retrospective financial valuation only analyzes the past without regard to overall value.\n- Comparing results to the budget does not reflect the value of the benefits realized.",
      "choices": [
        {
          "text": "Evaluate qualitative and quantitative project benefits.",
          "correct": true
        },
        {
          "text": "Price tangible benefits and divide them by expenses.",
          "correct": false
        },
        {
          "text": "Conduct a retrospective financial assessment.",
          "correct": false
        },
        {
          "text": "Assess outcomes and compare them to the budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company has decided to form agile teams within the organization to improve project results and take advantage of new opportunities in the market. A project manager with extensive agile experience was recruited to oversee the process. What should the project manager do first?",
 "explanation": "When a company starts implementing new agile teams, the first step a project manager must take is to define the criteria needed to launch agile projects. This includes:\n- Develop a clear and specific framework for agile teams that fit the company's culture and goals.\n- Define policies, standards, and procedures that will help teams work effectively within an agile environment.\n- Provide clear guidance to teams on how to implement agile practices, while setting goals and expected values.\n\nOther options are not the right start because:\n- Recruiting and evaluating agile practitioners needs to have clear criteria first to ensure quality selection.\n-  Agile PMO implementation is an advanced step after defining the core criteria and processes.\n- Conducting a retrospective analysis of past project experiences may help, but it is not a priority before defining the current framework.",
      "choices": [
        {
          "text": "Recruit, appoint, and evaluate new agile project practitioners.",
          "correct": false
        },
        {
          "text": "Implement an agile project management office (PMO).",
          "correct": false
        },
        {
          "text": "Determine the criteria for when to launch agile projects.",
          "correct": true
        },
        {
          "text": "Perform a retrospective analysis of prior project experiences.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Teams A and B are working on two different agile projects for the same customer. They are using the same method to calculate units of work, and each iteration is 2 weeks long. In the first two iterations, team A completed 150 units of work and team B completed 200 units of work. Both teams' tasks are getting completed as planned. The customer reported 5 errors per unit of work for Team A and 10 errors per unit of work for Team B.nnWhat conclusion should the project manager have regarding the teams and their performances?",
 "explanation": "Although Team B completed more work units in the same period, the error rate per business unit is much higher than Team A. This points to:\n-  The quality of work provided by Team A is higher than Team B, as fewer errors mean a more stable and reliable product.\n- Performance is measured not only by the quantity of work done, but also by its quality.\n\nOther options are wrong because:\n- Considering Team B better based solely on productivity ignores the quality of work and the impact of errors.\n- Saying that performance is equal ignores the perceived quality difference.\n- Evaluating performance after only two repetitions may be early but does not eliminate the importance of the quality of the results in this initial evaluation.",
      "choices": [
        {
          "text": "Team B is performing better than Team A as they have completed more units of work in the same duration.",
          "correct": false
        },
        {
          "text": "Teams A and B have completed their tasks as planned; therefore, they are both performing equally.",
          "correct": false
        },
        {
          "text": "Team A is performing better than Team B because there are fewer errors per unit of work.",
          "correct": true
        },
        {
          "text": "The teams have completed just two iterations; therefore, it is too early to assess their performance.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A complex technology project is in the execution phase. New technologies are added to the backlog based on customer requirements, which will involve significant changes to the deliverable.nnWhat should the project manager do to satisfy the customer?",
 "explanation": "When a customer requests major changes that affect the final product, the project manager must effectively manage the customer's expectations. This includes:\n- Clear communication with the customer about the impact of these changes on the schedule, cost, and product quality.\n- Clarify project boundaries and align customer expectations with the actual business needs of the organization.\n- Provide alternatives or compromises when needed to maintain a balance between customer requirements and project capabilities.\n\nOther options are not suitable because:\n- Re-planning all iterations and releases may be impractical or lead to significant delays.\n- Accepting all new requirements without managing expectations can lead to unwanted project scope overreach.\n- Pushing the team to accept the challenge only may strain the team and affect the quality of work and customer satisfaction.",
      "choices": [
        {
          "text": "Replan the sprints and releases to meet every expectation of the customer.",
          "correct": false
        },
        {
          "text": "Manage customer expectations based on the organization's business needs.",
          "correct": true
        },
        {
          "text": "Accept the new requirements, and schedule meetings to plan a new release schedule.",
          "correct": false
        },
        {
          "text": "Push the project team to increase flexibility and accept the new challenge.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A parent company announces an integration project for all of its subsidiary companies. The integration project covers the legal, human resources (HR), and finance departments of the subsidiary companies. Senior management is investing in this as the company's first agile project and a new project manager has been assigned.nnWhat should the project manager do first?",
      "explanation": "In a complex integration project involving multiple departments and companies, the project manager must first develop a  transition strategy to ensure:\n- Determine how to implement the transition changes and integration between systems and processes.\n- Ensure business continuity and reduce the risks associated with the change.\n- Coordinate the efforts of different teams and different stages of the project consistently.\n\nOther options are less priority at this stage because:\n Meeting with stakeholders to discuss risks is important but comes after developing a clear strategy.\n- Developing a team charter is after understanding the overall plan and strategy.\n- Enhancing the team's maturity in agile methodologies comes as the project progresses and executes.",
      "choices": [
        {
          "text": "Meet with the stakeholders to discuss risks.",
          "correct": false
        },
        {
          "text": "Develop a team charter.",
          "correct": false
        },
        {
          "text": "Plan to enhance the team's agile maturity level.",
          "correct": false
        },
        {
          "text": "Develop a transition strategy.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a hybrid project with a fixed time and fixed price agreement. The project manager is having difficulty getting the team to submit their time sheets. The feedback received from the team is that work will be delivered every two weeks, so no time sheets are required. However, the project manager needs the time sheets to complete a cost assessment of the project.nnWhat should the project manager do to ensure all team members submit their time sheets as required?",
      "explanation": "To ensure that the team collaborates in providing timelines, the project manager must clearly explain the impact of not providing these schedules on assessing project costs. This method:\n- Enhances the team's awareness of the importance of providing timely information.\n- Clarifies the relationship between timesheets and performance and cost evaluation, which may motivate them to comply.\n\nOther options are less effective because:\n- Requesting intervention from the PMO may not be practical or effective.\n- Sending reminders only without explaining the importance of timesheets may not change team behavior.\n- Changing the frequency of submitting timelines without team acceptance may provoke even greater resistance.",
      "choices": [
        {
          "text": "Ask the project management office (PMO) to ensure the team submits their time sheets.",
          "correct": false
        },
        {
          "text": "Send a weekly reminder to each team member notifying them to submit their time sheets.",
          "correct": false
        },
        {
          "text": "Explain the impact of not submitting time sheets on the project's cost assessment.",
          "correct": true
        },
        {
          "text": "Change the submission frequency for the time sheets from biweekly to weekly.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a product backlog refinement meeting, a stakeholder from the legal department and the product owner disagree on the prioritization of a particular item. The product owner states that the current prioritization is adding maximum value to the project, and the stakeholder states that the item should be prioritized because it is a governmental compliance requirement.nnWhat should the project manager do in this situation?",
      "explanation": "In the event of disagreement between the product owner and the stakeholder, the project manager shall facilitate a constructive discussion between the parties to discuss views and concerns. This helps:\n- Reach a common understanding and a balanced priority between business value and legal compliance.\n- Reduce conflicts and ensure effective cooperation.\n- Improve decision-making through dialogue and negotiation.\n\nOther options are wrong because:\n- Obeying only the authority of the product owner may lead to ignoring important legal concerns.\n- Examining past situations may not accurately reflect the current situation.\n- Trying to convince the product owner to change the priority without dialogue may lead to resistance.",
      "choices": [
        {
          "text": "Yield to the product owner's prioritization authority and remind the stakeholder that it is not their responsibility.",
          "correct": false
        },
        {
          "text": "Examine previous situations in the lessons learned register to find a solution and prioritize the backlog accordingly.",
          "correct": false
        },
        {
          "text": "Use negotiation techniques to convince the product owner to prioritize the backlog as suggested by the stakeholder.",
          "correct": false
        },
        {
          "text": "Facilitate a discussion between the product owner and the stakeholder to discuss their perspectives and concerns.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A department store chain is in the implementation stage of a project to replace the payment systems across all of its stores in multiple countries. The project planning followed a predictive approach, and implementation is based on multiple iterations for each country. Implementation in country C is stalled due to new laws regulating the security of the new payment solution implementation.nnWhich two actions should the project manager take to avoid a significant delay on the project? (Choose two)",
      "explanation": "In the event that new laws affect project implementation in a particular country, the project manager must take proactive action to minimize the impact on the overall schedule:\n\n1. Continuously monitor compliance with laws in each country to ensure that any regulatory changes are detected early, allowing for rapid adaptation.\n\n2. Document legal compliance risks in the affected country's project management plan during the implementation phase and cycles, so that there is formal planning to manage these risks.\n\nOther actions such as deploying alternative systems or stopping the project may lead to greater complications or delays without ensuring success.",
      "choices": [
        {
          "text": "Monitor compliance with the laws of each country continuously during planning and after implementation in each country.",
          "correct": true
        },
        {
          "text": "Document the legal compliance risks in the project management plan for country C in the implementation phase and iterations.",
          "correct": true
        },
        {
          "text": "Deploy alternative systems compatible with the security standards and legal framework for country C.",
          "correct": false
        },
        {
          "text": "Execute another country's implementation phase after validating the compliance standards while a solution is prepared for country C.",
          "correct": false
        },
        {
          "text": "Communicate the delay in the project to the steering committee, and place the project on hold until a decision is reached.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project that requires approval from a government agency. The agency is currently drafting legislation that will impact the project's approval process, but it is unclear when the legislation will become law. The project manager is concerned that the legislation may delay the project's key milestones or limit the project's development options.nnWhat should the project manager do?",
      "explanation": "In the event that legislation is being drafted that could affect the project, the project manager must:\n\n- Assess risk exposure on an ongoing basis to determine the extent to which the potential legislation will affect the project.\n- Take appropriate mitigation measures to minimize negative impacts on the timeline and project outcomes.\n\nIgnoring the legislation or assuming it passes without delay may result in negative surprises. A request to exclude activities or to request an additional reserve early without clear information may be inappropriate.",
      "choices": [
        {
          "text": "Apply for an additional contingency to prepare for the anticipated delay in project milestones.",
          "correct": false
        },
        {
          "text": "Review the project scope and submit a request to exclude activities associated with the legislation.",
          "correct": false
        },
        {
          "text": "Continuously evaluate exposure to the risk to minimize negative impacts on the project and its outcomes.",
          "correct": true
        },
        {
          "text": "Proceed with the project with the understanding that the pending legislation will pass without delay.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An international company is implementing an innovative technology at one of its production plants. The technology has already demonstrated positive returns at another site.nnWhat should the project manager consider as a key aspect of the successful implementation of this technology?",
      "explanation": "When moving an innovative technology to a new location, it is important:\n\n- Hold an information-sharing workshop with stakeholders and the team at the new site to explain the benefits of the technology and how it works.\n- This enhances everyone's understanding, reduces resistance to change, and encourages support.\n\nOther options such as assessing the business case, consulting with the technology manager, or developing a project charter are important but do not cover the core aspect of communication and local acceptance as the workshop does.", 
      "choices": [
        {
          "text": "Assess the business case to ensure the return on investment (ROI) meets or exceeds the performance indicators of the first site.",
          "correct": false
        },
        {
          "text": "Consult with the technology manager to ensure the technology can fit in the new site.",
          "correct": false
        },
        {
          "text": "Conduct an information-sharing workshop to present the new technology and its benefits to the new site's stakeholders.",
          "correct": true
        },
        {
          "text": "Develop the project charter for implementation at the new site using the lessons learned from the first site.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During final inspection of a deliverable, the quality team observes that there is a deviation on a particular component. The customer, however, has not indicated anything with regard to this in its specifications.nnWhat should the project manager do?",
      "explanation": "In this case, the project manager should take systematic action to ensure the quality of the final product and not exceed the agreed specifications:\n\n- **Conducting a quality assurance audit** is the most appropriate option because it allows to verify the existence of deviation and its causes, as well as assess its impact on product quality and final outputs.\n- Directly approving the output despite the deviation may lead to subsequent problems.\n- Rejecting the output without careful evaluation may cause unnecessary delays.\n- Referring the matter to a technical expert may be necessary later, but it is not the first step without a structured quality audit.",
      "choices": [
        {
          "text": "Raise the matter to a technical expert.",
          "correct": false
        },
        {
          "text": "Conduct a quality assurance audit.",
          "correct": true
        },
        {
          "text": "Approve the deliverable as it does not deviate from any customer specifications.",
          "correct": false
        },
        {
          "text": "Reject the deliverable, citing deviation from the project specifications.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a new technology project, confusion arises due to the lack of a clearly defined and communicated future state of the product. What should the project manager do next?",
      "explanation": "When there is no clear vision or future case for the product, the project manager should focus on clarifying the benefits and outputs that need to be achieved:\n\n- **Creating and obtaining approval of a benefit management plan** is vital because it demonstrates the value that the project will deliver and its long-term goals.\n- This helps guide the team and stakeholders towards the same goals and reduces confusion.\n- Other options such as asking the project sponsor or discussing the scope are important, but they do not provide an agreed formal document for managing benefits.",
      "choices": [
        {
          "text": "Create and get approval on a benefits management plan.",
          "correct": true
        },
        {
          "text": "Ask the project sponsor what the project outcome should be.",
          "correct": false
        },
        {
          "text": "Discuss the scope and objectives with the functional owner.",
          "correct": false
        },
        {
          "text": "Review the project's business case to identify alternatives.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new regulation has been approved that will impact the deliverables in the fourth phase of the project. The delivery is following an iterative approach and is currently completing the second phase.nnWhat should the project manager do next?",
      "explanation": "When a new regulation is approved that affects later stages of the project, the project manager should:\n\n- **Meeting with subject matter experts to assess the impact on objectives** helps understand how the new regulation will affect outputs, cost, and schedule.\n- This assessment is necessary to make informed decisions regarding budget, schedule, and future planning.\n- Other options such as escalating costs or requesting an exception without careful evaluation may lead to uncalculated risks or delays.\n",
      "choices": [
        {
          "text": "Consult with the project sponsor to discuss a cost increase.",
          "correct": false
        },
        {
          "text": "Get approval for the additional budget from the steering committee.",
          "correct": false
        },
        {
          "text": "Meet with subject matter experts (SMEs) to assess the impact to objectives.",
          "correct": true
        },
        {
          "text": "Acquire approval for an exception to the implementation of the new regulation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a critical project to deliver a new solution. The CEO is highly invested in the project, and the CFO is the product owner. During the testing phase, the CFO requests an additional nonfunctional requirement to shorten the frequency of transaction processing. This new requirement will impact the launch date, and the CFO is insistent on having it implemented.nnWhat should the project manager do to minimize the impact of the new requirement on the launch date and manage the expectations of the CEO and CFO?",
      "explanation": "When a product owner requests a new, non-functional requirement that may affect the project schedule, an accurate assessment of the impact of that requirement is the correct action.\n\n- Why the right choice?\nAssessing the scope of the new requirement helps to understand the exact impact on the schedule, resources, and costs, enabling the team to make informed decisions and effectively manage stakeholder expectations.\n\n- Why are other options wrong?\n- Deferral implementation: may lead to loss of opportunities for value improvement but does not address the impact of the current requirement.\n- Request for CEO intervention: may cause unnecessary escalation and affect the relationship between the team and stakeholders.\n- Tell the team to update the product record without evaluation: Lacks analysis of the impact of the requirement on the schedule, which may lead to subsequent problems.",
      "choices": [
        {
          "text": "Meet with the CFO and suggest delaying the implementation of the new requirement to the post-launch phase.",
          "correct": false
        },
        {
          "text": "Ask the CEO to intervene and stop the implementation of the new requirement, as development is complete.",
          "correct": false
        },
        {
          "text": "Tell the project team to update the product backlog with the new requirement and adjust the project plans.",
          "correct": false
        },
        {
          "text": "Assess the scope of the new nonfunctional requirement to determine its specific impact on the planned go-live date.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member suggests using a new product to speed up feature development, but this will increase the project budget. The project team is taking an incremental approach to product development, and the product owner is responsible for prioritizing and managing the product backlog. What should the project manager do first?",
      "explanation": "If a new product proposal may affect the budget, it is important to consult with the product owner who controls priorities and manages the product record.\n\n- Why the right choice?\nConsulting with the product owner ensures that the benefits and disadvantages of using the new product are discussed, which helps to make an informed decision about whether to list or postpone it.\n\n- Why are other options wrong?\n- Reviewing the cost plan or requesting additional funding without verifying the product priority and impacts may cause a conflict of priorities.\n- Modifying the acceptance criteria directly without coordination with the product owner may lead to complexities in project management.",
      "choices": [
        {
          "text": "Consult the product owner and present the benefits and drawbacks of using the new product.",
          "correct": true
        },
        {
          "text": "Review and update the cost management plan to accommodate the potential budget impact.",
          "correct": false
        },
        {
          "text": "Request additional funding for the implementation of the new product from the project sponsor.",
          "correct": false
        },
        {
          "text": "Revise the acceptance criteria for the user stories to incorporate the new product effectively.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is currently overseeing a project from its inception and is aware that there are several assumptions and dependencies integral to the project's success. What action should the project manager take in this situation?",
 "explanation": "Documenting and regularly following all assumptions and dependencies is essential to manage risks and ensure project success.\n\n- Why the right choice?\nDirecting the team to document and track these assumptions helps monitor changes, proactively address risks, and ensure clear communication with stakeholders.\n\n- Why are other options wrong?\n- Request support from the project sponsor for a private resource that may be early before documentation and follow-up.\n-  A brainstorming session alone is insufficient without formal documentation.\n- Requesting the implementation of a PMO  benefits measurement system may be an additional indirect measure for the issue of assumptions.",
      "choices": [
        {
          "text": "Seek support from the project sponsor to allocate a dedicated resource to monitor and track benefits realization.",
          "correct": false
        },
        {
          "text": "Instruct the project team to record all the assumptions and track all the changes.",
          "correct": true
        },
        {
          "text": "Facilitate a brainstorming session with the project team to formulate a comprehensive risk mitigation plan.",
          "correct": false
        },
        {
          "text": "Ask the project management office (PMO) to implement a benefits measurement system to verify benefit metrics and associated risks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new system is being developed to replace an existing manual process. During a sprint demo, business stakeholders expressed the concern that they would not gain any value from using this system.nnWhat should the project manager do next?",
      "explanation": "When stakeholders express concern about the expected value of the system, the project manager must first check whether the agreed performance measures have been achieved.\n\n- Why the right choice?\nReview performance metrics with stakeholders allows ensuring that the system meets agreed requirements and achieves the required results. This helps provide objective clarifications and reaffirm the planned benefits.\n\n- Why are other options wrong?\n- Discussing new stories with the product manager: It may lead to the addition of new requirements without first ensuring that existing metrics are met.\n- Steering Committee meeting: A very advanced step before checking existing metrics.\n- Creating a benefit management plan: A basic step but should be done during planning, not as a direct reaction to a concern during the Sprint presentation.",
      "choices": [
        {
          "text": "Discuss this with the product manager and identify new user stories to address business concerns.",
          "correct": false
        },
        {
          "text": "Call a steering committee meeting to determine critical success factors for the project.",
          "correct": false
        },
        {
          "text": "Create a project benefits management plan and review it with the stakeholders.",
          "correct": false
        },
        {
          "text": "Review the performance metrics with stakeholders to ensure the system accomplished agreed-upon metrics.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After several interviews with key stakeholders and checking the project charter, a project manager found that the current project organizational structure is no longer appropriate for the project's strategic goals. What should the project manager do next?",
 "explanation": "When the project manager discovers that the organizational structure no longer serves the objectives of the project, the organizational gaps must first be analyzed.\n\n- Why the right choice?\nAssessing the gaps between the current organizational structure and the expected benefits helps to see if there is an imbalance in the distribution of responsibilities or authority, or in the structure of teams or lines of communication. This analysis gives the project manager a basis to make realistic and practical decisions on what needs to change to achieve alignment with strategic goals.\n\n- Why are other options wrong?\n- Evaluation of lessons learned documents: Useful later as a reference but does not address the current situation directly or immediately.\n- Risk documentation request: Registering the risk in the risk register does not address the underlying problem and does not provide an immediate plan for structural change.\n- Project charter review: It has already been revised as per question. The charter is a high-level document and does not cover regulatory details as required.", 
      "choices": [
        {
          "text": "Assess the lessons learned documents and validate which organizational structure was used in the past for similar projects.",
          "correct": false
        },
        {
          "text": "Ask the team to document the risk in the project risk register and develop a risk response plan accordingly.",
          "correct": false
        },
        {
          "text": "Evaluate the gaps between the current organizational structure and the expected project benefits to determine required actions.",
          "correct": true
        },
        {
          "text": "Ask the team to review the project charter and evaluate the project objectives for relevance.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a hybrid (predictive-agile) project. During a standup meeting, a team member mentions that because of experience on a previous project, they think that one of the upcoming deliverables may need to comply with government regulations.nnWhat should the project manager do next?",
      "explanation": "If a topic related to legal or regulatory compliance arises during the work, direct escalation or suspension of the project is not preferable before confirmation. The first smart and effective step is to take advantage of previous knowledge.\n\n- Why the right choice?\nReview lessons learned from the previous project allows the project manager to get real practical evidence on whether there is an actual need for compliance. This method saves time and effort instead of making guess-based decisions.\n\n- Why are other options wrong?\n- Escalating the issue to PMO: Ineffective and too early, especially if the information is unconfirmed.\n- Stop project: Causes significant disruption to the project without a clear basis.\n- Removing the task from the critical path: Wrong action because the task may be essential, and the compliance requirements must first be checked instead of removed without evaluation.",
      "choices": [
        {
          "text": "Escalate the issue with the project management office (PMO) so they can determine if any compliance is required.",
          "correct": false
        },
        {
          "text": "Stop the project until it is confirmed that the deliverable is subject to any regulations.",
          "correct": false
        },
        {
          "text": "Review lessons learned from the previous project to determine if any compliance is required.",
          "correct": true
        },
        {
          "text": "Remove the task from the critical path and assign the resource to work on another requirement.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project for an accounts receivable system that was recently launched into production received a fine from a regulatory body because the system did not comply with local regulations. What should the project manager have done to avoid this situation?",
      "explanation": "The fine for non-compliance means that the final outputs did not conform to the regulations. This is usually due to the absence of the correct quality control process during the project phases.\n\n- Why the right choice?\nQuality Control Process is responsible for regularly checking outputs to ensure compliance with legal and regulatory requirements and standards, preventing such errors before they reach the regulator.\n\n- Why are other options wrong?\n- Define risk control management: focuses on anticipation and planning, not on detecting defects after work is carried out.\n- Implementing a case control record: Dealing with problems after they occur, not as a preventive measure.\n- Involving the audit department: It can be useful, but quality management is the basis for ensuring compliance during the implementation of work and not just through an external review.",
      "choices": [
        {
          "text": "Defined risk control management.",
          "correct": false
        },
        {
          "text": "Defined a control quality process.",
          "correct": true
        },
        {
          "text": "Implemented an issue control log.",
          "correct": false
        },
        {
          "text": "Involved the audit department in project planning.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is going through an organizational change. Most of the senior management has changed, including the project manager's direct supervisor. The supervisor has an aggressive working style, and has made critical comments to the project manager regarding the ongoing project, without really understanding the situation. The project manager feels uncomfortable working with the new supervisor.nnWhat should the project manager do next?",
      "explanation": "In cases of organizational change, the first correct step for the project manager is to evaluate the impact of that change on the project.\n\n- Why the right choice?\nOrganizational change impact assessment ensures that the project manager considers the impact of new people (such as supervisors or decision makers) on the progress of the project, such as changes in priorities, policy, or support.\n\n- Why are other options wrong?\n- Holding a project review meeting: A useful step, but not enough if the overall impact of the change is not first assessed.\n- Apply the recommendations of the new supervisor directly: may lead to risks without a real assessment of the project situation.\n- Inform the team of the need to prepare for change: Hasty action, because you must first know whether there is an actual significant impact or not.",
      "choices": [
        {
          "text": "Hold a project review meeting to explain the key points of the project to the new supervisor.",
          "correct": false
        },
        {
          "text": "Apply the new supervisor's recommendations to the project.",
          "correct": false
        },
        {
          "text": "Evaluate the impact of the organizational change to the project.",
          "correct": true
        },
        {
          "text": "Communicate to the project team that they need to be ready to embrace change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the last iteration of planning in an agile project, the team discovers that mandatory regulations were not included in the minimum viable product (MVP). What should the project manager do?",
 "explanation": "When it is discovered that mandatory regulations did not include the Minimum Viable Product (MVP), business priorities should be reviewed to ensure compliance. The product owner is responsible for prioritizing the product record, including legal and regulatory requirements.\n\n- Why the right choice?\nAsking the product owner to review the priority of this regulatory requirement is the right thing to do because the product owner is responsible for priorities according to business value and risk. This ensures that legal requirements are included in the priorities of upcoming work.\n\n- Why are other options wrong?\n- Request from the team directly: The team does not make priority decisions, but is implemented based on the product record.\n- Request from stakeholders: It is not their role to rearrange priorities, but rather to provide input.\n- Request from the sponsor: The sponsor is not concerned with managing the product record in detail but with strategic support.",
      "choices": [
        {
          "text": "Ask the team to include this regulatory requirement in the iteration backlog.",
          "correct": false
        },
        {
          "text": "Ask the product owner to review the priority of this regulatory requirement.",
          "correct": true
        },
        {
          "text": "Ask the stakeholders to review the priority of this regulatory requirement.",
          "correct": false
        },
        {
          "text": "Ask the sponsor for approval to include this regulatory requirement in the iteration backlog.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager had just started a long-term project when the government implemented new legislation that all engineers working in the state need to be registered. Registration is based on work area, experience, and professional development completed in the last 3 years. Due to budget constraints in the company for the past three years, there were limited opportunities for engineers to gain formal professional development.nnHow should the project manager handle the situation?",
 "explanation": "When organizational changes affect team requirements, the project manager must ensure that project resources meet these requirements.\n\n- Why the right choice?\nReview the team skills matrix and update the resource management plan allows determining whether team members have the required qualifications and licenses and filling in gaps, if any.\n\n- Why are other options wrong?\n- Submit a request to the Change Management Committee: It is not necessary at this stage, as it is about resource management.\n- Send everyone to training directly: It may be costly and unnecessary if some members are already registered.\n- Inform engineers only: Passive behavior and does not address project management professionally.",
      "choices": [
        {
          "text": "Send a request to the change management board to assess the situation.",
          "correct": false
        },
        {
          "text": "Review the team's skills matrix and update the resource management plan.",
          "correct": true
        },
        {
          "text": "Send all of the engineers to professional development to meet the requirements.",
          "correct": false
        },
        {
          "text": "Inform the engineers that they need to be registered to keep working for the company.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What approach should a project manager employ to encourage collaboration among developers in an agile development model?",
      "explanation": "In agile development environments, there are certain technologies specifically designed to enhance team collaboration and improve the quality of work.\n\n- Why the right choice?\nBehavior-driven development (BDD) encourages collaboration between developers, analysts, and stakeholders by writing testable scenarios in languages that are understandable to all. This promotes common understanding and reduces misunderstandings.\n\n- Why are other options wrong?\n- Acceptance test: An important step, but it comes after development.\n- Co-application development: A different concept and not directly related to collaboration within agile teams.\n- Rapid application development: It is concerned with speed and not necessarily with fostering internal collaboration.",
      "choices": [
        {
          "text": "Acceptance testing",
          "correct": false
        },
        {
          "text": "Behavior-driven development",
          "correct": true
        },
        {
          "text": "Joint application development",
          "correct": false
        },
        {
          "text": "Rapid application development",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a business status meeting, the project manager acknowledges that several market conditions have recently changed dramatically. As a result, the expected value of the project in progress may be threatened.nnWhat should the project manager do next?",
      "explanation": "When market conditions change dramatically, the project manager must ascertain whether the organization still sees value in continuing with the project. For this reason, the correct choice is to meet with the project sponsor.\n\n- Why the right choice?\nThe project sponsor is the official reference to guide the project and ensure its alignment with strategic objectives . Therefore, the situation must be discussed with him to make an informed decision.\n\n- Why are other options wrong?\n- Stop the project immediately: A hasty action without formal verification of the organization's support.\n- Continuation of the project: May result in waste of resources if there is no longer value.\n- Asking the team to investigate: This will not give a final decision on the feasibility of the project.",
      "choices": [
        {
          "text": "Stop the project immediately due to uncertainty that the project will deliver the expected value.",
          "correct": false
        },
        {
          "text": "Continue with the project since the project manager has not been formally informed of any change in market conditions.",
          "correct": false
        },
        {
          "text": "Ask the project team to investigate the evolution of market conditions during the last 6 months.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor to discuss the information and ask if the organization still supports delivery of the project.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The local government regulator has issued a notification to all companies regarding a new project aimed at facilitating information reporting to an international regulator. However, due to the dynamic nature of the project, there is a possibility of changing requirements while the delivery date remains fixed. The project manager assigned to this initiative is concerned about the uncertainty and the short timeline for delivery.nnHow should the project manager best prepare to address this situation?",
      "explanation": "Since the requirements may change constantly, a step-by-step and incremental approach is more appropriate.\n\n- Why the right choice?\nIncremental policy allows parts of the project to be delivered with the ability to modify them based on subsequent changes.\n\n- Why are other options wrong?\n- Detailed timeline: Not suitable for projects with variable requirements.\n- Contingency plan: Applies to predetermined risks, but here change is expected and continuous.\n- Communication strategies: important, but do not address the technical problem and change management.",
      "choices": [
        {
          "text": "Implement iterative and incremental approaches in relevant areas of the project to adapt to changing requirements.",
          "correct": true
        },
        {
          "text": "Meet with the sponsor to determine a detailed project schedule to ensure that the project is completed on time.",
          "correct": false
        },
        {
          "text": "Develop a detailed contingency plan using the crashing technique to expedite project activities as needed.",
          "correct": false
        },
        {
          "text": "Enhance communication strategies and engagement with the local government to ensure alignment and timely updates.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a legacy system modernization project. The project management plan is solidified and the requirements have been handed off to the IT department for development. However, the company's CEO announces the company's new strategic direction and upcoming plans for an enterprise resource planning (ERP) implementation.nnWhat should the project manager do?",
      "explanation": "When a new strategic direction is announced, the project manager must ensure that the current project is aligned with that direction.\n\n- Why the right choice?\nUnderstand how the project aligns with the new vision prevents work on a project that is not compatible with the organization's goals.\n\n- Why are other options wrong?\n- Request recommendations: Rely on others rather than analyze the situation.\n- Team meeting: It has no value without clarity of strategic direction.\n- Review timeline: Not useful if the project itself may become useless.",
      "choices": [
        {
          "text": "Ask the project sponsor for recommendations to keep the project on track.",
          "correct": false
        },
        {
          "text": "Understand and clarify how the existing project aligns with the overall organization vision.",
          "correct": true
        },
        {
          "text": "Conduct a project team meeting to plan and confirm resource assignments for the new project.",
          "correct": false
        },
        {
          "text": "Review the project schedule to ensure the project will be completed on time.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile practitioner has been assigned to lead a software development project in a relatively new industry where the external compliance standards are not clearly defined. What should the agile practitioner do to ensure that the project succeeds?",
      "explanation": "In an environment with unclear standards, an agile practitioner must rely on global best practices to ensure proven methods and at the same time monitor compliance updates.\n\n- Why the right choice?\nUsing global best practices provides a reliable framework, with the flexibility to update it when formal standards are issued.\n\n- Why are other options wrong?\n- Talking to other project managers: It may give information, but it is not sufficient as a formal procedure.\n- Developing special standards: may lead to conflicts with future standards.\n- Referring to related industries data: does not give accurate solutions to the new industry.",
      "choices": [
        {
          "text": "Speak to agile managers in other organizations with the same challenges to learn how they address issues.",
          "correct": false
        },
        {
          "text": "Develop a set of standards that work for the role and support the team in implementing them.",
          "correct": false
        },
        {
          "text": "Use global best practices as a guide for project implementation incorporating the new technology trends and monitoring compliance standards.",
          "correct": true
        },
        {
          "text": "Refer to other previous data that exists from related industries.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A business environment has become unstable because a stakeholder has altered the project deliverables and outcomes in the middle of the execution phase. Taking the stakeholder into consideration, how should the project manager ensure the project benefits are delivered?",
 "explanation": "Dealing with stakeholder changes requires structured change management that ensures requirements are formally captured according to procedures.\n\n- Why the right choice?\nEnsure stakeholder engagement commensurate with their impact and follow up on requirements through a change management process that maintains project stability.\n\n- Why are other options wrong?\n- Ensure only team approval: does not guarantee that stakeholder requirements are taken into account.\n- Integration of methods: Not sufficient if the change is not formally addressed.\n- Compliance with initial requirements: may ignore vital requirements that arose later.",
      "choices": [
        {
          "text": "Ensure the project team agrees to the project management plan and provide the stakeholder with constant updates.",
          "correct": false
        },
        {
          "text": "Combine both agile and predictive approaches and manage changes to the overall scope with minimal deviations.",
          "correct": false
        },
        {
          "text": "Ensure the project's deliverables and objectives are tailored to the initial requirements.",
          "correct": false
        },
        {
          "text": "Engage the stakeholder based on level of impact and ensure their requirements are captured adequately according to change management process.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has started developing a plan for a new project. During the first planning meeting, the stakeholders ask about the project's value and how it relates to the organization's goals.nnWhat should the project manager do next?",
      "explanation": "When the project manager is asked about the objectives and value of a project, the first reference is the project charter.\n\n- Why the right choice?\nProject Charter contains the definition of the project, its objectives, expected benefits, and its relationship to the organization's strategy.\n\n- Why are other options wrong?\n- Domain management plan: focuses on what is being accomplished and not on reason and value.\n- Sponsor invitation: Not always the effective method, the manager must have the answer.\n- Request documentation from the PMO: Not necessary if the information is in the project charter.",
      "choices": [
        {
          "text": "Refer the stakeholders to the scope management plan.",
          "correct": false
        },
        {
          "text": "Refer the stakeholders to the project charter.",
          "correct": true
        },
        {
          "text": "Invite the project sponsor to join the meeting to address questions.",
          "correct": false
        },
        {
          "text": "Ask the project management office (PMO) to provide the necessary documentation.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is working on a regulatory application that has a fixed duration for delivery. The team is using a hybrid approach and has divided development into three sprints. The first two sprints have not produced the required results mainly due to delays from functional units. The finance director is agitated due to the imminent sanctions if the application is not completed, and the project team is demoralized.nnWho is responsible for inspiring the project team?",
      "explanation": "One of the main responsibilities of the project manager is to manage the project team, including motivating it and enhancing team spirit to ensure productivity and quality.\n\n- Why the right choice?\nProject Manager is responsible for motivating the team through leadership tools, building trust, and addressing issues that affect performance.\n\n- Why are other options wrong?\n- Product owner: focuses on managing priorities and product record.\n- Finance manager: Cares about financial aspects and not team motivation.\n- Functional manager: is responsible for resources and not for direct motivation within the project.",
      "choices": [
        {
          "text": "Product Owner",
          "correct": false
        },
        {
          "text": "Financial Director",
          "correct": false
        },
        {
          "text": "Functional Manager",
          "correct": false
        },
        {
          "text": "Project Manager",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A client requests a major scope change due to a change in the market environment, which will significantly add to the project cost. This change is approved through the change control process.nnWhat should the project manager do to put the project on track?",
 "explanation": "When adopting a major change, the project manager must deal with its impact on time and costs using tools such as administrative reserve.\n\n- Why the right choice?\nAdministrative reserve is used to cover unexpected uncertainties that have been officially approved.\n\n- Why are other options wrong?\n- Baseline revaluation of the range: occurs later after direct action.\n- Risk control: necessary but not the first action.\n- Revaluation of the cost plan: Also a subsequent step after the timeline has been processed.",
      "choices": [
        {
          "text": "Reevaluate the scope baseline and impact on the project objectives.",
          "correct": false
        },
        {
          "text": "Use the management reserve to account for the schedule uncertainty.",
          "correct": true
        },
        {
          "text": "Monitor risks to ensure the effectiveness of the risk management process.",
          "correct": false
        },
        {
          "text": "Reevaluate the cost management plan to address the impact of the change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is leading a project that received a request for additional scope caused by changes in market demand. The change request also seeks a more rapid delivery time frame.nnWhich two actions should the project manager take? (Choose two)",
      "explanation": "When receiving a request for an additional domain and a faster timeframe, you must ensure that the change is worth the investment and that its risks are understandable.\n\n- Why the right choices?\n- Data collection and work environment analysis: to verify the feasibility and benefits of change.\n- Organizing a risk workshop: to adjust the risk plan and ensure that the change will not negatively affect the project.\n\n- Why are other options wrong?\n- Company performance evaluation: not directly related to current change management.\n- Organizing a workshop with sponsors: a next step after ascertaining the feasibility and benefits of the change.\n- Evaluating new technologies: Not the first action required to adjust the scope and schedule.",
      "choices": [
        {
          "text": "Assess company performance and the scope of other projects to ensure minimal impact.",
          "correct": false
        },
        {
          "text": "Organize a workshop with the sponsors and ask them to increase the project budget.",
          "correct": false
        },
        {
          "text": "Collect data and analyze the business environment to validate the business benefits.",
          "correct": true
        },
        {
          "text": "Assess new technologies and competitors, then benchmark the change against them.",
          "correct": false
        },
        {
          "text": "Organize a risk workshop, then update the risk management plan and the risk register.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is leading a remote home office implementation. The project manager is surprised with early signs of resistance from key stakeholders in the organization. The key stakeholders strongly disagree with the change and will require more persuasion than the project manager originally expected.nnWhich two tools and techniques should be used to identify the organizational and project influence of the stakeholders? (Choose two)",
 "explanation": "To determine the impact of stakeholders and plan strategies for dealing with them, the project manager uses stakeholder analysis tools.\n\n- Why the right choices?\n- Stakeholder analysis: to identify their needs, expectations and impact on the project.\n- Stakeholder map: Visually shows the location and impact of each stakeholder by power and interest.\n\n- Why are other options wrong?\n- Stakeholder matrix: later used to organize roles, not a primary analysis tool.\n-  RACI diagram: To clarify responsibilities, it has no direct relationship to determining impact.\n- Engagement map: focuses on levels of engagement, not actual impact.",
      "choices": [
        {
          "text": "Stakeholder matrix",
          "correct": false
        },
        {
          "text": "RACI chart",
          "correct": false
        },
        {
          "text": "Stakeholder analysis",
          "correct": true
        },
        {
          "text": "Stakeholder map",
          "correct": true
        },
        {
          "text": "Engagement map",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to a downturn in the business environment, a customer is only able to make a project's payment in part, rather than the fully committed monthly payment. What should the project manager do?",
      "explanation": "In agile or hybrid projects, when the budget is low, the focus is on delivering the highest possible value.\n\n- Why the right choice?\nDelivery of features with higher value allows for the desired benefits to be achieved within the available budget.\n\n- Why are other options wrong?\n- Stopping the project directly is a hasty decision.\n- Delivery of small independent components: may not bring the desired benefit.\n- Proceed according to plan without delivery: Opposes the principles of flexibility and graded value.",
      "choices": [
        {
          "text": "Discuss it with management and pause the project because of the customer's budget constraint.",
          "correct": false
        },
        {
          "text": "Deliver the features with the highest business value, based on the available budget.",
          "correct": true
        },
        {
          "text": "Deliver the features that have small independent components, based on the available budget.",
          "correct": false
        },
        {
          "text": "Continue with the planned development and deliver only when full payment is made.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager new to an organization has been tasked with running the first agile project. The project manager has decided to begin by assessing the organization's ability to adapt to an agile project.nnWhich three characteristics of the organization will help to set up the project for success? (Choose three)",
      "explanation": "The success of agile projects depends on the work environment and the culture of the organization.\n\n- Why the right choices?\n- Safe work environment: Allows members to express their opinions and try new things without fear.\n- Willingness to experiment: Necessary because agility depends on adaptation and continuous learning.\n- Speed to market: An indicator of the organization's flexibility and ability to quickly deliver benefits.\n\n- Why are other options wrong?\n- KPIs: Measurement tools, not a requirement for the success of an agile project.\n- Predictability: Not a priority in agile environment compared to flexibility and adaptation.",
      "choices": [
        {
          "text": "Safe work environment",
          "correct": true
        },
        {
          "text": "Key performance indicators (KPIs)",
          "correct": false
        },
        {
          "text": "Willingness to experiment",
          "correct": true
        },
        {
          "text": "Speed to market",
          "correct": true
        },
        {
          "text": "Predictability",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is tracking an infrastructure project that is dependent on a service provider. The service provider informed the project manager that some of the third-party components will no longer be manufactured or supported. Upon an initial review, this would significantly delay the schedule and increase the budget.nnWhat should the project manager do?",
      "explanation": "When faced with a problem that significantly affects the schedule and budget, it is necessary to escalate the matter to the project sponsor so that the appropriate decision is made at the strategic level.\n\n- Why the right choice?\nEscalating the matter to the project sponsor ensures the involvement of decision-makers who can allocate resources, adjust the scope of the project, or make other strategic decisions.\n\n- Why are other options wrong?\n- Update risk log: An important but not sufficient step on its own without a decision by senior management.\n- Hold a review meeting with the team: It may be necessary but not as a first solution before the issue is escalated.\n- Update project status: Reflects the problem but does not solve it or guide how to deal with it.",
      "choices": [
        {
          "text": "Escalate this issue to the project sponsor.",
          "correct": true
        },
        {
          "text": "Update the risk register.",
          "correct": false
        },
        {
          "text": "Convene a review with the team.",
          "correct": false
        },
        {
          "text": "Update the project status to reflect these findings.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is under scrutiny for its amount of water usage. The government's water licensing branch is changing its policy to be more restrictive.nnWhat should the project manager do?",
 "explanation": "When an important regulatory framework changes that affects a project, the impact of that change on the scope and plans of the project should be assessed.\n\n- Why the right choice?\nImpact evaluation helps to understand the extent to which the new policy affects the objectives and outputs of the project and thus planning the appropriate response.\n\n- Why are other options wrong?\n- Directing project resources to oppose policy: Unrealistic and may lead to losses.\n- Project cancellation: Early decision without impact assessment.\n- Creating a new timeline without impact evaluation may lead to unrealistic planning.",
      "choices": [
        {
          "text": "Align project resources to oppose the new water license standard.",
          "correct": false
        },
        {
          "text": "Cancel the project because of the uncertainty introduced with the policy change.",
          "correct": false
        },
        {
          "text": "Assess the impact of the policy change on the project scope.",
          "correct": true
        },
        {
          "text": "Create a new project schedule based on potential changes to the water policy.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company has undertaken a large transformation project to prepare itself for the changing economy. During the execution of the transformation project, a new technology emerges that was not foreseen in the risk management plan.nnWhat should the project manager do?",
      "explanation": "When a new risk or unexpected item arises, the risk management plan should be reviewed and the risk planning process applied to suit the new circumstances.\n\n- Why the right choice?\nReview and update the risk plan ensures appropriate handling of the new technology and mitigates its potential impact on the project.\n\n- Why are other options wrong?\n- Escalate the matter to the IT department and organize training: It may be later, but risk planning is the priority.\n- Review of the procurement plan: Not directly related to technical risks.\n- Escalation of the problem to the steering committee and brainstorming session: delay in taking direct planning action.",
      "choices": [
        {
          "text": "Escalate this to the IT department and organize training for the impacted team members.",
          "correct": false
        },
        {
          "text": "Revisit the procurement management plan and identify the impacted contracts for upcoming purchases.",
          "correct": false
        },
        {
          "text": "Revisit the risk management plan and apply the project risk planning process.",
          "correct": true
        },
        {
          "text": "Escalate the issue to the next steering committee and facilitate a brainstorming meeting.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A critical software development project has been in development for the past six sprints. A demonstration for stakeholders took place two days before the final sprint, in which a new stakeholder voiced that the product would not meet expectations for the market.nnWhat should the project manager do next?",
      "explanation": "In this case, the emergence of a new stakeholder expressing concern about market expectations before the completion of the last cycle indicates that the scope and plan of the project need to be carefully reviewed to ensure that market and stakeholder requirements are met.\n\n- Why the right choice?\nReview the scope of the project with the new stakeholder allows to clearly understand their expectations and make the necessary adjustments or clarify the boundaries of the project, this enhances the chances of product success.\n\n- Why are other options wrong?\n- Discuss the matter with the project sponsor and request that the issue be resolved: It may lead to unnecessary delays and leave the responsibility for resolving the issue away from the immediate team.\n- Review the to-do list with the development team and stakeholder: A very early focus on detail without understanding the full scope may waste time.\n- Follow the change management plan and adjust the scope: Before making any adjustment, you must first understand the expectations and conduct a thorough review.", 
      "choices": [
        {
          "text": "Discuss the matter with the project sponsor and new stakeholder and request them to fix the expectation issue.",
          "correct": false
        },
        {
          "text": "Review the scope and plan of the project with the new stakeholder.",
          "correct": true
        },
        {
          "text": "Review the list of required tasks with the development team and new stakeholder.",
          "correct": false
        },
        {
          "text": "Follow the change management plan and revise the scope and plan upon the stakeholders' request.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile project is in its last iteration. During the daily standup, the team realizes that they will not be able to complete all the activities that were planned for the sprint. The team members create a contingency plan.nnWhat should the project manager do next?",
      "explanation": "When the team is faced with the possibility of not completing the planned work, it is important to inform the product owner as they are responsible for priorities and decisions about the remaining content of the cycle.\n\n- Why the right choice?\nDiscussing the contingency plan with the product owner enables them to assess the impact and make appropriate decisions about reprioritizing or modifying the scope of work.\n\n- Why are other options wrong?\n- Discuss the contingency plan with stakeholders: It may be late or unnecessary to involve everyone at this stage.\n- Discussion with the project sponsor: The project sponsor does not usually interfere with the day-to-day details of the contingency plans.\n- Implement the contingency plan immediately: Without the consent of the product owner, it may lead to undesirable or inappropriate actions.",
      "choices": [
        {
          "text": "Discuss the contingency plan with the product owner.",
          "correct": true
        },
        {
          "text": "Discuss the contingency plan with stakeholders.",
          "correct": false
        },
        {
          "text": "Discuss the contingency plan with the project sponsor.",
          "correct": false
        },
        {
          "text": "Execute the contingency plan immediately.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While executing a critical iterative phase of a project, a problem previously identified as a risk just became a confirmed issue, which has halted progress. After entering the new item in the issue log, what should the project manager do next?",
 "explanation": "When an actual problem that was previously identified as a risk occurs and affects progress, communication with relevant stakeholders must be strengthened and involved in the solution to ensure a rapid and effective response.\n\n- Why the right choice?\nEnhancing communications ensures transparency and engages the right stakeholders, increasing the chances of a quick resolution and supporting informed decision-making.\n\n- Why are other options wrong?\n- Change the communication management plan and assign an owner to the issue: It may be part of the solution but it is not a sufficient step on its own.\n- Escalate the issue in the project review meeting: Delay in dealing with the issue.\n- Add the issue to the product record: Inappropriate because the issue affects progress and needs immediate action, not just recording it for viewing.",
      "choices": [
        {
          "text": "Increase communications and involve stakeholders in the resolution whenever necessary.",
          "correct": true
        },
        {
          "text": "Change the communications management plan and assign ownership to a team member.",
          "correct": false
        },
        {
          "text": "Escalate the issue within the team during the next project retrospective meeting.",
          "correct": false
        },
        {
          "text": "Add the issue to the product backlog to bring it into focus during the current sprint.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the execution phase of a project, a new project manager is assigned to replace the previous project manager. As the project manager starts managing the project, they discover that team performance is significantly decreasing, which is impacting the project's key performance indicators (KPIs). This team has delivered good performance on similar projects in the past.nnWhat should the project manager do next to improve this situation?",
      "explanation": "When a project manager notices a deterioration in team performance compared to their previous performance, you must first understand the root causes of this change before taking any action.\n\n- Why the right choice?\nMeeting with the team to identify the root cause helps uncover real problems that affect performance, such as communication problems, resources, or incentives.\n\n- Why are other options wrong?\n- Review the organizational resource and asset management plan: An important but not preliminary step before understanding the root cause.\n- Applying time pressure techniques: may lead to increased pressure on the team and further deterioration of performance.\n- Estimate baseline impacts and submit a change request: It is not possible to evaluate accurately without knowing the root cause.",
      "choices": [
        {
          "text": "Review the resource management plan and organizational assets.",
          "correct": false
        },
        {
          "text": "Implement compression techniques to bring the project back on track.",
          "correct": false
        },
        {
          "text": "Call for a team meeting to identify the root cause for the declining performance.",
          "correct": true
        },
        {
          "text": "Estimate the baseline impacts and submit a change request.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has recently finished a sprint for developing two features for a fleet management system. Although the team delivered the required features, they encountered several issues and conflicts during the sprint. Team members were upset about this experience and are now showing a lack of motivation due to what has occurred.nnWhat can the project manager do to help increase the team's motivation and engagement with the project?",
      "explanation": "When a team is frustrated and unmotivated by conflicts and negative experiences, it is important to provide space for open discussion and problem analysis to improve performance in the future.\n\n- Why the right choice?\nRetrospective allows the team to express their opinions, discuss problems, and draw lessons to improve collaboration and work in future sessions.\n\n- Why are other options wrong?\n- Arranging one-on-one meetings: may not address group or dynamic team problems.\n- Review course progress: focus more on results than on problems among team members.\n- Review planning procedures: Not sufficient to address behavioral or motivational problems.",
      "choices": [
        {
          "text": "Set up one-on-one meetings with the project team members.",
          "correct": false
        },
        {
          "text": "Review sprint progress with the project team members.",
          "correct": false
        },
        {
          "text": "Review sprint planning procedures with the project team members.",
          "correct": false
        },
        {
          "text": "Perform a sprint retrospective with the project team members.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A key project stakeholder showed interest in the beginning of a complex agile project but has become less involved as the sprint has progressed due to additional responsibilities. A few sprints later, the key stakeholder rejected a feature deliverable. The team is reworking the rejected deliverable for the next sprint.nnWhat should the project manager have done to avoid this situation?",
      "explanation": "Continuous communication and regular engagement of key stakeholders ensures that they understand and support the outputs, and reduces the chances of rejection of work in advanced stages.\n\n- Why the right choice?\nInvolving stakeholders in the decision-making process ensures that they comply with requirements and deliveries and reduces surprises or later rejections.\n\n- Why are other options wrong?\n- Documenting the vision and objectives of the project: important but not sufficient without direct interaction with stakeholders.\n- Analysis of changes in stakeholder characteristics: a delayed analytical step after the problem.\n- Customizing communications to needs: important but less influential than involving them in the decision.",
      "choices": [
        {
          "text": "Documented the project vision and objectives.",
          "correct": false
        },
        {
          "text": "Analyzed the changes in stakeholder attributes.",
          "correct": false
        },
        {
          "text": "Involved the key stakeholders in the decision-making process.",
          "correct": true
        },
        {
          "text": "Customized stakeholder communications based on the stakeholders' needs.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project manager is assigned to lead an agile project. The project manager wants to use motivation to encourage the team to perform well throughout the project.nnWhat should the project manager do?",
      "explanation": "Constant motivation is important to keep the team motivated and perform well.\n\n- Why the right choice?\nImplement a rewards system that helps boost motivation in team members and make them feel valued and actively engaged.\n\n- Why are other options wrong?\n- Using administrative reserves to fund team-building activities: important but not a direct means of motivation.\n- Inflating project estimates to provide financial margin: This may negatively affect the credibility of planning.\n- Requesting additional funding from the project sponsor: It may be necessary but is not the primary method of motivation.",
      "choices": [
        {
          "text": "Implement a reward system aimed to keep the team engaged and motivated.",
          "correct": true
        },
        {
          "text": "Use the management reserves to fund some team-building activities.",
          "correct": false
        },
        {
          "text": "Inflate project estimates to provide a financial buffer for team activities.",
          "correct": false
        },
        {
          "text": "Ask project sponsor to fund more for team building activities.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A company's leadership team has decided to invest in a new product using an agile approach. The commercial and product teams have started the planning activity for this new venture.nnWhich three key factors does the project manager need in order to deliver this product? (Choose 3)",
      "explanation": "These factors help to clarify the vision and guide the team to achieve product goals.\n\n- Why the right choices?\n- Product vision: Availability of the goal and overall vision of the product.\n- Product roadmap: work and development phases.\n- High-level product listing: details of features and requirements.\n\n- Why the wrong choices?\n- Key performance indicators (KPIs): important but not a basic initial planning.\n- Timeline performance indicators (SPIs): related to timesheet measurement, not a key factor.",
      "choices": [
        {
          "text": "Product vision",
          "correct": true
        },
        {
          "text": "Product roadmap",
          "correct": true
        },
        {
          "text": "High-level product backlog",
          "correct": true
        },
        {
          "text": "Key performance indicators (KPIs)",
          "correct": false
        },
        {
          "text": "Schedule performance indexes (SPIs)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team is assembled for a new project that will be using a predictive approach through requirements gathering and an agile approach for development and testing. Not everyone on the team has experience working in agile. The schedule has started slipping due to the unclear structure of the agile development approach.nnWhat should the project manager have done to avoid this situation?",
      "explanation": "Daily meetings (standing) help to follow up continuously and solve problems quickly.\n\n- Why the right choice?\nCreate daily parking meetings that allow tracking of progress and early recognition of delays, which helps in quick action.\n\n- Why are other options wrong?\n- Set up weekly case meetings: Low frequency to track daily delays.\n- Meeting with the team to allow decision-making: Good but does not cover daily follow-up.\n- Periodic meetings to identify low performance: Focuses on the problem without continuous daily follow-up.",
      "choices": [
        {
          "text": "Set up weekly status meetings to review team progress and regularly escalate delays.",
          "correct": false
        },
        {
          "text": "Met with the team, allowed team members to make decisions about what to do, and established performance goals.",
          "correct": false
        },
        {
          "text": "Established daily standup meetings to track team progress and escalate delays to stakeholders as appropriate.",
          "correct": true
        },
        {
          "text": "Conducted routine meetings and identified team members who are under performing.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A senior business stakeholder with many years of experience is pressuring an agile team to deliver most of the promised functionality to the customer 18 months in the future as opposed to multiple, incremental deliveries over the course of the 18 months. What should the project lead do next?",
      "explanation": "Dealing with stakeholders wisely and explaining the benefits helps build trust and achieve project success.\n\n- Why the right choice?\nWorking with the stakeholder to understand their concerns and explain the benefits of incremental deliveries supports the creation of continuous value and reduces risk.\n\n- Why are other options wrong?\n- Working with the team to schedule incremental deliveries: does not address stakeholder pressure or concerns.\n- Scheduling meetings with the client to determine their support: does not focus on the stakeholder's concerns.\n- Provide concern details and adjust goals: may lead to the fulfillment of inappropriate requests and increase risk.",
      "choices": [
        {
          "text": "Work with the agile team to schedule the incremental deliveries to enable delivery of business value sooner to the customer.",
          "correct": false
        },
        {
          "text": "Schedule meetings with the customer to determine their ability to support multiple incremental deliveries.",
          "correct": false
        },
        {
          "text": "Provide details of the concern to the agile team and adjust their goals and release plans to conform to the stakeholder's request.",
          "correct": false
        },
        {
          "text": "Work with the stakeholder to understand what the concerns are while, at the same time, conveying the benefits of incremental deliveries.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a water treatment investment project. The local government has recently passed a law that requires compliance with clean water according to global standards. This is a new regulation that was initiated in the last month and was quickly passed.nnWhat should the project manager do?",
      "explanation": "Dealing with legal changes quickly is important to avoid delays and risks.\n\n- Why the right choice?\nConducting an impact analysis of new regulations helps to assess their impact on the project and inform stakeholders to make informed decisions.\n\n- Why are other options wrong?\n- Continue the project without modification: It may expose the project to the risk of non-compliance.\n- Recommend to continue only: It may be unrealistic without a full understanding of the impact.\n- Recommend stopping the project immediately: It may be a hasty step without adequate analysis.",
      "choices": [
        {
          "text": "Inform the stakeholders and continue with the project according to the original plans since the law was passed after the project started.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor and recommend that the project continue because the new legal requirements can be delivered.",
          "correct": false
        },
        {
          "text": "Conduct an analysis of the impact of the regulation on the project and the business and communicate it to stakeholders.",
          "correct": true
        },
        {
          "text": "Recommend that all work on the project be stopped immediately until the impact of the regulation is understood.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A startup in its early stages has been acquired by a major company. In light of this new scenario, the project manager has been requested to review the project's roadmap.nnWhat should the project manager do?",
      "explanation": "Defining value definition with stakeholders helps rearrange priorities in line with the goals of the new company.\n\n- Why the right choice?\nUnderstanding the value and priorities of stakeholders ensures that the roadmap reflects the new strategic objectives.\n\n- Why are other choices wrong?\n- Reprioritize based solely on ROI: It may be narrow in scope and neglect other goals.\n- Focus on long-term benefits and reduce technical debt: Good but does not guarantee alignment with new stakeholders.\n- Launch a customer survey: It may be late and impractical at this early stage.",
      "choices": [
        {
          "text": "Determine the definition of value with the stakeholders and reprioritize the project's backlog accordingly.",
          "correct": true
        },
        {
          "text": "Reprioritize the project's backlog by prioritizing those features that maximize the return on investment (ROI).",
          "correct": false
        },
        {
          "text": "Reprioritize the roadmap by focusing on long-term benefits and reducing the technical debt.",
          "correct": false
        },
        {
          "text": "Launch a customer survey to better evaluate the key project features prior to reprioritizing the roadmap.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been assigned to a project to implement an asset health management system. The executive business sponsor has indicated that the system is expected to improve the quality of operations and extend the life span of the assets.nnWhat should the project manager do in order to demonstrate the business value once the system is in production?",
      "explanation": "To assert business value, a project manager must define clear and measurable success metrics that are directly related to business goals, such as reducing costs and improving performance.\n\n- Why the right choice?\nIdentifying critical success metrics, cost savings, and ongoing performance metrics provides practical evidence of value creation.\n\n- Why are other options wrong?\n- Write test cases that are important but focus on technical quality rather than proof of value.\n- Verification of compliance is necessary but not sufficient to measure business value.\n- Review return on investment Reference data is good but insufficient without specifying clear success criteria.",
      "choices": [
        {
          "text": "Establish critical success criteria, potential cost savings, and ongoing performance metrics for the project.",
          "correct": true
        },
        {
          "text": "Write test cases to align with the business values and ensure that acceptance criteria are clear during user acceptance testing (UAT).",
          "correct": false
        },
        {
          "text": "Verify that all requirements and acceptance criteria are in alignment with the business value and expectations.",
          "correct": false
        },
        {
          "text": "Validate the return on investment (ROI), review the current asset performance, and use it as a benchmark for future measurements.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a project that will deliver a solution in country A. Due to the potential for a security breach, country A's government is banning the technology that will be used in the project's solution, adversely affecting the project. The project manager is close to completing the installation for the project after already procuring the materials and the banned technology.nnWhat should the project manager do?",
      "explanation": "Handling sudden organizational changes must be done through a formal change management process to ensure that the solution complies with the laws.\n\n- Why the right choice?\nReviewing the project management plan and following the change control process helps to assess the formal impact and plan for the appropriate response.\n\n- Why are other options wrong?\n- An important legal review but not the first step.\n- Meeting with the project sponsor is necessary but does not address the initial procedural step.\n- Informing the client that it is not possible to deliver is a passive and unprofessional step without trying to adapt.",
      "choices": [
        {
          "text": "Review the project management plan and follow the process for change control.",
          "correct": true
        },
        {
          "text": "Request that the legal team review the change and determine the appropriate response.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor about the issue and request direction for next steps.",
          "correct": false
        },
        {
          "text": "Inform the customer that the project cannot deliver the defined scope.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is developing a product where the time to market is critical. During the execution phase, the client submits a change request to include the latest technology that will enhance the product features and provide a competitive advantage. The change will impact the project constraints, but the benefits outweigh the cost and effort.nnWhat should the project manager do next?",
      "explanation": "In cases of orders that improve competitive value, it is best to use an incremental delivery approach that accelerates the arrival of key market features.\n\n- Why the right choice?\nIncremental delivery adoption enables the project to deliver value faster with the ability to incorporate improvements later.\n\n- Why are other options wrong?\n- Starting a separate project may cause duplication and delay delivery.\n- Implementing an integrated change process may lead to a delay without ensuring the speed of delivery.\n- Closing the current project and restarting is an expensive and unnecessary step.",
      "choices": [
        {
          "text": "Adopt an incremental delivery approach and release essential features of the product into the market first to counter competition.",
          "correct": true
        },
        {
          "text": "Start a separate project to adopt the new technology incrementally to enhance the product features as the technology matures.",
          "correct": false
        },
        {
          "text": "Perform an integrated change control process and review the project constraints to effectively manage the enhanced scope.",
          "correct": false
        },
        {
          "text": "Close the current project and start a new project with an incremental delivery approach.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is asked to manage a project that will allow the company to comply with a new, upcoming regulation. Just after project kick-off, the scope is modified to have the project team now work on specific tasks, while a global team will manage the program for several countries in parallel. The project management plan has not yet been shared, and the deadline to complete the project is fixed.nnWhat should the project manager do to handle the scope and changes?",
 "explanation": "In the case of an unclear or variable scope with a fixed deadline, it is preferable to start with a  backlog  and work on the clearer tasks while gradually improving the scope according to the principles of agile work.\n\n- Why the right choice?\nDefine an initial list and start working allows the launch to be accelerated while gradually ingesting changes without delay.\n\n- Why are other options wrong?\n- Create a risk entry that is important but does not solve the practical problem in domain management.\n- Formalizing the change is important but delayed without a clear plan.\n- Reviewing organizational assets is useful but does not directly address the current issue.",
      "choices": [
        {
          "text": "Create a risk entry in the risk management plan due to the lack of a global project management plan.",
          "correct": false
        },
        {
          "text": "Formalize the change in the scope with the project sponsor to limit accountability for the specific tasks.",
          "correct": false
        },
        {
          "text": "Review the organizational process assets (OPAs) from similar situations and the approaches that were implemented.",
          "correct": false
        },
        {
          "text": "Define an initial backlog and start working on the clearest tasks, then incrementally refine the scope.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project execution phase overlaps with a holiday in the country where the majority of team members are based. This phase is critical, and all team members are required to work through the holiday. This negatively impacts team morale.nnWhat should the project manager have done to avoid this?",
 "explanation": "Good resource planning includes recognizing holidays and planning in advance to distribute work to avoid a negative impact on team morale.\n\n- Why the right choice?\nDevelop a good resource management plan that allows proper planning and distribution of tasks in a manner that respects the circumstances of the members.\n\n- Why are other options wrong?\n- Requesting assistance from other teams may not be available or appropriate.\n- Postponing activities may delay the project.\n-  The stakeholder engagement plan is important but does not address resource management.",
      "choices": [
        {
          "text": "Requested help from other teams based in other countries",
          "correct": false
        },
        {
          "text": "Postponed project activities",
          "correct": false
        },
        {
          "text": "Prepared the stakeholder engagement plan",
          "correct": false
        },
        {
          "text": "Better developed the resource management plan",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager notices that the project is behind schedule because materials delivery was delayed. The procurement team informs the project manager that new government-imposed rules for the procurement of these materials caused this delay.nnIn what plan should these new rules be documented?",
 "explanation": "Procurement rules and changes should be documented in the procurement management plan as they relate to procurement policies and procedures that affect the project.\n\n- Why the right choice?\nThe procurement management plan includes all the regulations and policies related to procurement, making it the most appropriate place to document these rules.\n\n- Why are other options wrong?The CMP is about information exchange, not policies.\n- The Stakeholder Engagement Plan is about communicating with stakeholders.\n-  The Timeline Management Plan is about delivery dates, not legislation or rules.",
      "choices": [
        {
          "text": "Procurement management",
          "correct": true
        },
        {
          "text": "Communications management",
          "correct": false
        },
        {
          "text": "Stakeholder engagement",
          "correct": false
        },
        {
          "text": "Schedule management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Midway through project execution, several stakeholders raise concerns about team performance and delivery. The project manager believes the project is progressing per the approved scope, budget, and schedule.nnWhat should the project manager do next?",
      "explanation": "When stakeholders are concerned that the project is proceeding as planned, going back to the CMP is the right step to manage their expectations and clarify the current situation.\n\n- Why the right choice?\nCommunication management plan helps the project manager determine how and when to communicate with stakeholders to reassure and update them in a way that eliminates concerns.\n\n- Why are other options wrong?\n- Sending an email without a plan may not be effective or misunderstood.\n- Requesting the intervention of the project sponsor is not necessary if the project is going well.\n- Asking stakeholders to escalate their concerns is not effective management of the situation.",
      "choices": [
        {
          "text": "Email the stakeholders to assure them of action.",
          "correct": false
        },
        {
          "text": "Consult the communications management plan to manage stakeholders' expectations.",
          "correct": true
        },
        {
          "text": "Ask the project sponsor to intervene.",
          "correct": false
        },
        {
          "text": "Ask stakeholders to escalate their concerns to the CEO.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The implementation of a business requirement for an IT project impacts several applications. The application owner notices that changes to a function in application X can be started only upon completion of the development of a new feature in application Y.nnThis is an example of what dependency?",
 "explanation": "The 'Finish-to-Start, FS' dependency means that an activity can only start after the previous activity ends.\n\n- Why the right choice?\nChanges in application (X) begin only after you finish developing a feature in application (Y), and this is a classic model of FS dependency.\n\n- Why are other options wrong?\n- Start-to-start (SS) means that the two activities start at the same time.\n- Start-to-end (SF) means that the beginning of one activity depends on the end of another activity, which is the opposite of the case.\n- Finish to end (FF) means that the two activities end at the same time and not start after completion.",
      "choices": [
        {
          "text": "Start-to-start (SS)",
          "correct": false
        },
        {
          "text": "Finish-to-start (FS)",
          "correct": true
        },
        {
          "text": "Start-to-finish (SF)",
          "correct": false
        },
        {
          "text": "Finish-to-finish (FF)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An unforeseen issue results in the need to procure a new piece of machinery critical for meeting quality specifications. From where may the necessary funds be obtained?",
 "explanation": "In cases where unplanned funding is needed due to unforeseen issues, the project manager typically uses the administrative reserve that is allocated to manage unforeseen risks.\n\n- Why the right choice?\nAdministrative reserve is used to cover additional costs that appear during the project that were not covered in the original budget.\n\n- Why are other options wrong?\n- Key stakeholders are not a direct source of funding.\n-  The contingency reserve is used for predetermined risks and not for unforeseen situations.\n-  The project sponsor may participate in decision-making but is not the actual funding source.",
      "choices": [
        {
          "text": "Key stakeholders",
          "correct": false
        },
        {
          "text": "Management reserve",
          "correct": true
        },
        {
          "text": "Contingency reserve",
          "correct": false
        },
        {
          "text": "Project sponsor",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager for a US$15 million construction project must meet a specific project milestone earlier than planned because a season-long pattern of extreme weather is expected soon. The project is already over budget, and the project sponsor is not prepared to provide additional funding.nnWhich tool or technique should the project manager use to achieve the milestone before the extreme weather begins?",
 "explanation": "Fast Tracking is used to reduce the duration of the project by running some activities in parallel instead of arranging them in sequence.\n\n- Why the right choice?\nParallel execution does not require additional resources and is suitable in the case of a limited budget.\n\n- Why are other options wrong?\n- Simulation is an analysis tool, not a time compression tool.\n- Resource leveling may lead to additional delays.\n-  Crashing requires additional funding not available here.",
      "choices": [
        {
          "text": "Simulation",
          "correct": false
        },
        {
          "text": "Fast tracking",
          "correct": true
        },
        {
          "text": "Resource smoothing",
          "correct": false
        },
        {
          "text": "Crashing",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to organizational changes, a key stakeholder is replaced by a new employee. The next status review meeting to update project progress will not take place until next month.nnWhat should the project manager do next?",
      "explanation": "Early communication with new stakeholders is essential to build a common understanding and avoid surprises.\n\n- Why the right choice?\nSchedule a live meeting that provides personal communication and an opportunity to answer queries.\n\n- Why are other options wrong?\n- Sending a report may not be enough to build trust.\n- Asking for sponsor advice is a direct ineffective step.\n- Waiting until the next meeting increases the risk of misunderstanding.",
      "choices": [
        {
          "text": "Schedule a separate meeting with the new stakeholder to brief them on project status.",
          "correct": true
        },
        {
          "text": "Prepare and send a project status report to the new stakeholder for review.",
          "correct": false
        },
        {
          "text": "Seek advice from the project sponsor on how to obtain support from the new stakeholder.",
          "correct": false
        },
        {
          "text": "Wait for the next communication window to share information with the new stakeholder.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team discovers an opportunity to enhance software without impacting the budget or schedule. The team makes the enhancement without proper documentation, which later causes production issues.nnWhat process should have been conducted to prevent this?",
 "explanation": "Integrated change control ensures that all changes are evaluated by a formal committee before they are implemented.\n\n- Why the right choice?\nThis process prevents unauthorized or ill-considered changes from being made.\n\n- Why are other options wrong?\n- Control of the schedule is only for timing.\n-  A qualitative risk analysis that focuses on assessing risks and not approving changes.\n- Scope management planning outlines and does not address changes during implementation.",
      "choices": [
        {
          "text": "Control Schedule",
          "correct": false
        },
        {
          "text": "Perform Qualitative Risk Analysis",
          "correct": false
        },
        {
          "text": "Plan Scope Management",
          "correct": false
        },
        {
          "text": "Perform Integrated Change Control",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A pilot project is ready to close and the project team wants to capture the challenges that were overcome and the opportunities for future work. Where will they document this information?",
      "explanation": "The Lessons Learned Log is the place dedicated to documenting experiences gained during the project including challenges, opportunities and improvements.\n\n- Why the right choice?\nRecord lessons learned helps improve the performance of future projects.\n\n- Why are other options wrong?\n- Organizational process asset updates: includes general policies and procedures.\n- Work performance report: reflects the current situation and does not document experiences.\n- Project management plan: a document for planning, not documentation after closing.",
      "choices": [
        {
          "text": "Organizational process assets updates",
          "correct": false
        },
        {
          "text": "Work performance report",
          "correct": false
        },
        {
          "text": "Project management plan",
          "correct": false
        },
        {
          "text": "Lessons learned register",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team completes the identification of project and product requirements. Which of the following were used to accomplish this?",
      "explanation": "Brainstorming, convergence charts and mind maps are tools used to creatively and systematically.\n\n- Why the right choice?\nThese tools help to collect ideas and analyze them in a visual and effective way.\n\n- Why are other options wrong?\n- Benchmarking and network diagram are not the main tools for determining requirements.\n- WBS is used later after the requirements have been defined.\n- Observation and conversation may support but are not the main medium.",
      "choices": [
        {
          "text": "Benchmarking, network diagram, and trend analysis",
          "correct": false
        },
        {
          "text": "Work breakdown structure (WBS), trend analysis, and observation/conversation",
          "correct": false
        },
        {
          "text": "Brainstorming, affinity diagrams, and mind mapping",
          "correct": true
        },
        {
          "text": "Affinity diagrams, benchmarking, and observation/conversation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project's original budget at completion (BAC) was calculated as US$100,000, but the estimate at completion (EAC) is US$120,000. If the schedule performance index (SPI) is equal to 1, what is the cost performance index (CPI)?",
      "explanation": "When the EAC is greater than the BAC it means that the efficiency is lower than planned.\n\n- Why the right choice?\nCPI = BAC / EAC = 100,000 / 120,000 < 1.\n\n- Why are other options wrong?\n- If CPI = 1 it means that the costs are in line with the plan and this is not the case here.\n- Greater than 1 means better performance than expected.\n- 1.2 does not make sense here because the EAC is greater than the BAC.",
      "choices": [
        {
          "text": "Equal to 1.2",
          "correct": false
        },
        {
          "text": "Less than 1",
          "correct": true
        },
        {
          "text": "Equal to 1",
          "correct": false
        },
        {
          "text": "Greater than 1",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During testing of a project component, a senior tester discovers a functionality that will ensure the future performance of the project's solution. This will create a change in scope.nnWhich type of change request should be made to include this functionality?",
      "explanation": "A preventive measure is used to add features or steps aimed at preventing future problems before they occur. In this context, the feature discovered by the laboratory will contribute to improving performance later, so a request is made to change the type of preventive action.\n\n- Why the right choice?\nThe preventive measure addresses future improvements before issues arise.\n\n- Why are other options wrong?\n- Corrective action: Fixes an existing issue, not for future improvement.\n- Bug fix: Intended to correct a detected bug.\n- Scope update: Due to a change, not its type.",
      "choices": [
        {
          "text": "Preventive action",
          "correct": true
        },
        {
          "text": "Corrective action",
          "correct": false
        },
        {
          "text": "Defect repair",
          "correct": false
        },
        {
          "text": "Scope update",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While reviewing project documentation, a project manager discovers that modifications were made without proper approvals. What should the project manager do next?",
 "explanation": "In this case the project manager should refer to the change management plan to determine how to deal with unauthorized modifications. This plan outlines the actions that need to be taken to correct the situation and ensure that all changes are properly documented.\n\n- Why the right choice?\nThe change management plan contains the processes needed to control modifications.\n\n- Why are other options wrong?\n- Escalation of the order directly is not the first step.\n-  Review of the requirements management plan is not appropriate for this case.\n- Escalating the order to the sponsor is done after exhausting the internal means.",
      "choices": [
        {
          "text": "Escalate the issue to the project management office (PMO).",
          "correct": false
        },
        {
          "text": "Review the change management plan.",
          "correct": true
        },
        {
          "text": "Review the requirements management plan.",
          "correct": false
        },
        {
          "text": "Escalate the issue to the project sponsor.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to commitments to another project, an accountant fails to deliver an important report to a project manager on time. The project manager did not expect the delay and didn't realize the accountant had conflicting priorities.nnWhat should the project manager have done to avoid this?",
 "explanation": "The resource allocation plan shows the commitments of each team member including participation in other projects. By reference, the project manager can coordinate efforts and avoid conflicts between tasks.\n\n- Why the right choice?\nThe resource allocation plan is necessary to understand the distribution of work and commitments.\n\n- Why are other options wrong?\n-  The  RACI matrix specifies who is responsible but does not show the availability of people.\n- Timesheets and resource calendar are based on information entered in advance and may not reflect conflict of commitments.",
      "choices": [
        {
          "text": "Referenced the RACI matrix.",
          "correct": false
        },
        {
          "text": "Referenced timesheets.",
          "correct": false
        },
        {
          "text": "Referenced the resource allocation plan.",
          "correct": true
        },
        {
          "text": "Referenced the resource calendar.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What should a project manager do to obtain stakeholder agreement?",
      "explanation": "To ensure stakeholder approval, the project manager must implement a stakeholder engagement management process. This process includes setting their expectations, meeting their needs, and enhancing their engagement throughout the project life cycle.\n\n- Why the right choice?\nStakeholder engagement management directly aims to achieve their satisfaction and approval.\n\n- Why are other options wrong?\n- Updating the resource management plan is not directly related to stakeholder approval.\n- Monitoring and controlling project work focuses on performance, not approvals.\n- Scheduling a meeting may be a means, but it is not an approved process for this purpose.",
      "choices": [
        {
          "text": "Update Resource Management Plan",
          "correct": false
        },
        {
          "text": "Manage Stakeholder Engagement",
          "correct": true
        },
        {
          "text": "Monitor and Control Project Work",
          "correct": false
        },
        {
          "text": "Schedule a meeting between sponsor and stakeholders",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A design project is ready to be transferred to production. What activity is required for phase closure?",
      "explanation": "Before moving into production, you must document the effects of any customizations made on operations. This is necessary to ensure that the impact on future work is clear and that unregistered edits are not repeated.\n\n- Why the right choice?\nRecording customization effects helps maintain and improve process standards.\n\n- Why are other options wrong?\n- The summary budget is determined in the planning stages.\n- Quality management is related to control, not closure.\n- Preventive measures are about risks and not about phase closure.",
      "choices": [
        {
          "text": "Determine summary budget.",
          "correct": false
        },
        {
          "text": "Manage quality.",
          "correct": false
        },
        {
          "text": "Ensure preventive actions are completed.",
          "correct": false
        },
        {
          "text": "Record impacts of tailoring to any process.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A geographically dispersed team successfully completed a project. The project manager wants to quickly obtain the team's feedback for statistical analysis.nnWhat method should the project manager use?",
      "explanation": "Questionnaires are an effective way to collect data and observations from geographically distributed teams, and allow the results to be analyzed statistically easily.\n\n- Why the right choice?\nSurveys provide the collection of analyzable quantitative data.\n\n- Why are other options wrong?\n- Video conference and focus sessions are difficult to organize with distributed teams.\n- Email is less structured and more difficult to analyze statistically.",
      "choices": [
        {
          "text": "Video conference",
          "correct": false
        },
        {
          "text": "Focus group",
          "correct": false
        },
        {
          "text": "Questionnaires",
          "correct": true
        },
        {
          "text": "Email",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager takes over a recently approved project. What will play a key role in determining the communication method?",
      "explanation": "The key factor is stakeholder requirements, because they determine how, type and frequency of information they want to receive to ensure their expectations are met.\n\n- Why the right choice?\nStakeholder requirements determine the format, content, frequency, and method of communication.\n\n- Why are other options wrong?\n- Frequency of deployment is part of the communication plan but not the primary factor.\n- The transmitter-receiver model is a theoretical framework and not a practical specific.\n- Meeting management methods are related to the implementation of meetings and not to the determination of the method of communication.",
      "choices": [
        {
          "text": "Stakeholder requirements",
          "correct": true
        },
        {
          "text": "Frequency of distribution",
          "correct": false
        },
        {
          "text": "Sender-receiver model",
          "correct": false
        },
        {
          "text": "Meeting management methods",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While reviewing a status report, a project manager notices that, over a period of six months, the coding quality for one developer is statistically lower than another developer assigned the same task. Which tool should the project manager use to trace the problem's source back to its actionable root cause?",
 "explanation": "Ishikawa is best suited for analyzing the root causes of complex problems such as poor coding quality.\n\n- Why the right choice?\nFishbone chart helps to classify possible causes in an organized manner.\n\n- Why are other options wrong?\n-  The graph shows only the distribution of data.\n- The control diagram monitors stability, not the cause.\n- The dispersion chart shows the relationship between two variables but does not reveal the root causes.",
      "choices": [
        {
          "text": "Histogram",
          "correct": false
        },
        {
          "text": "Control chart",
          "correct": false
        },
        {
          "text": "Scatter diagram",
          "correct": false
        },
        {
          "text": "Ishikawa diagram",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the completion of a project, customer agreement cannot be achieved through negotiations. What should the project manager do next?",
      "explanation": "When negotiations fail, arbitration is the next means of settling the dispute legally without resorting directly to the courts.\n\n- Why the right choice?\nArbitration provides a formal and binding solution for both parties without resorting to litigation.\n\n- Why are other options wrong?\n- Informing team members is not the appropriate direct procedure.\n- Legal action often comes after arbitration.\n- Initiating the closure phase is not appropriate before the dispute is resolved.",
      "choices": [
        {
          "text": "Inform project team members.",
          "correct": false
        },
        {
          "text": "Initiate litigation since all work was completed.",
          "correct": false
        },
        {
          "text": "Start the closing phase.",
          "correct": false
        },
        {
          "text": "Explore arbitration.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project's execution, a previously unidentified stakeholder within the customer's organization requests a change that could affect the project's scope. The stakeholder's influence within the customer's organization is strong.nnWhat should the project manager do first?",
      "explanation": "When a new stakeholder emerges with impact, the first necessary step is to formally identify them and update the stakeholder register before taking any action related to their request.\n\n- Why the right choice?\nBecause the registration of a new stakeholder ensures that it is included in the stakeholder management plan.\n\n- Why are other options wrong?\n- Setting a meeting or issuing a change request requires that this person be formally identified.\n- Meeting with everyone is a late step before verifying their identity and assessing their impact.",
      "choices": [
        {
          "text": "Schedule a meeting and, based on the outcome, update the project management plan.",
          "correct": false
        },
        {
          "text": "Issue a change request to the change control board (CCB).",
          "correct": false
        },
        {
          "text": "Identify the new stakeholder and update the stakeholder register.",
          "correct": true
        },
        {
          "text": "Meet with all stakeholders to discuss the change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to a budget issue, the project team decides to use low-cost equipment with higher testing uncertainty to reduce cost. However, the test results are unstable and are creating discrepancies. One of the team members is aware of the situation and proposes to use high-resolution equipment with lower test uncertainty to increase the testing quality.nnHow should the project manager respond to this proposal?",
 "explanation": "The right thing to do is to evaluate the proposal and not accept or reject it directly. Such a decision requires an analysis of the balance of cost and quality.\n\n- Why the right choice?\nBecause evaluating the proposal allows the project manager to make a decision based on data and not on assumptions.\n\n- Why are other options wrong?\n- Direct rejection may waste an opportunity for improvement.\n- Direct acceptance may create financial problems.\n- Focusing only on quality without considering the budget is not balanced.",
      "choices": [
        {
          "text": "Reject the proposal due to budget constraints and follow the quality management plan.",
          "correct": false
        },
        {
          "text": "Accept the proposal because the high-resolution equipment produces precise test results with lower test uncertainty.",
          "correct": false
        },
        {
          "text": "Evaluate the proposal to determine if the high-resolution equipment produces precise test results with lower test uncertainty.",
          "correct": true
        },
        {
          "text": "Accept the proposal because budget is not an issue when quality assurance is taken into consideration.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While performing a qualitative project risk analysis process the project manager finds that the product is missing the \"Definition of Done\". What type of risk is this?",
      "explanation": "The absence of an achievement definition is technically dangerous because it is directly related to the technical product acceptance criteria.\n\n- Why the right choice?\nBecause the definition of achievement is technical and technical to ensure that the product meets the requirements.\n\n- Why are other options wrong?\n- Commercial risk related to return or market.\n- External risk associated with parties outside the project.\n- Administrative risk related to operations and management and not to the technical aspect.",
      "choices": [
        {
          "text": "Commercial risk",
          "correct": false
        },
        {
          "text": "External Risk",
          "correct": false
        },
        {
          "text": "Management Risk",
          "correct": false
        },
        {
          "text": "Technical Risk",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While forming the team to work on a global project with incremental deliveries, the project leader shared the performance measurement plan with the team. Team members did not appreciate the proposed plan, as they expressed it is not realistic.nnWhat should the project leader do to ensure the team member's engagement in the implementation of the performance management plan?",
 "explanation": "Directly including the team in evaluating their performance through self-evaluation enhances their sense of responsibility and participation and reduces resistance to the plan.\n\n- Why the right choice? Because it enhances the independence of the team and makes its members part of monitoring their performance.\n- Why are other options wrong?\n- Force the team creates greater resistance.\n-  An HR offer that does not address the sense of unreality.\n- Individual talk is not effective compared to a systematic solution that includes everyone.",
      "choices": [
        {
          "text": "Ask the team members to abide by the plan, otherwise, they will not be properly appraised.",
          "correct": false
        },
        {
          "text": "Include self-assessments at the start, middle, and end of the project to increase the autonomy of the team.",
          "correct": true
        },
        {
          "text": "Ask the human resources team to deliver a presentation about the company's performance measurements.",
          "correct": false
        },
        {
          "text": "Talk to the team member on a one-on-one basis to convince them about the benefits of the proposed plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a feedback meeting, the project manager is informed by team members that validating deliverables is difficult due to the fact that technology requirements keep changing before the due dates of their handover causing rework. The project manager suggests a more appropriate project management methodology to be adopted to address this occurrence for upcoming projects.nnWhich project management methodology will work for this team?",
      "explanation": "Agile is flexible and adaptable to constant changes in requirements, reducing rework and providing faster results.\n\n- Why the right choice? Because it is in line with dynamic environments where requirements are constantly changing.\n- Why are other options wrong?\n- Predictive and waterfall depend on fixed plans.\n- Incremental does not provide the same degree of adaptation as Agile.",
      "choices": [
        {
          "text": "Agile",
          "correct": true
        },
        {
          "text": "Predictive",
          "correct": false
        },
        {
          "text": "Waterfall",
          "correct": false
        },
        {
          "text": "Incremental",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What are the main outputs of the risk identification process?",
 "explanation": "Risk identification essentially produces the risk log, as well as the risk report and updating the project documents to ensure that all new details are included.\n\n- Why the right choice? Because it collects all the real output of this process according to the approved directory.\n- Why are the other options wrong?\n- Some of them are incomplete, such as the absence of updating documents.\n-  The risk management plan is not a product of this process but is in the planning stage.",
      "choices": [
        {
          "text": "Risk report and risk register",
          "correct": false
        },
        {
          "text": "Risk report, risk register, and project documents updates",
          "correct": true
        },
        {
          "text": "Risk management plan, risk register, and risk responses",
          "correct": false
        },
        {
          "text": "Risk report, probability, and impact matrix",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While conducting a retrospective meeting, team members were surprised from the performance results of the team shared by the project lead. The team have all expressed their ignorance of the measurements and availability of the different tools in place.nnWhat should have the project lead done to avoid this situation?",
      "explanation": "The correct answer: Plan and establish a clear framework for measuring performance.\n\n- Why is this the correct answer?\nBecause establishing a clear and pre-agreed performance measurement framework ensures the transparency and awareness of all team members of the measurement tools and standards.\n\n- Why are other options wrong?\nReassigning the task may create a new load and affect the balance\n Registering the analyst in a training program may not be practical in a short-term project\n Moving work after the start of implementation causes a loss of continuity and affects quality",
      "choices": [
        {
          "text": "Ask the HR to explain the different performance measurement tools",
          "correct": false
        },
        {
          "text": "Inform the team members to fill in feedback on a regular basis",
          "correct": false
        },
        {
          "text": "Provide Team members with continuous feedback about their performance",
          "correct": false
        },
        {
          "text": "Planning and define a clear performance measurement framework",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While forming a team to work on a global project, the project leader calls for an ice breaker meeting between the diverse team members.nnWhat should the project manager do to motivate the team to express their expectations?",
      "explanation": "The correct answer: Start with a team self-assessment to increase team independence.\n\n- Why is this the correct answer?\nBecause self-evaluation promotes active participation and motivates members to express their expectations freely and responsibly.\n\n- Why are other options wrong?\nAsking the team to write expectations may make them feel forced and unspontaneous\n Asking direct questions may create tension and limit openness\n Focusing on rewards does not motivate expressing expectations deeply and honestly",
      "choices": [
        {
          "text": "Ask the team members to write their expectations on post notes",
          "correct": false
        },
        {
          "text": "Ask direct questions to each team member and wait for their responses",
          "correct": false
        },
        {
          "text": "Inform the team members about the incentives of the project success",
          "correct": false
        },
        {
          "text": "Start by doing a team self-assessment to increase team autonomy",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A virtual project team is composed of members from various countries with cultural differences. The project manager is concerned that cultural differences may lead to miscommunication and conflict.nnWhat should the project manager do to effectively mitigate against potential conflicts?",
      "explanation": "The correct answer: Collaboratively define the business rules of the project and communicate them clearly.\n\n- Why is this the correct answer?\nCollaboratively defining rules creates a shared commitment and reduces misunderstandings caused by cultural differences.\n\n- Why are other options wrong?\nForcing the team to use only written communications may limit the effectiveness of communication\n Appointing a higher-ranking referee may raise problems of authority and reduce cooperation\n Making single decisions to resolve disputes without the team's participation may increase tension and dissatisfaction",
      "choices": [
        {
          "text": "Collaboratively define and communicate the project-specific ground rules.",
          "correct": true
        },
        {
          "text": "Require that all communications within the project team are in written form.",
          "correct": false
        },
        {
          "text": "Appoint the senior member of one country's team to act as arbitrator if a conflict arises.",
          "correct": false
        },
        {
          "text": "Make all conflict resolution decisions and then inform the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "There is a conflict between two team members regarding a project task. Which conflict resolution method should project manager use to make it win-win situation?",
      "explanation": "Correct answer Collaboration/Problem Solving\n\n- Why is this the correct answer?\nCooperation means that the two parties work together to find a solution that meets the interests of all, leading to a healthy working relationship and continuity in the team\n\n- Why are other options wrong?\nCoercion temporarily resolves the conflict but may create resentment and future disagreements\nCalm postpones the problem without actually solving it\nCompromise means making concessions, but it may not fully satisfy both parties",
      "choices": [
        {
          "text": "Collaborate/problem solve",
          "correct": true
        },
        {
          "text": "Force/direct",
          "correct": false
        },
        {
          "text": "Smooth/accommodate",
          "correct": false
        },
        {
          "text": "Compromise/reconcile",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is not able to complete the list of project objectives due to conflicting directives from two department directors. Which approach would allow the directors to adjust their directives with a win/win outcome?",
      "explanation": "Correct answer Collaboration/Problem Solving\n\n- Why is this the correct answer?\nCollaboration enables managers to dialogue and share different perspectives to find a common solution that satisfies everyone and supports project goals\n\n- Why are other options wrong?\nWithdrawal avoids the problem and does not solve it\nCalm postpones the conflict and does not solve it\nForcing may lead to tensions and increase the conflict",
      "choices": [
        {
          "text": "Collaborate/problem solve",
          "correct": true
        },
        {
          "text": "Withdraw/avoid",
          "correct": false
        },
        {
          "text": "Smooth/accommodate",
          "correct": false
        },
        {
          "text": "Force/direct",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has asked every team member involved in a conflict to make a sacrifice to resolve the situation. This approach corresponds to which conflict resolution technique?",
      "explanation": "Correct answer Settlement/reconciliation\n\n- Why is this the correct answer?\nCompromise means that each side makes mutual concessions with the aim of reaching a compromise that partially satisfies everyone\n\n- Why are other options wrong?\nCooperation requires participation and a common solution, not just concessions\nCalm postpones the conflict and does not address it\nWithdrawal avoids conflict without resolving it",
      "choices": [
        {
          "text": "Compromise/reconcile",
          "correct": true
        },
        {
          "text": "Collaborate/problem solve",
          "correct": false
        },
        {
          "text": "Smooth/accommodate",
          "correct": false
        },
        {
          "text": "Withdraw/avoid",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project leader noticed that a new team member is demotivated and always arrives late to work, causing a delay in the deliverables. What should the project manager do?",
      "explanation": "The correct answer is to talk to the member individually while emphasizing the importance of teamwork and the value of each member's contribution\n\n- why is this the correct answer?\nDirect communication helps to understand the reasons for poor enthusiasm or delay and encourages the member to improve his performance with the support of the manager\n\n- Why are other options wrong?\nReferring the matter to HR may cause the member to feel uncomfortable\nAsking an older member may not solve the problem appropriately\nGroup talk about attendance may not address the problem of the new member in particular",
      "choices": [
        {
          "text": "Ask HR to deal with the team member's attendance, advise them to arrive on time, and remind them of the incentives at the end of the project.",
          "correct": false
        },
        {
          "text": "Ask a senior team member to speak with the team member, share personal experiences, and find out the reasons for the performance issues.",
          "correct": false
        },
        {
          "text": "During the daily meeting, ask all team members to arrive on time, and plan an event after working hours to celebrate the project progress.",
          "correct": false
        },
        {
          "text": "Talk with the team member on a one-to-one basis, emphasizing the importance of teamwork and the value of each member's contributions.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which statement correctly differentiates management from leadership?",
      "explanation": "The correct answer Managers ask how and when leaders ask what and why\n\n- why is this the correct answer?\nManager focuses on planning and execution with specific questions while the leader focuses on vision and guidance through thought-opening questions\n\n- Why are other options wrong?\nThe opposite is not true Leaders focus on long-term vision and managers on implementation\nManagers do not challenge the status quo and leaders seek change\nLeaders inspire trust and managers use control, not just control",
      "choices": [
        {
          "text": "Managers ask how and when; leaders ask what and why.",
          "correct": true
        },
        {
          "text": "Managers focus on long-term goals; leaders focus on short-term goals.",
          "correct": false
        },
        {
          "text": "Managers challenge the status quo; leaders accept the status quo.",
          "correct": false
        },
        {
          "text": "Managers inspire trust; leaders rely on control.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a project, there is a stakeholder who does not see any benefit for the project. Sometimes the stakeholder uses politics to place obstacles to prevent a successful project completion.nnWhat is the personality of this kind of stakeholder?",
      "explanation": "The correct answer is opposed (Antagonist)\n\n- Why is this the correct answer?\nOpponent is a passive stakeholder trying to hinder the project using policies and obstructions\n\n- Why are other options wrong?\nQuiet does not interfere but does not interact\nNeutral does not have a clear position\nThe supporter works to support the project",
      "choices": [
        {
          "text": "Stoic",
          "correct": false
        },
        {
          "text": "Neutral",
          "correct": false
        },
        {
          "text": "Champion",
          "correct": false
        },
        {
          "text": "Antagonist",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager for a small company is assigned to a project with a scope that is complex and new. The program manager recommends creating a team with individuals that can offer complementary expertise.nnWhat are the characteristics of the network that should be built?",
      "explanation": "Correct answer: self-organized, team members with internal and external stakeholders, all participants are committed to the business agreement and the set of rules.\n\n- Why is this the correct answer?\nThe self-organized network allows for greater flexibility and better integration between team members and stakeholders from inside and outside the organization, with clarity in rules and business commitments.\n\n- Why are other options wrong?\nCentralized coordination may reduce flexibility and hinder innovation\nExcluding external stakeholders reduces effectiveness and communication",
      "choices": [
        {
          "text": "Central coordination, team members with internal and external stakeholders, all participants abiding to the work agreement and set of rules",
          "correct": false
        },
        {
          "text": "Self-organized, team members with internal and external stakeholders, all participants abiding to the work agreement and set of rules",
          "correct": true
        },
        {
          "text": "Self-organized, team members with internal stakeholders, all participants abiding to the work agreement and set of rules",
          "correct": false
        },
        {
          "text": "Central coordination, team members with internal stakeholders, all participants abiding to the work agreement and set of rules",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager in an organization selects an agile delivery for a cutting-edge technology project. The project manager develops a professional network and wants the product owner to join this network.nnWhich two benefits will the project manager use to encourage the product owner to join and participate in the network? (Choose two).",
      "explanation": "The right answers: access to knowledge and the global workforce, and an opportunity to interact with resources.\n\n- Why are these the right answers?\nThe professional network gives the product owner the possibility to benefit from a variety of experiences and knowledge and allows him to interact directly with different resources to support the project.\n\n- Why are other options wrong?\nLower risks and costs are not a direct benefit to the professional network\nThe formal professional network is not a motivational advantage just as powerful as access to knowledge and resources",
      "choices": [
        {
          "text": "Access to global knowledge and workforce",
          "correct": true
        },
        {
          "text": "Lower risk and cost",
          "correct": false
        },
        {
          "text": "Opportunity to engage with resources",
          "correct": true
        },
        {
          "text": "Formal professional network",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is working in an agile environment on a project that will span a few years. The end user asks for a pilot in the first quarter of the project.nnWhat are the optimal times to conduct a formal readiness review? (Choose two).",
      "explanation": "Correct answers: At the beginning of the pilot project, at the end of the pilot project.\n\n- Why are these the correct answers?\nThe readiness review at the beginning of the pilot project ensures proper preparation and implementation, and the review at the end evaluates the results and determines the next steps.\n\n- Why are other options wrong?\nPeriodic reviews such as every month or quarter may not be associated with clear delivery points\nKey delivery points may not adequately cover the details of the pilot project",
      "choices": [
        {
          "text": "Every quarter",
          "correct": false
        },
        {
          "text": "Every month",
          "correct": false
        },
        {
          "text": "At major handoff points",
          "correct": false
        },
        {
          "text": "At the beginning of the pilot",
          "correct": true
        },
        {
          "text": "At the end of the pilot",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project that includes many stakeholders with conflicting priorities. What should the project manager do to reduce conflict?",
      "explanation": "Correct answer: Document and deliver all outputs after everyone approves them.\n\n- Why is this the correct answer?\nDocumenting outputs and agreeing by all parties ensures clarity of expectations and minimizes misunderstandings and conflicts.\n\n- Why are other options wrong?\nTake the lead in every aspect that may provoke resistance and reduce cooperation\nNegotiation with the help of the PMO may not always be effective in reducing conflicts\nThe use of agile to facilitate deliveries does not necessarily guarantee that conflicts between stakeholders will be minimized",
      "choices": [
        {
          "text": "Document and sign off on all deliverables in the project.",
          "correct": true
        },
        {
          "text": "Take the lead in all aspects of the negotiations.",
          "correct": false
        },
        {
          "text": "Negotiate all aspects with help from the project management office (PMO).",
          "correct": false
        },
        {
          "text": "Negotiate all aspects using agile for easy deliveries.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with many stakeholders and conflicting priorities. Senior management asked the project manager to avoid \"noise\" specifically for political projects.nnAlthough it is difficult to find resources for the project, what should the project manager do to ensure smooth progress of the project?",
      "explanation": "Correct answer: Allocate scarce resources efficiently to meet project needs.\n\n- Why is this the correct answer?\nEfficient distribution of resources helps reduce conflicts and focuses on achieving project objectives despite constraints.\n\n- Why are other options wrong?\nBarter principle may cause complications and lead to unexpected situations\nConsistency between words and deeds is not enough without effective resource management\nThe use of courtesies may not always be a sustainable strategy",
      "choices": [
        {
          "text": "Apply \"If you do something nice for me I'll do something nice for you.\"",
          "correct": false
        },
        {
          "text": "Be consistent with words and actions to avoid conflicts with the stakeholders.",
          "correct": false
        },
        {
          "text": "Utilize compliments to obtain resources, and cooperate toward mutual goals.",
          "correct": false
        },
        {
          "text": "Allocate the scarce resources efficiently to meet the needs of the project.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What should a project manager do first when people are not following the project compliance process?",
      "explanation": "Correct answer: Understand the reasons for non-compliance.\n\n- Why is this the correct answer?\nKnowing the causes helps in addressing the problem effectively and identifying appropriate solutions.\n\n- Why are other options wrong?\nEarly escalation may increase tension without understanding the problem\nStart an audit may be a later step after understanding\nRegistering the case only without analysis does not solve the problem",
      "choices": [
        {
          "text": "Escalate the issue to senior management or the sponsor",
          "correct": false
        },
        {
          "text": "Initiate an audit process",
          "correct": false
        },
        {
          "text": "Log the non-compliance and watch the progress",
          "correct": false
        },
        {
          "text": "Understand the reasons for non-compliance",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project team is working on determining dependencies for approximately 350 activities for an ongoing project. Which actions should the project team take to manage dependencies successfully? (Choose 2).",
      "explanation": "Correct answers: evaluate and document dependencies, and ensure dependencies are monitored.\n\n- Why are these the correct answers?\nEvaluation and documentation of dependencies shows the relationships between activities, and continuous monitoring ensures that any changes or problems are dealt with quickly.\n\n- Why are other options wrong?\nReporting only the sponsor or customer is not enough to manage dependencies effectively\nUsing only one dependency type (end-to-start) may limit flexibility",
      "choices": [
        {
          "text": "Communicate the dependencies to the sponsor.",
          "correct": false
        },
        {
          "text": "Assess and document the dependencies.",
          "correct": true
        },
        {
          "text": "Communicate the dependencies to the customer.",
          "correct": false
        },
        {
          "text": "Ensure that the dependencies are monitored.",
          "correct": true
        },
        {
          "text": "Ensure you use only finish-to-start dependencies.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer requested a change in functionality for a product that will be delivered in the next sprint. The responsible specialist for this change is also assigned to a deliverable for another project. The project manager needs to negotiate the availability of the specialist.nnWho is responsible for confirming the specialist's availability?",
      "explanation": "Correct answer: Job manager.\n\n- Why is this the correct answer?\nThe functional manager is responsible for allocating team resources and confirming the availability of the specialist between different projects.\n\n- Why are other options wrong?\nProject sponsor does not manage resources directly\nProduct owner determines product requirements, not resource availability\nHR department is responsible for recruitment, not daily assignment of tasks",
      "choices": [
        {
          "text": "Project sponsor",
          "correct": false
        },
        {
          "text": "Functional manager",
          "correct": true
        },
        {
          "text": "Product owner",
          "correct": false
        },
        {
          "text": "Human resources",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager received an email from the factory regarding key equipment that will not be delivered as planned. The project manager must make alternative arrangements with other vendors to implement a temporary fix.nnWho is responsible for confirming the resource availability for the fix?",
      "explanation": "Correct answer: Product owner.\n\n- Why is this the correct answer?\nThe product owner is responsible for identifying the required resources and ensuring that they are available to meet the needs of the product and alternative solutions.\n\n- Why are other options wrong?\nService provider is the actual supplier and not the confirmation administrator\nThe functional manager may not have direct authority over the resources of the product\nThe human resources department is not responsible for the availability of equipment",
      "choices": [
        {
          "text": "Service provider",
          "correct": false
        },
        {
          "text": "Functional manager",
          "correct": false
        },
        {
          "text": "Product owner",
          "correct": true
        },
        {
          "text": "Human resources",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team in the middle of an incremental delivery project decided they need the help of a subject matter expert (SME) who is working in a different department. The project team asked the SME to join their team and assist in a specific task and they informed the project leader about this action.nnWhat should the project manager do?",
      "explanation": "Correct answer: Facilitate the coordination of resources with the resources required based on the team work agreement.\n\n- Why is this the correct answer?\nThe project manager must coordinate resources in an organized manner in accordance with business policies and agreements, to ensure that the expert's onboarding does not negatively affect the rest of the projects or teams.\n\n- Why are other options wrong?\nBudget verification and impact evaluation is important but not always the first step\nGetting sponsor approval is important but it comes after initial resource coordination\nTalking to the job manager is important but should be within the coordination framework and not a separate step",
      "choices": [
        {
          "text": "Check the project budget and assess the impact and feasibility of adding an additional resource",
          "correct": false
        },
        {
          "text": "Talk with the project sponsor and get approval, explaining that this resource is important and crucial",
          "correct": false
        },
        {
          "text": "Talk to the functional manager of this needed resource and check their availability and bandwidth",
          "correct": false
        },
        {
          "text": "Facilitate the coordination of resources with the needed resources based on the teams working agreement",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has been on a complex project that began eight months ago. The project manager has a quality team that has been working hard, is motivated, and successful.nnWhat type of management and leadership should the project manager use at this stage?",
      "explanation": "Correct answer: Enable the team to improve results.\n\n- Why is this the correct answer?\nA mature and motivated team needs to be empowered to leverage their experience and skills to enhance performance rather than intensive management.\n\n- Why are other options wrong?\nSupport through iterations and feedback is useful but less effective with a mature team\nConflict resolution assistance may not be required if there are no problems\nProviding feedback or training only on demand may reduce opportunities for continuous development",
      "choices": [
        {
          "text": "Empower them to improve results",
          "correct": true
        },
        {
          "text": "Support with periodic iterations and feedback",
          "correct": false
        },
        {
          "text": "Help with conflict resolution",
          "correct": false
        },
        {
          "text": "Feedback, coaching, or help only when they ask for it",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new member joined a project during the execution phase. The work requires strong collaboration with other team members.nnWhat should the project manager do to foster a collaborative environment?",
      "explanation": "Correct answer: Organize a one-day workshop with the whole team to introduce the new member to the project.\n\n- Why is this the correct answer?\nThe workshop helps to quickly integrate the new member into the team and provide a comprehensive understanding of the project, which enhances collaboration.\n\n- Why are other options wrong?\nSend email is not effective to promote collaboration\nShare only information without interaction that may not be enough\nRequest a description of interests in a meeting that may not be effective to quickly integrate the new member",
      "choices": [
        {
          "text": "Send an email to the project team asking them to collaborate with the new team member.",
          "correct": false
        },
        {
          "text": "Share all information available and allocate time to explain in detail the work in progress.",
          "correct": false
        },
        {
          "text": "Ask each member to describe their interests and experience in the next team meeting.",
          "correct": false
        },
        {
          "text": "Organize a one-day workshop with the entire team to bring the new member up to speed.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is actively engaged in the preparation of the last delivery before the final product is live in production. What should the project manager do to make sure that the whole team is in full sync?",
      "explanation": "The correct answer: Ensure that the team attends daily meetings and actively participates.\n\n- Why is this the correct answer?\nDaily meetings ensure continuous communication and instant coordination between team members, which helps to resolve problems quickly and ensure that everyone is simultaneously.\n\n- Why are other options wrong?\nInformation availability is important, but it does not guarantee everyone's commitment or interaction\nWhiteboard display is useful but not sufficient for full coordination\nAvailability of a place for conversations is important, but structured meetings are more effective",
      "choices": [
        {
          "text": "Ensure the team is attending the daily meetings and participating actively",
          "correct": true
        },
        {
          "text": "Ensure that the needed information is available and accessible to each and every member",
          "correct": false
        },
        {
          "text": "Ensure to visualize the work to be done on a white board visual and accessible to all",
          "correct": false
        },
        {
          "text": "Ensure there is a room for the team to have regular conversation whenever needed",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Quality management is a vital aspect of any project. Which of the following quality control aspects is a component of a high functioning measurement system?",
      "explanation": "Correct answer: Accuracy.\n\n- Why is this the correct answer?\nAccuracy means that the measurement system provides correct and reliable results, and is essential for any effective measurement system.\n\n- Why are other options wrong?\nInaccuracy means wrong results\nNo repetition indicates poor consistency\nTime duration is not a component of measurement quality but a time factor",
      "choices": [
        {
          "text": "Accuracy",
          "correct": true
        },
        {
          "text": "Non-precision",
          "correct": false
        },
        {
          "text": "Non-repeatability",
          "correct": false
        },
        {
          "text": "Duration",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The first version delivered to the quality control team has poor performance, and the testers are complaining that they cannot complete all the test cases as planned. Which is a tool to help to monitor performance?",
      "explanation": "Correct answer: Run Chart).\n\n- Why is this the correct answer?\nRun schema is used to monitor performance over time and helps identify trends and problems during testing.\n\n- Why are other options wrong?\nData flow diagram describes information flow but not performance\nFlow diagram shows operations but does not monitor performance over time\nUnattended inefficient diagram to monitor performance",
      "choices": [
        {
          "text": "Run Chart",
          "correct": true
        },
        {
          "text": "Data Flow Diagram",
          "correct": false
        },
        {
          "text": "Flow Chart",
          "correct": false
        },
        {
          "text": "Non-Control Chart",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the development of a project, the project manager noticed that results are not as good as expected. Which tool or document shows which elements are impacting the key metrics?",
      "explanation": "Correct answer: Pareto Chart).\n\n- Why is this the correct answer?\nPareto Chart helps identify the most important factors that affect the quality of results by focusing on the main elements that cause the most problems.\n\n- Why are other options wrong?\nOperating plan is used to monitor performance over time and not to identify influencing factors\nProject charter sets objectives and does not focus on quality analysis\nThe risk register deals with risks and not the analysis of factors affecting quality",
      "choices": [
        {
          "text": "Pareto chart",
          "correct": true
        },
        {
          "text": "Run chart",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": false
        },
        {
          "text": "Risk register",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager must make decisions daily, regardless of the decision's level of importance or criticality. What should a project manager do to ensure their decisions are unbiased and rational?",
      "explanation": "Correct answer: understand that not everything can be achieved.\n\n- Why is this the correct answer?\nAcknowledging constraints helps the manager make realistic and balanced decisions without bias or expecting unfeasible results.\n\n- Why are other options wrong?\nUnverified data use may lead to wrong decisions\nMaking decisions quickly may be reckless and uncalculated\nWaiting for confirmed results may hinder progress and cause delays in decisions",
      "choices": [
        {
          "text": "Utilize data without checking for accuracy",
          "correct": false
        },
        {
          "text": "Understand they cannot achieve everything",
          "correct": true
        },
        {
          "text": "Make decisions quickly",
          "correct": false
        },
        {
          "text": "Make decisions only when the results are certain",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is assigned to a project and the first task is to assist in creating the Work Breakdown Structure (WBS). Which tool, technique or document is used as starting point for an effective WBS creation?",
      "explanation": "Correct answer: Project Charter.\n\n- Why is this the correct answer?\nProject charter contains the scope of the project and the basic objectives, and is the basis on which the workload structure is built.\n\n- Why are other options wrong?\nBaseline of scope is used after WBS is specified and not as a start\nThe list of activities comes after WBS\nWBS dictionary is detailed documentation after building the underlying structure",
      "choices": [
        {
          "text": "Scope baseline",
          "correct": false
        },
        {
          "text": "Activity list",
          "correct": false
        },
        {
          "text": "Project charter",
          "correct": true
        },
        {
          "text": "WBS dictionary",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a five-year program, many project team members have joined and left the subprojects. Because of this, conflict among team members often occurs.nnWhich technique should the project manager use to resolve the conflicts long term?",
      "explanation": "Correct answer: problem-solving).\n\n- Why is this the correct answer?\nProblem solving is a technique focused on addressing the roots of conflict and achieving a win-win outcome for all parties.\n\n- Why are other options wrong?\nCoercion results in a short-term solution with the possibility of a return to conflict\nCalm ignores the problem and does not address the root cause\nCompromise may leave some parties dissatisfied",
      "choices": [
        {
          "text": "Forcing",
          "correct": false
        },
        {
          "text": "Smoothing",
          "correct": false
        },
        {
          "text": "Compromise",
          "correct": false
        },
        {
          "text": "Problem-solving",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The team informed the project leader that they are not sure of the stakeholder needs, despite the multiple collection requirements efforts and engagement in status meetings.nnHow should the project manager approach this issue?",
      "explanation": "The correct answer: Document what the team believes to be the needs of stakeholders, present it to them, and ask for their comments to share with the team.\n\n- Why is this the correct answer?\nThis policy allows stakeholders to directly correct or confirm requirements.\n\n- Why are other options wrong?\nForcing the team to work with stakeholders without clarity may increase ambiguity\nCanceling the project is an extreme step\nWriting user stories without confirming needs may result in inappropriate results",
      "choices": [
        {
          "text": "Require the team to work with the stakeholders to analyze their detailed requirements and sign off on the specification",
          "correct": false
        },
        {
          "text": "Discuss with the team the option of canceling the project since the risk is too great to continue",
          "correct": false
        },
        {
          "text": "Ask the team to write a collection of user stories to capture the needs, prioritize and manage the stories",
          "correct": false
        },
        {
          "text": "Document what the team believes the stakeholders need, show it to stakeholders, and ask for their feedback to share with the team",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a retrospective meeting, team members show disengagement, stating that they are repeating the same ideas over and over.nnHow can the project manager best handle this situation?",
      "explanation": "Correct answer: Encourage the team to provide ideas for improving processes and supporting changes based on feedback received.\n\n- Why is this the correct answer?\nThis approach encourages active participation and gives the team a sense of responsibility towards improving the work.\n\n- Why are other options wrong?\nForce the team to repeat the same points or useless notes reduces the value of meetings and does not address the real problem.",
      "choices": [
        {
          "text": "Ask the team members to pay more attention to the session even if they think they know what is coming.",
          "correct": false
        },
        {
          "text": "Ask the team members to give their feedback, even if it is the same as other team members, to stress their points.",
          "correct": false
        },
        {
          "text": "Encourage the team members to provide better feedback as they know the questions already.",
          "correct": false
        },
        {
          "text": "Encourage the team to provide ideas for process improvement and support changes based on the feedback received.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is helping their organization transition from utilizing predictive methods to agile methods. One team member asks when high-level requirements definition and solution design activities should be done in an agile methodology.n How should the project manager respond?",
      "explanation": "Correct answer: In agile, the team must plan to perform some of these activities as part of the zero sprint before starting development.\n\n- Why is this the correct answer?\nPrint zero is used for preparation and includes infrastructure setup, prerequisite identification, and solution design.\n\n- Why are other options wrong?\nDoing these activities within the first sprint affects the speed of start-up.\nAvoiding these activities altogether is not suitable for complex projects.\nPostponing these activities as much as possible may lead to problems in planning and implementation.",
      "choices": [
        {
          "text": "In agile, these activities must start as soon as the project team is assembled, preferably in sprint one.",
          "correct": false
        },
        {
          "text": "In agile, the team should plan to perform some of these activities as part of sprint zero before starting development.",
          "correct": true
        },
        {
          "text": "In agile, the team should avoid waste, so these activities must be done as part of development.",
          "correct": false
        },
        {
          "text": "In agile, the team follows the last responsible moment strategy and should defer those activities as much as possible.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading an agile project that is in the execution phase. After a couple of sprints, the project manager realizes that the team's estimates are not realistic.nnWhat action should the project manager take to remove this impediment?",
      "explanation": "Correct answer: Organize product menu optimization sessions to better understand the scope and review estimates.\n\n- Why is this the correct answer?\nProduct Menu Optimization (Backlog Refinement) allows estimates to be updated based on new information and scope changes.\n\n- Why are other options wrong?\nDiscussing the issue in retrieval or daily meetings may not be enough without reviewing the scope.\nAdding a reserve margin without reviewing the actual cause may lead to inefficient management.",
      "choices": [
        {
          "text": "Ask the team to address this issue at the next the retrospective to avoid impacting the sprint in progress.",
          "correct": false
        },
        {
          "text": "Obtain approval from project sponsor to add a contingency buffer to the sprint, and change the end date.",
          "correct": false
        },
        {
          "text": "Ask the team to address this issue at the next standup, and meet the commitment for the sprint in progress.",
          "correct": false
        },
        {
          "text": "Organize product backlog refinement sessions to better understand the scope and review estimations.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a daily meeting, the project team raised an impediment that one of the business subject matter experts is frequently changing the definition of done, and expressed their fear that this is a sign of distrust. What should the project manager do?",
      "explanation": "Correct answer: Remind the team that constant feedback is essential to success.\n\n- Why is this the correct answer?\nAgile depends on adapting to changes, and constant feedback is an essential part of ensuring value creation.\n\n- Why are other options wrong?\nFocusing only on current work without dealing with feedback impairs quality.\nTransferring responsibility to the product owner or imposing a fixed definition reduces business flexibility and violates agile principles.",
      "choices": [
        {
          "text": "Remind the team to focus on their work, and commit to speak with the SME",
          "correct": false
        },
        {
          "text": "Remind the product owner to support the team and speak with the SME",
          "correct": false
        },
        {
          "text": "Remind the SME to keep the definition of done that was initially agreed",
          "correct": false
        },
        {
          "text": "Remind the team that continuous feedback is important for success",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project whose sponsor has asked why some of the components of the project were developed in-house. Where can this information be found?",
      "explanation": "Correct answer: In the procurement management plan, under Build-vers-Buy Decisions.\n\n- Why is this the correct answer?\nProcurement management plan contains details about build-versus purchase decisions that explain what is being implemented internally and what is being purchased from abroad.\n\n- Why are other options wrong?\nProject charter includes project objectives and not procurement details.\nThe technical structure and solution document focus on the technical aspect and not on procurement decisions.",
      "choices": [
        {
          "text": "In the Procurement Management Plan, under build vs. buy decisions",
          "correct": true
        },
        {
          "text": "In the Project Charter, under the assumptions and constraints section",
          "correct": false
        },
        {
          "text": "In the Technical Architecture Document, under solution boundaries",
          "correct": false
        },
        {
          "text": "In the Solution Architecture Document, under project purpose and justification",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is in the testing phase, and the quality control team informs the project manager that the quality of the deliverables from one vendor is poor. Their investigation found that the staff assigned does not have the required certifications.nnHow did this issue arise?",
 "explanation": "Correct answer: The PMP did not include the required certificates.\n\n- Why is this the correct answer?\nEnsuring supplier qualifications is an essential part of the procurement management plan.\n\n- Why are other options wrong?\nNot requesting references or identifying participating individuals is not the main reason in this case.\nHigh quality standards are not the problem if certificates are required at all.",
      "choices": [
        {
          "text": "The vendors' proposal did not include the list of people assigned to the project.",
          "correct": false
        },
        {
          "text": "The project sponsor did not mandate three references from previous customers.",
          "correct": false
        },
        {
          "text": "The Procurement Management Plan did not include the certifications required",
          "correct": true
        },
        {
          "text": "The quality control team had too high of standards and tested too thoroughly",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project with a very aggressive delivery schedule and a firm completion date. The project requires expensive and fragile components that are prone to rework and rejections. The project manager is developing the vendor selection criteria.nnWhat should be the strategy for vendor selection?",
      "explanation": "Correct answer: Acceptable price if the resource is closer to the project site.\n\n- Why is this the correct answer?\nGeographic proximity reduces transportation risks and increases the speed of supply, which is important with a strict schedule and sensitive components.\n\n- Why are other options wrong?\nVendor selection based solely on price may lead to quality problems.\nSponsor or team recommendations are not sufficient without clear criteria regarding location and schedule.",
      "choices": [
        {
          "text": "Lowest price regardless of the vendor's warehouse location.",
          "correct": false
        },
        {
          "text": "Acceptable price if the vendor is closer to the project site.",
          "correct": true
        },
        {
          "text": "Project sponsor's recommendation based on past experience.",
          "correct": false
        },
        {
          "text": "Team members' recommendations based on past experience.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager oversees a complex project in which a vendor is responsible for delivering several essential components. The project manager and the vendor team are located in different time zones, and this time zone difference has become a significant challenge, leading to productivity issues within the project. Team members from both sides often struggle to coordinate meetings, share updates, and communicate effectively due to the time zone disparities.nnWhat should the project manager do to solve this issue?",
      "explanation": "Correct answer: Both teams were asked to change their working hours to a common time zone.\n\n- Why is this the correct answer?\nCoordinate working hours between teams in different time zones Enhances the ease of daily meetings and information exchange to resolve productivity issues. This is a practical solution that preserves existing contracts and reduces costs.\n\n- Why are other options wrong?\nMonitoring the table alone will not address the root cause of poor communication.\nMoving the vendor team is expensive and impractical, especially in long projects.\nTerminating the contract and looking for a new supplier may lead to project delays and high costs.",
      "choices": [
        {
          "text": "Closely monitor the project schedule and take action if milestones are missed.",
          "correct": false
        },
        {
          "text": "Ask both teams to change their working hours to a common time zone.",
          "correct": true
        },
        {
          "text": "Find a common space and relocate the vendor team with the project team.",
          "correct": false
        },
        {
          "text": "Terminate the engagement and find a new vendor in the local time zone.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager just completed a project in an organization that values lessons learned. Leadership encourages all the project stakeholders to use the process, tools, and results from the lessons learned repository in future projects. Preparing to update the lessons learned repository, the project manager has gathered relevant project data and feedback.nnWhat should the project manager do next?",
      "explanation": "The correct answer: Analyze and organize the results with stakeholders to draw ideas.\n\n- Why is this the correct answer?\nAnalysis and organization of lessons learned is an important step to ensure that raw data is transformed into viable ideas that help future projects.\n\n- Why are other options wrong?\nStoring comments without analysis makes them useless.\nDocumenting results before analysis may result in the transfer of inaccurate information.\nRetrieving previous comments is unrelated to updating the current repository.",
      "choices": [
        {
          "text": "Store all the comments and recommendations received for future reference.",
          "correct": false
        },
        {
          "text": "Analyze and organize the findings with the stakeholders to extract insights.",
          "correct": true
        },
        {
          "text": "Document and share the findings with the stakeholders for review and feedback.",
          "correct": false
        },
        {
          "text": "Retrieve all of the comments and recommendations received in the past.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What is the main goal of a Visionary leadership style?",
      "explanation": "The correct answer: Provide long-term guidance and motivate the team to achieve it.\n\n- Why is this the correct answer?\nVisionary leadership focuses on drawing an inspiring and clear future image for the team, which enhances motivation and commitment.\n\n- Why are other choices wrong?\nSupporting the team to define a shared vision is part of transformational leadership, not visionary.\nLeadership adopting technologies is related to other leadership styles such as technical leadership.\nPrioritization is a tactical task within leadership styles but is not the primary goal of vision.",
      "choices": [
        {
          "text": "To support the team to self organise and decide a common vision.",
          "correct": false
        },
        {
          "text": "To champion the adoption of the latest technologies and practices.",
          "correct": false
        },
        {
          "text": "To provide long-term direction and engage the team to deliver it.",
          "correct": true
        },
        {
          "text": "To prioritise and assign the tasks that are aligned with the vision.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which leadership style would help people to connect, even when working remotely and never having met each other?",
      "explanation": "Correct answer: emotional (asymptotic).\n\n- Why is this the correct answer?\nEmotional (convergent) leadership focuses on building personal relationships and a supportive work environment, which helps create connections between people even in remote work environments.\n\n- Why are other options wrong?\nThe participatory style focuses on engaging the team in decision-making, but is not directed to building relationships.\nThe rhythm style is concerned with achieving results quickly according to high standards.\nThe training style focuses on developing people, but not on building immediate connections.",
      "choices": [
        {
          "text": "The participative style",
          "correct": false
        },
        {
          "text": "The Affiliative style",
          "correct": true
        },
        {
          "text": "The Pace Setting style",
          "correct": false
        },
        {
          "text": "The Coaching style",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In your project you need some assistance facilitating meetings, following up on action items, introducing new team members, and mediating conflicts.nnWho would be the most suitable team member type to assist you with those activities?",
      "explanation": "Correct answer: Relationship-oriented team member.\n\n- Why is this the correct answer?\nA relationship-oriented member has communication skills, the ability to build trust, and facilitate collaboration among team members, making them best suited for these activities.\n\n- Why are other options wrong?\nAuthority-oriented member may impose their opinion and are not interested in communication.\nAchievement-oriented member focused on completing tasks regardless of relationships.\nDelivery-oriented member is more concerned with the end results than interacting with the team.",
      "choices": [
        {
          "text": "Power Oriented team member.",
          "correct": false
        },
        {
          "text": "Affiliate Oriented team member.",
          "correct": true
        },
        {
          "text": "Achievement Oriented Team member.",
          "correct": false
        },
        {
          "text": "Delivery Oriented Team member.",
          "correct": false
        }
      ]
    }
  ]
}
