{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "During the execution phase of your project, a Resource Manager informed you that one of the experts allocated to your project had to be motivated in order to perform very well.\n\nWhat would be the recommended actions to address this issue?",
      "explanation": "Correct answer: Remind the team member of the importance of their role and how they will be rewarded.\n\n- Why is this the correct answer?\nIndividuals are motivated by linking their efforts to the objectives of the project and demonstrating the impact of their contributions with an explanation of moral or material rewards, and this enhances the internal motivation.\n\n- Why are other options wrong?\nRemind the job manager may not be effective because the responsibility here is on the project manager.\nMentioning sanctions fosters a negative climate rather than motivation.\nFocusing only on financial incentives may not cover aspects of personal motivation related to self-worth.",
      "choices": [
        {
          "text": "Remind the functional manager that is his duty to motivate his team",
          "correct": false
        },
        {
          "text": "Remind the team member that there are penalties for bad behaviours.",
          "correct": false
        },
        {
          "text": "Remind the team member that there are financial incentives for the team.",
          "correct": false
        },
        {
          "text": "Remind the team member their important role and how it will be rewarded.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project execution, a team member made a mistake resulting in a 1-week delay to the project schedule. What should the project manager do with regard to this error and delay?",
      "explanation": "The correct answer: discuss the problem with the team, search for solutions, and provide support and assistance to the team.\n\n- Why is this the correct answer?\nProblem solving in project management relies on transparency, teamwork, and root cause analysis without direct blame, focusing on solutions.\n\n- Why are other options wrong?\nHolding one individual responsible for the mistake weakens the collective spirit.\nEscalation to senior management directly may lead to a loss of confidence in the team.\nImposing a solution without involving the team weakens their commitment and reduces the chances of improving performance.",
      "choices": [
        {
          "text": "Discuss the issue with the team, look for solutions, and offer to help and support the team.",
          "correct": true
        },
        {
          "text": "Make sure the impact of this mistake is understood by the team member who made the mistake.",
          "correct": false
        },
        {
          "text": "Escalate the issue to senior management to make sure a similar mistake won't happen again.",
          "correct": false
        },
        {
          "text": "Find a solution, communicate it to the team, and reinforce that it should be implemented now.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is involved in an e-commerce development project. The project has been completed successfully using the hybrid model and initiated operations handover. The project manager notices that the development team is relaxed and not spending time on the handover process, which is impacting application support.\n\nHow should the project manager handle this situation?",
      "explanation": "Correct answer: Meeting with the development team to discuss the importance of the delivery process and its impact on application support.\n\n- Why is this the correct answer?\n\n a project environment, it is important to promote collective awareness of the different stages of the project. Explaining the importance of the delivery phase refocuses the team and motivates them to complete the work with quality.\n\n- Why are other options wrong?\nDirect confrontation may cause tension without effective results.\nDelegate responsibility may lead to distraction and ignoring part of the team.\nIgnoring the problem exposes the project to quality and technical support risks.",
      "choices": [
        {
          "text": "Confront the development team and demand their immediate attention to the handover process.",
          "correct": false
        },
        {
          "text": "Meet with the development team to discuss the importance of the handover process and its impact on application support.",
          "correct": true
        },
        {
          "text": "Delegate the responsibility of the handover process to another team member to ensure it gets done properly.",
          "correct": false
        },
        {
          "text": "Disregard the issue and expect that the development team will address and resolve the issue on their own.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. In order to make sure there is enough funding available for the project, the project sponsor is asking the project manager for an estimate when the project will be completed.\n\nHow should the project manager respond to the sponsor?",
      "explanation": "Correct answer: Give the estimate to the sponsor, because the flexible approach supports grading.\n\n- Why is this the correct answer?\nEven in flexible projects, stakeholders need preliminary estimates to manage finance and planning, with the understanding that these estimates may change later.\n\n- Why are other options wrong?\nReject the estimate on the grounds that flexibility does not require it is contrary to the principles of flexible project management, as continuous estimates are provided.\nConvincing the sponsor to add a reserve margin without providing an original unprofessional estimate.\nThe reminder that the budget and schedule are not important in flexibility is inaccurate, as they remain part of the overall project controls.",
      "choices": [
        {
          "text": "Inform the sponsor that an estimate is not necessary, as agile supports responding to change over following a plan.",
          "correct": false
        },
        {
          "text": "Remind the sponsor that agile projects are not judged based on budget and schedule.",
          "correct": false
        },
        {
          "text": "Provide the estimate to the sponsor, as agile supports estimating.",
          "correct": true
        },
        {
          "text": "Influence the sponsor to add a contingency buffer to the cost in case of a cost overrun.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project that has a component using agile. The project sponsor asks the project manager to add a new component to this project which is government regulated with new complex tax-rules with enough time provided to implement these rules. The sponsor suggests implementing this new component using predictive non-agile approach due to its complexity.\n\n Which methodology will the project manager use for this new component?",
      "explanation": "The correct answer is: use the hybrid approach by continuing to manage the current component with Agile, and the new component using the predictive methodology.\n\n- Why?\nThe hybrid approach combines the advantages of flexibility and rigor, and is usually used when the project contains parts of a different nature such as scalable parts and others with strict and fixed requirements.\n\n- Why are other options wrong?\nAgile is not suitable for all cases, especially with strict regulatory requirements.\nManaging both components with the same methodology without taking into account their characteristics may compromise the efficiency of implementation.\nAsking the sponsor for guidance is unprofessional because the decision is about choosing an appropriate methodology based on the characteristics of the work, not just administrative guidance.",
      "choices": [
        {
          "text": "Inform the project sponsor that you will manage the new component using agile methodology as agile supports one-size-fits-all.",
          "correct": false
        },
        {
          "text": "Use hybrid approach by continuing to manage the existing component using agile, and the new component using predictive.",
          "correct": true
        },
        {
          "text": "Manage the existing component as well as the new component using predictive plan-based approach.",
          "correct": false
        },
        {
          "text": "Seek guidance from project sponsor for which methodology will suit best for new component.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is handling virtual teams around the world. What should the project manager do to overcome cross-cultural differences?",
      "explanation": "Correct answer: Create a common understanding of the team's goals and objectives.\n\n- Why?\nWhen working with multicultural teams, having clear and common goals and objectives helps to unite efforts and mitigate the impact of cultural differences on performance.\n\n- Why are other options wrong? Establishing informal communication channels is important, but it alone is not enough to ensure understanding.\nStrengthening individual sovereignty may exacerbate rather than resolve differences.\nAn open communication environment is necessary, but without common goals, cultural differences may remain an obstacle to understanding priorities.",
      "choices": [
        {
          "text": "Create grapevine communication channels and invite team members to contribute freely",
          "correct": false
        },
        {
          "text": "Nurture stronger personal boundaries and individual sovereignty",
          "correct": false
        },
        {
          "text": "Create an environment where team members can openly communicate",
          "correct": false
        },
        {
          "text": "Create a shared understanding of team goals and objectives",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "For virtual teams, the following are the boundaries that teams need to work through for successful project outcomes, except:",
      "explanation": "Correct answer: personal comfort.\n\n- Why?\nPersonal comfort is not a fundamental barrier that affects the success of virtual teams from a project management perspective. Virtual teams usually face challenges such as:\n1. Poor interpersonal interaction.\n2. Different working practices and methods.\n3. Diversity of knowledge and uneven backgrounds.\n\n- Why are other options wrong? Interpersonal interactions, work practices and methods, and knowledge diversification are the most important challenges that must be managed to achieve effective results.",
      "choices": [
        {
          "text": "Interpersonal interactions and developing relational capital",
          "correct": false
        },
        {
          "text": "Working practices and routines",
          "correct": false
        },
        {
          "text": "Knowledge diversity",
          "correct": false
        },
        {
          "text": "Personal Convenience",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Engagement and motivation can be successfully achieved by the project manager in a virtual team by all the following, except:",
      "explanation": "Correct answer: Ineffective collaboration.\n\n- Why?\n\neffective collaboration hinders motivation and interaction rather than achieving them. Goal setting, task structuring, and reward systems are key tools used by the project manager to promote teamwork and motivation.\n\n- Why are other options wrong?\nGoal setting guides the team.\nStructuring tasks helps to distribute work clearly.\nReward systems enhance motivation.",
      "choices": [
        {
          "text": "Goal Setting",
          "correct": false
        },
        {
          "text": "Task Structures",
          "correct": false
        },
        {
          "text": "Inefficient Collaboration",
          "correct": true
        },
        {
          "text": "Reward Systems",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Good communication etiquettes of a Project Manager include the following when sending emails, except:",
      "explanation": "Correct answer : Always reply immediately to emotional messages.\n\n- Why?\nImmediate response to emotional messages may lead to hasty decisions or unprofessional expression of feelings. It is always preferable to slow down and reread the message before replying to avoid impulsive reactions.\n\n- Why are other options wrong? Knowing the audience, being tactful and using the correct rules of writing are all essential elements of effective professional communication via email.",
      "choices": [
        {
          "text": "Always responding immediately to emotional messages",
          "correct": true
        },
        {
          "text": "Knowing your audience",
          "correct": false
        },
        {
          "text": "Always being courteous",
          "correct": false
        },
        {
          "text": "Using proper grammar, spelling, and punctuation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "Project managers should wear a leadership face and drive the project team to achieve the expected deliverables. What qualities should a project manager have? (Choose 3).",
      "explanation": "The right answers: leadership, ethics, empowerment.\n\n- Why are these qualities important?\n1. Leadership: Directs the team towards goals.\n2. Ethics: To maintain a work environment that respects values and principles.\n3. Enable: Enables team members to make decisions and execute tasks efficiently.\n\n- Why are other options wrong?\nAdaptability is important but not a key trait required in all cases.\nAggressiveness is not a positive leadership trait and may be counterproductive.",
      "choices": [
        {
          "text": "Lead",
          "correct": true
        },
        {
          "text": "Ethical",
          "correct": true
        },
        {
          "text": "Adapt",
          "correct": false
        },
        {
          "text": "Aggressive",
          "correct": false
        },
        {
          "text": "Empower",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is on a project that has a significant dependence on market changes. The PMO recommended to use an agile approach and the project manager scheduled reference checks to select the implementation partner. To be successful, agile needs a high level of trust between the client and vendor.\n\nWhich of the following aspects should the project manager look for to build trust that the vendor can deliver? (Choose 2).",
      "explanation": "Correct answers: processes and tools + technical excellence.\n\n- Why?\n1. Processes and tools: Ensures that the supplier has clear mechanisms, plans, and proven methodologies that help them perform work frequently and effectively.\n2. Technical excellence: indicates the supplier's ability to complete the work with the required quality and speed, which enhances customer confidence.\n\n- Why are the other answers wrong?\n- Perseverance is important, but it is not a direct criterion for building confidence in the implementation of  Agile.\n- Planning skills are essential but the focus in Agile is more on responding to change and not just sticking to the plan.",
      "choices": [
        {
          "text": "Processes and tools - to ensure that the vendor used an efficient and repeatable delivery approach",
          "correct": true
        },
        {
          "text": "Technical excellence - to ensure that the deliverables were completed as soon as possible and of a high quality",
          "correct": true
        },
        {
          "text": "Perseverance - to ensure that the vendor overcome the challenges inherent to frequent scope change",
          "correct": false
        },
        {
          "text": "Planning skills - to ensure that the vendor met the costs and milestones agreed in the contract",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project being run by a project manager is implementing a new technology. The project manager wants to be sure that the project delivers business value.\n\nWhat roles are critical in ensuring that the organization will benefit from the project delivery? (Choose 3).",
      "explanation": "Correct answers: Project Manager + Business Analyst + Customer Leader.\n\n- Why?\n1. Project Manager: Responsible for ensuring that the project is proceeding within the specified objectives.\n2. Business Analyst: Ensures that the solution meets business needs and provides value.\n3. Customer leader: Represents the interests of the customer and makes sure that the value reaches them.\n\n- Why are the other answers wrong?\n- People and Culture Manager: His primary role is not related to the direct value of the project.\n- Technical Architect: focuses more on the technical side than the commercial side of the project.",
      "choices": [
        {
          "text": "People and culture manager",
          "correct": false
        },
        {
          "text": "Project manager",
          "correct": true
        },
        {
          "text": "Business analyst",
          "correct": true
        },
        {
          "text": "Customer lead",
          "correct": true
        },
        {
          "text": "Technical architect",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project that entails transitioning to agile. The project will pilot the agile delivery modeled around using four resources from a vendor, working alongside two internal resources with no agile experience. The project manager needs to act as a coach for the project team and help them understand the differences between the functioning of a traditional project team and an agile team.\n\nWhat is the most important thing the project manager needs to do to establish agile team behavior?",
      "explanation": "The correct answer is: \"Build trust within the team.\" In Agile, building trust is foundational. A trusted environment enables team members to experiment, collaborate openly, share ideas freely, and take ownership without fear of blame. While focusing on results, encouraging collaboration, and ensuring accountability are all important, none of these can be fully effective without trust as the base.",
      "choices": [
        {
          "text": "Focus on the produced result of the team.",
          "correct": false
        },
        {
          "text": "Build trust within the team.",
          "correct": true
        },
        {
          "text": "Encourage collaboration among the team.",
          "correct": false
        },
        {
          "text": "Hold each team member accountable.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team recently completed a long-term project using a predictive approach. The team then started a new project with the same project manager, but now they are using an agile approach. After the initial sprint, the team waits for the project manager to make decisions on behalf of the team, as has been done in previous projects.\n\nWhat should the project manager do?",
      "explanation": "The correct answer is: mentoring and coaching the team to support their own decision-making. In Agile, one of the basic principles is to empower teams to be self-organizing and make their decisions independently. If the team continues to rely on the manager, it means that they have not yet switched to an  agile mindset.",
      "choices": [
        {
          "text": "Ask the product owner to make decisions for the team.",
          "correct": false
        },
        {
          "text": "Give continuous positive feedback to all team members.",
          "correct": false
        },
        {
          "text": "Remind the team that they are using an agile approach.",
          "correct": false
        },
        {
          "text": "Coach the team to guide and support their own decisions.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a retrospective meeting, the project team confirmed that all deliverables were completed according to the specifications provided in the product backlog. However, the number of errors found during testing increased dramatically.\n\nWhat should the project manager do?",
      "explanation": "The correct answer is: meet with quality assurance specialists to clarify the problem and look for solutions. \n\n this situation, it is important to first identify the root cause of the increase in errors. The problem may be in the test method or in understanding the acceptance criteria. While reviewing or recording a risk plan is a next step, dealing directly with the quality team is the most immediate and effective procedure.",
      "choices": [
        {
          "text": "Meet with quality assurance specialists to clarify the issue and seek resolutions.",
          "correct": true
        },
        {
          "text": "Review the risk management plan to determine the mitigation strategy.",
          "correct": false
        },
        {
          "text": "Perform a Monte Carlo analysis to identify possible scenarios and actions.",
          "correct": false
        },
        {
          "text": "Register the risk in the risk register and monitor it during the next iteration.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An application developer took a story card to work that read \"Customer can pay using credit card\". After the implementation, the functionality was rejected because the application could not accept foreign credit cards.\n\nWhat should the project manager have done to avoid this issue?",
      "explanation": "The correct answer is: describe the user story in more detail. \n\nsufficiently defined stories lead to misunderstandings and incomplete requirements. In the Agile methodology, it is important that each story has clear acceptance criteria so that the developer understands exactly what is needed. This is called INVEST in user stories: (independent, negotiable, valuable, appreciable, small, testable).",
      "choices": [
        {
          "text": "Described the user story in more detail.",
          "correct": true
        },
        {
          "text": "Scheduled the user story for the next iteration.",
          "correct": false
        },
        {
          "text": "Performed iterative backlog grooming with the team.",
          "correct": false
        },
        {
          "text": "Gathered more detailed requirement specifications from end users.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The sponsor notified the product owner that the budget was approved for a project. However, any additional investment for the project would have to wait until the next fiscal year. The product owner is concerned that this will hold up the project.\n\nWhat should the product owner do?",
      "explanation": "Correct answer: Track budget based on the launch plan and show value to the business.\n\n- Why?\nThe product owner is responsible for ensuring that the commercial value is clearly visible against the investments made. If there are budget constraints, it is best to focus on maximizing value within the current budget.\n\n- Why are other options wrong?\n- Explain that the project has just started and the budget will need to be adjusted: This is not a realistic solution if the budget is already fixed.\n- Track the budget based on each sprint and remove unnecessary outputs: This may affect quality and key outputs.\n- Ensure that the project manager monitors each invoice: This is a managerial role rather than a strategic role that addresses key value concerns.",
      "choices": [
        {
          "text": "Track the budget based on the release plan and show the value to the business.",
          "correct": true
        },
        {
          "text": "Explain that the project is just starting and the budget will need to be adjusted.",
          "correct": false
        },
        {
          "text": "Track the budget based on each sprint and remove nice-to-have deliverables.",
          "correct": false
        },
        {
          "text": "Ensure that the project manager monitors every invoice from the project.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During release planning, a conflict arises between stakeholders regarding prioritizing certain needs, which is causing the development team to lose focus. To align all stakeholders and resolve this conflict, which conflict resolution technique should the project manager employ?",
      "explanation": "Correct answer: Collaboration.\n\n- Why?\nCooperation is considered the most effective way to resolve disputes as it focuses on meeting the needs of all parties involved. Instead of imposing the opinion of one party, the method of cooperation is used to reach a solution that satisfies everyone.\n\n- Why are other options wrong?\n- Force: May lead to dissatisfaction of the parties and affect the performance of the team.\n- Withdrawal: Leaves the problem unresolved.\n- Tempering: It may hide the problem instead of solving it radically.",
      "choices": [
        {
          "text": "Forcing",
          "correct": false
        },
        {
          "text": "Collaboration",
          "correct": true
        },
        {
          "text": "Withdrawal",
          "correct": false
        },
        {
          "text": "Smoothing",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team has been tasked to build a new product. The team builds the demo first and add features to the initial product. This is an example of what technical practice?",
      "explanation": "Correct answer: continuous delivery.\n\n- Why?\nContinuous delivery is a software development technique in which a product is repeatedly released through incremental stages, where a prototype or demo is first introduced and then features are gradually added.\n\n- Why are other answers wrong?\n- Test-Based Development (TDD): Focuses on writing tests before writing code.\n- Behavior-based development: It is based on describing the expected behavior of the system from the user's perspective.\n- Explorations (Spikes): Used for exploration and verification, not to gradually release a full product.",
      "choices": [
        {
          "text": "Test-Driven Development (TDD)",
          "correct": false
        },
        {
          "text": "Continuous Delivery",
          "correct": true
        },
        {
          "text": "Behavior-Driven Development",
          "correct": false
        },
        {
          "text": "Spikes",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company's project management office (PMO) is incorporating more adaptive technologies and has hired a new project manager with hybrid project management experience. The team is slow in adopting the new methodology and has not been updating project artifacts in a timely manner.\n\nWhich action should the project manager take to improve the team's performance?",
      "explanation": "Correct answer: organize a training session for all team members.\n\n- Why?\nWhen new methodologies are introduced, the team needs to understand them and learn how to work according to them. Group training raises the level of knowledge and competence and clarifies expectations.\n\n- Why are other options wrong?\n- Send an email: It may not be enough to motivate change.\n- Communication with functional managers: Not the direct solution to changing team behavior.\n- Speaking individually: less effective compared to a comprehensive team training session.",
      "choices": [
        {
          "text": "Send an email asking all project team members to complete updates at the end of the day.",
          "correct": false
        },
        {
          "text": "Set up a training session for all project team members.",
          "correct": true
        },
        {
          "text": "Reach out to the functional managers for support.",
          "correct": false
        },
        {
          "text": "Speak individually with each project team member about making the needed updates.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile team has been struggling to keep up with the planned pace, which is frequently resulting in sprint failures. What should the project manager do to help avoid this situation in the future?",
      "explanation": "Correct answer: Review the team's speed over several previous sprints and adjust the plan accordingly.\n\n- Why?\nTeam Velocity is a real metric that shows how much work a team can accomplish during a single sprint. Reviewing them helps the project manager set realistic expectations and adjust the plan to suit the actual capabilities of the team.\n\n- Why are other options wrong?\n- Requesting sponsor approval for overtime: It is not a sustainable solution and may lead to team fatigue.\n-  Member replacement and scope negotiation: A drastic measure that may be unnecessary at first.\n- Switching to kanban: It may not always be appropriate for team speed issues, and should be evaluated based on context.",
      "choices": [
        {
          "text": "Ask the project sponsor to approve overtime to compensate for the lack of performance while adjusting the plan.",
          "correct": false
        },
        {
          "text": "Review the velocity of the team over the last several sprints and adjust the plan accordingly.",
          "correct": true
        },
        {
          "text": "Replace junior team members with more experienced ones, and negotiate the project scope to compensate for the budget gap.",
          "correct": false
        },
        {
          "text": "Switch to a Kanban approach to have better control on the planned pace by limiting work in progress.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is struggling to figure out the performance of the project teams in an agile environment. For the same scope of work, team A has calculated and delivered 100 story points and team B has calculated and delivered 125 story points.nnWhich team is performing better?",
      "explanation": "Correct answer: The team with the fewest defects in deliverables.\n\n- Why?\n\n an Agile environment, the quality of deliverables is as important as the quantity. Team B can accomplish more story points, but if there are many drawbacks, this negatively affects the final value.\n\n- Why are the other options wrong?\n- Only the number of story points does not reflect the quality of the work or the efficiency of the team.\n- Completing the largest number of stories without regard to quality may lead to problems with the final product.",
      "choices": [
        {
          "text": "Team A as they have calculated fewer story points than team B.",
          "correct": false
        },
        {
          "text": "Team B as they have calculated more story points than team A.",
          "correct": false
        },
        {
          "text": "The team that completes the most stories selected from the sprint backlog.",
          "correct": false
        },
        {
          "text": "The team with the least amount of defects in their deliverables.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company has an existing contract to maintain and enhance a client's customer database. The company's legal department informs the project manager that a new piece of legislation requiring stricter protection of customer information might soon be signed into law. The law will require additional security features to be implemented into the database the project manager is maintaining. These features are not included in the scope of the current contract.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Update the risk log with this issue and plan the risk response with the sponsor and the customer.\n\n- Why?\nLegal changes represent risks that must be effectively managed. Updating the risk log allows the manager to track the situation and communicate with stakeholders to make appropriate decisions regarding the adjustment of scope, costs, or schedule.\n\n- Why are other options wrong?\n- Requesting the support of the project sponsor to amend the contract immediately may be premature before risk assessment and planning.\n- Waiting for the requirements to be formally approved may delay the response and may lead to problems later.\n- Raising the issue in the next contract negotiations is insufficient if legislation is imminent and requires immediate action.",
      "choices": [
        {
          "text": "Seek the project sponsor's support to influence the client to amend the contract immediately.",
          "correct": false
        },
        {
          "text": "Ask the legal department to raise the issue in the next contract negotiation with the customer.",
          "correct": false
        },
        {
          "text": "Update the risk register with the issue and plan risk response with the project sponsor and client.",
          "correct": true
        },
        {
          "text": "Wait until the legal requirements are finalized so the change in scope can be concretely defined.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An experienced project manager is managing a multi-million dollar agile project. The project manager communicates the ground rules to the team, but after 12 iterations, the project manager starts noticing that some team members are not following the ground rules.\n\nWhat should the project manager do first to ensure team adherence to the ground rules?",
      "explanation": "Correct answer: Schedule a meeting with the team to reinforce the ground rules.\n\n- Why?\nOpen communication with the team helps reaffirm and interpret rules and ensure everyone understands their importance. This action reinforces the team's commitment constructively without unnecessary escalation.\n\n- Why are other options wrong?\n- Sending warnings or requesting replacement of members without attempting to re-communicate and clarify may lead to tension in the team and affect performance.\n- Informing the sponsor and requesting disciplinary action may be a rapid escalation and should be the last option after constructive attempts.",
      "choices": [
        {
          "text": "Contact human resources to request a written warning letter be sent to team members not following the ground rules.",
          "correct": false
        },
        {
          "text": "Ask the functional manager to replace team members not following the ground rules.",
          "correct": false
        },
        {
          "text": "Schedule a meeting with the project team to reinforce the ground rules.",
          "correct": true
        },
        {
          "text": "Notify the project sponsor about this behavior and ask the sponsor to take disciplinary action.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The steering committee has asked a project manager experienced in agile to provide an indication of the remaining time on a medium-sized project. What tools can be used to provide this information?",
      "explanation": "Correct answer: Release Burndown Chart).\n\n- Why?\nRelease burn diagram shows the current progress and time remaining based on the work done and the remaining work, which helps provide an accurate indication of the expected time to finish the project.\n\n- Why are the other options wrong?\n- Analysis of the work requirements document does not give a direct time estimate.\n-  The story points of the remaining stories express the volume of work, but are not directly translated into the remaining time without the velocity context.\n- Alternative measurements are indirect indicators and do not provide a clear view of the remaining time.",
      "choices": [
        {
          "text": "Analysis of the business requirements document",
          "correct": false
        },
        {
          "text": "A release burndown chart",
          "correct": true
        },
        {
          "text": "Story points for the remaining user stories",
          "correct": false
        },
        {
          "text": "Surrogate measurements",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A newly formed team has become accustomed to agile practices. The project lead has noticed that while they are performing according to expectations, there is boredom with daily team practices among many of the team members.\n\nWhat should the project lead do in this situation?",
      "explanation": "The correct answer: Challenge the team to find new ways to achieve higher performance levels to improve the situation.\n\n- Why?\nEncourage the team to look for new improvements that foster innovation and motivation, reducing boredom and increasing engagement and enthusiasm.\n\n- Why are other options wrong?\n- Allowing only the review meeting to self-correct may not be enough if the team is already bored.\n- Talking to individual members is useful but may not lead to collective and effective solutions.\n- Asking the team to inform senior management may delay solutions and reduce team autonomy.",
      "choices": [
        {
          "text": "Allow the team to self-organize and have them analyze the situation in their retrospective session and self correct.",
          "correct": false
        },
        {
          "text": "Challenge the team to find new ways to achieve higher levels of performance to improve the situation.",
          "correct": true
        },
        {
          "text": "Speak with individual team members to determine what they would like to do to improve the situation in the team.",
          "correct": false
        },
        {
          "text": "Have the team inform senior management of the situation and ask for recommendations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with a Scrum team that is continually missing deadlines. The steering committee is concerned about the project as it is not clear that it will deliver the expected value. After some analysis, the project manager discovers there is a mismatch of competencies in one of the teams.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Provide appropriate training to compensate for incompatibility.\n\n- Why?\n\ncompatibility in competencies can lead to poor performance and delays, and providing appropriate training enhances team skills and reduces technical gaps, helping the team meet deadlines.\n\n- Why are other options wrong?\n- Accepting the risk of project delay means ignoring the problem without trying to solve it.\n- Updating the project schedule to reflect the delay addresses the symptoms, not the cause.\n- Emphasizing the importance of punctuality alone does not solve the problem of inefficiency.",
      "choices": [
        {
          "text": "Accept the risk of the project missing deadlines due to the mismatch.",
          "correct": false
        },
        {
          "text": "Provide appropriate training to compensate for the mismatch.",
          "correct": true
        },
        {
          "text": "Update the project schedule to reflect the delay.",
          "correct": false
        },
        {
          "text": "Emphasize to the teams the importance of meeting the agreed deadlines.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A large corporation is transforming itself from a predictive to agile approach. A project team with knowledge of agile practices is experiencing significant conflicts with the executives regarding the processes to be followed.\n\nHow should these conflicts be resolved?",
      "explanation": "The correct answer: Train executives on Agile practices.\n\n- Why?\nTraining executives helps them understand Agile practices and goals, reducing conflict, enhancing their support for the team, and facilitating cultural transformation in the organization.\n\n- Why are other options wrong?\n- Negotiating a specific process can be difficult without a deep understanding of Agile practices.\n- Involving managers in review meetings may not be enough to understand the full practice.\n- Requiring managers to use Agile without training may lead to resistance and non-cooperation.",
      "choices": [
        {
          "text": "Negotiate with the executives and agree on a process.",
          "correct": false
        },
        {
          "text": "Train the executives on agile practices.",
          "correct": true
        },
        {
          "text": "Include the executives in team retrospectives.",
          "correct": false
        },
        {
          "text": "Request that the executives use agile practices.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member is hosting an event and invites several colleagues through their work calendars. Another team member, who was not invited to the event, is noticeably distracted during several standup meetings.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Set a meeting with the distracted team member to discuss any issues.\n\n- Why?\nWhen a team member shows distractions, it's important that the project manager contacts them directly to understand the causes and work to resolve them to ensure a cohesive and supportive work environment.\n\n- Why are other options wrong?\n- Requesting that the event be specified as private does not address the cause of the distraction.\n- Using special means of communication may not solve the root problem.\n- Adding a section for social events in the project charter may be impractical and does not address the individual problem.",
      "choices": [
        {
          "text": "Ask the individual who is hosting the event to mark it as private.",
          "correct": false
        },
        {
          "text": "Set up a meeting with the distracted team member to discuss any issues.",
          "correct": true
        },
        {
          "text": "Ask the individual who is hosting the event to use private communication methods.",
          "correct": false
        },
        {
          "text": "Add a social events section to the charter to handle these situations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a hybrid project. A stakeholder has directly contacted a team member and has requested a change. Due to the request, the team member was distracted from their work, which caused a loss in productivity.\n\nWhat should the team member do?",
      "explanation": "Correct answer: Inform Scrum Master of the change request from the stakeholder and the resulting impact on productivity.\n\n- Why?\nScrum Master is responsible for facilitating the process and handling change requests in an orderly manner to maintain team focus and productivity.\n\n- Why are other options wrong?\n- Informing the stakeholder directly about the correct action without involving Scrum Master may lack coordination.\n- Submitting the request directly to the Change Control Committee may not be quick or practical in a hybrid environment.\n- Informing Scrum Master to discuss the change with the stakeholder is a subsequent step after informing them of the impact.",
      "choices": [
        {
          "text": "Inform the stakeholder that the correct procedure for new requirements is to provide it directly to the project manager.",
          "correct": false
        },
        {
          "text": "Inform the stakeholder that the correct procedure for new requirements is to provide it directly to the change control board (CCB).",
          "correct": false
        },
        {
          "text": "Inform the scrum master regarding the stakeholder's request for a change and the impact this has had on productivity.",
          "correct": true
        },
        {
          "text": "Inform the scrum master so that the change can be discussed directly with the stakeholder.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an industrial plant, the owner has decided to add more capacity to the plant by installing a new machine and updating the software used in production. This capacity enlargement will occur while the plant is still functioning and producing. The software update will be accomplished using an agile approach in order to minimize risk. The machine procurement, installation, and integration will be accomplished using predictive approaches.\n\nWhat types of communications will the project manager have to design into the schedule management plan to ensure the project will be on schedule?",
      "explanation": "Correct answer: weekly meetings in the same location with relevant stakeholders.\n\n- Why?\nWeekly recurring meetings in the same location help to coordinate immediately between teams using different methodologies and ensure information exchange and continuous updates, reducing risk and helping in project punctuality.\n\n- Why are other options wrong?\n- Biweekly reports may delay the transmission of information and do not allow for immediate interaction.\n- Weekly one-on-one meetings may not provide the necessary group coordination.\n- Biweekly conference calls are less frequent and do not achieve the required continuous communication.",
      "choices": [
        {
          "text": "Weekly colocated meetings with the relevant stakeholders",
          "correct": true
        },
        {
          "text": "Biweekly written status reports from the relevant stakeholders",
          "correct": false
        },
        {
          "text": "Weekly one-on-one meetings with each of the relevant stakeholders",
          "correct": false
        },
        {
          "text": "Biweekly conference calls with the relevant stakeholders",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile project is running its fifth iteration out of 10. After the last retrospective, the team members realize that they had to work extra hours to deliver the committed work.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Conduct a focused review (Retrospective) to help the team discover the root cause.\n\n- Why?\nFocused review allows the team to delve into the reasons why additional work is needed, enabling them to take sustained corrective action to improve planning and implementation in future cycles.\n\n- Why are other options wrong?\n- A request for a lower commitment may be a temporary solution but does not address the real causes.\n- Requesting additional members may add administrative complexities and may not solve the root problem.\n- Implementing a mid-cycle checkpoint does not guarantee that the root causes of overtime work will be revealed.",
      "choices": [
        {
          "text": "Ask the team to have a lower commitment for the next iteration.",
          "correct": false
        },
        {
          "text": "Ask for additional team members to maintain the velocity.",
          "correct": false
        },
        {
          "text": "Conduct a focused retrospective to help the team to discover the root cause.",
          "correct": true
        },
        {
          "text": "Implement a checkpoint in the iteration to verify if the team is on track.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is being executed. The project's life cycle is defined as predictive; However, a major deliverable will be handed over incrementally to the customer. The assigned resources are experienced and reliable and are willing to make decisions that the project manager used to make after each incremental delivery on other projects.\n\nWhat should the project manager do?",
      "explanation": "The correct answer: support the team's decisions and transfer decision-making responsibility to them.\n\n- Why?\nWhen resources are reliable, experienced, and have the knowledge to make decisions, decision delegation enhances autonomy and motivates the team, increasing the speed and efficiency of work.\n\n- Why are other options wrong?\n- Informing the team that the project manager is responsible for making decisions reduces the independence of the team and does not fit into the step-by-step delivery environment.\n- Consulting with the product owner may add an unnecessary administrative layer in this case.\n- Scheduling a meeting with the steering committee is unnecessary and may slow down the process.",
      "choices": [
        {
          "text": "Inform the team that although this is a hybrid environment, the project manager must still be responsible for making decisions.",
          "correct": false
        },
        {
          "text": "Consult the product owner about letting the resources make decisions.",
          "correct": false
        },
        {
          "text": "Support the decisions of the team and transfer the decision making responsibility to them.",
          "correct": true
        },
        {
          "text": "Schedule a steering committee meeting and obtain their approval on the request.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team has been working for two months and has consistently missed planned user stories. How should the project manager address this issue?",
      "explanation": "Correct answer: Ensure that the cycle size is appropriate for the duration of the iteration.\n\n- Why?\nChoosing a suitable Sprint size is important to ensure that the team can deliver user stories within the specified time frame, improving plan commitment and increasing productivity.\n\n- Why are other options wrong?\n- Randomly changing the duration of the course may have a negative impact on the stability of the team.\n- Hiring a highly skilled resource may not solve the problem if it is related to the size of the cycle.\n- Using a reward system that may temporarily motivate the team but does not address the root causes of failure.",
      "choices": [
        {
          "text": "Promote changing the iteration duration in order to commit as planned.",
          "correct": false
        },
        {
          "text": "Ensure the sprint size is appropriate for the iteration duration.",
          "correct": true
        },
        {
          "text": "Engage in recruiting a highly skilled resource to reinforce the skills.",
          "correct": false
        },
        {
          "text": "Consider using a reward system to encourage timely delivery.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project with a hybrid approach and has requested a senior team member to perform a quantitative risk analysis. The team member responds that they do not have the knowledge to perform such an analysis.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Help the team member perform quantitative analysis through mentoring and training.\n\n- Why?\nProvide support and training that enhances team skills, ensures accurate work, and builds the team's ability to handle similar tasks in the future.\n\n- Why are other options wrong?\n- Escalating the issue to the functional manager may lead to a delay and does not directly address the lack of knowledge.\n- Contacting the Project Management Office (PMO) may not be the best solution when team skills can be developed internally.\n- Performing analysis instead of a team member reduces capacity building opportunities in the team.",
      "choices": [
        {
          "text": "Escalate the issue to the functional manager.",
          "correct": false
        },
        {
          "text": "Contact the project management office (PMO) and request them to assign another team member who has the knowledge to perform this task to the team.",
          "correct": false
        },
        {
          "text": "Help the team member to perform the quantitative risk analysis through coaching, mentoring, and training.",
          "correct": true
        },
        {
          "text": "Perform the quantitative risk analysis for the team member.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A transportation company is transforming its operational processes and the main system this company uses to move freight. The scope statement is in place. An iterative delivery approach has been agreed by all stakeholders.\n\nWhat does the project manager need to do next to help the team understand the work that needs to be done?",
      "explanation": "Correct answer: Work with the team to detail the scope into a workload structure and work packages to create the required deliverables and schedules.\n\n- Why?\nDetailing the scope into a workbreakdown structure helps transform overall goals into clear and actionable tasks, making it easier to manage the project and organize the work.\n\n- Why are the other options wrong?\n- Preparing a project management plan requires a clear understanding of the scope first.\n- Working directly with stakeholders on appointments without detailing the work structure may lead to unclear responsibilities.\n- Creating a requirements management plan is important later after defining the structure of the division of work.",
      "choices": [
        {
          "text": "Start working on the project management plan with work packages, a detailed schedule, and work assignments for team members.",
          "correct": false
        },
        {
          "text": "Work directly with stakeholders on the work breakdown structure (WBS) and assign tasks with a required timeline for each team member to start the work.",
          "correct": false
        },
        {
          "text": "Work with the team to decompose the scope into a WBS and work packages in order to create required deliverables and timelines.",
          "correct": true
        },
        {
          "text": "Create the requirements management plan to outline how project requirements will be collected, analyzed, and documented, and then assign requirements to team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A lengthy, ongoing project exhausts a project team. Due to deadline issues, the project manager cannot extend the project schedule.\n\nWhat should the project manager do next?",
      "explanation": "Correct answer: discuss the situation with the team.\n\n- Why?\nDiscussing the situation with the team helps in understanding the real challenges, finding common solutions to improve performance or adjust priorities within the specified schedule.\n\n- Why are the other options wrong?\n-  Project charter review does not address the current problem directly.\n- Providing further appreciation may be good but does not solve the burnout or schedule problem.\n- Requesting additional resources may not be available or possible due to time constraints.",
      "choices": [
        {
          "text": "Review the project charter.",
          "correct": false
        },
        {
          "text": "Provide more recognition to team members.",
          "correct": false
        },
        {
          "text": "Discuss the situation with the team.",
          "correct": true
        },
        {
          "text": "Request additional resources.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Due to a recent incident, a dissatisfied stakeholder files a complaint about a project that has been closed. What can the project manager do to help resolve this?",
      "explanation": "Correct answer: Review the PMIS archive.\n\n- Why?\nPMIS archive review gives the project manager access to all documents and reports related to the closed project, which helps in understanding the issue and responding appropriately to the complaint.\n\n- Why are other options wrong?\n- Implementing a SaaS plan is usually during project execution and not after closing.\n- Consulting with the project sponsor may be useful but is not the first step without gathering information.\n- Updating the risk register is inappropriate for a closed project.",
      "choices": [
        {
          "text": "Execute the relationship management plan.",
          "correct": false
        },
        {
          "text": "Consult with the project sponsor to manage the dissatisfied stakeholder.",
          "correct": false
        },
        {
          "text": "Review the project management information system (PMIS) archives.",
          "correct": true
        },
        {
          "text": "Update the risk register.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project steering committee meeting, the project manager reports that a formerly supportive key team member has become resistant to and negative about changes. Where should this information be captured?",
      "explanation": "Correct answer: Stakeholder Engagement Assessment Matrix.\n\n- Why?\nStakeholder Engagement Assessment Matrix documents the level of support and interaction of each stakeholder, tracking attitude changes and impact on the project.\n\n- Why are other options wrong?\n-  The RACI matrix clarifies roles and responsibilities but does not track the behavior or attitude of stakeholders.\n-  The risk and issue register focuses on problems and risks rather than directly stakeholder positions.\n- Business performance reports focus on work progress and not on stakeholder assessment.",
      "choices": [
        {
          "text": "Responsible, accountable, consult, and inform (RACI) matrix",
          "correct": false
        },
        {
          "text": "Stakeholders engagement assessment matrix",
          "correct": true
        },
        {
          "text": "Risk register and issue log",
          "correct": false
        },
        {
          "text": "Work performance reports",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team receives outsourced deliverables and determines that they do not meet the agreed-upon acceptance criteria. What should the project manager reference to verify this with the vendor?",
      "explanation": "Correct answer: Statement of Work (SOW).\n\n- Why?\nThe work statement specifies the scope of work, acceptance criteria, and requirements that the vendor must meet.\n\n- Why are other options wrong?\n- The procurement management plan relates to how procurement processes are managed but does not specify acceptance criteria.\n-  The request for proposal (RFP) is a pre-contract publicity document and is not a reference for evaluating work after implementation.\n- Inspections are used to verify the quality of work but do not contain details of contractual agreements.",
      "choices": [
        {
          "text": "Procurement management plan",
          "correct": false
        },
        {
          "text": "Request for proposal (RFP)",
          "correct": false
        },
        {
          "text": "Statement of work (SOW)",
          "correct": true
        },
        {
          "text": "Inspections",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager in a cross-functional organization needs to inform the department manager of the number and type of resources required, and the length of time they will be needed. What should the project manager use to present this resource information?",
      "explanation": "Correct answer: resource diagram of resource distribution.\n\n- Why?\nThe resource distribution chart shows the amount of resources required over a period of time, helping department managers better understand and plan the need for resources.\n\n- Why are other options wrong?\n- Resource assignments focus on who is responsible for tasks but do not indicate the amount or duration of resource usage.\n-  The RAM matrix shows the allocation of roles and responsibilities but does not detail the quantity or duration of resources.\n- The project organization structure diagram shows the administrative structure of the team and not the details of the resources required.",
      "choices": [
        {
          "text": "Resource assignments",
          "correct": false
        },
        {
          "text": "Resource histogram",
          "correct": true
        },
        {
          "text": "Responsibility assignment matrix (RAM)",
          "correct": false
        },
        {
          "text": "Project organization chart",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A demanding project stakeholder insists that an additional feature be added to a project product without changing the scope, budget, or schedule. The project manager allows this feature to be included since it adds great value to the end product. However, the project manager discovers that adding this feature has lengthened the project schedule and increased project costs.\n Which process should the project manager have followed before including the additional product feature?",
      "explanation": "Correct answer: monitor changes.\n\n- Why?\nThe change monitoring process allows the impact of any changes to the scope, schedule, and budget to be evaluated before they are approved.\n\n- Why are other options wrong?\n- Schedule planning relates to the creation of the schedule but does not control change requests.\n- Procurement planning focuses on procurement processes and not changes in the scope of the project.\n- Quality audit tests product quality and does not manage scope or schedule changes.",
      "choices": [
        {
          "text": "Change control",
          "correct": true
        },
        {
          "text": "Schedule planning",
          "correct": false
        },
        {
          "text": "Procurement planning",
          "correct": false
        },
        {
          "text": "Quality audit",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project to create a new product is completed and introduced into the market, but sales are much lower than expected. Analysis determines that the product is misaligned with the organization's core competencies.\n\nDuring what activity should this have been discovered?",
      "explanation": "Correct answer: review feasibility study.\n\n- Why?\nFeasibility study is conducted at an early stage to assess whether the project meets the organization's objectives and core competencies before starting implementation.\n\n- Why are other options wrong?\n- Analysis, what if scenarios are used to assess risks and probabilities, not to determine product alignment with competencies.\n- Strategic performance appraisal focuses on reviewing performance after implementation and not during planning.\n- Scoping defines project outputs but does not delve into their alignment with core competencies.",
      "choices": [
        {
          "text": "What-if scenario analysis",
          "correct": false
        },
        {
          "text": "Business case review",
          "correct": true
        },
        {
          "text": "Strategic performance evaluation",
          "correct": false
        },
        {
          "text": "Scope definition",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project is being audited to ensure compliance with organizational policies. What process is being conducted?",
      "explanation": "Correct answer: Quality management.\n\n- Why?\nQuality management includes reviewing compliance with policies and standards and ensuring their application during project implementation.\n\n- Why are other options wrong?\n- Schedule audit focuses only on schedule and not on policy compliance.\n- Quality management planning determines how quality will be managed but not the audit process itself.\n- Quality control focuses on verifying outputs and not auditing compliance with policies.",
      "choices": [
        {
          "text": "Audit Schedule",
          "correct": false
        },
        {
          "text": "Plan Quality Management",
          "correct": false
        },
        {
          "text": "Control Quality",
          "correct": false
        },
        {
          "text": "Manage Quality",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While working on a project, the project team realizes that recent data center upgrades could impact the project's outcome. Certain modules of the project deliverable are incompatible with the new environment. The team identifies the appropriate steps to address the issue.\n\nWhat is the next step for the project manager?",
      "explanation": "Correct answer: Submit a change request.\n\n- Why?\nWhen an impact on project output is detected due to environmental or unforeseen changes, the project manager must submit a formal change request to manage the impact of this issue and ensure that it is reviewed and approved.\n\n- Why are other options wrong?\n- A request for a budget increase may be later after the change has been evaluated and not the first step.\n-  The project schedule change is made after the change is approved, not before.\n- The requirements document is updated after the change is approved, not before.",
      "choices": [
        {
          "text": "Request a budget increase.",
          "correct": false
        },
        {
          "text": "Submit a change request.",
          "correct": true
        },
        {
          "text": "Change the project schedule.",
          "correct": false
        },
        {
          "text": "Update the requirements document.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer's requested design change is approved by the change control board (CCB). The project manager then discovers that the change will cause a three-month project delay.\n\nWhat should the project manager have done to avoid this?",
      "explanation": "Correct answer: Accurately evaluate the demand according to the risk management plan.\n\n- Why?\nAll change requests should be carefully evaluated before being approved, especially with regard to their impact on the schedule and risks, to avoid unexpected delays or issues.\n\n- Why are other options wrong?\n- Increasing the budget and requesting additional resources may be a reaction after the evaluation and not the first step.\n- Redefining the scope should be done based on a careful assessment and not directly.\n-  Crashing is an option for managing delays but is not a substitute for the correct assessment of demand.",
      "choices": [
        {
          "text": "Increased the authorized budget, and requested additional resources",
          "correct": false
        },
        {
          "text": "Redefined the project scope to include the new design",
          "correct": false
        },
        {
          "text": "Fast tracked and crashed the schedule",
          "correct": false
        },
        {
          "text": "Thoroughly assessed the request in accordance with the risk management plan",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new warehouse facility is under construction. The project manager implements team development efforts such as training that will result in a lower defect ratio.\n\nWhat should the project manager do next?",
      "explanation": "Correct answer: Update resource management plan.\n\n- Why?\nAfter team training is performed, the resource management plan should be updated to reflect changes in team skills and abilities, helping to monitor and improve the quality of work.\n\n- Why are other options wrong?\n- Delivering a training program that has already been done.\n- Increasing quality control reviews may be later, but it is not the essential next step.\n- Adding training costs to the budget assumes that it was done before, not after, implementation.",
      "choices": [
        {
          "text": "Introduce a training program.",
          "correct": false
        },
        {
          "text": "Update the resource management plan.",
          "correct": true
        },
        {
          "text": "Increase quality control reviews.",
          "correct": false
        },
        {
          "text": "Add training costs to the budget.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is using Lean Six Sigma methodology on a project. Midway through the project, an external Lean consultant is invited to conduct an audit to ensure that the methodology is being properly applied.\n\nWhich process is being employed?",
      "explanation": "Correct answer: Quality management.\n\n- Why?\nInvite an external consultant to conduct an audit that falls within the quality management activities that ensure that the project adheres to the standards and procedures required to achieve quality.\n\n- Why are other options wrong?\n- Quality control focuses on process control and not external audit.\n- Conducting qualitative risk analysis is about risk assessment, not audit.\n- Quality management planning takes place at the beginning of the project and not during implementation.",
      "choices": [
        {
          "text": "Manage Quality",
          "correct": true
        },
        {
          "text": "Control Quality",
          "correct": false
        },
        {
          "text": "Perform Qualitative Risk Analysis",
          "correct": false
        },
        {
          "text": "Plan Quality Management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An experienced project manager is preparing a kick-off meeting for a new service assessment. A high-level description of the service has been provided.\n\nWhat should the project manager do first?",
      "explanation": "Correct answer: Project charter development.\n\n- Why?\nProject charter development is the formal first step that gives authority to start the project and provides a clear framework for goals and expectations.\n\n- Why are other options wrong?\n- The development of the Responsibilities Matrix (RACI) comes after the establishment of the project charter.\n- Defining the project scope statement usually follows the development of the charter.\n- The establishment of a workshift structure (WBS) takes place after the scope is clearly defined.",
      "choices": [
        {
          "text": "Develop the project charter.",
          "correct": true
        },
        {
          "text": "Develop the responsible, accountable, consult, and inform (RACI) matrix.",
          "correct": false
        },
        {
          "text": "Define the project scope statement.",
          "correct": false
        },
        {
          "text": "Create the work breakdown structure (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a project's initiation phase, the project manager reviews the business case and finds that information is incomplete. What should the project manager do?",
      "explanation": "Correct answer: Review the feasibility study with the sponsor to ensure that the project is compatible with business needs.\n\n- Why?\nTo ensure that the project is in line with the business objectives and strategic direction, you should discuss and study deficiencies with the sponsor to get clear guidance.\n\n- Why are other options wrong?\n- Adding the information gap to the risk register does not solve the underlying problem.\n- The review of the statement of work (SOW) to create the charter does not address the lack of information in the feasibility study.\n-  The modification of the feasibility study is made after obtaining clear guidance from the sponsor.",
      "choices": [
        {
          "text": "Add an information gap to the risk register.",
          "correct": false
        },
        {
          "text": "Review the project statement of work (SOW) to create the project charter.",
          "correct": false
        },
        {
          "text": "Revise the business case to narrow the project scope and create the project charter.",
          "correct": false
        },
        {
          "text": "Review the business case with the sponsoring organization to confirm that the project aligns with business needs.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project implementation, an issue arises that requires the execution of the project's contingency plan, which will impact the project schedule. What should the project manager do?",
      "explanation": "Correct answer: Issue a change request.\n\n- Why?\nWhen implementing a contingency plan that affects the schedule, the change must be formally documented by requesting a change to ensure approval and tracking.\n\n- Why are other options wrong?\n- Starting a risk audit is not the appropriate action after the contingency plan is implemented.\n-  The cost impact review should be done after the change request is issued.\n- Updating the contingency plan does not address the impact of implementation on the schedule.",
      "choices": [
        {
          "text": "Initiate a risk audit.",
          "correct": false
        },
        {
          "text": "Issue a change request.",
          "correct": true
        },
        {
          "text": "Review the cost impact.",
          "correct": false
        },
        {
          "text": "Update the contingency plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager discovers a significant flaw in a major project deliverable. Which project management process is being performed?",
      "explanation": "Correct answer: Quality control.\n\n- Why?\nQuality control involves identifying and correcting defects to ensure that the final product meets the standards and requirements.\n\n- Why are other options wrong?\n- Quality management includes quality planning and control and does not focus only on the detection of defects.\n- Quality management planning is done at the planning stage and not when the defect is discovered.\n- Statistical sampling is a tool used within quality control and not the complete process.",
      "choices": [
        {
          "text": "Manage Quality",
          "correct": false
        },
        {
          "text": "Control Quality",
          "correct": true
        },
        {
          "text": "Plan Quality Management",
          "correct": false
        },
        {
          "text": "Statistical Sampling",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While preparing a project charter for a new project, a project manager reviews lessons learned from previous projects. The lessons learned documents show frequent issues with low engagement levels and stakeholder misalignment on project objectives.\n\nWhat should the project manager do to avoid repetition of this issue in the new project?",
      "explanation": "Correct answer: build a common understanding among stakeholders about the key outputs outlined in the approved project charter.\n\n- Why?\nTo create a clear collective agreement that reduces differences and differences in understanding among stakeholders, promoting participation and consensus.\n\n- Why are other options wrong?\n- Allowing any stakeholder to join the Change Control Board (CCB) without controls may increase complexity and not solve the underlying problem.\n- Including all stakeholders in the assigning responsibilities matrix does not guarantee their compatibility or effective participation.\n- Integrating all requirements into the workflow structure without unifying the vision may lead to complexities and conflict of objectives.",
      "choices": [
        {
          "text": "Allow any stakeholder to join the change control board (CCB) at any time in the project.",
          "correct": false
        },
        {
          "text": "Include all stakeholders in the responsibility assignment matrix (RAM) for acceptance of the deliverables.",
          "correct": false
        },
        {
          "text": "Gather all the requirements provided by every individual stakeholder and include in the work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Build a common understanding among stakeholders about key deliverables described in the approved project charter.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new project has high uncertainty in the cost required for completion. What approach should the project manager use to determine the expected costs?",
      "explanation": "Correct answer: Estimate in three points.\n\n- Why?\nThis approach incorporates optimistic, pessimistic, and more likely estimates, reflecting uncertainty and giving a more accurate estimate.\n\n- Why are other options wrong?\n- Standard estimation is based on previous projects that may not reflect current uncertainty.\n- Statistical techniques require large historical data and may not be appropriate in this case.\n- Parametric estimation is based on precisely defined factors and is not ideal in high uncertainties.",
      "choices": [
        {
          "text": "Analogous estimating",
          "correct": false
        },
        {
          "text": "Statistical techniques estimating",
          "correct": false
        },
        {
          "text": "Parametric estimating",
          "correct": false
        },
        {
          "text": "Three-point estimating",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "All quality controls have passed, and a project deliverable is ready to be released to the customer. However, a change request to add new quality criteria has been approved.\n\nWhat should the project manager do first?",
      "explanation": "Correct answer: Stop delivering output to client.\n\n- Why?\nBecause after approving a change request that adds new quality standards, delivery must be discontinued to ensure that the output meets the new standards before submission.\n\n- Why are other options wrong?\n- Update the project management plan as a later step after stopping delivery and ensuring that the change is implemented.\n- Using the new standards only for future outputs may result in the delivery of outputs that do not conform to the current standards.\n- Updating the risk register does not directly address the case of interruption of delivery due to the change.",
      "choices": [
        {
          "text": "Update the project management plan.",
          "correct": false
        },
        {
          "text": "Stop the release of the deliverable to the customer.",
          "correct": true
        },
        {
          "text": "Use the new quality criteria for future deliverables.",
          "correct": false
        },
        {
          "text": "Update the risk register.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a group activity to identify an input to the Plan Procurement Management process, some participants disagree with the ranking of compliance-related items. What tool or technique should the project manager use to resolve this?",
      "explanation": "Correct answer: nominal set technology.\n\n- Why?\nThis technique helps to collect participants' opinions in an organized manner and evaluate them to reach consensus, especially in cases of disagreement.\n\n- Why are other options wrong?\n- The convergence diagram helps in accumulating ideas but does not guarantee a specific order or priority in case of disagreement.\n- Multi-criteria decision analysis is used to evaluate options based on specific criteria and not to resolve differences in the order of elements.\n- Brainstorming is used to generate ideas and not to resolve differences or ranking.",
      "choices": [
        {
          "text": "Affinity diagram",
          "correct": false
        },
        {
          "text": "Multicriteria decision analysis",
          "correct": false
        },
        {
          "text": "Nominal group technique",
          "correct": true
        },
        {
          "text": "Brainstorming",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A multinational company is locally developing a digital product using a new technology platform. The only expert on this platform is located in the company's headquarters, and they are responsible for providing support to different countries.\n\nHow can the local project manager ensure the involvement of this expert?",
      "explanation": "Correct answer: Insert the expert into the team using a virtual environment.\n\n- Why?\nTo ensure the expert's active participation despite its geographic distance, it can be integrated into the team through a virtual environment that provides a continuous and participatory means of communication.\n\n- Why are other options wrong?\n- Design an expensive and impractical travel schedule for ongoing support.\n- Requesting the appointment of the expert as a permanent member may not be possible due to his many responsibilities.\n- Communication as needed may lead to delays in support and affect the progress of the project.",
      "choices": [
        {
          "text": "Design a travel schedule so that timely, onsite assistance can be provided.",
          "correct": false
        },
        {
          "text": "Include the expert on the team using a virtual environment.",
          "correct": true
        },
        {
          "text": "Ask the project sponsor to assign the expert as a full-time member of the team.",
          "correct": false
        },
        {
          "text": "Ask team members to contact the expert as an external expertise source on an as-needed basis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During project closure, the project manager finds it difficult to obtain successful project completion feedback. Some stakeholders disagree with the project's success criteria and have been frustrated with the project from the beginning.\n\nTo what should the project manager refer to address these concerns?",
      "explanation": "Correct answer: Project charter.\n\n- Why?\nProject charter is the document that sets out the criteria for project success and stakeholder expectations, and therefore must be reverted to address stakeholder differences or concerns.\n\n- Why are other options wrong?\n-  The quality management plan focuses on product quality and not the overall success assessment.\n- The project scope statement defines the components of the work but does not address the agreed success criteria.\n- The requirements documents define functions and requirements, but do not cover stakeholder approvals or success criteria.",
      "choices": [
        {
          "text": "Project charter",
          "correct": true
        },
        {
          "text": "Quality management plan",
          "correct": false
        },
        {
          "text": "Scope statement",
          "correct": false
        },
        {
          "text": "Requirements documentation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An impact assessment reveals that a deliverable could be delayed by two weeks. A key resource has not been available to work on a non-critical activity due to other priorities. This could cause work overload on the other remaining resources.\n\nSince cost is a major constraint for this project, what should the project manager do immediately?",
      "explanation": "Correct answer: Determine whether the task has a float that allows the project end date to be achieved.\n\n- Why?\nSince the cost is restricted, assigning additional resources or changing the calendar may raise costs. Therefore, it is best to first determine whether the delay can be accommodated within an available time margin without affecting the delivery date.\n\n- Why are other options wrong?\n- Hiring a temporary resource may increase the cost.\n- Reducing the scope may require renegotiation with stakeholders.\n- Changing the resource calendar may lead to overloading and increased costs.",
      "choices": [
        {
          "text": "Determine if the task has available float to meet the project end date.",
          "correct": true
        },
        {
          "text": "Hire a temporary resource to do the job.",
          "correct": false
        },
        {
          "text": "Consult the team and reduce the scope.",
          "correct": false
        },
        {
          "text": "Change the resource calendar to avoid major delays.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An approved project charter stated that an agile approach must be used. During a lessons learned session, the client indicates that the team was unable to provide reliable cost estimates for the project, and that more time should be allocated to define the scope during the first iteration.\n\nWhat lesson should be captured in the lessons learned repository?",
      "explanation": "Correct answer: The client must be introduced in advance to the agile methodology to understand the costing process.\n\n- Why?\nCost estimates in an Agile environment are different from traditional models, so it's important to educate the customer about the business style to avoid unrealistic expectations.\n\n- Why are other options wrong?\n- Rejecting the use of  Agile is impractical if the project is defined by this methodology.\n- Allocating time to define the scope is important but not the basic lesson written here.\n- Including the client in daily meetings may not directly solve the costing problem.",
      "choices": [
        {
          "text": "The client should be exposed to the agile approach in advance to understand the cost estimating process.",
          "correct": true
        },
        {
          "text": "The agile approach should not be used if the client requires reliable cost estimates.",
          "correct": false
        },
        {
          "text": "During the first iteration of a project, time should be allocated to define the scope and ensure that reliable cost estimates are performed.",
          "correct": false
        },
        {
          "text": "Client communications should be included in the daily standups.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A senior manager informs a project manager that the project is not performing as well as other projects. What can the project manager use to improve performance for the next series of iterations?",
      "explanation": "Correct answer: Retrospective review.\n\n- Why?\nRetrospective session allows the team to review performance, identify problems, and develop plans to improve performance in future iterations.\n\n- Why are other options wrong?\n-  Business list analysis focuses on setting priorities and not improving overall performance.\n- Team building and team motivation are important but do not provide a structured review to improve performance as a retrospective review does.",
      "choices": [
        {
          "text": "Retrospective session",
          "correct": true
        },
        {
          "text": "Backlog analysis",
          "correct": false
        },
        {
          "text": "Team building",
          "correct": false
        },
        {
          "text": "Team motivation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is kicking off a new hybrid project to be in compliance with new government regulations. The team has established a reliable velocity of 40 story points per iteration. Every iteration lasts 2 weeks. The sponsor wants to know when the project will be done if there are 800 story points remaining.",
      "explanation": "Correct answer: 10 months.\n\n- Why?\nTo calculate the time required to finish 800 story points at 40 points per iteration, divide 800  40 = 20 repetitions.\nEvery repetition is 2 weeks, 20  2 = 40 weeks.\nSince a month has about 4 weeks, 40  4 = 10 months.\n\n- Why are the other options wrong?\n- 4 hours, 8 weeks, and 40 days do not match the calculation of the working speed and duration of the iteration.",
      "choices": [
        {
          "text": "4 hours",
          "correct": false
        },
        {
          "text": "8 weeks",
          "correct": false
        },
        {
          "text": "40 days",
          "correct": false
        },
        {
          "text": "10 months",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is on a mega industrial project. The project team is distributed throughout six different countries and time zones. During a review meeting, it was noticed that important baselined milestone dates were missed.\n\nWhat is the most likely reason for the missed deadlines?",
      "explanation": "Correct answer: miscommunication within the team.\n\n- Why?\nA team distributed in different time zones faces coordination and communication challenges, which can lead to delays in milestones and effective coordination.\n\n- Why are other options wrong?\n- Lack of commitment and support may have an impact, but it is not the most likely cause with a distributed team.\n- Misunderstanding stakeholder expectations and high expectations do not necessarily lead to delayed deadlines in the same way that poor communication does.",
      "choices": [
        {
          "text": "Lack of buy-in commitment",
          "correct": false
        },
        {
          "text": "Poor team communication",
          "correct": true
        },
        {
          "text": "Misunderstanding stakeholder expectations",
          "correct": false
        },
        {
          "text": "Stakeholders' expectation is set too high",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager was just given a new project to handle. She is working on the project documents and, after reading the Project Charter, is compiling the risks as she sees them. Once she completes the list, when should it be reviewed?",
      "explanation": "Correct answer: regularly and throughout the duration of the project.\n\n- Why?\nRisks change and evolve during the project lifecycle, so they must be reviewed and updated continuously to ensure they are dealt with effectively.\n\n- Why are other options wrong?\n- Reviewing risks only at certain points such as project start-up or weekly meetings is insufficient to maintain effective risk management throughout the project.",
      "choices": [
        {
          "text": "When starting the project and as each risk is closed.",
          "correct": false
        },
        {
          "text": "While organizing, preparing, and carrying out the work.",
          "correct": false
        },
        {
          "text": "During weekly meetings as new risks are identified and added.",
          "correct": false
        },
        {
          "text": "Regularly and throughout the project.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an agile development environment, when should a risk analysis be performed?",
      "explanation": "Correct answer: before the start of each iteration.\n\n- why?\n\n the agile methodology, risk is continuously and repeatedly evaluated and analyzed before each iteration to identify and mitigate potential risks that may affect achievement in that iteration.\n\n- Why are other options wrong?\n- During a daily standing meeting focuses on daily progress and not necessarily on deep risk analysis.\n-  The review meeting (retrospective) aims to review the work done and improve processes, but it is not the optimal time to proactively analyze risks.\n- After each SCRUM  meeting there is no meeting with this name, and the well-known meetings are planning, standing, reviewing, and returning.",
      "choices": [
        {
          "text": "Before the start of each iteration",
          "correct": true
        },
        {
          "text": "During the daily standup meeting",
          "correct": false
        },
        {
          "text": "In the retrospective meeting",
          "correct": false
        },
        {
          "text": "After every scrum meeting",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has noticed apparent interpersonal conflict between some team members during the initiation of a project. When should the project manager address this problem?",
      "explanation": "Correct answer: as soon as possible to prevent the conflict from escalating later during the project.\n\n- Why?\nPersonal problems affect team performance and may worsen if not dealt with early, which can harm the work atmosphere and project progress.\n\n- Why are other options wrong?\n- Remembering before each meeting does not address the root problem.\n- Determining who is right may increase the conflict.\n- Waiting until the end of the project may worsen the atmosphere and exacerbate the problem.",
      "choices": [
        {
          "text": "At the earliest time possible to prevent the conflict from escalating later in the project",
          "correct": true
        },
        {
          "text": "Prior to every meeting by reminding the project team to be respectful with each other",
          "correct": false
        },
        {
          "text": "Directly after an outburst or dispute between members to determine which member is right",
          "correct": false
        },
        {
          "text": "At the end of the project to let the conflict de-escalate and record it in the lessons learned",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A newly-hired project manager is running a project for the first time and is worried about rising tensions. Project team members are arguing during an effort-intensive phase and stakeholders have voiced some doubts about the project's performance. In a discussion with a senior project manager, the new project manager admits that they have a fear of conflict and asks the senior project manager how they perceive conflict.\n\nHow should the senior project manager respond?",
      "explanation": "Correct answer: \"Conflict in projects is inevitable - focus on managing it.\"\n\n- Why?\nConflict is a natural and expected part of working in project teams, especially during high-pressure or complex phases. The key is not to avoid conflict, but to manage it constructively to maintain productivity and team cohesion.\n\n- Why the other options are incorrect:\n- \"Conflict in projects is preventable\" underestimates how common and natural disagreements are in team environments.\n- \"Conflict in projects is disastrous\" reflects an overly negative and counterproductive view that discourages proactive problem-solving.\n- \"Conflict in projects is healthy - refrain from interfering\" risks neglecting real issues that require mediation or guidance, which can escalate tensions and reduce performance.",
      "choices": [
        {
          "text": "Conflict in projects is inevitable - focus on managing it.",
          "correct": true
        },
        {
          "text": "Conflict in projects is preventable - replan the mitigation.",
          "correct": false
        },
        {
          "text": "Conflict in projects is disastrous - prepare a recovery plan.",
          "correct": false
        },
        {
          "text": "Conflict in projects is healthy - refrain from interfering.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team is working on a complex and fast-changing new product development project. After a recent process evaluation, the team decides to add an agile toolkit to the predictive approach they are using. This addition is intended to improve the overall project delivery, success, and productivity.\n\nWhich of the following describes how this change is intended to add value to the overall delivery, success, and productivity?",
      "explanation": "Correct answer: Use agile tools to leverage the ability of agile methodologies to respond effectively to change, while maintaining the advantages of a predictive approach to project management.\n\n- Why?\nThe hybrid approach integrates the advantages of the two approaches to provide greater flexibility in handling changes without losing organization and careful planning of the predictive approach.\n\n- Why are other options wrong?\n- Replacing all predictive methods may cause the loss of some essential features of control and planning.\n- Comparing agiles with a predictive approach does not provide immediate value to the ongoing project.\n- Allowing the team to choose between methods may cause business conflicts and lack of clarity in operations.",
      "choices": [
        {
          "text": "Use the agile toolkit to leverage the ability of agile methods to respond effectively to change, while maintaining the benefits of a predictive approach to project management.",
          "correct": true
        },
        {
          "text": "Use the agile toolkit to replace all predictive methods with new agile methods, and by doing so, reduce poor productivity.",
          "correct": false
        },
        {
          "text": "Use the agile toolkit to compare agile against predictive methods, then choose the best approach for future projects.",
          "correct": false
        },
        {
          "text": "Use the agile toolkit and ask team members to choose between agile and predictive methods so that they will work more effectively and productively.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager engaged in the delivery of a global project is in the process of recruiting a project team. After the team is formed, what should the project manager do?",
      "explanation": "Correct answer: Send a welcome mail and host an introductory event for the team so that members get to know each other.\n\n- Why?\nThis step promotes building relationships and communication between team members, which helps establish a positive work environment from the beginning.\n\n- Why are other options wrong?\n- Sending the project plan and charter is important but not the first step after forming the team.\n- Holding a meeting to discuss concerns about requirements is a next step after building trust between the team.\n- Sending a questionnaire and communicating via email is less effective in building direct personal interaction.",
      "choices": [
        {
          "text": "Send a welcome email and host a team introductory event with the team members so they get to know each other.",
          "correct": true
        },
        {
          "text": "Send a project management plan and charter to team members to familiarize them with project goals and procedures.",
          "correct": false
        },
        {
          "text": "Arrange a meeting for team members to discuss any concerns regarding requirements and project scope.",
          "correct": false
        },
        {
          "text": "Send the team members a survey to learn more about each member, share the results via email.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At which stage in the Tuckman team development model should the project manager put the most focus on increasing team motivation?",
      "explanation": "Correct answer: Forming.\n\n- Why?\nAt this stage, the team begins to get acquainted and build trust, and motivating members helps to establish team spirit and orientation towards the goal.\n\n- Why are other options wrong?\n-  Storming is  a stage of conflict and challenges, but it is not the primary time for motivation.\n-  Regulation  is a stage of stability and improvement of relationships.\n-  Performing is an effective implementation phase where motivation is less needed because it is already high.",
      "choices": [
        {
          "text": "Forming",
          "correct": true
        },
        {
          "text": "Storming",
          "correct": false
        },
        {
          "text": "Norming",
          "correct": false
        },
        {
          "text": "Performing",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An executive stakeholder has crucial decision power on the execution and success of a project. How should this stakeholder's importance be reflected in the stakeholder engagement plan?",
      "explanation": "Correct answer: Describe the level of support of the executive, his expectations, risk limits, and communication methods appropriate to the different needs of the project.\n\n- Why?\nBecause this method ensures that the real role of the executive is accurately defined, with his expectations clarified and supported, facilitating relationship management and effective communication.\n\n- Why are other options wrong?\n-  The executive ranking in the organizational chart does not reflect his actual impact on the project.\n- Classifying him as a supporter with updated contact information is not sufficient to clarify his role and impact.\n- The description of his previous participation may not accurately reflect the current situation and does not specify appropriate communication methods.",
      "choices": [
        {
          "text": "Describe the executive's support level, expectations, risk threshold, and appropriate communications for various project needs.",
          "correct": true
        },
        {
          "text": "Rank the executive in an organizational chart and illustrate any affinities or hostilities with other stakeholders.",
          "correct": false
        },
        {
          "text": "Label the executive as \"supportive\" and ensure that email, phone numbers, and absence/vacation times are up to date.",
          "correct": false
        },
        {
          "text": "Describe the executive's involvement in similar past projects in order to decide the appropriate engagement level on a case-by-case basis.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A new graduate recently joined a mature agile R& D team. A mentor, assigned to work with the graduate, is overwhelmed by the extra workload. Team performance and motivation are dropping.\n\nHow can the project manager help with this situation?",
      "explanation": "The correct answer: maintain a non-intrusive leadership style with the team, but use a transactional leadership style to give clear directions to the graduate.\n\n- Why?\nThe transactional method allows the graduate to be clearly guided without excessive interference with the work of the mature team, which reduces the burden on the mentor and maintains the team's performance.\n\n- Why are other options wrong?\n- Service leadership style may increase the burden on the mentor.\n- Canceling the mentoring plan may negatively affect graduate development.\n- Requesting additional participation from the team may strain other team members and affect performance.",
      "choices": [
        {
          "text": "Maintain a laissez-faire leadership style with the team, but use a transactional style to give firm guidance to the graduate.",
          "correct": true
        },
        {
          "text": "Ask the mentor to use a collaborative servant leader approach to perform the usual duties along with the mentor role.",
          "correct": false
        },
        {
          "text": "Cancel the mentor plan and focus on keeping the graduate motivated by learning through an intensive immersion.",
          "correct": false
        },
        {
          "text": "Ask three more team members to share the mentor role in order to reduce the individual mentor workload by 75%.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Some team members assigned to a new technology project expressed their lack of knowledge about the technology and the challenges they will face during implementation. What should the project manager do?",
      "explanation": "The correct answer: reassure team members that there is a training path set up to learn the new technology.\n\n- Why?\nProviding training is the optimal support to enhance team skills and enable them to deal with technical challenges, maintaining business continuity and quality.\n\n- Why are other options wrong?\n- Replacement may cause delays and increase cost.\n- Relying solely on self-learning may not be sufficient or effective.\n- Redistribution may lead to misuse of resources and underutilization of team skills.",
      "choices": [
        {
          "text": "Due to the project due dates, replace the members with more knowledgeable staff.",
          "correct": false
        },
        {
          "text": "Ask the team members to do some research and self-learning efforts about the technology.",
          "correct": false
        },
        {
          "text": "Reallocate the members to work on and complete different tasks for which they have experience.",
          "correct": false
        },
        {
          "text": "Reassure the team members that a training path is in place to learn the new technology.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A pharmaceutical project in the initiation phase is likely to be impacted by new market regulations. Which stakeholder categories should the project manager assign to the relevant regulatory body?",
      "explanation": "Correct answer: external with high authority/impact.\n\n- Why?\nRegulator is a third party that has significant authority and influence over the progress of the project through regulations and legislation, so it should be classified as such.\n\n- Why are other options wrong?\n- Internal actors are not involved here.\n- Actors with resistance or opposition support do not apply to regulators with high authority and influence.",
      "choices": [
        {
          "text": "External with high power/influence",
          "correct": true
        },
        {
          "text": "Internal with high power/influence",
          "correct": false
        },
        {
          "text": "Internal with antagonist/resistant support level",
          "correct": false
        },
        {
          "text": "External with antagonist/resistant support level",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team member approaches the project manager immediately after the end of the project meeting about his need for help to complete a late-due-date task.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Discuss the problem during the daily meeting, and make the appropriate decision with the team.\n\n- Why?\nSharing the problem with the team in the daily meeting ensures transparency and allows the manager and team members to collaborate to find the best solution in a collective and organized manner.\n\n- Why are other options wrong?\n- Ignoring the request may exacerbate delays and poor morale.\n- Reallocating the task individually without discussion may cause tensions and reduce collaboration.\n- Loading a beginner member with a task that may lead to poor quality and incomplete the task in time.",
      "choices": [
        {
          "text": "Ignore the team member's request, and ask for double the efforts to complete the task",
          "correct": false
        },
        {
          "text": "Discuss the issue during the daily meeting, and decide the course of action with the team",
          "correct": true
        },
        {
          "text": "Ask the team member to step out from the task and re-allocate the task to someone else",
          "correct": false
        },
        {
          "text": "Ask a junior team member to help in the completion of the task on the due date",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is faced with deciding on the next steps to take in order to address recently identified tasks schedule delays. The project manager expects team members to make the appropriate decisions for their separately assigned tasks and proceed to implement them.\n\nWhich type of leadership style is the project manager using in this instance?",
      "explanation": "Correct answer: Free rein).\n\n- Why?\nThis pattern allows the team the freedom to make decisions on how to carry out tasks, with minimal manager intervention, which enhances independence and responsibility.\n\n- Why are other options wrong?\n- Democratic involves sharing decisions with the manager effectively and not leaving the decision entirely to the team.\n- Authoritarian The manager controls all decisions and does not leave freedom to the team.\n- Compromise means avoiding conflict and is not a leadership style associated with decision-making.",
      "choices": [
        {
          "text": "Democratic",
          "correct": false
        },
        {
          "text": "Autocratic",
          "correct": false
        },
        {
          "text": "Free rein",
          "correct": true
        },
        {
          "text": "Smoothing",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is in the process of identifying the benefits associated with two projects in order to choose the one that will deliver more business value. The task involves analyzing which project best helps the company meet its compliance and regulatory requirements, as well as improve customer satisfaction.\n\nWhich of the following best describes the category of the benefits being analyzed in this task?",
      "explanation": "Correct answer: qualitative benefit.\n\n- Why?\nQualitative benefits relate to elements that are not easily measurable such as customer satisfaction, organizational compliance, and reputation improvement.\n\n- Why are other options wrong?\n- Quantitative interest focuses on accurately measurable financial figures and values.\n- Quality utility is not a common classification in interest analysis.\n- True interest is a term not used in this context.",
      "choices": [
        {
          "text": "Quantitative benefit",
          "correct": false
        },
        {
          "text": "Qualitative benefit",
          "correct": true
        },
        {
          "text": "Quality benefit",
          "correct": false
        },
        {
          "text": "Real benefit",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company is considering adopting the agile methodology for future projects. The project manager is leading a discussion focused on the benefits associated with the agile methodology.\n\nWhich of the following points should the project manager highlight?",
      "explanation": "The correct answer: transparency is key, early and reliable delivery, methodology embraces change.\n\n- Why?\nThese points reflect the core values of the agile methodology, which focuses on quickly adapting to change, continuously delivering value, and enhancing collaboration and transparency.\n\n- Why are other options wrong?\n-  The second option talks about predictive methodologies and not agile.\n-  The third option focuses on some general management principles and not the basic characteristics of agile.\n- The fourth option contains a mixture of inaccurate or incomplete ideas regarding agile.",
      "choices": [
        {
          "text": "Transparency is central, early and reliable delivery, methodology embraces change",
          "correct": true
        },
        {
          "text": "Product based method, divides projects into valuable phases, focuses on business justification",
          "correct": false
        },
        {
          "text": "Clear documentation exist, single point of responsibility, effective collaboration",
          "correct": false
        },
        {
          "text": "No overtime if possible, face-to-face contact and constantly looking back to move forward",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team just completed an environmental scan and have uncovered a lot of related hindrances that could potentially affect the project delivery negatively. The project manager is working with the team to understand the details of each identified hindrance and how the hindrances relate to each other, in order to understand the overall complexity of the project. This will enable the team to arrive at a plan that addresses the challenges identified.\n\nWhich of the following techniques has the project manager used in this instance?",
      "explanation": "The correct answer: Systems Thinking.\n\n- Why?\nSystems thinking is a method of understanding the interrelationships between the components of a system or a project as a whole, and helps to recognize how different factors affect each other to understand the complexity of the project.\n\n- Why are other options wrong?\n- Pareto analysis focuses on identifying the most influential causes based on the 80/20 principle.\n- Critical analysis focuses on identifying the critical path in the project schedule.\n- Total quality management is a methodology that focuses on improving quality in processes, not a system complexity analysis technique.",
      "choices": [
        {
          "text": "Pareto analysis",
          "correct": false
        },
        {
          "text": "Critical analysis",
          "correct": false
        },
        {
          "text": "Systems thinking",
          "correct": true
        },
        {
          "text": "Total quality management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What interpersonal skills do project managers or teams need to monitor stakeholder relationships, evaluate engagement strategies, and modify these approaches as needed?",
      "explanation": "The correct answer: active listening, leadership, cultural and political awareness.\n\n- Why?\nThese skills help the project manager better understand stakeholders, deal with cultural and political diversity, and guide the team effectively.\n\n- Why are other choices wrong?\n- Coaching and decision-making are important but do not include directly monitoring stakeholder relationships.\n- Team building and networks are important skills but not focused on evaluating and modifying engagement strategies.\n- Building relationships, influence, and cultural awareness are important, but active listening and leadership complement the picture better.",
      "choices": [
        {
          "text": "Active listening, leadership, and cultural and political awareness",
          "correct": true
        },
        {
          "text": "Coaching, decision-making, and cultural and political awareness",
          "correct": false
        },
        {
          "text": "Active listening, team building, leadership, and networking",
          "correct": false
        },
        {
          "text": "Networking, influencing, and cultural awareness",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "When managing a strategic project for their organization, what four tools should a project manager use for risk analysis? (Choose four)",
      "explanation": "The correct answer includes: brainstorming, screening, risk checklists, and interviewing.\n\n- Brainstorming: to generate potential risk ideas from the project team and stakeholders.\n- Screening: Review documents and records to find past or potential risks.\n- Risk checklists: Use pre-made lists to review known risks.\n- Interviewing: Gathering risk information from experts or stakeholders.\n\n- Incorrect options:\n- Product evaluation is not a tool for risk analysis.\n- Decision tree analysis is used for decision-making and not for basic risk analysis.",
      "choices": [
        {
          "text": "Brainstorming",
          "correct": true
        },
        {
          "text": "Inspection",
          "correct": true
        },
        {
          "text": "Risk checklists",
          "correct": true
        },
        {
          "text": "Product evaluation",
          "correct": false
        },
        {
          "text": "Interviewing",
          "correct": true
        },
        {
          "text": "Decision tree analysis",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "The project team members are dispersed across different countries. Suddenly, travel restrictions do not allow team members to collocate.\n\nWhen analyzing project risks, which risk analysis tools should the project manager use? (Choose two).",
      "explanation": "Correct answer: Risk checklist and meetings.\n\n-  A risk checklist helps ensure that all previously known risks are reviewed regardless of where the team is.\n- Meetings (even if they are virtual) are important for gathering information and discussing risks with the distributed team.\n\n- Other options are not suitable:\n-  A context chart helps to understand the system and is not a direct risk analysis tool.\n- Data representation and charting techniques are used for other purposes such as statistical analysis and tabulation.",
      "choices": [
        {
          "text": "Risk checklist",
          "correct": true
        },
        {
          "text": "Context diagram",
          "correct": false
        },
        {
          "text": "Meetings",
          "correct": true
        },
        {
          "text": "Data representation",
          "correct": false
        },
        {
          "text": "Diagramming techniques",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During a team meeting, team members asked the project manager to advise them on project dependencies. What should the project manager ask the team to do for internal dependencies?",
      "explanation": "The correct answer is for them to familiarize themselves with the latest organizational changes.\n\n- Internal dependencies relate to factors and processes within the organization that affect the project, such as organizational changes.\n- Other options such as merging with a competing organization, updating an Internet provider, or working from home policy are often external or not directly related to the internal dependencies of the project.",
      "choices": [
        {
          "text": "Become familiar with the latest organizational changes.",
          "correct": true
        },
        {
          "text": "Read about the merger with a competing organization.",
          "correct": false
        },
        {
          "text": "Check the changes related to the work-from-home policy.",
          "correct": false
        },
        {
          "text": "Become familiar with the upgrade of the Internet provider.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is working on a complex project. The project includes many stakeholders with conflicting priorities.\n\nWhich two actions should the project manager take to be prepared for negotiations and gain support from all of the stakeholders? (Choose two)",
      "explanation": "The right answers are to understand the policy and personal interests of stakeholders, and to develop a good communication management plan.\n\n- Understanding policy and interests helps the project manager to identify the motivations and expectations of stakeholders, which facilitates negotiation.\n- Good communication management ensures effective communication delivery and consensus among stakeholders.\n- Other options such as allocating a reserve margin, developing a relationship with the project team or risk management are not straightforward procedures for negotiations with stakeholders.",
      "choices": [
        {
          "text": "Allow enough contingency to cope with scope changes.",
          "correct": false
        },
        {
          "text": "Develop a good relationship with the project team.",
          "correct": false
        },
        {
          "text": "Understand the politics and personal interests of the stakeholders.",
          "correct": true
        },
        {
          "text": "Develop a good communications management plan.",
          "correct": true
        },
        {
          "text": "Develop a good risk management plan.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is working on a complex project that has high interest from senior management. There are many stakeholders with competing priorities, which requires significant negotiation skills to overcome rising conflicts.\n\nWhich two principles should the project manager follow when developing the negotiation strategy? (Choose two).",
      "explanation": "The two correct answers are: separating people from the problem, and focusing on interests, not situations.\n\n- Separating people from the problem helps avoid emotional escalation and the dialogue focuses on solving the problem rather than personal conflict.\n- Focusing on interests rather than situations facilitates reaching solutions that satisfy all parties and reduce conflicts.\n- Focusing on political issues, management priorities, or delegation of decisions are not effective basic principles in negotiating in the context of multiple conflicts.",
      "choices": [
        {
          "text": "Separate the people from the problem.",
          "correct": true
        },
        {
          "text": "Focus on political issues first.",
          "correct": false
        },
        {
          "text": "Focus on management priorities.",
          "correct": false
        },
        {
          "text": "Focus on interests, not positions.",
          "correct": true
        },
        {
          "text": "Delegate the decisions to the team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project with many stakeholders that have conflicting priorities. Senior management asked the project manager to avoid \"noise\" because this is a highly political project. The project manager opted to use expert opinion from well known industry profiles.\n\nWhat did the project manager do to satisfy senior management's request?",
      "explanation": "The correct answer is: take action based on the authority of senior management.\n\n- Using eminent expert opinions reflects a clear response based on senior management authority to minimize conflicts and control the project.\n- Other options such as friendly response, consistency of words, or cooperation are general behaviors but do not reflect specific actions that clearly meet the request of senior management.",
      "choices": [
        {
          "text": "Responded in a friendly manner to senior management",
          "correct": false
        },
        {
          "text": "Appeared to be consistent in the use of words and actions",
          "correct": false
        },
        {
          "text": "Cooperated with senior management to achieve mutual goals",
          "correct": false
        },
        {
          "text": "Took action based on the senior management's power to act",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex, political project with many stakeholders having conflicting priorities. Senior management asked the project manager to ensure that there was no \"noise\" regarding the project. During a stakeholder meeting, the project manager asked a series of questions to confirm acceptance for each deliverable before asking for acceptance of the whole project.\n\nWhat did the project manager do to satisfy stakeholders?",
      "explanation": "Correct answer: \"Acted in a manner that was consistent in the use of words and actions\".\n\n- Reason:\nActing consistently between words and actions builds stakeholder trust and credibility. It reduces misunderstandings and ensures alignment, which is critical in politically sensitive environments.\n\n- Why other options are incorrect:\n- \"Responded to positive actions of the stakeholders to reward actions\" may build goodwill but doesnt directly relate to delivering on commitments.\n- \"Engaged with stakeholders by cooperating toward mutual goals\" is valuable but is not the primary behavior described in the scenario.\n- \"Acted based on the power authorized by senior management\" may create resistance and increase stakeholder dissatisfaction in a political context.",
      "choices": [
        {
          "text": "Responded to positive actions of the stakeholders to reward actions",
          "correct": false
        },
        {
          "text": "Acted in a manner that was consistent in the use of words and actions",
          "correct": true
        },
        {
          "text": "Engaged with stakeholders by cooperating toward mutual goals",
          "correct": false
        },
        {
          "text": "Acted based on the power authorized by senior management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working with a team to develop work packages. The project manager noticed a gap in the requirements gathering where important points were missing, which would impact the project timeline.\n\nWhat should the project manager do?",
      "explanation": "The correct answer is \"Meeting with the product manager to create a list of missing requirements in the task book\".\n\n- Reason: Coordination with the product manager helps complete the missing requirements to ensure the completeness of the scope and avoid delays.\n- Why other options are wrong:\n - Meeting with the sponsor to discuss the cancellation of the project is an early and impractical act.\n - Requesting a budget increase is not the best solution without clear analysis.\n - Impact assessment and updating of the risk profile is important, but the missing requirements must first be accurately identified.",
      "choices": [
        {
          "text": "Meet with the project sponsor to discuss canceling the project.",
          "correct": false
        },
        {
          "text": "Meet with the project sponsor and stakeholders to request a budget increase.",
          "correct": false
        },
        {
          "text": "Meet with the product manager to create a backlog with the missing requirements.",
          "correct": true
        },
        {
          "text": "Evaluate the impact, update the risk register, and present it to the stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager planning a strategic predictive project has suddenly fallen ill. The project baseline must be submitted to the customer within 3 days, and the project management office (PMO) director must find someone to finish the planning. The choices are:\n\nProject manager A: highly experienced in Scrum projects only, available immediately for 2 days only\n\nProject manager B: moderately experienced mainly in construction projects, available the next day for 1 week\n\nWhich project manager should the PMO director choose and on what basis?",
      "explanation": "The correct answer is \"B better understands the complexities of predictive planning and has a network of subject matter experts\".\n\n- Reason: The project requires expertise in predictive planning and not agile (Scrum). Although B is not immediately available, his experience and activities in (predictive) construction projects make him the most suitable choice to complete planning correctly.\n- Why other options are wrong:\n - A is immediately available but his expertise in Scrum only is not suitable for the predictive project.\n - Focusing on the latest trends does not replace the appropriate experience.\n -  B availability is longer but is not the main reason for selection.",
      "choices": [
        {
          "text": "A is available immediately and has more experience to plan quickly and correctly.",
          "correct": false
        },
        {
          "text": "B better understands the complexities of predictive planning and has use of a network of subject matter experts (SMEs).",
          "correct": true
        },
        {
          "text": "A is more up to date and conversant with the latest project planning trends and methodologies.",
          "correct": false
        },
        {
          "text": "B will be available to work for a longer period in case the submission deadline is missed.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a project that is vital to their organization and the local environmental and energy authority. During a team meeting to discuss project risks , the team raised a high risk that an important senior manager is not currently involved with project.\n\nWhat should the project manager do to mitigate this risk?",
      "explanation": "The correct answer is \"Escalate this risk to senior management\".\n\n- Reason: The absence of an important senior manager from the project is a vital risk and needs the intervention of senior management to ensure participation and support.\n- Why other options are wrong:\n - Regular status reports are important but do not solve the problem of the absence of a senior manager.\n -  A detailed management plan that does not address the absence of key support.\n - Inviting the manager to daily meetings may not be practical or sufficient without administrative support.",
      "choices": [
        {
          "text": "Implement regular status reporting.",
          "correct": false
        },
        {
          "text": "Escalate this risk to senior management.",
          "correct": true
        },
        {
          "text": "Develop a highly detailed project management plan",
          "correct": false
        },
        {
          "text": "Invite the senior manager to daily project meetings.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An educational institution raises a complaint after placing an order for a software module from a company using agile practices. The complaint claims that billing for payment of a partial delivery violates the Agile Manifesto if the customer was not involved in progress meetings.\n\nThe customer's claim is supported by which of the Four Values of the Agile Manifesto?",
      "explanation": "The correct answer is \"Collaborating with the client more than negotiating the contract\".\n\n- Reason:\nThe complaint is related to not involving the client in progressive meetings, which indicates poor cooperation and communication, which is one of the core values in the Agile statement.\n- Why other options are wrong:\n - Operations that maintain a constant pace are not related to the complaint.\n - Recurring software delivery is correct but not related to customer participation.\n - Software operating as a key measure of progress does not address the issue of collaboration with the client.",
      "choices": [
        {
          "text": "Processes maintaining a constant pace indefinitely",
          "correct": false
        },
        {
          "text": "Software delivery frequently and in short periods",
          "correct": false
        },
        {
          "text": "Customer collaboration over contract negotiation",
          "correct": true
        },
        {
          "text": "Working software as a primary measure of progress",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has engaged the sponsor and discussed concerns regarding noncompliance. The project manager understands that this could be a potential audit situation.\n\nWhat should the project manager do?",
      "explanation": "The correct answer is to disclose the source of the problem to the auditors and leave the decision to them.\n\n- Reason:\nTransparency and compliance are essential in project management, and the competent authorities must be informed to follow the required procedures.\n- Why are other options wrong:\n - Not doing anything that might exacerbate the problem.\n - Detach an incompatible partition does not address the root problem.\n - Obtaining driver's approval for non-compliance is contrary to professional standards and ethics.",
      "choices": [
        {
          "text": "Do nothing and continue to work as before, assuming there will be an audit.",
          "correct": false
        },
        {
          "text": "Disengage the noncompliant department, as this is problematic.",
          "correct": false
        },
        {
          "text": "Disclose the source of the problem to the auditors and let them decide.",
          "correct": true
        },
        {
          "text": "Gain the commitment and approval from leadership on noncompliance.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is working on determining the dependencies for activities for an ongoing project. What action should the project team take first to manage dependencies successfully?",
      "explanation": "Correct answer: \"Evaluation and documentation of dependencies\".\n\n- Detailed explanation:\nIdentifying dependencies between activities is the first and essential step in managing the project schedule. Without knowledge and evaluation of dependencies, it becomes impossible to monitor or control their impact on the progress of the project.\n- After evaluation, the team documents these dependencies accurately in the project plan or agenda to be a clear reference for everyone.\n- These documents allow dependencies to be monitored and tracked later, helping to identify potential delays and take action.\n\n- Why other options are wrong:\n - Monitoring and tracking dependencies is important but comes after they have been identified and documented.\n - Sponsor reporting does not solve the underlying problem, it is a subsequent step to communication.\n - Assigning planners to each task is not necessary before understanding dependencies accurately.",
      "choices": [
        {
          "text": "Monitor and track the dependencies.",
          "correct": false
        },
        {
          "text": "Communicate the dependencies to the sponsor.",
          "correct": false
        },
        {
          "text": "Assess and document the dependencies.",
          "correct": true
        },
        {
          "text": "Appoint project schedulers for all tasks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project vendor has informed a project manager that an outsourced project deliverable will be available 6 months later than the agreed project schedule. The vendor stated that they are focusing on other project deliverables with priority dependencies, and this particular deliverable had no stated dependencies.\n\nWhat should the project manager do to avoid schedule delays in future?",
      "explanation": "Correct answer: \"Identify any dependencies if any\".\n\n- Detailed explanation:\n\n this case, the vendor indicates that there are undocumented dependencies that affect priorities, indicating a weakness in the process of identifying dependencies.\n-  The project manager must accurately identify and document all dependencies in the project plan and task schedule.\n- This allows for better management of the project chronology, and avoids sudden delays due to unknown dependencies.\n- Knowing the dependencies, the project manager can take proactive action to modify the schedule or resources.\n\n- Why other options are wrong:\n - Monitoring dependencies and responding to challenges without knowing them in advance will not be effective.\n - Ensuring that dependencies are of a certain type (e.g. from finish to start) is not the main solution, the most important thing is to identify them all.\n - Holding a meeting to inform the client does not address the root of the problem in the dependency management.",
      "choices": [
        {
          "text": "Monitor the dependencies and respond to challenges.",
          "correct": false
        },
        {
          "text": "Ensure that all new dependencies are finish to start",
          "correct": false
        },
        {
          "text": "Specify any dependencies if they exist.",
          "correct": true
        },
        {
          "text": "Conduct a meeting to inform the customer.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a new compliance project that is different from regular projects as it will involve multinational partners and several government departments. The project will result in the adoption of new standards and procedures.\n\nWhat must the project manager do from the onset?",
      "explanation": "Correct answer: \"Ensure that compliance guidelines are interpreted and verified\".\n\n- Detailed explanation:\n\ncompliance projects, especially those involving multiple entities and complex standards, it is essential that compliance guidelines are properly understood and interpreted from the outset to ensure that all parties comply with the requirements.\n- This prevents misunderstandings and delays in delivery resulting from the wrong application of standards.\n- Ensuring the correct interpretation of the guidelines helps verify that the project is proceeding in accordance with applicable regulations and laws.\n\n- Why other options are wrong:\n- Identifying and meeting business requirements is important, but not the priority, in a complex compliance project.\n - Availability of solution design from the outset may not be possible in compliance projects that require a thorough understanding of the standards first.\n- Effective project implementation and delivery depends on the correct interpretation of the guidelines first.",
      "choices": [
        {
          "text": "Ensure that the business requirements are defined and met",
          "correct": false
        },
        {
          "text": "Ensure solution design is available from the start of the project",
          "correct": false
        },
        {
          "text": "Ensure execution and handover are done effectively",
          "correct": false
        },
        {
          "text": "Ensure the interpretation of compliance guidance and validation",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "In two months, there will be a delivery of project machines from a factory. The project team is in the process of performing a follow-up meeting to review the commitments and dependencies regarding these machines.\n\nWhich actions should the project team take to ensure that the deliveries are properly performed by the factory? (Choose 2).",
      "explanation": "Correct answers: \"Ensure that all dependencies are regularly tracked, monitored, and reported\" and \"Determine when dependency is required and how long it will continue to be needed\".\n\n- Detailed explanation:\n- Tracing dependencies The team helps ensure that every item associated with the delivery process is monitored and handled appropriately, reducing the risk of delays or technical issues.\n- Determining the timing and duration of dependencies allows for better scheduling planning and ensuring that delivery will take place on time without conflict or lack of resources.\n\n- Why are other options wrong:\n - Sending an email just a week in advance may not be enough to ensure good coordination.\n - Scheduling a meeting to discuss how to manufacture machines is not necessary at the administrative level of the project team, but rather the responsibility of the manufacturer.\n - Talk to plant staff to find out their qualifications outside the responsibilities of the project manager and his team.",
      "choices": [
        {
          "text": "Ensure that they track and monitor all dependencies and report at regular intervals.",
          "correct": true
        },
        {
          "text": "Send an email to the research and development factory one week before delivery.",
          "correct": false
        },
        {
          "text": "Specify exactly when a dependency is required and for how long this requirement holds.",
          "correct": true
        },
        {
          "text": "Schedule a meeting with the factory regarding how the machine is going to be manufactured.",
          "correct": false
        },
        {
          "text": "Talk to the factory employees to ascertain if they are qualified to build the machines.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team recently experienced delays due to noncompliance which have made the project schedule less flexible and increased risk to cost and poor quality. The team is brainstorming about ways to avoid this in future.\n\nWhat is the most far-reaching implication for the organization if this noncompliance is not resolved?",
      "explanation": "Correct answer: \"Business survival and continuity\".\n\n- Detailed explanation:\nNoncompliance can lead to serious legal, regulatory, and operational consequences that may ultimately threaten the long-term survival and continuity of the organization.\n\n- Why other options are wrong:\n- \"Unhappy clients or end users\" is a real consequence, but typically short- to medium-term.\n- \"Slower response to system\" is a technical issue and not the most critical organizational impact.\n- \"Fines and penalties\" may increase costs but do not necessarily jeopardize the organization's existence.",
      "choices": [
        {
          "text": "Business survival and continuity",
          "correct": true
        },
        {
          "text": "Unhappy clients or end users",
          "correct": false
        },
        {
          "text": "Slower response to system",
          "correct": false
        },
        {
          "text": "Fines and penalties",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project team decides to document new aspects of a regulation as additional elements in the work breakdown structure (WBS). Which of the following are potential downsides to this approach? (Choose 2).",
      "explanation": "Correct answers: \"Requirements become more difficult to track at the project level\" and \"Some of these requirements may not be completed as part of the project itself\".\n\n- Detailed explanation:\n- Adding new organizational elements to the workload structure may lead to complexity and difficult tracking, because these elements may not be clear within the scope of the project.\n- Some organizational requirements may be outside the scope of the project, making it difficult to ensure their implementation within the project.\n\n- Why are the other options wrong:\n - Tracking optimization does not occur in this case due to additional complexity.\n - The fragmentation of new items requires time and effort, but it is not necessarily a substantial negative impact compared to other challenges.",
      "choices": [
        {
          "text": "Traceability improves but requirements will likely remain fragmented.",
          "correct": false
        },
        {
          "text": "Traceability of requirements becomes more difficult at the project level.",
          "correct": true
        },
        {
          "text": "Some of these requirements may not be completed as part of the project itself.",
          "correct": true
        },
        {
          "text": "Regulatory requirements are not necessarily tied to the scope of the project.",
          "correct": false
        },
        {
          "text": "Splitting the new items takes time and also requires effort to update the WBS.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager considers compliance to be part of the organization's process assets. The project team, however, has decided to include compliance as inputs to the relevant processes rather than document these rules as requirements.\n\nWhat is the project manager's compliance responsibility?",
      "explanation": "Correct answer: \"Acts as the coordinator of resources and activities\".\n\n- Explanation:\n  The project manager is responsible for coordinating activities and resources to ensure compliance within the project framework.\n- Why other options are wrong:\n - Conducting audits is not the responsibility of the project manager but is usually the responsibility of the quality or audit team.\n - Compliance risk analytics can involve the project manager, but it is not his primary responsibility.\n - Changing the assets of the organization's operations is a decision at a higher level and does not fall within the responsibility of the project manager.",
      "choices": [
        {
          "text": "Acts as coordinator for the resources and activities",
          "correct": true
        },
        {
          "text": "Conducts audits for the compliance requirement",
          "correct": false
        },
        {
          "text": "Performs risk analyses of compliance risks",
          "correct": false
        },
        {
          "text": "Changes process assets of the organization",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is helping an organization transition from traditional methods to agile. The infrastructure, data warehousing, and enterprise architecture teams operate very differently than the application development teams.\n How should the project manager implement agile in this organization?",
      "explanation": "Correct answer: \"Deliberately adapts the implementation to make the methodology more environmentally friendly and the current nature of work\".\n\n- Explanation:\n Because the nature of the work of different teams is different, adapting the agile methodology to suit the unique environment and tasks of each team ensures the success and effectiveness of the application.\n- Why other options are wrong:\n - Imposing the same methodology on all teams reduces effectiveness and does not take into account business differences.\n - Going from top to bottom may encounter resistance and does not guarantee correct adaptation.\n - Using one team as a pilot project is useful but does not address the need to adapt the methodology across different teams.",
      "choices": [
        {
          "text": "Ask every team in the organization to implement the same agile methodology so that a one-size-fits-all solution can provide consistency across all teams.",
          "correct": false
        },
        {
          "text": "Tailor the implementation by deliberately adapting the approach to make it more suitable for the given environment and work at hand.",
          "correct": true
        },
        {
          "text": "Force the top-down transition approach by asking the CEO to provide support for implementing agile in every team in the organization.",
          "correct": false
        },
        {
          "text": "Ask one team to implement scrum as a pilot so that all other teams in the organization can also implement scrum by learning from this team.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A group of stakeholders at a financial institution are conducting a project closure review. Some of the stakeholders are concerned that the project deliverables do not satisfy the established closure criteria. What is the first thing that the project manager should do to address this issue?",
      "explanation": "Correct answer: \"Conduct a thorough analysis to find out why the criteria are not met\".\n\n- Explanation:\n  When there is concern about not meeting the closing criteria, the project manager must first understand the root cause of the problem before taking any further action. This helps to identify the appropriate solution whether it is modifying the output, updating the criteria, or otherwise.\n- Why are the other options wrong:\n - Reassuring stakeholders without analysis may lead to ignoring a real problem.\n - The proposal to delete criteria is illogical because it may reduce the quality of the project.\n - Taking corrective measures before understanding why may lead to inefficient actions or a waste of time and resources.",
      "choices": [
        {
          "text": "Assure the stakeholders that the project deliverables satisfy all established closure criteria.",
          "correct": false
        },
        {
          "text": "Propose that the closure criteria be amended by removing the criteria that have not been met.",
          "correct": false
        },
        {
          "text": "Take corrective measures by adapting the closure criteria and extending the project timeline.",
          "correct": false
        },
        {
          "text": "Perform a thorough analysis to determine why the closure criteria have not been satisfied.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In the middle of a project incremental delivery, due to a change in the technology, a team member informed the project leader that due to a lack of knowledge in the technology the delivery will be delayed and suggests outsourcing services.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: \"Discuss the impact of new technology with the team and make a decision jointly\".\n\n- Explanation:\n  Dealing with technological changes must be collective to ensure that all members understand the challenges and their impact on the schedule and quality, helping to make an informed decision about outsourcing or other solutions.\n- Why are other options wrong:\n - Informing the end user of the delay before analyzing the problem may cause a negative impression without attempting to resolve the problem internally.\n - Searching for an external service without discussing the team may result in decisions that are not supported by the team and an increased cost.\n - Informing the sponsor and requesting support before assessing the impact of the problem with the team may lead to hasty or inappropriate decisions.",
      "choices": [
        {
          "text": "Inform the end user of the delay of the specific delivery due to the new technology",
          "correct": false
        },
        {
          "text": "Search for an outsourcing service with the experience needed",
          "correct": false
        },
        {
          "text": "Inform the sponsor of the delay and ask for their support and approval",
          "correct": false
        },
        {
          "text": "Discuss the impact of the new technology with the team and decide action jointly",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An agile coach is counseling a large software organization that has been using waterfall methodology and now plans to start using agile or hybrid methodology.\n\nWhat would be a project manager's suggestion?",
      "explanation": "The correct answer: \"Start with the agile and then move to hybrids, knowing that the implementation of the agile takes time\".\n\n- Explanation:\n - Moving to the agile directly can be a challenge due to the need to change the culture and processes, so starting with the agile gradually is a good option.\n - The hybrid methodology combines the advantages of waterfall and agile, but it is not always the best option to start.\n- Why are the other options wrong:\n - Continuing to use the waterfall does not take advantage of the advantages of modern agile.\n - Relying on hybrids from the beginning may not be appropriate if the team is not yet capable of agile skills.\n - Saying that hybrids are always best suited is not accurate because the choice depends on the working environment and needs.",
      "choices": [
        {
          "text": "Continue using waterfall, since hybrid does not fit with the organizational structure.",
          "correct": false
        },
        {
          "text": "Start with agile and then move to hybrid, although agile takes time to implement.",
          "correct": true
        },
        {
          "text": "Start using hybrid methodologies because waterfall knowledge is transferable.",
          "correct": false
        },
        {
          "text": "Start using hybrid, the more appropriate methodology for software organizations.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A product owner has requested to incorporate embedded functionality for the patient portal in the next sprint. The team decided to perform an Affinity Estimation session to define how much value will be delivered.\n\nWhich role is responsible to facilitate the session?",
      "explanation": "Correct answer: \"Scrum Master\".\n\n- Explanation:\n - Scrum Master is responsible for facilitating agile meetings and events, including affinity assessment sessions.\n - Ensures that the team follows agreed principles and frameworks and works collaboratively.\n- Why other options are wrong:\n -  The product owner prioritizes but does not facilitate the session.\n - Developers share the estimate but do not facilitate.\n - Stakeholders may be present but not responsible for the facilitation.",
      "choices": [
        {
          "text": "Product Owner",
          "correct": false
        },
        {
          "text": "Scrum Master",
          "correct": true
        },
        {
          "text": "Developer",
          "correct": false
        },
        {
          "text": "Stakeholder",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is leading a team on a new development project. The team is made up of a diverse group of people with different personalities and work styles. The project manager is committed to creating a cohesive and productive team, so they decided to introduce the DISC behavior model to help team members understand each other better.\n\nBased on the DISC behavior model, which of the following characteristics best describes the Influence style?",
      "explanation": "Correct answer: \"Outgoing, enthusiastic, optimistic\".\n\n- Explanation:\nThe Influence (I) style in the DISC model is characterized by sociability, enthusiasm, and optimism. People with this style are typically energetic, people-oriented, and skilled at motivating others and building positive relationships.\n\n- Why other options are incorrect:\n- \"Direct, result-oriented, and firm\" describes the Dominance (D) style.\n- \"Accommodating, patient, humble, tactful\" fits the Steadiness (S) style.\n- \"Analytical, reserved, and precise\" aligns with the Conscientiousness (C) style.",
      "choices": [
        {
          "text": "Direct, result-oriented, and firm",
          "correct": false
        },
        {
          "text": "Outgoing, enthusiastic, optimistic",
          "correct": true
        },
        {
          "text": "Accommodating, patient, humble, tactful",
          "correct": false
        },
        {
          "text": "Analytical, reserved, and precise",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Project managers must be able to identify flaws that cause errors in decision making. Which option would help a project manager make optimal decisions?",
      "explanation": "Correct answer: \"Check with others\".\n\n- Explanation:\n - Checking with others helps reduce errors and biases by getting different points of view and evaluating ideas accurately.\n- Why other options are wrong:\n - Using biases leads to subjective and incorrect decisions.\n - Using wrong assumptions leads to inaccurate conclusions.\n - Applying logical errors increases the likelihood of bad decisions.",
      "choices": [
        {
          "text": "Utilizing biases",
          "correct": false
        },
        {
          "text": "Using false assumptions",
          "correct": false
        },
        {
          "text": "Checking with others",
          "correct": true
        },
        {
          "text": "Applying logical errors",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is in a successful automotive company with high quality standards. The project manager needs to ensure that they create a high-quality WBS.\n\nWhich of the following is not a key characteristic of a high quality WBS?",
      "explanation": "Correct answer: \"Customer-focused\" is not a characteristic of high-quality WBS.\n\n- Explanation:\n -  The workflow structure (WBS) must be output-oriented, i.e. focused on the final results of the project and not directly on the customer.\n - It must be hierarchical and implement the 100% rule which means that all the work required must be fully integrated into the structure.\n- Why other options are wrong:\n - \"output-oriented\" is a valid and basic property of WBS.\n - \"hierarchical\" is a valid property because WBS is structurally built.\n - \"100% rule\" is necessary to ensure that all components of the work are included.",
      "choices": [
        {
          "text": "Deliverable oriented",
          "correct": false
        },
        {
          "text": "Hierarchical",
          "correct": false
        },
        {
          "text": "The 100% rule",
          "correct": false
        },
        {
          "text": "Customer focused",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following project artifacts do not utilize the WBS as an input?",
      "explanation": "Correct answer: \"Project scope\".\n\n- Explanation:\nThe project scope statement defines what needs to be accomplished and why. It is developed before the WBS and serves as an input to the WBS creationnot the other way around.\n\n- Why the other options are incorrect:\n- \"Project schedule\": Uses the WBS to identify work packages, sequence activities, and develop timelines.\n- \"Risk management plan\": Relies on the WBS to identify risk-prone areas based on work packages.\n- \"Quality plan\": Uses the WBS to determine which deliverables need quality assurance and control measures.",
      "choices": [
        {
          "text": "Project schedule",
          "correct": false
        },
        {
          "text": "Project scope",
          "correct": true
        },
        {
          "text": "Risk management plan",
          "correct": false
        },
        {
          "text": "Quality plan",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on requirement management in a pharmaceutical company. Which improvement is something the project manager's organization should expect as an outcome of the project?",
      "explanation": "Correct answer: \"Reduced risks\".\n\n- Explanation:\nEffective requirements management helps reduce risks related to unclear or incomplete understanding of stakeholder and regulatory needsespecially critical in regulated industries like pharmaceuticals.\n\n- Why other options are incorrect:\n- \"Reduced quality\", \"increased costs\", and \"increased schedule\" are negative outcomes and would not be expected improvements from good requirements management.",
      "choices": [
        {
          "text": "Reduced quality",
          "correct": false
        },
        {
          "text": "Increased costs",
          "correct": false
        },
        {
          "text": "Reduced risks",
          "correct": true
        },
        {
          "text": "Increased schedule",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager works for a global company and understands the importance of the requirements management plan. When should the requirements management plan be implemented?",
      "explanation": "Correct answer: \"During the planning phase\".\n\n- Explanation:\nA requirements management plan is developed during the planning phase of the project to guide how requirements will be analyzed, documented, and managed throughout the project lifecycle. Creating this plan early provides clarity, supports stakeholder alignment, and helps prevent scope creep.\n\n- Why other options are incorrect:\n- \"At the start of the project\" is vague and may refer to the initiation phase, which is too early for this specific planning activity.\n- \"Prior to executing\" is not specific and could still be late in fast-tracked projects.\n- \"After customer contract signature\" is too late, as many planning elements should be finalized by then.",
      "choices": [
        {
          "text": "At the start of the project",
          "correct": false
        },
        {
          "text": "Prior to executing",
          "correct": false
        },
        {
          "text": "After customer contract signature",
          "correct": false
        },
        {
          "text": "During the planning phase",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Project Manager B has been assigned to take over a project from Project Manager A. Project Manager A informs Project Manager B that the project is on schedule only because Project Manager A constantly pushes the team to perform.\n\nWhat is the first action Project Manager B should take as the new project manager?",
      "explanation": "Correct answer: \"Determine a management strategy\".\n\n- Explanation:\nAs the new project manager, the first priority is to assess the current situation and define a suitable management strategy. This includes determining whether the former approach is sustainable and if a new style of leadership or planning is needed to support the team.\n\n- Why other options are incorrect:\n- Checking the risk status or cost performance is helpful but should follow after a comprehensive management approach is determined.\n- Informing the team of new objectives without first defining a clear strategy could lead to confusion or resistance.",
      "choices": [
        {
          "text": "Check the risk status.",
          "correct": false
        },
        {
          "text": "Check the cost performance.",
          "correct": false
        },
        {
          "text": "Determine a management strategy.",
          "correct": true
        },
        {
          "text": "Tell the team the new objectives.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which is an essential component for maintaining the support and commitment of all stakeholders?",
      "explanation": "Correct answer: \"Effective communication\".\n\n- Explanation:\n - Effective communication ensures that information is exchanged clearly and accurately, enhancing understanding and commitment by all stakeholders.\n - Without effective communication, misunderstandings may occur that lead to loss of support.\n- Why other options are wrong:\n - \"Honesty\", \"Transparency\" and \"Reliability\" are important values but depend on having effective communication to maintain them.",
      "choices": [
        {
          "text": "Honesty",
          "correct": false
        },
        {
          "text": "Effective communication",
          "correct": true
        },
        {
          "text": "Transparency",
          "correct": false
        },
        {
          "text": "Reliability",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is a tactic that a project manager can employ to effectively monitor the impact of the risk on the project while monitoring risks?",
      "explanation": "Correct answer: \"Risk reporting\".\n\n- Explanation:\nRisk reporting is a key tactic in monitoring the impact of risks. It keeps all stakeholders informed of current and emerging risks, their severity, and potential responses, enabling proactive decision-making.\n\n- Why other options are incorrect:\n- \"Risk avoidance\", \"risk acceptance\", and \"risk escalation\" are response strategies used to handle risksnot to monitor them. Monitoring requires ongoing visibility and communication, which is achieved through risk reporting.",
      "choices": [
        {
          "text": "Risk avoidance",
          "correct": false
        },
        {
          "text": "Risk escalation",
          "correct": false
        },
        {
          "text": "Risk acceptance",
          "correct": false
        },
        {
          "text": "Risk reporting",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is assigned to a project that is already in progress because the original project manager left the organization unexpectedly. Unfortunately, the previous project manager did not adhere to the organization's knowledge transfer procedures prior to leaving the organization. What can the new project manager do to fill the knowledge gaps? (Choose 3)",
      "explanation": "Correct answers focus on compensatory strategies to fill knowledge gaps by reviewing documents and engaging with stakeholders and team members.\n\n- Reviewing project documentation (plans, requirements, risk registers) gives a clear view of the projects current status and scope.\n- Meeting with key stakeholders helps the new PM align project execution with expectations and identify critical needs.\n- Interviewing team members helps capture informal and practical knowledge acquired during project execution.\n\nWhy other options are incorrect:\n- Proceeding without collecting knowledge increases the risk of misalignment and rework.\n- Reaching out to the former project manager may not be feasible or reliable depending on the circumstances of their departure.",
      "choices": [
        {
          "text": "Review the project documentation, including the project plan, requirements document, and risk register.",
          "correct": true
        },
        {
          "text": "Proceed with the project as planned and engage in job shadowing activities.",
          "correct": false
        },
        {
          "text": "Meet with key stakeholders to understand their expectations and priorities.",
          "correct": true
        },
        {
          "text": "Interview team members to learn about their areas of expertise and experience with the project.",
          "correct": true
        },
        {
          "text": "Reach out to the previous project manager and request a comprehensive knowledge transfer.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager's team has identified the lack of proper knowledge transfer expectations in the project. Which of the obstacles does not apply in this situation?",
      "explanation": "The correct answer is: \"Systematic review of the completed project\" because it is a positive process aimed at analyzing the project after its completion and identifying lessons learned, and this promotes knowledge transfer rather than being an obstacle.\n\nOptions explained:\n- Systematic review of the completed project: Not an obstacle, but an opportunity to improve processes and transfer knowledge, so it does not apply as an obstacle.\n- Failures and mistakes that were dealt with personally: It is considered an obstacle because not sharing mistakes and lessons learned with the team prevents collective learning.\n- Lack of individual motivation to document lessons learned: A clear obstacle because without motivation to document information, valuable knowledge is lost.\n- Poor leadership participation in promoting knowledge transfer: an important obstacle affecting the organization's culture in knowledge sharingIn short, obstacles are the factors that hinder the transfer of knowledge, and reviewing a project is one of the best tools to facilitate this, so it is the wrong choice.",
      "choices": [
        {
          "text": "A systematic review of the completed project",
          "correct": true
        },
        {
          "text": "Personally handled failures and mistakes",
          "correct": false
        },
        {
          "text": "Insufficient individual motivation to document the lessons learned",
          "correct": false
        },
        {
          "text": "Sparse leadership involvement to promote knowledge transfer",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In an agile environment, a project leader should always consider a time for open and free discussions between team members on how the team can increase their performance.\n\nWhy is this practice important for the team?",
      "explanation": "Correct answer: \"Teams should continuously seek to improve their processes\".\n\nAnswer Explanation:\n- Continuous improvement is a core principle of agile methodologies, where the team strives to refine their workflows and enhance performance to deliver greater value.\n- Open discussions help the team identify blockers, share lessons learned, and brainstorm improvements collaboratively.\n\nWhy other options are incorrect:\n- \"Teams should take actions to continuously increase productivity\": While valid, it is more general. Agile focuses on process improvement, not just output.\n- \"Teams should continuously experiment new ways of doing things\": Experimentation is one method, but the goal is broader  continuous improvement.\n- \"Teams should continuously push their members to work harder\": This contradicts agile values. It risks burnout and doesn't ensure sustainable improvements. Agile promotes smarter, not harder, work.",
      "choices": [
        {
          "text": "Teams should take actions to continuously increase productivity",
          "correct": false
        },
        {
          "text": "Teams should continuously experiment new ways of doing things",
          "correct": false
        },
        {
          "text": "Teams should continuously seek to improve their processes",
          "correct": true
        },
        {
          "text": "Teams should continuously push their members to work harder",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing a project involving a few vendors. The project sponsor asks how the project will acquire goods and external services.\n\nWhere should this information be documented?",
      "explanation": "The correct answer is \"In the procurement management plan\".\n\n- Why?\nProcurement Management Plan is the document that defines how goods and services are purchased from vendors, including contract types, contracting procedures, evaluation criteria, and associated processes.\n\n- Why are other options wrong?\n-  A Master Service Agreement (MSA) is a contract that specifies general terms of business with the seller, but does not contain a detailed plan for the purchase.\n-  A BOM contract is a detailed technical document that focuses on the materials themselves, not the procurement method or procedures.\n-  The Service Level Agreement (SLA) sets out the level of performance expected of the service provider, but does not address the method of obtaining goods and services.",
      "choices": [
        {
          "text": "In the Procurement Management Plan",
          "correct": true
        },
        {
          "text": "In the Master Service Agreement",
          "correct": false
        },
        {
          "text": "In the Bill of Materials Contract",
          "correct": false
        },
        {
          "text": "In the Service Level Agreement",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project is in the execution phase. Equipment and devices must be transported from the vendor's warehouse to the project site through five towns.\n\nWhich stakeholders should the project manager involve in planning and executing a safe transport? (Choose 3).",
      "explanation": "Correct answers: \"City councils\", \"Equipment installers\", \"Equipment suppliers\".\n\n- Why?\n1. City councils: It is important to involve them to obtain the necessary permits to ensure safe and smooth passage through different cities, and they also help in coordination with local authorities.\n2. Equipment installers: Responsible for properly installing equipment on site, and need to know transportation dates to ensure they are ready.\n3. Equipment suppliers: The source of the equipment, and must be coordinated with to ensure that it is delivered on schedule and to solve any logistical problems.\n\n- Why are other options wrong?\n- Project sponsor: Is a supervisory authority and not an executive body in transport.\n- Warehouse technician: Their role is limited to storing and maintaining equipment inside the warehouse and not transporting through cities.",
      "choices": [
        {
          "text": "City councils",
          "correct": true
        },
        {
          "text": "Project sponsor",
          "correct": false
        },
        {
          "text": "Equipment installers",
          "correct": true
        },
        {
          "text": "Equipment suppliers",
          "correct": true
        },
        {
          "text": "Warehouse technician",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a complex project that has a very high environmental impact. The project was approved by the organization's PMO and is now in the planning phase. The project sponsor provided the project manager with a list of all project stakeholders.\n\nWhat will be the next activity in the Stakeholder Management Plan?",
      "explanation": "Correct answer: analysis.\n\n- Why?\nAfter identifying and documenting stakeholders, they are analyzed to understand their needs, expectations, and level of impact on the project, including assessing their strength, interest and planning how they will be managed.\n\n- Why are other options wrong?\n- Selection: The list has already been delivered.\n- Participation: Comes after the analysis where a plan for stakeholder interaction is developed.\n- Monitoring: Conducted later during the implementation of the project to verify the continued effectiveness of stakeholder strategies.",
      "choices": [
        {
          "text": "Analyze",
          "correct": true
        },
        {
          "text": "Monitor",
          "correct": false
        },
        {
          "text": "Engage",
          "correct": false
        },
        {
          "text": "Identify",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is managing an agile project. The PMO manager is not familiar with agile delivery.\n\nWhich of the following statements describe the agile approach?",
      "explanation": "Correct answer: Respond to change instead of sticking to plan.\n\n- Why?\nAgile focuses on adapting to changes and updating the business plan based on variables rather than strictly adhering to a specific plan from the start.\n\n- Why are other options wrong?\n- Customer collaboration instead of commitment to plan: This is not an exact version of what is stated in the four values of the generations.\n- Responding to change instead of processes and tools: This conflicts with the original value (people and interactions more than processes and tools).\n- Customer collaboration instead of mass tests: Not an official expression in the statement for agiles.",
      "choices": [
        {
          "text": "Responding to change over following a plan",
          "correct": true
        },
        {
          "text": "Customer collaboration over following a plan",
          "correct": false
        },
        {
          "text": "Responding to change over processes and tools",
          "correct": false
        },
        {
          "text": "Customer collaboration over comprehensive testing",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has just completed the initiation phase of a project and needs to identify and analyze the stakeholders. The project charter focused on scope and budget approval only.\n\nWhat should the project manager do to identify stakeholders?",
      "explanation": "Correct answer: Review lessons learned from previous projects.\n\n- Why?\nReview lessons learned helps identify recurring patterns about potential stakeholders who may be overlooked. This step provides a broader view next to official documentation.\n\n- Why are other options wrong?\n- Project charter review: insufficient because it focused only on scope and budget, and did not include a list of stakeholders.\n- Brainstorming session with the project team: It may be a next step, but the beginning is by reviewing the available resources first.\n- Organizational structure review: useful in identifying some stakeholders, but not as comprehensive as reviewing lessons learned.",
      "choices": [
        {
          "text": "Review lessons learned from previous projects.",
          "correct": true
        },
        {
          "text": "Review the project charter.",
          "correct": false
        },
        {
          "text": "Conduct a brainstorming session with the project team.",
          "correct": false
        },
        {
          "text": "Review the organization chart.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager recently joined a new organization. The project sponsor is a subject matter expert and wants to manage scope by delivering in small increments and changing the scope based on feedback.\n\nWhich of the following approaches should be the recommended option?",
      "explanation": "Correct answer: Scrum.\n\n- Why?\nScrum relies on delivering work as short iterations (sprints), with frequent review and scope adjustment based on feedback. This is in line with what the sponsor requests.\n\n- Why are other options wrong?\n-  Waterfall: Continuous change is not allowed after scoping has been defined.\n-  Kanban: Suitable for continuous workflow but does not include an iterative delivery structure as in Scrum.\n-  Predictive: Depends on a fixed plan, which is not compatible with flexible scope management.",
      "choices": [
        {
          "text": "Scrum",
          "correct": true
        },
        {
          "text": "Waterfall",
          "correct": false
        },
        {
          "text": "Kanban",
          "correct": false
        },
        {
          "text": "Predictive",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is leading a project with 34 team members from six countries. The scope of the project is to modernize a process used for almost 40 years in the organization.\n\nWhat criteria should the project manager consider while developing the communication plan? (Choose 3).",
      "explanation": "The correct answers: personal diversity, age diversity, cultural diversity.\n\n- Why?\nWhen preparing a communication plan in multinational and large teams, it is important to consider personal, cultural, and age differences so that messages are understandable and effective for everyone.\n\n- Why is the incorrect choice wrong?\n- Diversity of skills has more to do with the distribution of work and the distribution of roles than with the direct communication plan.",
      "choices": [
        {
          "text": "Personal diversity",
          "correct": true
        },
        {
          "text": "Age diversity",
          "correct": true
        },
        {
          "text": "Cultural diversity",
          "correct": true
        },
        {
          "text": "Skill diversity",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project steering group has made a decision to change the vendor that will deliver a component of a project.\n\nWhich of the following activities should be included in the handover? (Choose 2).",
      "explanation": "Correct answers: The old vendor must provide training for the new vendor and help with the transition + the new vendor must receive the activities according to the current project plan.\n\n- Why?\nChange in resource always requires the transfer of knowledge and methodology of an organized transition so that the progress of the project is not affected. Training and receiving activities in an orderly manner helps in business continuity.\n\n- Why are other options wrong?\n- Providing additional incentives is not an essential part of the delivery process.\n- The follow-up of the old supplier is not a direct responsibility of the new supplier but is organized within the agreed transition plan.",
      "choices": [
        {
          "text": "The old vendor should provide training for the new one and assist with the transition.",
          "correct": true
        },
        {
          "text": "Both vendors should provide additional incentives for staff during the transition.",
          "correct": false
        },
        {
          "text": "The new vendor should take over activities as per the existing project plan.",
          "correct": true
        },
        {
          "text": "The new vendor should shadow the old vendor to ensure knowledge transfer.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is working on a large business transformation project. All of the build deliverables were signed off and the project manager is managing the transition to BAU (Business as Usual).\n\nWhich of the following are important operational readiness considerations that the project manager needs to consider? (Choose 2).",
      "explanation": "Correct answers: \n- Formal training and documentation must be made available to all users.\n- Responsibilities and accountability are formally handed over to operations teams.\n\n- Why?\nTo ensure business continuity after the project is finished, operational teams must be ready and trained with full documentation, and responsibilities must be formally handed.\n\n- Why are other options wrong?\n-  The cheat sheet and self-training are insufficient for large transformation projects.\n- Keeping operational support on the project team is contrary to the concept of transition to BAU.",
      "choices": [
        {
          "text": "A cheat sheet for core functionality is provided and self training is encouraged.",
          "correct": false
        },
        {
          "text": "Formal training and access to documentation should be provided to all users.",
          "correct": true
        },
        {
          "text": "Responsibility and accountability are formally handed over to operational teams.",
          "correct": true
        },
        {
          "text": "The project team remains responsible for operational support during BAU.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After consultation with executive stakeholders, it was decided that the project manager would replace a vendor while the project is in the execution phase. The new vendor simply has more domain knowledge and was not identified earlier, but is probably the right vendor candidate now.\n\nWhich of the following documents would contain the best information for the new vendor?",
      "explanation": "Correct answer: Request for proposal (RFP).\n\n- Why?\nRequest for Proposal (RFP) explains the details of the requirements and contract terms in a way that allows suppliers to submit their technical and financial solutions and offers.\n\n- Why are other options wrong?\n- RFI is intended for the collection of raw information only.\n- RFQ is used to request specific prices when specifications are fully known.\n- RFC is not related to procurement management but to contract changes.",
      "choices": [
        {
          "text": "Request for Information (RFI)",
          "correct": false
        },
        {
          "text": "Request for Quote (RFQ)",
          "correct": false
        },
        {
          "text": "Request for Proposal (RFP)",
          "correct": true
        },
        {
          "text": "Request for Contract (RFC)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "You are the project manager in an organization that is implementing agile delivery. You have experience as a scrum master and will perform this role in addition to the project management responsibilities. One of the team members wants to know what the main focus of a servant leader is.nnWhat will be your response?",
      "explanation": "The correct answer: the growth and well-being of individuals and the communities to which they belong.\n\nExplanation: The servant leader focuses on empowering and supporting the team to achieve the best performance while maintaining the well-being and development of individuals. This is different from traditional methods that focus on power or control.\n\nWhy other options are wrong:\n- Customer satisfaction and value proposition are important, but they are not the focus of the server leader.\n- Managing stakeholder expectations is part of the project manager's role, not the characteristics of the server leader specifically.\n- Productivity and efficiency are a result, not a direct focus.",
      "choices": [
        {
          "text": "Client satisfaction and value delivered demonstration.",
          "correct": false
        },
        {
          "text": "Growth and well-being of people and communities they belong to.",
          "correct": true
        },
        {
          "text": "Stakeholders expectation management and communication.",
          "correct": false
        },
        {
          "text": "Productivity and efficiency to achieve commitments made.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What are the four team-building leadership styles?",
      "explanation": "The correct answer: visionary, alliance, directive, and participatory.\n\nExplanation:\n- The visionary style focuses on creating a common vision.\n-  The alliance style builds trust and relationships.\n- The guiding style gives instructions and clarifies the path.\n-  The participatory style encourages collective decision-making.\n\nOther options have confused correct and inaccurate patterns according to the classifications adopted in project management.",
      "choices": [
        {
          "text": "Visionary, affiliative, coaching and participative",
          "correct": true
        },
        {
          "text": "Visionary, affiliative, coaching and pace setting",
          "correct": false
        },
        {
          "text": "Visionary, affiliative, coaching and directive",
          "correct": false
        },
        {
          "text": "Visionary, affiliative, coaching and high waters",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "During the weekly meeting, team members are reviewing the tasks assigned by the Project Manager. A few team members are complaining that there is not enough information to estimate how long it will take to complete the work.\n\nWhat is the most likely cause for this issue?",
      "explanation": "Correct answer: Project objectives are not clearly defined.\n\nExplanation: When project goals are not clear, it is difficult for team members to understand the full purpose of the tasks assigned to them, resulting in difficulty estimating the time and effort required. This directly affects planning and performance expectations.\n\nWhy are other options wrong:\n- A dynamic business environment affects changes, but it is not the direct cause of the lack of task information.\n- Internal competition is a problem in the team environment, not a reason for the lack of information.\n- Roles and responsibilities are related to who does what, but here the problem is related to the lack of information about tasks and not who will perform them.",
      "choices": [
        {
          "text": "Project objectives are not clearly defined",
          "correct": true
        },
        {
          "text": "The business environment is very dynamic",
          "correct": false
        },
        {
          "text": "Internal competition between team members",
          "correct": false
        },
        {
          "text": "Roles & Responsibilities are not clearly defined",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "You are managing a complex project with a large number of stakeholders. You decided to use the Salience Model to identify and group the most important stakeholders based on their power, urgency and legitimacy.\n\nWhich of the following aspects is the most important in this instance?",
      "explanation": "Correct answer: Critical.\n\nExplanation: In the brightness model, Definitive Stakeholders are the most important because they combine power, urgency, and legitimacy. These require immediate and direct attention from the project manager.\n\nWhy are other options wrong:\n- The dominant has power and legitimacy but not urgency.\n- The follower has legitimacy and urgency but does not have power.\n- The claimant has power and urgency but may not have legitimacy.",
      "choices": [
        {
          "text": "Dominant",
          "correct": false
        },
        {
          "text": "Dependent",
          "correct": false
        },
        {
          "text": "Demanding",
          "correct": false
        },
        {
          "text": "Definitive",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "In the Project team meeting the team members are complaining of a drop in motivation and that they don't feel that their efforts are appreciated. You decided to build and present the team as a high performance team to the organization.\n\nWhich of the following attributes of the organizational environment and managerial style will lead to a high performance team? Select 3",
      "explanation": "Correct answers: business challenge return, stimulating environment, and problem-solving techniques.\n\nExplanation:\n-  Business challenge returns enhance individuals' sense of value and contribution.\n-  A stimulating environment that helps keep the team active and creative.\n- Problem-solving techniques support collaboration and teamwork.\n\nWhy other choices are wrong:\n- Personal motivations are not always related to the team but to the individual.\n- Financial rewards may motivate in the short term but do not guarantee sustainable high performance.\n- Theory of constraints is a methodology for improving operations and is not a direct factor in building high-performance teams.",
      "choices": [
        {
          "text": "Personal Driving Forces.",
          "correct": false
        },
        {
          "text": "Work Challenge Dividend.",
          "correct": true
        },
        {
          "text": "Progressive Financial Rewards.",
          "correct": false
        },
        {
          "text": "Stimulating Environment.",
          "correct": true
        },
        {
          "text": "Problem Solving Techniques",
          "correct": true
        },
        {
          "text": "Theory of Constraints",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager decided to involve a third party to manage project risk given that they had more experience than the current project team. What kind of response strategy did the project manager apply to address overall project risk?",
      "explanation": "Correct answer: Transfer.\n\nExplanation:\nConversion means transferring the impact of risk to another party (such as an insurance company or external contractor), in exchange for financial compensation or a formal agreement. This is exactly the case of involving a third party.\n\nWhy are other options wrong:\n- Avoidance means canceling the activity that contains the risk.\n- Exploitation is related to opportunities, not threats.\n- Minimization means reducing the likelihood or impact of the risk internally without transferring it to another party.",
      "choices": [
        {
          "text": "Avoid",
          "correct": false
        },
        {
          "text": "Exploit",
          "correct": false
        },
        {
          "text": "Transfer",
          "correct": true
        },
        {
          "text": "Reduce",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After an organization trained and implemented a new mandatory project management software application for all project staff, the project manager noticed that several team members show low levels of commitment to the new software. What is the cause for this?",
      "explanation": "The correct answer: fear of the unknown.\n\nExplanation: When implementing a new system or a major change in the work environment, fear of the unknown is one of the most common reasons for rejecting or resisting change. Even with adequate training, individuals may be reluctant to commit due to unclear results or because they get used to legacy systems.\n\nWhy other options are wrong:\n- Lack of skills addressed through training.\n- Lack of clarity of project vision is not directly related to the use of project management software.\n- Excessive communication does not usually lead to low commitment and may even lead to confusion.",
      "choices": [
        {
          "text": "Fear of the unknown",
          "correct": true
        },
        {
          "text": "Lack of required skills",
          "correct": false
        },
        {
          "text": "Lack of clear project vision",
          "correct": false
        },
        {
          "text": "Too much communication",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a long-term project in a complex environment. The project manager's focus is on maintaining healthy team work and collaboration.\n\nWhat conflict resolution strategy should be used within the project team?",
      "explanation": "Correct answer: problem solving.\n\nExplanation: Problem solving is  a collaborative approach used to address conflicts in a constructive and lasting way. In long and complex work environments, this approach is preferred because it supports trust building and maintains long-term relationships.\n\nWhy other options are wrong:\nSettlement may lead to completely unsatisfactory compromises.\n- Assimilation means sacrificing one party's opinion in favor of another, which is not sustainable.\n- Consultation is a method of communication, not a conflict resolution strategy per se.",
      "choices": [
        {
          "text": "Problem solving",
          "correct": true
        },
        {
          "text": "Compromising",
          "correct": false
        },
        {
          "text": "Accommodating",
          "correct": false
        },
        {
          "text": "Consultation",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A team lead is assigned to an ongoing project. The team members have been working together for a while.\n\nHow should the team lead start building relationships?",
      "explanation": "Correct answer: Ask team members directly about personal and practical matters.\n\nExplanation: To build strong relationships as a new leader, it's best to interact directly with team members and ask them about their interests and work style. This promotes trust and understanding.\n\nWhy other options are wrong:\n- Distributing tasks only does not promote relationship building.\n- Talking about personal preferences unilaterally without listening to the team may be considered authoritarian.\n- Asking for information from other colleagues instead of direct communication The team may feel disrespected or ignored.",
      "choices": [
        {
          "text": "Distribute tasks and observe the quality of the deliverables.",
          "correct": false
        },
        {
          "text": "Talk about personal preferences and make sure the team understands your approach.",
          "correct": false
        },
        {
          "text": "Ask some team members to share information about other members to become familiar with the team.",
          "correct": false
        },
        {
          "text": "Ask the team members directly about both personal and work-related matters.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager wants to establish an incentive and rewards strategy for the project team. What approach should be taken?",
      "explanation": "Correct answer: Identify the needs of each team member to determine the appropriate incentives.\n\nExplanation: Not every team member is motivated in the same way. Some may prefer financial rewards, others prefer public recognition or internship opportunities. So it's best to know what works for each member.\n\nWhy are other options wrong:\n- The HR department question gives general ideas, not ad hoc.\n- Budget verification is a management step but not the most appropriate way to devise an effective strategy.\n- Presenting results publicly is a method of work recognition, not an overall motivation strategy.",
      "choices": [
        {
          "text": "Ask Human Resources department which incentives should be provided.",
          "correct": false
        },
        {
          "text": "Check on budget availability in order to determine specific reward amounts.",
          "correct": false
        },
        {
          "text": "Provide an opportunity for publicly presenting the outcomes.",
          "correct": false
        },
        {
          "text": "Identify the specific needs for each team member to determine incentives.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "Select three ways to improve and practice leadership skills. (Choose 3)",
      "explanation": "Correct answers: involve the team in the project process, actively participate in project tasks, request feedback and analyze the results.\n\nExplanation: Improving leadership skills needs a combination of direct work with the team, listening to their opinions, and participating in activities.\n\nWhy other options are wrong:\n- Treating all team members the same is not always effective; everyone has different needs and motivations.\n- The use of democracy in all team decisions may lead to slow decision-making in some cases that require decisiveness.",
      "choices": [
        {
          "text": "Engage the team in the project process.",
          "correct": true
        },
        {
          "text": "Be actively involved in the project tasks.",
          "correct": true
        },
        {
          "text": "Treat each team member the same way.",
          "correct": false
        },
        {
          "text": "Ask for feedback and analyze the results.",
          "correct": true
        },
        {
          "text": "Use democracy for all team decisions.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "At the midway point of a project, the project manager was informed of a market movement that would make the project results useless to the client. This information could cause the project to be cancelled or at least a big change on the scope and desired outcome.\n\nWhat should the project manager do next?",
      "explanation": "Correct answer: Have a transparent discussion with the sponsor, offering to provide support in evaluating the strategy if necessary.\n\nExplanation: The project manager is responsible for conveying information with strategic impact to the sponsor and stakeholders and not making the decision himself. Transparency and professionalism must be maintained.\n\nWhy other options are wrong:\n- Preparing reports and trying to convince the client to continue is unethical.\n- Continuing to implement without paying attention to market changes is contrary to the role of the project manager.\n- Stopping the project immediately is a decision that belongs to the sponsor or decision-makers, and not to the project manager alone.",
      "choices": [
        {
          "text": "Prepare all status reports and demos to keep the client focused on the project execution that has been successful.",
          "correct": false
        },
        {
          "text": "Have a transparent discussion with the project sponsor, offering support on the strategy evaluation if needed.",
          "correct": true
        },
        {
          "text": "Continue working on the project execution, as the business strategy is not responsibility of the project manager.",
          "correct": false
        },
        {
          "text": "Halt the project immediately, as the project manager knows it will be useless to the client.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "An internal project has delivered its scope on time, within budget, and with the expected quality. The client was satisfied with the result and it enabled them to launch the new product to market. However, the product did not attract the expected interest and did not cover the investment made. The project team is aware of these results and it is impacting their morale to deliver the next project.\n\nHow should the project manager handle this situation? Choose 2 answers.",
      "explanation": "Correct answers: \n1. Discussion with the team to clarify that product success is not a direct result of the project and does not reflect their performance.\n2. Hold a meeting with the business management to make sure they understand that the project has achieved its goals.\n\nExplanation:\n-  The project manager should support the team and raise their morale by clarifying that the responsibility for the success of the product in the market is related to commercial and marketing factors outside the scope of the project.\n- It is also important to communicate with the business management to ensure that management understands the difference between the success of the project and the implementation of its tasks, and the success of the product in the market.\n\nWhy other options are wrong:\n. No action reinforces team frustration and does not show responsible leadership.\n- Discussing strategy with the business sponsor may be useful, but it is not one of the project manager's primary tasks in this context.",
      "choices": [
        {
          "text": "Have a discussion with the team to explain that the product success is not a direct result of the project and it does not reflect their performance",
          "correct": true
        },
        {
          "text": "Have a meeting with the business to make sure they understand the project met its objectives",
          "correct": true
        },
        {
          "text": "No action is necessary, as the project manager is only responsible for the project deliverables.",
          "correct": false
        },
        {
          "text": "Have a conversation with the business sponsor to validate the strategy for the new project based on this result.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following steps gives special attention to the group decision making processes?",
      "explanation": "The correct answer: turning ideas into action.\n\nExplanation: \n- Collective decision-making is not only about generating ideas or defining a problem, but requires an actual commitment to implement agreed solutions.\n- Turning ideas into action is the step that ensures that collective decisions are realized on the ground.\n\nWhy are other options wrong:\n- Defining a problem and generating solutions are important steps, but they focus on analysis rather than implementation.",
      "choices": [
        {
          "text": "Problem Definition",
          "correct": false
        },
        {
          "text": "Problem Solution Generation",
          "correct": false
        },
        {
          "text": "Ideas to Action",
          "correct": true
        },
        {
          "text": "Solution Action Planning",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "What is the difference between risks and issues? (Choose two).",
      "explanation": "The primary difference between risk and problems is that risks are potential or uncertain events that may occur in the future, while problems are confirmed or have already occurred and require remediation.\n\nCorrect answers:\n- Risks are uncertain and problems are certain: Because risks are probabilities while problems are real and have occurred.\n- Risks may not occur but the problem has occurred:  Because the risks may not materialize but the problems have already occurred.\n\nWrong choices:\n- Risks are confirmed and problems are uncertain: Incorrect because risks are uncertain and problems are certain.\n- Risks occurred and problems may not occur: False because problems are events that have already occurred.",
      "choices": [
        {
          "text": "Risks are uncertain and issues are certain.",
          "correct": true
        },
        {
          "text": "Risks are certain and issues are uncertain.",
          "correct": false
        },
        {
          "text": "Risks have occurred and issues may not occur.",
          "correct": false
        },
        {
          "text": "Risks may not occur and an issue has occurred.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager seeks to alleviate the IT department's workload while empowering the business to initiate new implementations and lay the groundwork for future solutions. How should the project manager facilitate this transition?",
      "explanation": "Correct answer:\n- Enable business units to use a simplified IT project management platform to initiate and follow up projects independently.\n\nExplanation:\n- This approach supports delegation of authority to business teams, reducing the burden on the IT department and allowing projects to start and execute quickly and flexibly.\n- Imposing strict policies or comprehensive evaluation that may lead to slowness and delays in project implementation.\n- Collaborating with cross-functional teams is important but does not demonstrate direct burden relief as in the correct answer.",
      "choices": [
        {
          "text": "Enforce stringent IT governance policies centralized within the IT department, ensuring uniformity and control over all IT endeavors.",
          "correct": false
        },
        {
          "text": "Mandate comprehensive IT project proposals to the IT department for assessment and approval before any project can commence.",
          "correct": false
        },
        {
          "text": "Enable business units to use a simplified IT project management platform to initiate and monitor projects independently.",
          "correct": true
        },
        {
          "text": "Collaborate with cross-functional IT business teams to jointly plan and execute IT projects, fostering cooperation between stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which of the following is different to the other options for managing external stakeholders in mega projects?",
      "explanation": "\"Persuasion\", \"prosecution\", and \"give and take\" are flexible communication and interaction strategies used to manage external stakeholders, and rely on building relationships and negotiation.\n\n\"Strict orders\" differ because they express a repressive or direct management style, usually inappropriate in managing external stakeholders with whom dealing requires diplomatic and negotiation skills.\n\nTherefore, the correct answer is \"strict orders\" because they differ in approach and style.",
      "choices": [
        {
          "text": "Persuasion",
          "correct": false
        },
        {
          "text": "Deputation",
          "correct": false
        },
        {
          "text": "Give and take",
          "correct": false
        },
        {
          "text": "Strict orders",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which one of the following is not a Resource-Based Power in relation to mega projects?",
      "explanation": "Resource-based powers depend on the use of human resources in a flexible manner such as contractual recruitment, talent acquisition, or secondment.\n\n\"Direct control recruitment\" is not considered a resource-based power because it refers to the exertion of direct authority or control, rather than the flexible use of resources.\n\nTherefore, the correct answer is \"Recruitment via Direct Control\" because it differs from other methods that rely on resource flexibility.",
      "choices": [
        {
          "text": "Recruiting on a contractual basis",
          "correct": false
        },
        {
          "text": "Recruiting expert talents",
          "correct": false
        },
        {
          "text": "Recruitment on the basis of secondment",
          "correct": false
        },
        {
          "text": "Recruitment via Direct Control",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager needs to ensure that the products of the organization meet certain government standards and regulations. The project manager's team is developing a business requirements document (BRD) to help in this regard.\n\n\n Which of the following statements are correct about compliance requirements? (Choose 2).",
      "explanation": "Compliance requirements are usually non-functional because they relate to the limitations and standards that the product or system must follow, not its direct functions. They must be clearly documented in the Business Requirements Document (BRD) to ensure compliance with laws and regulations.\n\nIn addition, these requirements must be part of the scope of the project in order to be effectively managed by the project team, ensuring that the product complies with the required regulatory standards.",
      "choices": [
        {
          "text": "Compliance requirements are functional requirements and must be included in the BRD.",
          "correct": false
        },
        {
          "text": "Compliance requirements are non-functional requirements and must be documented in the BRD.",
          "correct": true
        },
        {
          "text": "Compliance requirements should be part of the project scope and should be managed by the project team.",
          "correct": true
        },
        {
          "text": "Compliance requirements can be considered organization assets and do not need to be included in the BRD.",
          "correct": false
        },
        {
          "text": "Compliance requirements can not be considered organization assets and must be included in the BRD.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is on a project that is part of a business transformation initiative impacting most of the 10,000 employees in the company. The scope of the project is the improvement of collaboration between teams by implementing a new cloud platform that will replace a 20-year-old communication tool.\n\nWhat will be the most critical success factor?",
      "explanation": "In large business transformation projects, it is not enough to simply develop a good system or user interface; success requires effective planning and implementation of change management. Change management helps employees adapt to new tools and processes, and reduces resistance to change, which enhances the success of the new platform adoption and the achievement of project goals.\n\nTherefore, the most important success factor is good planning and implementation of change management to ensure acceptance by end users of the new system.",
      "choices": [
        {
          "text": "Good quality, go-live should have zero critical defects.",
          "correct": false
        },
        {
          "text": "Good user interface developed by talented graphical artists",
          "correct": false
        },
        {
          "text": "Good change management planning and execution",
          "correct": true
        },
        {
          "text": "Good change control process with fast approvals",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager in an organization is considering implementing an agile project delivery. The organization has a strong project management office (PMO) and a well-defined change control process.\n\nWhat key aspect of agile project delivery should the project manager emphasize as the most compelling argument for its adoption?",
      "explanation": "The agile approach is characterized by the ability to adapt to unexpected changes and changing business expectations in a fast and efficient way, making it particularly suitable for projects facing a changing environment or unstable demands. This is the main reason for choosing a flexible approach, as it allows for continuous response to variables rather than strict adherence to the original plan.\n\nOther options are true in terms of some of the features of agiles, but not the primary reason that promotes the adoption of a flexible approach in organizations with strict processes.",
      "choices": [
        {
          "text": "Agile delivery can improve quality through incremental delivery and efficient defect repair.",
          "correct": false
        },
        {
          "text": "Agile teams offer flexibility in accommodating planned changes while streamlining the approval process.",
          "correct": false
        },
        {
          "text": "The product owner utilizes a list known as the backlog to prioritize work items, including planned changes.",
          "correct": false
        },
        {
          "text": "Agile delivery is well-suited for handling unforeseen changes and shifting business expectations.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager for a large government organization decides to save money by changing the local implementation partner, and is considering using offshore resources instead.\n\nWhat are the main risks associated with using offshore resources? (Choose 3).",
      "explanation": "The use of external resources can create additional challenges due to time and culture differences, requiring greater oversight to ensure effective coordination. In addition, external resources may lack specialized business knowledge compared to the previous partner, which may affect the quality of implementation. Geopolitical differences may also lead to delays or complications in configuration and adaptation to the work environment.\n\nOther options may be correct in some cases, but they are not the primary or most common risks when using external resources.",
      "choices": [
        {
          "text": "Offshore resources may need more supervision due to time and cultural differences",
          "correct": true
        },
        {
          "text": "Offshore resources may not have the same business domain knowledge as the previous vendor",
          "correct": true
        },
        {
          "text": "Offshore resources may need more effort in planning and managing project budgets",
          "correct": false
        },
        {
          "text": "Offshore resources may need longer onboarding due to geopolitical differences",
          "correct": true
        },
        {
          "text": "Offshore resources may need detailed documentation due to time and cultural differences",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "A project manager is assigned to a very complex and technical project. The project manager is currently working on the resources plan, and intends to recommend to the project sponsor that external resources should be used instead.\n\nWhat risks can be mitigated using one or more vendors to deliver components of the project? (Choose 3).",
      "explanation": "Using external suppliers can help mitigate schedule risk by leveraging their expertise and ability to speed up delivery. Also, technical risks are reduced when specialized external resources with high technical expertise with the required components are outsourced. In addition, scope risks can be reduced through clarity and precise identification of what the external supplier will deliver, reducing the likelihood of deviation or delay resulting from blurred scope.\n\nFinancial and political risks are less likely to be mitigated only by external suppliers, and in some cases may even increase due to higher costs or contractual issues.",
      "choices": [
        {
          "text": "Financial",
          "correct": false
        },
        {
          "text": "Schedule",
          "correct": true
        },
        {
          "text": "Technical",
          "correct": true
        },
        {
          "text": "Political",
          "correct": false
        },
        {
          "text": "Scope",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What tool should a project manager incorporate to better identify and respond to common stakeholder resistance to change challenges?",
      "explanation": "Change management is the main tool that helps the project manager to recognize and address stakeholder resistance to change in a structured manner. By implementing change management, stakeholder communication, training, and psychological support efforts can be directed to alleviate fears, foster acceptance, and achieve success in implementing changes.\n\nWhile risk management, stakeholders, and communications are also important, change management focuses directly on resisting change.",
      "choices": [
        {
          "text": "Change management",
          "correct": true
        },
        {
          "text": "Risk management",
          "correct": false
        },
        {
          "text": "Stakeholder management",
          "correct": false
        },
        {
          "text": "Communication management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has identified stakeholders for a software development project: the sales team will be the primary users of the new software application; the IT department will be responsible for deploying and maintaining the new software application; and the project sponsor is the executive who is responsible for approving the project and providing funding. The project manager is in the planning phase of the project, and must engage the stakeholders.\n\nWhat is the most important thing for the project manager to do to build shared understanding?",
      "explanation": "The most important step to building a common understanding among all stakeholders is to clearly define their needs and expectations from the outset. This allows the project manager to plan work in line with end-user goals, IT department requirements, and executive sponsor expectations. Holding a project start-up meeting or preparing a communication plan is important, but they won't bring full benefit without precise identification of needs first.",
      "choices": [
        {
          "text": "Hold a kick-off meeting with all stakeholders.",
          "correct": false
        },
        {
          "text": "Create a stakeholder register and communication plan.",
          "correct": false
        },
        {
          "text": "Identify the stakeholders' needs and expectations.",
          "correct": true
        },
        {
          "text": "Document the stakeholders' concerns and risks.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team is arranging user testing to be completed for a project but does not have a strong enough server to do so. The team orders a new server and postpones user testing.\n\nWhat should the project manager do moving forward?",
      "explanation": "Since the new server is required to perform the test appropriately, the most appropriate option is to wait for the arrival of the new server while reevaluating the user test schedule. This ensures the quality of the test and does not compromise the results or customer satisfaction. Attempting to use an inappropriate server or canceling testing may lead to subsequent product quality issues.",
      "choices": [
        {
          "text": "Eliminate the user testing from the project plan.",
          "correct": false
        },
        {
          "text": "Utilize the current server to complete user testing.",
          "correct": false
        },
        {
          "text": "Request to expedite the new server from the supplier.",
          "correct": false
        },
        {
          "text": "Await the arrival of the new server and reevaluate timelines for user testing.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The team and product owner are reviewing user stories in the iteration planning meeting. While reviewing stories, it is identified that some of the high-value stories have more associated risks.\n\nWhat should the agile project manager do?",
      "explanation": "The correct answer is: It is recommended that the team include stories with risks in early iterations rather than late ones.\n\nCause: In an agile environment, it is always preferable to deal with high-value, high-risk items early to minimize their impact on the project. This approach allows the team to detect any issues early and adapt to challenges.\n\nWhy other options are wrong:\n- The team's choice of low-risk stories only may postpone larger problems, putting the project at risk later.\n- Working with the product owner is necessary, but the goal here is to prioritize based on value and risk and not just discuss.\n- Pareto analysis is typically used to analyze problems or defects, not to prioritize user stories in planning.",
      "choices": [
        {
          "text": "Recommend that the team include risky stories in early iterations rather than later ones.",
          "correct": true
        },
        {
          "text": "Recommend that the team choose stories with low risk for easy completion to keep team motivation high.",
          "correct": false
        },
        {
          "text": "Work with the product owner to decide on the stories that should go during the iteration.",
          "correct": false
        },
        {
          "text": "Use the Pareto analysis to decide which stories can be completed the fastest.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager sends out requests for regular status meetings and daily standup meetings during the project setup phase. However, business stakeholders are declining the meetings.\n\nWhat should the project manager do?",
      "explanation": "The correct answer is: Check why meetings were rejected.\n\nReason: The project manager needs to understand the motivation behind refusing to attend meetings, as there may be reasons such as frequency or timing of meetings, or unclear importance to them. After knowing why, the communication plan can be adjusted to suit their circumstances.\n\nWhy are the other options wrong:\n- Resharing the communication plan without knowing the underlying reason will not be effective.\n- Setting a code of conduct without addressing the underlying problem may cause stress.\n- Holding a project start-up meeting is an important step, but it is not the solution to the problem identified here.",
      "choices": [
        {
          "text": "Check why meetings are declined",
          "correct": true
        },
        {
          "text": "Re-share communications plan",
          "correct": false
        },
        {
          "text": "Set up a project team ground rules",
          "correct": false
        },
        {
          "text": "Hold a project kick-off meeting",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A research and development department is planning to develop a product that will introduce a new line of business for the organization. What should the project manager do to increase the project's chances of success?",
      "explanation": "The correct answer is: organize a session that focuses on the scope, vision, and mission of the initiative.\n\nWhy: When you start a completely new initiative such as a new product for a new business line, it is first necessary to unify the understanding among all parties about what is needed and why this project is being implemented. Focusing on the vision, scope, and mission helps guide all phases of the project later.\n\nWhy are other options wrong:\n- Starting the project plan directly with a previous template may lead to ignoring the peculiarities of this new project.\n- Impact analysis and feasibility studies are important, but they come after clarity of vision and scope.\n- The feasibility study is not a substitute for clarifying the vision and scope, but a subsequent complementary step.",
      "choices": [
        {
          "text": "Start developing the project management plan based on a previous project template from the project management office (PMO).",
          "correct": false
        },
        {
          "text": "Conduct an impact analysis of the new initiative to determine how the project should be rolled out.",
          "correct": false
        },
        {
          "text": "Plan a working session focusing on the scope, vision, and mission of the initiative.",
          "correct": true
        },
        {
          "text": "Conduct benchmarking to determine the business viability of the initiative.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Since the beginning of a project, the product owner keeps asking during ceremonies about the budget spent for each product iteration. The product owner seems much more interested in the cost rather than the product itself.\n\nWhat should the project manager have done earlier to change the product owner's behavior?",
      "explanation": "The correct answer is: Work with the product owner to clarify their role in the agile project and the scope of formal meetings.\n\nReason: In an agile environment, the role of the product owner focuses on prioritizing the work and the value that the product brings to the end user, not on budget management. Clarifying this role early avoids the product owner's preoccupation with matters that are not within his responsibility.\n\nWhy are other options wrong:\n- Using different estimation methods or submitting periodic financial reports may feed this behavior instead of correcting it.\n- Working with a fixed-rate contract does not solve the basic problem of uncertainty of the role.",
      "choices": [
        {
          "text": "Worked on different approaches of estimating to give confidence of the cost spent in each product increment",
          "correct": false
        },
        {
          "text": "Worked on a communications management plan with reports of budget spent in each iteration versus planned to avoid these discussions during ceremonies",
          "correct": false
        },
        {
          "text": "Worked with the product owner to clarify their role in an agile project and the scope of the agile ceremonies",
          "correct": true
        },
        {
          "text": "Worked on a fixed-price contract to switch the product owner's attention to value instead of money",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "What can a project manager do to communicate the formal project announcement and relevant information to stakeholders, and then gain their commitment?",
      "explanation": "The correct answer: develop a communication management plan.\n\n- Why?\nThe CMP outlines how information is shared with stakeholders throughout the project, and is a formal tool that helps gain their commitment by systematically communicating what they need to know.\n\n- Why are other options wrong?\n- Creating a project charter announces the start of the project but does not cover detailed communication.\n- The project start-up meeting is an important step but it is a one-time event, not an ongoing plan.\n-  The  RACI matrix defines responsibilities but does not focus on communication management.",
      "choices": [
        {
          "text": "Create the project charter.",
          "correct": false
        },
        {
          "text": "Conduct a kick-off meeting.",
          "correct": false
        },
        {
          "text": "Develop the communications management plan.",
          "correct": true
        },
        {
          "text": "Prepare and distribute the responsible, accountable, consult, and inform (RACI) matrix.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "While preparing a project's third progress report, the project manager identifies that the project will experience delays due to late material deliveries. The two previous project reports indicated that the project was on track.\n\nWhat should the project manager do next?",
      "explanation": "Correct answer: Add the delay to the case log and include it in the project report.\n\n- Why?\nWhen an issue affecting a project is discovered, it must be formally documented in the case log to ensure it is addressed and tracked, and then included in performance reports.\n\n- Why are other options wrong?\n- Discussing the matter with the team is a possible step but does not compensate for the official documentation.\n- Contacting the purchasing manager is a tactical step but not the first necessary action.\n- Escalation of the problem A subsequent decision depends on assessing the severity of the delay.",
      "choices": [
        {
          "text": "Discuss it with the project team to determine the most appropriate way to respond.",
          "correct": false
        },
        {
          "text": "Add it to the issue log and include it in the project report.",
          "correct": true
        },
        {
          "text": "Contact the procurement manager to expedite delivery of the material.",
          "correct": false
        },
        {
          "text": "Escalate the issue to the project owner and request a schedule change.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "An organization is under a business transformation. The project manager has been assigned to a project related to one of the new business lines.nnWhat should the project manager and team do before defining the scope of the project?",
      "explanation": "Correct answer: Adapt and allocate existing assets.\n\n- Why?\nBefore defining the scope of the project, it is important to review existing organizational assets such as WBS templates, previous plans, or lessons learned and adapt them to the requirements of the new project, saving time and ensuring consistency.\n\n- Why are other options wrong?\n- Lead a procurement meeting that takes place later after the scope has been defined.\n- The creation of a  WBS comes after the scoping has been defined, not before.\n- Approval of a feasibility study usually occurs before the start of the project and is not part of the project manager's task at the planning stage.",
      "choices": [
        {
          "text": "Lead a procurement meeting.",
          "correct": false
        },
        {
          "text": "Create a work breakdown structure (WBS).",
          "correct": false
        },
        {
          "text": "Adapt and tailor existing assets.",
          "correct": true
        },
        {
          "text": "Sign off on the business case.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A company outsources the execution of a project with a fixed-price contract to a supplier. During execution, the supplier agrees to deliver additional customer requirements that were not included in the contract. To fulfill the expanded scope, both parties add more resources to keep the project on the planned schedule.\n\nWhich technique is being applied in this project?",
      "explanation": "Correct answer: Crashing.\n\n- Why?\nCrashing is a scheduling technique that aims to reduce the duration of a project by adding additional resources without changing the scope of work. In this scenario, resources have been added to maintain the schedule.\n\n- Why are the other options wrong?\n-  Fast tracking: Means that activities are carried out in parallel rather than in sequence.\n-  Resource leveling is used to adjust the schedule based on resource availability rather than to speed it up.\n-  Lead and lag is used to modify the temporal relationships between activities and not to reduce the duration by adding resources.",
      "choices": [
        {
          "text": "Fast tracking",
          "correct": false
        },
        {
          "text": "Crashing",
          "correct": true
        },
        {
          "text": "Resource leveling",
          "correct": false
        },
        {
          "text": "Lead and lag",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is developing a project management plan to submit to the project sponsor in two weeks. The project sponsor, however, wants to review the early resource estimates before the deadline.\n\nWhat should the project manager do?",
      "explanation": "Correct answer: Share an initial version of the  RBS with the sponsor.\n\n- Why?\nResource Allocation Structure (RBS) displays the allocation and estimates of resources required for the project, and is suitable for reviewing initial estimates by the sponsor before the full plan is completed.\n\n- Why are other options wrong?\n- The request to wait until the WBS is completed may delay the process and not meet the sponsor's early request.\n- Share the budget estimate sheet (BES) may not clarify sufficient resource details at this point.\n- Reshare Statement of Work (SOW) does not provide details of required estimates for resources.",
      "choices": [
        {
          "text": "Ask the sponsor to wait until the Work breakdown structure (WBS) is done.",
          "correct": false
        },
        {
          "text": "Share a draft copy of the Budget Estimate Sheet (BES) with the sponsor.",
          "correct": false
        },
        {
          "text": "Re-share the Statement of Work (SOW) with the sponsor.",
          "correct": false
        },
        {
          "text": "Share a draft copy of the Resource Breakdown Structure (RBS) with the sponsor.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A customer requested a change to a functionality that is being delivered in the next iteration. The specialist responsible for this functionality was recently assigned to another project.\n\nWhat should the project manager do first?",
      "explanation": "Correct answer: Negotiate resource availability.\n\n- Why?\nIt is important to first check that the specialist is available to implement the required change before taking further steps, to ensure business continuity and no delay in delivery.\n\n- Why are other options wrong?\n- Requesting a new resource from HR may be unnecessary before checking availability.\n- Requesting a new resource from the sponsor before exploring existing options can be costly and inefficient.\n- Informing the customer that it is not possible to perform before checking availability is proactive and unprofessional.",
      "choices": [
        {
          "text": "Request a new resource from HR.",
          "correct": false
        },
        {
          "text": "Request a new resource from the project sponsor.",
          "correct": false
        },
        {
          "text": "Negotiate for the resource's availability.",
          "correct": true
        },
        {
          "text": "Tell the customer that the new change is not possible.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has just started building the team for a huge and complex project. The project manager is highly interested in having effective communication with their large team.\n\nWhat should the manager do to achieve this?",
      "explanation": "Correct answer: Create a process to share information with all team members.\n\n- Why?\nTo ensure effective communication in a large team, a clear and structured information sharing process that allows everyone to access developments and decisions regularly and reliably.\n\n- Why are other options wrong? Organizing group activities is useful but not enough on its own to ensure regular communication.\n- Clear and early assessment is important but does not cover ongoing communication.\n- Allowing a free exchange of ideas is good but needs an organizational framework to ensure its effectiveness in large teams.",
      "choices": [
        {
          "text": "Organize team activities to help team members express their interests.",
          "correct": false
        },
        {
          "text": "Establish a process of sharing information with all team members.",
          "correct": true
        },
        {
          "text": "Use timely and clear assessment of the situation with team members.",
          "correct": false
        },
        {
          "text": "Allow free exchange of ideas and opinions between team members.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "After completing the stakeholder analysis, the project manager is in the action planning phase. What should the project manager do with the stakeholders that have no interest or influence in the project?",
      "explanation": "The correct answer: keep a close eye on these stakeholders.\n\n- Why?\nEven stakeholders who show little interest or influence should be monitored regularly to identify any changes in their situation and avoid unexpected surprises.\n\n- Why are other options wrong?\n- Encouraging or focusing too much on uninterested stakeholders may consume useless resources.\n- Exploitation of these stakeholders is inappropriate because they have no influence or interest in the project.",
      "choices": [
        {
          "text": "Closely monitor these stakeholders",
          "correct": true
        },
        {
          "text": "Highly encourage these stakeholders",
          "correct": false
        },
        {
          "text": "Attentively focus on these stakeholders",
          "correct": false
        },
        {
          "text": "Visibly harness these stakeholders",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A vendor informs a project manager that the project's equipment can be delivered earlier than anticipated. The project manager recognizes that this is an opportunity to complete the project ahead of schedule.\n\nWhat should the project manager do next?",
      "explanation": "Correct answer: Determine if there are risks.\n\n- Why?\nThe project manager should assess the impact of early equipment delivery, including identifying any potential risks such as quality acceptance or impact on the overall schedule.\n\n- Why are other options wrong?\n- Request management approval may be necessary later but the first step is evaluation.\n- Using equipment provided directly without evaluation may lead to problems.\n- Adjustment of the project schedule should be done after a risk and opportunity analysis.",
      "choices": [
        {
          "text": "Request management approval.",
          "correct": false
        },
        {
          "text": "Use the equipment offered.",
          "correct": false
        },
        {
          "text": "Revise the project schedule.",
          "correct": false
        },
        {
          "text": "Determine if there is a risk.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier reports that they are over capacity, which may delay their delivery. What should the project manager update?",
      "explanation": "Correct answer: risk log.\n\n- Why?\nExcess production capacity that may delay delivery is a potential hazard that must be recorded for proper response planning.\n\n- Why are other options wrong?\n-  The stakeholder register is not suitable because it belongs to the stakeholders.\n-  The case log is used for current problems, not for potential risks.\n-  The project schedule may change later after the risk is addressed and not immediately upon receipt of the information.",
      "choices": [
        {
          "text": "Risk register",
          "correct": true
        },
        {
          "text": "Stakeholder register",
          "correct": false
        },
        {
          "text": "Issue log",
          "correct": false
        },
        {
          "text": "Project schedule",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A large risk to a project is identified, and the risk management plan is executed. Upon completion of the approved actions, what should the project manager do?",
      "explanation": "Correct answer: identify new risks and monitor residual risks.\n\n- Why?\nAfter implementing the risk management plan and dealing with the significant risk, the project manager should continue to monitor any remaining risks as well as identify new risks that may arise. This helps maintain risk control over the duration of the project.\n\n- Why are other options wrong?\n- Updating the risk management plan may be part of the work but is not the next essential step after implementation.\n- Adjusting the project schedule and budget depends on the impact of the risk, but it is not the first action after the completion of the procedures.\n- Updating lessons learned is usually done at the end of the project and not immediately after addressing a risk.",
      "choices": [
        {
          "text": "Update the risk management plan.",
          "correct": false
        },
        {
          "text": "Revise the project schedule and the budget.",
          "correct": false
        },
        {
          "text": "Update the lessons learned.",
          "correct": false
        },
        {
          "text": "Identify new risks, and monitor residual risks.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project's outcome is highly sensitive to and dependent upon financial market activity. Therefore, the company's financial advisor delivers daily exchange-rate forecasts. The project's budget was planned using a conservative scenario with high exchange-rate variations. The project manager now wants to review this budget to update the probability and impact of a possible new scenario using current financial conditions.\n\nTo what should the project manager refer?",
      "explanation": "Correct answer: risk log.\n\n- Why?\nThe risk register contains all risks that may affect the project, including scenarios related to exchange rate fluctuations, and must be updated continuously to assess the likelihood and impact of these risks.\n\n- Why are other options wrong?\n-  The stakeholder register relates to influential persons and not to financial risks.\n- Lessons learned document past experience and do not address current risk updates.\n- Market conditions External information that is not used as a formal reference for project risk management.",
      "choices": [
        {
          "text": "Stakeholder register",
          "correct": false
        },
        {
          "text": "Risk register",
          "correct": true
        },
        {
          "text": "Lessons learned",
          "correct": false
        },
        {
          "text": "Marketplace conditions",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "Which is the process that the project manager performs to prioritize individual project risks for further analysis or action by assessing their probability of occurrence and impact, as well as other characteristics?",
      "explanation": "Correct answer: qualitative risk analysis.\n\n- Why?\nQualitative risk analysis is the process by which the project manager and his team assess each risk based on its probability and impact to prioritize dealing with it, and it focuses on non-numerical or quantitative risk assessment.\n\n- Why are other options wrong?\n- Quantitative risk analysis uses numerical data to estimate the impact of risks but comes after qualitative analysis.\n- Risk identification is the first stage of collecting risks and not prioritization.\n- Risk management planning is the preparation of the general framework for risk management, not the prioritization of individual risks.",
      "choices": [
        {
          "text": "Quantitative Risk Analysis",
          "correct": false
        },
        {
          "text": "Qualitative Risk Analysis",
          "correct": true
        },
        {
          "text": "Identify Risks",
          "correct": false
        },
        {
          "text": "Plan Risk Management",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager has finished a qualitative risk analysis with their team. Which project documents may require updating based on this information?",
      "explanation": "Correct answer: risk log, assumption log, case log, risk report.\n\n- Why?\nAfter the qualitative analysis is completed, the risk register should be updated to reflect new risk priorities and assessments, and these findings may affect assumptions and open issues and should also be documented in the risk report to ensure effective follow-up.\n\n- Why are other options wrong?\n- The 'Risk Log, Risk Report, Lessons Learned' option is incomplete because it does not include the Assumption Log and Case History.\n-  The 'Risk Management Plan, Assumption Record' option does not include the underlying documents that change directly due to qualitative analysis.\n-  The 'Risk Log, Risk Report' option is incomplete because it does not cover all documents related to risks, assumptions and issues.",
      "choices": [
        {
          "text": "Risk Register, Risk Report, Lessons Learned",
          "correct": false
        },
        {
          "text": "Plan Risk Management, Assumption Log",
          "correct": false
        },
        {
          "text": "Risk Register, Assumption Log, Issue Log, Risk Report",
          "correct": true
        },
        {
          "text": "Risk Register, Risk Report",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A supplier for a regulatory project is responsible for making the component changes. The supplier is unlikely to meet the project schedule. Based on the risk response plan, the project manager secured stakeholder approval to use paper forms until the component changes go live. It is still possible, however, that the paper form changes may not be ready in time.\n\nWhich risk type is the project manager facing in this situation?",
      "explanation": "Correct answer: Residual risk.\n\n- Why?\nResidual risk is the risk that remains after the response plan is implemented, i.e. it cannot be completely eliminated but is reduced to an acceptable level. Here, although paper forms are adopted as an alternative, there is a possibility that the changes will not be ready in time.\n\n- Why are the other options wrong?\n- A secondary risk is a new risk that arises as a result of taking action in response to the primary risk, and is not the case here.\n-  The primary risk is the original risk before the response plan was implemented.\n-  The risk of compliance is related to non-compliance with laws or regulations, which is not related here.",
      "choices": [
        {
          "text": "Secondary risk",
          "correct": false
        },
        {
          "text": "Residual risk",
          "correct": true
        },
        {
          "text": "Primary risk",
          "correct": false
        },
        {
          "text": "Compliance risk",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project team often asks questions about the rationale for their work and how the client perceives their progress and deliverables. What should the project manager do to build trust and get the team engaged?",
      "explanation": "Correct answer: Share feedback and invite team members to case meetings with stakeholders.\n\n- Why?\nSharing feedback enhances transparency and provides the team with direct visibility into project progress and client expectations, increasing the team's sense of responsibility and engagement.\n\n- Why are other options wrong?\n- Reassuring the team without providing concrete data that may not be enough to build trust.\n- Presenting the project plan and progress reports is important but less interactive compared to the team's participation in case meetings.\n- Comparing pending tasks with completed may give a sense of accomplishment but does not address the team's need to understand the client's vision and feedback.",
      "choices": [
        {
          "text": "Share feedback and invite team members to status meetings with the stakeholders.",
          "correct": true
        },
        {
          "text": "Assure the team that the client is happy and you are handling the expectations.",
          "correct": false
        },
        {
          "text": "Present the project plan and progress report to the team with regular updates when revised",
          "correct": false
        },
        {
          "text": "Compare the pending tasks to the completed tasks so the team has a sense of accomplishment.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "The project manager is having difficulties persuading stakeholders to adopt new technlogy in the project.\n What should the project manager have done to avoid this resistance?",
      "explanation": "The correct answer: engage stakeholders as soon as possible.\n\n- Why? Engaging stakeholders early helps build their acceptance and support, and reduces resistance to change by interacting directly with them and understanding their concerns and needs.\n\n- Why are other choices wrong? Investing in effective communication is important, but it comes after stakeholder engagement, not its substitute.\n- Providing technical support does not address resistance to change on a psychological and behavioral level.\n- Proposing a formal agreement may not guarantee the actual acceptance and cooperation required.",
      "choices": [
        {
          "text": "Invest in stakeholders' communication",
          "correct": false
        },
        {
          "text": "Provide technical support to stakeholders",
          "correct": false
        },
        {
          "text": "Propose an agreement to stakeholders",
          "correct": false
        },
        {
          "text": "Engage stakeholders as early as possible",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "In a hybrid project, the project manager receives a notification that, in response to a recent court decision, a new project requirement must be incorporated into the project scope. What should the project manager do?",
      "explanation": "Correct answer: Submit a change request to the Change Control Board (CCB).\n\n- Why? Any change in project scope must go through a formal approval process, especially in hybrid projects that combine traditional and agile methods, to ensure that the change is documented and monitored and its impact on the project.\n\n- Why are other options wrong?\n- Accepting the new requirement directly may result in exceeding the scope of the project without evaluating its impact.\n- Excluding the requirement may conflict with legal obligations.\n- Including the requirement after a meeting with stakeholders is insufficient without formal approval.",
      "choices": [
        {
          "text": "Accept the new requirement as part of the project scope.",
          "correct": false
        },
        {
          "text": "Exclude the new requirement from the project scope.",
          "correct": false
        },
        {
          "text": "Submit a change request to the change control board (CCB).",
          "correct": true
        },
        {
          "text": "Incorporate the new requirement after meeting with stakeholders.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "A project manager is working on a critical project for which historical data is unavailable. This may put the project at risk.\n\nWhat should the project manager do?",
      "explanation": "The correct answer: develop a risk management plan and inform key stakeholders of potential risks.\n\n- Why?\nWhen historical data is not available, the estimate is more accurate with systematic risk management and stakeholder involvement in identifying and dealing with potential risks.\n\n- Why are other options wrong?\n- Planning based on risk appetite only without a clear plan is insufficient.\n- Developing a project management plan without a special focus on risk will not adequately protect the project.\n- Informing the sponsor only without developing a response plan does not ensure that the risks are effectively addressed.",
      "choices": [
        {
          "text": "Plan project execution based on stakeholders' risk appetites.",
          "correct": false
        },
        {
          "text": "Develop the project management plan to identify and prioritize opportunities and threats.",
          "correct": false
        },
        {
          "text": "Inform the sponsor of the risk involved, then continue with project delivery.",
          "correct": false
        },
        {
          "text": "Develop a risk management plan and inform key stakeholders about the risks involved.",
          "correct": true
        }
      ]
    }
  ]
}