{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "تلقى فريق المشروع تدريبًا على التكنولوجيا المتعلقة بأحد مخرجات المشروع. خلال تسعة أشهر من العمل على المشروع، تم استبدال عدة أعضاء من الفريق. تباطأت الإنتاجية لأن الأعضاء الجدد غير ملمين بالتكنولوجيا، وأصبح جدول المشروع مهددًا بالتأخير. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الحل الصحيح هو الاجتماع مع الفريق بأكمله وطلب من الأعضاء الحاليين تدريب الأعضاء الجدد لأن هذا الخيار هو الأسرع والأكثر كفاءة لتجاوز المشكلة دون تأخير أو زيادة التكاليف. الاستفادة من خبرة الأعضاء الحاليين لتعزيز التماسك داخل الفريق وتوفير الوقت والموارد أفضل من بدء تدريب رسمي طويل أو استقدام أعضاء جدد.\n\nالخيارات الأخرى غير فعالة كخطوة أولى: التفاوض مع راعي المشروع لزيادة الميزانية خيار متأخر ومكلف. إصدار طلب تغيير لاستقدام أعضاء جدد غير عملي لأنه يسبب تأخير إضافي ويؤثر على تماسك الفريق. تسهيل ورشة عمل مع خبير متخصص فكرة جيدة لكنها مكلفة وتستغرق وقتًا، لذلك ليست الخيار الأمثل في البداية.",
      "choices": [
        {
          "text": "الاجتماع مع الفريق بأكمله وطلب من الأعضاء الحاليين تدريب الأعضاء الجدد.",
          "correct": true
        },
        {
          "text": "التفاوض مع راعي المشروع لزيادة الميزانية من أجل تدريب إضافي للأعضاء الجدد.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير لاستقدام أعضاء جدد مدربين مسبقًا على التكنولوجيا المعنية.",
          "correct": false
        },
        {
          "text": "تسهيل ورشة عمل مع خبير متخصص لتعريف الأعضاء الجدد بالتكنولوجيا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اليوم السابق لبدء أعمال البناء، علم مدير المشروع أن مخطط الهيكل لم يُقبل من قبل العميل. ما الخطوة الأولى التي يجب على مدير المشروع اتخاذها لضمان الالتزام بالجدول الزمني؟",
      "explanation": "الحل الصحيح هو الاجتماع مع العميل في أسرع وقت ممكن لمناقشة التعديلات على المخطط. هذه الخطوة تعالج المشكلة مباشرة وتساعد على التوصل إلى اتفاق أو تصحيح عاجل قبل أن يؤثر ذلك على بدء أعمال البناء. بما أن الجدول الزمني مهدد، فإن الحل الفوري هو التواصل المباشر مع العميل لتحديد المطلوب بالضبط وتجنب التأخير.\n\nشرح الخيارات الخاطئة:\n- بدء البناء حسب الموعد مع مراجعة المخطط مع العميل في نفس الوقت: هذا خيار غير مسؤول وخطير لأن بدء العمل بدون موافقة رسمية قد يؤدي إلى إعادة العمل وتكاليف إضافية.\n- مناقشة عملية قبول مكونات المخرجات مع العميل: هذا خيار عام جداً ولا يعالج المشكلة الفورية الحالية.\n- مراجعة خطة تفاعل أصحاب المصلحة وتوقعاتهم: رغم أهميته على المدى الطويل، إلا أنه ليس الإجراء المناسب كخطوة أولى في حالة أزمة تتطلب تدخل فوري مع العميل.",
      "choices": [
        {
          "text": "الاجتماع مع العميل في أسرع وقت ممكن لمناقشة التعديلات على المخطط.",
          "correct": true
        },
        {
          "text": "بدء البناء حسب الموعد مع مراجعة المخطط مع العميل في نفس الوقت.",
          "correct": false
        },
        {
          "text": "مناقشة عملية قبول مكونات المخرجات مع العميل.",
          "correct": false
        },
        {
          "text": "مراجعة خطة تفاعل أصحاب المصلحة وتوقعاتهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن الفريق سيتأخر عن تحقيق أحد المراحل لأن العضو (أ) لم يُكمل متطلبات المهمة التي يحتاجها العضو (ب). عند الاجتماع مع العضو (أ)، ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الحل الصحيح هو تحديد أي عقبات تعيق استكمال المهام ومعرفة ما إذا كان العضو (أ) بحاجة إلى المساعدة. هذه الخطوة تمثل أسلوب القيادة الداعم والتحليلي، حيث يتحقق مدير المشروع من الأسباب الجذرية لعدم الإنجاز ويوفر الدعم اللازم، سواء كان تدريبًا أو إزالة عوائق.\n\nشرح الخيارات الخاطئة:\n- أ: غير مسؤول، نقل المسؤولية دون معالجة السبب ليس حلاً فعالاً.\n- ج: حل سريع لكن سطحي، لا يعالج المشكلة من جذورها.\n- د: تجنّب للمشكلة، يجب مساعدة العضو لا التخلص منه أو استبداله.",
      "choices": [
        {
          "text": "توجيه العضو (أ) لنقل مسؤوليات إكمال المتطلبات إلى العضو (ب).",
          "correct": false
        },
        {
          "text": "تحديد أي عقبات تعيق استكمال المهام ومعرفة ما إذا كان العضو (أ) بحاجة إلى المساعدة.",
          "correct": true
        },
        {
          "text": "طلب من العضو (أ) العمل مباشرة مع العضو (ب) لاستكمال المتطلبات بهدف تحقيق المرحلة.",
          "correct": false
        },
        {
          "text": "طلب من العضو (أ) اقتراح بديل يمكنه إكمال المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يضم مشروع تقني أعضاء من دول متعددة. يرى أصحاب المصلحة أن هذا التوزيع سيحافظ على بقاء المشروع ضمن الميزانية، لكن مدير المشروع يعتقد أن هناك مشاكل محتملة قد تؤثر على نجاح المشروع لم تؤخذ بالحسبان. ما الذي يجب على مدير المشروع فعله لتوثيق هذا القلق؟",
      "explanation": "الحل الصحيح هو توثيق المخاطر في سجل المخاطر. ما ذكره مدير المشروع هو احتمال حدوث مشكلة مستقبلية مثل مشاكل في التوقيت أو التواصل، وهذه تقع ضمن إدارة المخاطر لأنها لم تحدث بعد.\n\nشرح الخيارات الخاطئة:\n- ب: تعديل خطة تفاعل أصحاب المصلحة ليس مناسبًا لأن القلق هنا يتعلق بمخاطر محتملة وليس بتفاعل أصحاب المصلحة.\n- ج: تسجيل المعلومة في سجل المشكلات غير مناسب لأن المشكلة لم تحدث بعد، فهي مجرد احتمال.\n- د: تحديث خطة إدارة الموارد لا يعالج القلق المتعلق بالمخاطر المحتملة التي أشار إليها مدير المشروع.",
      "choices": [
        {
          "text": "توثيق المخاطر في سجل المخاطر.",
          "correct": true
        },
        {
          "text": "تعديل خطة تفاعل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسجيل المعلومة في سجل المشكلات.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ اثنان من أصحاب المصلحة مدير المشروع أن حالة مرحلة حرجة في المشروع لم تُبلغ إليهما. على الرغم من أن هذه المرحلة تقع ضمن مجال اهتمامهما، إلا أنه تم التعرف عليهما مؤخرًا فقط. ما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "الحل الصحيح هو إجراء تحليل لأصحاب المصلحة وتحديث سجل أصحاب المصلحة. السبب أن أصحاب المصلحة الجدد تم التعرف عليهم مؤخرًا، ومن المهم تحديد اهتماماتهم ومستوى تأثيرهم والتأكد من إدراجهم بشكل رسمي في خطة التواصل. تحديث سجل أصحاب المصلحة يسمح بإدارة توقعاتهم وضمان شمولهم في الاتصالات القادمة.\n\nشرح الخيارات الخاطئة:\n- مراجعة خطة إدارة الاتصالات: خطوة مهمة لكنها تأتي بعد معرفة من هم أصحاب المصلحة الجدد وتحديث السجل.\n- تحديد طرق جديدة لإرسال تقارير حالة المشروع: إجراء لاحق بعد تحديث سجل أصحاب المصلحة.\n- جدولة اجتماع حالة المشروع ودعوة أصحاب المصلحة الجديدين: مفيد لكن ليس الخطوة الأولى قبل تحديث سجل أصحاب المصلحة وتقييمهم.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لأصحاب المصلحة وتحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تحديد طرق جديدة لإرسال تقارير حالة المشروع لجميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع حالة المشروع ودعوة أصحاب المصلحة الجديدين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع في مرحلة التنفيذ يسير وفق الخطة وضمن الميزانية. يطلب أحد أصحاب المصلحة الرئيسيين تغييرًا في وتيرة التواصل، حيث يرغب في التوقف عن تلقي تقارير الحالة الأسبوعية ويُفضل أن يتم إخطاره فقط في حال وجود مشكلة تتطلب انتباهه. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الحل الصحيح هو تعديل خطة إدارة الاتصالات لتعكس طلب صاحب المصلحة. خطة إدارة الاتصالات تحدد كيفية التواصل مع أصحاب المصلحة، تكرار التقارير، نوع المعلومات، وطريقة إيصالها. عند وجود طلب رسمي من صاحب مصلحة رئيسي بتغيير وتيرة التواصل، يجب تحديث هذه الخطة لضمان تلبية توقعاته وفعالية التواصل.\n\nالخيارات الخاطئة:\n- مراجعة خطة تفاعل أصحاب المصلحة لتحديد مدى مشاركة هذا الطرف: خطوة مهمة لكنها ليست الإجراء الأول بعد طلب التغيير، لأن خطة تفاعل أصحاب المصلحة تُركز على مستوى مشاركة أصحاب المصلحة وليس طريقة التواصل المحددة.\n- سؤال أصحاب المصلحة الآخرين إذا كانوا يرغبون أيضًا في تقليل عدد الإشعارات: قد يؤدي إلى تأخير وإرباك، فكل صاحب مصلحة له تفضيلاته الخاصة ويجب احترامها بشكل فردي.\n- الاجتماع مع صاحب المصلحة لمناقشة كمية ونوع المعلومات التي يجب التواصل بها: رغم أن النقاش مفيد، لكن الخطوة الأولى العملية هي تعديل خطة الاتصالات رسميًا وفق الطلب.\n\nتعديل خطة الاتصالات يضمن توثيق التغيير مما يسهل المتابعة ويقلل الالتباس. يجب تنفيذ التغيير بسرعة لتجنب إرسال معلومات غير مرغوبة تؤثر على رضا صاحب المصلحة. التواصل الفعّال مع أصحاب المصلحة يساهم في نجاح المشروع ورضاهم.",
      "choices": [
        {
          "text": "مراجعة خطة تفاعل أصحاب المصلحة لتحديد مدى مشاركة هذا الطرف.",
          "correct": false
        },
        {
          "text": "سؤال أصحاب المصلحة الآخرين إذا كانوا يرغبون أيضًا في تقليل عدد الإشعارات.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة الاتصالات لتعكس طلب صاحب المصلحة.",
          "correct": true
        },
        {
          "text": "الاجتماع مع صاحب المصلحة لمناقشة كمية ونوع المعلومات التي يجب التواصل بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع مشروعًا له جدول زمني صارم ويتطلب طرحًا سريعًا في السوق لأن هناك منافسًا يعمل على منتج مشابه. لا يستطيع فريق المشروع تحقيق تاريخ التشغيل المحدد، ولا توجد موارد داخلية أخرى يمكنها المساعدة. كيف يمكن لمدير المشروع التخفيف من هذا الخطر؟",
      "explanation": "الحل الصحيح هو البحث عن موارد خارجية يمكنها المساعدة في تحقيق تاريخ التشغيل المطلوب. عندما تكون الموارد الداخلية غير كافية أو غير متاحة، فإن الاستعانة بمصادر خارجية (Outsourcing) تُعتبر استراتيجية فعالة لتقليل خطر التأخير وضمان تحقيق المواعيد النهائية. هذا يسمح بتوفير خبرات إضافية أو زيادة القدرة الإنتاجية دون الحاجة إلى توظيف دائم أو إعادة هيكلة الفريق.\n\nالأخطاء في الخيارات الأخرى:\n- مطالبة الفريق بإزالة العوائق التي تمنعهم من الالتزام بتاريخ التشغيل: رغم أهمية إزالة العوائق، إلا أن المشكلة هنا تتعلق بنقص الموارد، وهذا الخيار لا يعالج السبب الأساسي.\n- طلب من راعي المشروع تحديد تاريخ تشغيل جديد بناءً على الموارد المتاحة: تغيير التاريخ يجب أن يكون خيارًا أخيرًا بعد محاولة تخفيف الخطر، وليس الخطوة الأولى.\n- طلب من الفريق التركيز فقط على الميزات الأساسية والالتزام بتاريخ التشغيل: تقليل نطاق العمل (التصغير) قد يكون استراتيجية صحيحة لكنه غير مذكور هنا كخيار، وبدون موارد إضافية، قد لا يكون كافيًا لتحقيق الموعد.\n\nباختصار، الاستعانة بالموارد الخارجية هو الحل الأنسب لتخفيف خطر التأخير في هذا السياق.",
      "choices": [
        {
          "text": "البحث عن موارد خارجية يمكنها المساعدة في تحقيق تاريخ التشغيل المطلوب.",
          "correct": true
        },
        {
          "text": "مطالبة الفريق بإزالة العوائق التي تمنعهم من الالتزام بتاريخ التشغيل.",
          "correct": false
        },
        {
          "text": "طلب من راعي المشروع تحديد تاريخ تشغيل جديد بناءً على الموارد المتاحة.",
          "correct": false
        },
        {
          "text": "طلب من الفريق التركيز فقط على الميزات الأساسية والالتزام بتاريخ التشغيل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بإغلاق مشروع تم الانتهاء منه رسميًا. لماذا يجب على مدير المشروع توثيق الأنشطة النهائية للمشروع؟",
      "explanation": "السبب الأساسي لتوثيق الأنشطة النهائية للمشروع هو جمع وتوثيق الدروس المستفادة وأرشفة المعلومات التاريخية. هذا يساعد المؤسسات على تحسين العمليات المستقبلية من خلال الاستفادة من الخبرات المكتسبة، ويُعد جزءًا هامًا من إدارة المعرفة. بالإضافة إلى ذلك، يضمن ذلك حفظ الوثائق المهمة التي قد تُستخدم في مشاريع مستقبلية أو لمراجعة الأداء.\n\nالخيارات الخاطئة:\n- تسجيل دراسات الحالة والمراجع الخاصة بالعميل: هذه ليست الوظيفة الأساسية لتوثيق الأنشطة النهائية.\n- تسجيل مؤشرات أداء المشروع النهائية وتحليل الجودة: رغم أهمية هذه المعلومات، إلا أنها جزء من التقارير الفنية وليست السبب الأساسي لتوثيق الأنشطة النهائية.\n- السماح للعميل بتقديم الفواتير واستلام إيصال الدفع النهائي: هذه إجراءات مالية وليست جزءًا من توثيق الأنشطة النهائية للمشروع.",
      "choices": [
        {
          "text": "لتسجيل دراسات الحالة والمراجع الخاصة بالعميل.",
          "correct": false
        },
        {
          "text": "لتسجيل مؤشرات أداء المشروع النهائية وتحليل الجودة.",
          "correct": false
        },
        {
          "text": "لتوثيق الدروس المستفادة وأرشفة المعلومات التاريخية.",
          "correct": true
        },
        {
          "text": "للسماح للعميل بتقديم الفواتير واستلام إيصال الدفع النهائي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اشتكى اثنان من أصحاب المصلحة الرئيسيين، وهما أيضًا عضوين في مجلس التحكم في التغيير (CCB)، من أنه لم يتم إبلاغهم بتمديد جدول المشروع. يعلم مدير المشروع أن التمديد كان ضروريًا لإضافة قيمة للمشروع. ما الذي كان يجب على مدير المشروع فعله لتجنب هذه المشكلة؟",
      "explanation": "في إدارة التغيير داخل المشاريع، خاصة عندما يتعلق الأمر بتغييرات تؤثر على الجدول الزمني، التواصل مع أصحاب المصلحة الأساسيين هو أمر ضروري جدًا. هؤلاء أصحاب المصلحة هم أيضًا أعضاء في مجلس التحكم في التغيير (CCB)، مما يعني أنهم يجب أن يكونوا على دراية بكل الخطوات التي تؤثر على المشروع.\n\nالخطأ الرئيسي في الحالة هو عدم التشاور معهم قبل تقديم طلب التغيير الرسمي. هذا قد يسبب إحباطًا لهم ويؤدي إلى مشاكل في التواصل والثقة.\n\n- لماذا التشاور مهم؟\nالتشاور يضمن أن أصحاب المصلحة يفهمون أسباب التغيير ويوافقون عليه قبل إتمام العملية. هذا يعزز الشفافية ويساعد في تقليل الاعتراضات أو المشكلات المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقديم طلب التغيير بدون التشاور: يؤدي إلى نقص في الشفافية ويغضب أصحاب المصلحة.\n- إجراء تحليل ماذا لو: هذا خطوة تقنية جيدة لكن ليست البدء الصحيح في التواصل مع أصحاب المصلحة.\n- سؤال راعي المشروع عن هامش زمني: لا يتصل مباشرة بإبلاغ أصحاب المصلحة.",
      "choices": [
        {
          "text": "تقديم طلب تغيير إلى مجلس التحكم بالكامل دون مناقشته أولاً مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إجراء تحليل ماذا لو لتحديد أثر التغيير.",
          "correct": false
        },
        {
          "text": "سؤال راعي المشروع إذا كان هناك هامش زمني (float) في الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "التشاور مع أصحاب المصلحة قبل اتباع عملية التغيير المعتمدة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مراجعة لإحدى التكرارات، لم يتم استيفاء تعريف الانتهاء (DoD). ما هو الإجراء المناسب الذي يجب أن يتخذه مدير المشروع؟",
      "explanation": "عندما لا يتم استيفاء تعريف الانتهاء (Definition of Done - DoD)، فهذا يعني أن المخرجات أو الميزات لم تحقق المتطلبات المحددة التي تجعل العمل مكتملًا. الإجراء الصحيح هو تحديد السبب الجذري لهذه المشكلة مع الفريق خلال اجتماع الاستعراض الرجعي (Retrospective)، ومن ثم اقتراح خطة لمعالجة أوجه القصور لضمان تحسّن مستمر.\n\n- لماذا الخيار الصحيح؟\nهذا النهج تحليلي وتعاوني، يشجع الفريق على تحديد المشكلات والعمل على تحسين الأداء والجودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب تحديث الميثاق وإعادة تعيين السلطات: إجراء رسمي وثقيل ولا يعالج المشكلة المباشرة.\n- طلب تطوير ميزات جديدة: قد يؤدي إلى إضافة عمل غير مطلوب دون فهم السبب الأساسي.\n- إرسال طلب تغيير مع ميزانية إضافية: لا يجب طلب تغييرات مالية دون تحديد جذري للمشكلة وحلها أولاً.",
      "choices": [
        {
          "text": "طلب من راعي المشروع تحديث ميثاق المشروع وإعادة تعيين السلطات والمسؤوليات.",
          "correct": false
        },
        {
          "text": "طلب من فريق المشروع تطوير ميزات جديدة لتحل محل الميزات التي تم رفضها.",
          "correct": false
        },
        {
          "text": "تحديد السبب الجذري مع الفريق في اجتماع الاستعراض الرجعي واقتراح خطة لمعالجة أوجه القصور.",
          "correct": true
        },
        {
          "text": "إرسال طلب تغيير جديد إلى مجلس التحكم (CCB) للموافقة عليه مع إضافة ميزانية إلى الخط الأساسي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اقترح الراعي تعديلًا في نطاق المشروع يحظى بشعبية بين فريق المشروع وأصحاب المصلحة الرئيسيين. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "يجب على مدير المشروع اتباع عملية إدارة التغيير الرسمية لضمان توثيق التعديل ومراجعته والموافقة عليه بشكل صحيح قبل تنفيذه.\n\n- لماذا الخيار الصحيح؟\nعملية إدارة التغيير تحافظ على السيطرة على نطاق المشروع وتمنع التغييرات العشوائية التي قد تؤثر على الجدول الزمني أو الميزانية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ أصحاب المصلحة: مجرد الإبلاغ غير كافٍ دون اتباع العملية الرسمية.\n- تحديث متطلبات المشروع: يحدث فقط بعد الموافقة الرسمية.\n- تعديل هيكل تقسيم العمل: يتم بعد الموافقة والتحديث الرسمي للنطاق.",
      "choices": [
        {
          "text": "اتباع عملية إدارة التغيير.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة بالتغيير.",
          "correct": false
        },
        {
          "text": "تحديث متطلبات المشروع.",
          "correct": false
        },
        {
          "text": "تعديل هيكل تقسيم العمل (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تأخر مزود خارجي في تسليم عنصر مكتمل. كإجراء حسن نية وللحفاظ على جدول المشروع، عرض المزود تحمل تكلفة استئجار نظام مؤقت. وبما أنه لن يحدث أي تأخير في الجدول، ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "رغم أن الحل المقترح لا يؤثر على الجدول الزمني، إلا أنه يمثل تغييرًا في التكاليف أو الموارد أو الإجراءات، ولذلك يجب تطبيق عملية التحكم المتكامل في التغيير (Integrated Change Control).\n\n- لماذا الخيار الصحيح؟\nأي تغيير (حتى وإن كان يبدو غير مؤثر على المخرجات) يجب أن يمر عبر هذه العملية لضمان توثيقه، ومراجعته، والحصول على الموافقات اللازمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إدراج المورد في WBS: لا يتم إدراجه إلا بعد الموافقة على التغيير.\n- عدم اتخاذ أي إجراء: يتعارض مع سياسات التغيير المنهجية.\n- تحديث مستندات المشروع: يتم فقط بعد الموافقة الرسمية على التغيير.",
      "choices": [
        {
          "text": "إدراج هذا المورد الإضافي في هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "عدم اتخاذ أي إجراء إضافي لأنه لا يوجد تأخير في الجدول.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية التحكم المتكامل في التغيير.",
          "correct": true
        },
        {
          "text": "تحديث مستندات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استأنف مدير مشروع جديد مشروعًا في مرحلة التنفيذ. خلال اجتماع حالة المشروع، أبلغ أحد أعضاء الفريق عن مشكلة نقلها صاحب مصلحة. ما الذي يجب أن يفعله مدير المشروع الجديد أولاً؟",
      "explanation": "عند تولي مدير جديد للمشروع وظهور مشكلة تم التبليغ عنها، فإن الخطوة الأولى المنهجية هي الرجوع إلى سجل المشكلات (Issue Log) للتأكد مما إذا كانت المشكلة موثقة مسبقًا، وفهم سياقها والتصرف بناءً على المعلومات المتوفرة.\n\n- لماذا الخيار الصحيح؟\nالرجوع إلى سجل المشكلات يوفر الأساس لاتخاذ قرارات مبنية على بيانات دقيقة وسابقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- معالجة المشكلة فورًا: قد يؤدي إلى قرارات غير مدروسة دون فهم كافٍ.\n- مراجعة خطة أصحاب المصلحة: غير مرتبط بشكل مباشر بالمشكلة الحالية.\n- تحديث خطة المخاطر: المشكلة الحالية ليست خطرًا محتملاً بل حدث قائم.",
      "choices": [
        {
          "text": "مراجعة سجل المشكلات.",
          "correct": true
        },
        {
          "text": "معالجة المشكلة فورًا.",
          "correct": false
        },
        {
          "text": "مراجعة خطة تفاعل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قدّم بائع جدولًا زمنيًا عالي المستوى لمشروع مدته ثلاث سنوات، بما في ذلك جدول مفصل لمرحلة التصميم. ماذا يصف هذا الأسلوب؟",
      "explanation": "هذا المثال يعكس أسلوب تخطيط الموجات المتلاحقة (Rolling Wave Planning)، وهو أسلوب تدريجي يتم فيه تخطيط الأنشطة القريبة بتفصيل كبير، بينما تُخطط الأنشطة البعيدة بشكل عام. يتم تحديث التفاصيل تدريجيًا مع تقدم المشروع.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن البائع قدّم جدولًا مفصلًا لمرحلة حالية (التصميم) فقط، بينما أبقى بقية المشروع عالي المستوى، وهذا جوهر التخطيط التدريجي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n التفكيك (Decomposition): يتعلق بتقسيم نطاق العمل وليس الجدولة المرحلية.\nالحكم الخبروي (Expert judgment): أسلوب يستخدم لاتخاذ قرارات مستندة إلى الخبرة، وليس أسلوب تخطيط زمني.\n القوالب (Templates): أدوات تساعد في التوثيق أو التخطيط، لكنها ليست أسلوبًا لتقسيم الجدول الزمني.",
      "choices": [
        {
          "text": "تخطيط الموجات المتلاحقة (Rolling wave planning).",
          "correct": true
        },
        {
          "text": "التفكيك (Decomposition).",
          "correct": false
        },
        {
          "text": "الحكم الخبروي (Expert judgment).",
          "correct": false
        },
        {
          "text": "القوالب (Templates).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لمعالجة تغيير في المتطلبات، يحتاج فريق المشروع إلى أن يكون محفزًا ومرنًا لإعادة ترتيب الأولويات. ما هو أسلوب القيادة الذي سيساعد الفريق على الأداء الجيد في ظروف متغيرة وغير مؤكدة؟",
      "explanation": "النهج التعاوني في القيادة (Collaborative Leadership) يُعد الأنسب في البيئات المتغيرة وغير المؤكدة. حيث يُركز على تمكين الفريق، والتشجيع على الابتكار، وتسهيل التفاعل بين الأعضاء لتحقيق الأهداف المشتركة.\n\n- لماذا الخيار الصحيح؟\nلأن النهج التعاوني يعزز التحفيز والتعلم المستمر، ويمنح الفريق مساحة لإعادة ترتيب الأولويات والتكيف مع التغيرات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• النهج التوجيهي يركز على السيطرة وتوجيه الأوامر، وهو أقل فعالية في بيئات تحتاج إلى مرونة.\n• التوثيق لا يعالج التغير في المتطلبات بشكل مباشر.\n• تكييف الرؤية أمر استراتيجي، لكن القيادة المرنة تكون أكثر فعالية في تسيير الفريق خلال التغيرات اليومية.",
      "choices": [
        {
          "text": "النهج التعاوني يعزز التحفيز والتعلم والنمو والابتكار حول رؤية المشروع.",
          "correct": true
        },
        {
          "text": "النهج التوجيهي يعزز ثقة الفريق من خلال التأكد من أن الأعضاء يعملون فقط في المهام التي تناسب مؤهلاتهم.",
          "correct": false
        },
        {
          "text": "النهج التعاوني يضمن توثيق إجراءات المشروع بشكل كافٍ لتغطية جميع الحالات.",
          "correct": false
        },
        {
          "text": "النهج التوجيهي يُعِد الفريق للتغييرات المتكررة من خلال تكييف رؤية المشروع مع الاتجاهات الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد نجاح في مرحلة صعبة من المشروع، قام مدير المشروع بإعادة تعيين عضو فريق عالي الأداء إلى مهمة أكثر استراتيجية. ما الذي يمثل هذا المثال؟",
      "explanation": "هذا المثال يُظهر استخدام أسلوب الاعتراف (Recognition)، وهو عنصر مهم في إدارة الفريق وتحفيز الأداء. عندما يلاحظ مدير المشروع أداءً متميزًا، فإن مكافأة هذا الجهد بتكليف الشخص بمهام أكثر أهمية يُعد شكلاً من أشكال التقدير والتحفيز.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن إعادة تعيين عضو الفريق إلى مهمة أكثر استراتيجية يُعتبر نوعًا من المكافأة المعنوية التي تعترف بجهده وتفوقه.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• قبول المخاطر: لا علاقة له بتكليف المهام أو الأداء.\n• الإرشاد: يتضمن تقديم التوجيه والنصح، وليس تكليفًا جديدًا.\n• تغيير في النطاق: يرتبط بنطاق العمل في المشروع، وليس بالموارد البشرية.",
      "choices": [
        {
          "text": "الاعتراف.",
          "correct": true
        },
        {
          "text": "قبول المخاطر.",
          "correct": false
        },
        {
          "text": "الإرشاد.",
          "correct": false
        },
        {
          "text": "تغيير في النطاق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا تكون فيه المتطلبات ثابتة ومسار العمل مخططًا له طوال دورة التطوير الكاملة. بالإضافة إلى ذلك، يتم إشراك العميل في مراحل معينة فقط، ويتم إجراء الاختبار بعد مرحلة البناء. أي منهجية يجب أن يستخدمها مدير المشروع لهذا المشروع؟",
      "explanation": "المنهجية التنبؤية (Predictive) تُستخدم عندما تكون المتطلبات واضحة وثابتة منذ البداية، ويتم تنفيذ المشروع وفق تسلسل خطي (مثل: التخطيط ثم التصميم ثم البناء ثم الاختبار). ويُعرف هذا النموذج غالبًا باسم 'Waterfall'.\n\n- لماذا هذا هو الخيار الصحيح؟ لأن المشروع يعتمد على متطلبات ثابتة، وتفاعل العميل محدود، والاختبارات تتم بعد مرحلة البناء، وكل هذا يعكس خصائص المنهجية التنبؤية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• المنهجية الرشيقة (Agile): تتطلب تفاعلًا مستمرًا مع العميل وتكرارات متتالية وتكيفًا مع التغيير.\n• المنهجية الهجينة (Hybrid): تجمع بين الرشيقة والتنبؤية، لكن السؤال يشير بوضوح إلى تطبيق تسلسل خطي دون عناصر من الأسلوب الرشيق.\n• التحسين المستمر (Continuous Improvement): هو مفهوم لتحسين العمليات بشكل مستمر وليس منهجية إدارة مشروع.",
      "choices": [
        {
          "text": "المنهجية الرشيقة (Agile).",
          "correct": false
        },
        {
          "text": "المنهجية الهجينة (Hybrid).",
          "correct": false
        },
        {
          "text": "المنهجية التنبؤية (Predictive).",
          "correct": true
        },
        {
          "text": "التحسين المستمر (Continuous Improvement).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع جميع أصحاب المصلحة الداخليين والخارجيين في المشروع. ويجب عليه الآن تحديد أفضل نهج لتفاعل أصحاب المصلحة. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "الخيار الصحيح هو إجراء تحليل لأصحاب المصلحة. تحليل أصحاب المصلحة هو الخطوة الأساسية لفهم من هم أصحاب المصلحة، ما هي اهتماماتهم، ومستوى تأثيرهم على المشروع. يساعد هذا التحليل في تحديد الاستراتيجيات المناسبة للتفاعل معهم بشكل فعّال لضمان دعمهم للمشروع.\n\nالخيار إنشاء تحليل SWOT لا يرتبط مباشرة بإدارة أصحاب المصلحة، بل يُستخدم لتحليل نقاط القوة والضعف والفرص والتهديدات للمشروع.\n\nالخيار تطوير تحليل متعدد المعايير لاتخاذ القرار يُستخدم لاتخاذ قرارات معقدة وليس لتحديد كيفية التفاعل مع أصحاب المصلحة.\n\nالخيار تصميم مخطط السمكة (Fishbone Diagram) يُستخدم لتحليل أسباب المشاكل وليس لتحديد استراتيجيات أصحاب المصلحة.",
      "choices": [
        {
          "text": "إجراء تحليل لأصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "إنشاء تحليل SWOT.",
          "correct": false
        },
        {
          "text": "تطوير تحليل متعدد المعايير لاتخاذ القرار.",
          "correct": false
        },
        {
          "text": "تصميم مخطط السمكة (Fishbone Diagram).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم مدير مشروع مؤخرًا إلى مؤسسة تنفذ مجموعة من المبادرات الإستراتيجية لتحسين الربحية. راجع مدير المشروع حالة العمل لمشروع سابق مع راعي المشروع للتأكد من توافقه مع أهداف المنظمة والتعلم من نجاحاته وإخفاقاته. أي من نتائج المشروع التالية تُعتبر الأكثر نجاحًا في سياق المبادرات الإستراتيجية لهذه المؤسسة؟",
      "explanation": "الخيار الصحيح هو تنفيذ المشروع في الوقت المحدد، وضمن الميزانية، وحقق زيادة بنسبة 5٪ في المبيعات المتوقعة للمنتج. هذا الخيار يعكس تحقيق الأهداف الثلاثة الرئيسية: الوقت، التكلفة، والقيمة المضافة (زيادة المبيعات)، وهو ما يدل على نجاح استراتيجي حقيقي.\n\nالخيار تم تنفيذ المشروع بميزانية أقل بنسبة 25٪، ولكن استغرق مدة أطول بنسبة 20٪ يُظهر تأخيرًا في الوقت رغم التوفير في التكلفة، مما قد يؤثر سلبًا على الربحية.\n\nالخيار تم تنفيذ المشروع ضمن الميزانية، وتمت الموافقة على إغلاقه من قبل مكتب إدارة المشاريع لا يظهر تحقيق قيمة مضافة واضحة للمؤسسة.\n\nالخيار تم تسليم المشروع مبكرًا، ودخل السوق قبل المنافسين، وتجاوز الميزانية بنسبة 10٪ يشير إلى تجاوز التكلفة، مما قد يؤثر على الربحية.",
      "choices": [
        {
          "text": "تم تنفيذ المشروع بميزانية أقل بنسبة 25٪، ولكن استغرق مدة أطول بنسبة 20٪ عن الخطة الأصلية.",
          "correct": false
        },
        {
          "text": "تم تنفيذ المشروع ضمن الميزانية، وتمت الموافقة على إغلاقه من قبل مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "تم تسليم المشروع مبكرًا، ودخل السوق قبل المنافسين، وتجاوز الميزانية بنسبة 10٪.",
          "correct": false
        },
        {
          "text": "تم تنفيذ المشروع في الوقت المحدد، وضمن الميزانية، وحقق زيادة بنسبة 5٪ في المبيعات المتوقعة للمنتج.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، أدرك مدير المشروع أن أحد أعضاء الفريق لا يُكمل المهام وفقًا لخطة إدارة المشروع. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
      "explanation": "الخيار الصحيح هو التحدث مع عضو الفريق لمعرفة أسباب الأداء الضعيف. هذا الإجراء يساعد مدير المشروع على فهم العقبات أو المشاكل التي يواجهها العضو، سواء كانت شخصية، تقنية، أو متعلقة بالبيئة، مما يمكنه من تقديم الدعم المناسب لحل المشكلة وتحسين الأداء.\n\nالخيارات الخاطئة:\n- بناء فريق مصفوفي لمراجعة العلاقات في جميع فرق المشروع: إجراء غير مباشر ولا يعالج المشكلة الحالية.\n- طلب من جميع أعضاء الفريق التركيز أكثر على المشروع: طلب عام وغير محدد ولا يعالج السبب الحقيقي للأداء الضعيف.\n- إعادة تعيين المهام غير المنجزة إلى عضو آخر في الفريق: قد يؤدي إلى تفاقم المشكلة بدون فهم السبب الجذري للأداء الضعيف.",
      "choices": [
        {
          "text": "بناء فريق مصفوفي لمراجعة العلاقات في جميع فرق المشروع.",
          "correct": false
        },
        {
          "text": "طلب من جميع أعضاء الفريق التركيز أكثر على المشروع.",
          "correct": false
        },
        {
          "text": "إعادة تعيين المهام غير المنجزة إلى عضو آخر في الفريق.",
          "correct": false
        },
        {
          "text": "التحدث مع عضو الفريق لمعرفة أسباب الأداء الضعيف.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ مورد لمكوّن حيوي في مشروع بناء مدير المشروع أن التسليم سيتأخر بشكل كبير. وبما أن هذا الخطر تم تحديده أثناء التخطيط، فإن خط الأساس للتكلفة يحتوي على احتياطي كافٍ للطوارئ. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الخيار الصحيح هو تحديد مورد يمكنه توفير المكون ضمن قيمة الاحتياطي.\n\nالشرح المفصل:\n- تم تحديد هذا التأخير مسبقًا كمخاطرة خلال مرحلة التخطيط، واحتياطي الطوارئ مخصص لمواجهة هذه المخاطر لتجنب تجاوز الميزانية.\n- استخدام المورد البديل ضمن قيمة الاحتياطي يتيح معالجة التأخير دون الحاجة لطلب تغيير رسمي أو زيادة تكلفة.\n- هذا الإجراء يساعد في الحفاظ على الجدول الزمني للمشروع وتقليل التأثير السلبي.\n\nالأخطاء في الخيارات الأخرى:\n- طلب المكوّن من مورد آخر مع تقديم طلب تغيير إلى مجلس التحكم في التغيير (CCB) إجراء غير ضروري حالياً لأن الاحتياطي موجود لمعالجة هذا.\n- مراجعة خطة الاستجابة للمخاطر وبيان العمل وبند الغرامة مهم لكن يجب أن يتم بعد اتخاذ إجراء عملي.\n- تحديث الجدول الزمني ومستودع الدروس المستفادة خطوة تالية وليست الأولوية في هذه اللحظة.",
      "choices": [
        {
          "text": "تحديد مورد يمكنه توفير المكون ضمن قيمة الاحتياطي.",
          "correct": true
        },
        {
          "text": "طلب المكوّن من مورد آخر وتقديم طلب تغيير إلى مجلس التحكم في التغيير (CCB).",
          "correct": false
        },
        {
          "text": "مراجعة خطة الاستجابة للمخاطر وبيان العمل للخطوات التالية وبند الغرامة على التأخير.",
          "correct": false
        },
        {
          "text": "تحديث الجدول الزمني للمشروع ومستودع الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة التنفيذ، واختبار المنتج أوشك على الاكتمال. اقترح أحد أعضاء الفريق تسريع الاختبار من خلال إزالة بعض الاختبارات، معتقدًا أن ذلك سيساعد في إنهاء العمل مبكرًا ويوفر وقتًا إضافيًا (float) للمشروع. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الخيار الصحيح هو رفض اقتراح عضو الفريق.\n\nالشرح المفصل:\n- إزالة بعض الاختبارات يمكن أن تؤدي إلى مخاطر جودة، وإصدار منتج غير مكتمل أو يحتوي على عيوب، مما قد يكلف المشروع وقتًا وموارد أكبر على المدى الطويل.\n- الوقت الإضافي (float) في الجدول لا يعني بالضرورة أنه يجب التضحية بجودة العمل.\n- مدير المشروع مسؤول عن ضمان جودة المنتج والالتزام بمعايير الاختبار المحددة.\n- يمكن مناقشة الاقتراح أو طلب دراسة من مدير الجودة، لكن الرفض المبدئي هو الإجراء الصحيح للحفاظ على جودة المشروع.\n\nالخيارات الأخرى:\n- طلب مزيد من المعلومات أو مناقشة الاقتراح قد يكون مفيدًا، لكن الخطوة الأولى يجب أن تحمي جودة المشروع.\n- طلب من مدير الجودة دراسة الاقتراح يمكن أن يكون لاحقًا إذا كانت هناك أسباب مقنعة، لكنه ليس الخطوة الأولى.",
      "choices": [
        {
          "text": "طلب مزيد من المعلومات من عضو الفريق.",
          "correct": false
        },
        {
          "text": "رفض اقتراح عضو الفريق.",
          "correct": true
        },
        {
          "text": "مناقشة الاقتراح مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "طلب من مدير الجودة دراسة الاقتراح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي مما يلي يمثل مستويات المواقف من المخاطر؟",
      "explanation": "الخيار الصحيح هو يتجنب المخاطر، محايد تجاه المخاطر، متسامح مع المخاطر، يسعى للمخاطر.\n\nالشرح المفصل:\n- مستويات المواقف من المخاطر تعبر عن كيفية تعامل الأفراد أو المنظمات مع المخاطر المحتملة.\n- يتجنب المخاطر يعني رفض تحمل المخاطر وعدم الرغبة في المخاطرة.\n- محايد تجاه المخاطر يعني عدم الميل سواء لقبول المخاطر أو تجنبها.\n- متسامح مع المخاطر يعني قبول المخاطر مع تقليلها إلى الحد المقبول.\n- يسعى للمخاطر يعني البحث عن المخاطر لتحقيق مكاسب أو فرص أكبر.\n\nالأخطاء في الخيارات الأخرى:\n- محافظ، معتدل، متحرر هي مستويات مواقف عامة في مجالات أخرى لكنها ليست توصيفات شائعة لمواقف المخاطر.\n- يقلل من المخاطر، يتجنبها، ينقلها، يقبلها هي استراتيجيات إدارة المخاطر، وليست مواقف نفسية أو توجهات تجاه المخاطر.\n- مرتفع، متوسط، منخفض تصف مستويات خطورة المخاطر وليس المواقف تجاهها.\n- إيجابي، سلبي، غير مبالٍ تصف الاتجاهات العامة لكنها ليست تصنيفات دقيقة لمواقف المخاطر.",
      "choices": [
        {
          "text": "محافظ، معتدل، متحرر.",
          "correct": false
        },
        {
          "text": "يتجنب المخاطر، محايد تجاه المخاطر، متسامح مع المخاطر، يسعى للمخاطر.",
          "correct": true
        },
        {
          "text": "يقلل من المخاطر، يتجنبها، ينقلها، يقبلها.",
          "correct": false
        },
        {
          "text": "مرتفع، متوسط، منخفض.",
          "correct": false
        },
        {
          "text": "إيجابي، سلبي، غير مبالٍ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل مدير المشروع خطط المشروع وقدم جميع المستندات للموافقة، لكنه لم يخصص وقتًا للتأخيرات المحتملة في الحصول على الموافقات. بالإضافة إلى تعيين مالك للمخاطر لمعالجة هذا الخطر، ما الذي كان يجب على مدير المشروع فعله؟",
      "explanation": "الخيار الصحيح هو تطوير إجراءات محددة لتنفيذ استراتيجية الاستجابة للمخاطر المتفق عليها، بما في ذلك الخطط الأساسية والبديلة.\n\nالشرح المفصل:\n- تخصيص وقت للتأخيرات المحتملة في الموافقات يُعتبر جزءًا من التخطيط الفعّال لإدارة المخاطر.\n- تعيين مالك للخطر خطوة جيدة، ولكن يجب دعم ذلك بخطط عملية واضحة تشمل الإجراءات التنفيذية للاستجابة للمخاطر.\n- الخطط الأساسية والبديلة (Plan A وPlan B) تساعد على ضمان استمرار المشروع في حال حدوث التأخيرات.\n- الخيارات الأخرى إما غير عملية أو تركز على أوجه لا تعالج المشكلة بشكل مباشر.\n\nلماذا الخيارات الأخرى خاطئة؟\n- طلب التصعيد فقط دون خطة واضحة قد يؤدي إلى تأخيرات إضافية.\n- تقليل تقديرات إنجاز العمل دون تعديل الجدول أو الموارد قد يؤدي إلى فشل في تحقيق الأهداف.\n- تحليل الخيارات الحقيقية مفيد لكن في هذه الحالة يجب أولاً وضع خطط استجابة واضحة قبل اللجوء لتحليل اقتصادي.",
      "choices": [
        {
          "text": "طلب من مالك الخطر التصعيد إلى أصحاب الموافقة للحصول عليها في أسرع وقت ممكن.",
          "correct": false
        },
        {
          "text": "تعديل خطط المشروع من خلال تقليل تقديرات إنجاز العمل ليتم الانتهاء منه في الوقت المحدد بالرغم من التأخير.",
          "correct": false
        },
        {
          "text": "تطوير إجراءات محددة لتنفيذ استراتيجية الاستجابة للمخاطر المتفق عليها، بما في ذلك الخطط الأساسية والبديلة.",
          "correct": true
        },
        {
          "text": "استخدام تحليل الخيارات الحقيقية لإجراء تحليل اقتصادي لاستراتيجيات استجابة بديلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجري مدير المشروع تحديد المخاطر استنادًا إلى نطاق عالي المستوى والحكم الخبيري. ما المعلومة الموجودة في ميثاق المشروع والتي يمكن أن تساعد في تحديد المخاطر؟",
      "explanation": "الخيار الصحيح هو اهتمام أصحاب المصلحة.\n\nالشرح المفصل:\n- ميثاق المشروع يحتوي على معلومات أساسية تساعد في التعرف على المخاطر المحتملة.\n- اهتمام أصحاب المصلحة يساعد مدير المشروع على فهم من يمكن أن يتأثر بالمشروع أو يؤثر عليه، مما يسلط الضوء على مخاطر تتعلق بتوقعات وتأثيرات هؤلاء الأطراف.\n- ملخص أدوار ومسؤوليات المشروع يوفر معلومات عن الهيكل الإداري لكنه لا يوضح المخاطر بشكل مباشر.\n- المتطلبات التفصيلية والنطاق عادة تكون في وثائق أخرى وليست في ميثاق المشروع، وهي مهمة لتخطيط المشروع لكن أقل فائدة لتحديد المخاطر في مرحلة البداية.\n- مصفوفات الاتصال تدير قنوات التواصل لكنها ليست مصدرًا مباشرًا لتحديد المخاطر.\n\nالأخطاء في الخيارات الأخرى:\n- كل خيار آخر يركز على جزء مهم من إدارة المشروع، لكن لا يقدم معلومات محددة لتحديد المخاطر في المرحلة الأولى.",
      "choices": [
        {
          "text": "ملخص أدوار ومسؤوليات المشروع.",
          "correct": false
        },
        {
          "text": "المتطلبات التفصيلية والنطاق.",
          "correct": false
        },
        {
          "text": "مصفوفات الاتصال بالمشروع.",
          "correct": false
        },
        {
          "text": "اهتمام أصحاب المصلحة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن مخرجات المشروع لن تلبي متطلبات الجودة ما لم يتم إجراء تغيير في أحد المكونات. بعد تقديم طلب تغيير رسمي، أرسل مدير المشروع تفاصيل التغيير بالبريد الإلكتروني إلى جميع أصحاب المصلحة. معظمهم استلموا المعلومات ووعوا التغيير، لكن تبين لاحقًا أن بعض أصحاب المصلحة لم يتلقوا البريد الإلكتروني أو لم يقرأوه. ما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "الخيار الصحيح هو مراجعة خطة إدارة الاتصالات.\n\nالشرح المفصل:\n- خطة إدارة الاتصالات تحدد كيف ومتى ومن يتلقى المعلومات المتعلقة بالمشروع.\n- الاعتماد فقط على البريد الإلكتروني قد لا يكون كافيًا لضمان وصول المعلومات لجميع أصحاب المصلحة أو وعيهم بها.\n- مراجعة الخطة تسمح بتحديد قنوات تواصل بديلة أو إضافية لضمان تلقي المعلومات بشكل فعال.\n- الخيارات الأخرى لا تعالج مشكلة التواصل بشكل مباشر أو شامل.\n\nشرح الخيارات الأخرى:\n- إعداد تقرير مفصل عن أداء العمل: مفيد لكنه لا يحل مشكلة التواصل مع أصحاب المصلحة.\n- الاجتماع مع راعي المشروع: قد يساعد لكن ليس الحل الأول لضمان التواصل الصحيح.\n- سؤال أصحاب المصلحة عن مدى إلمامهم بالتكنولوجيا: غير مرتبط بمشكلة التواصل حول التغيير.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "إعداد تقرير مفصل عن أداء العمل.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة الاتصال.",
          "correct": false
        },
        {
          "text": "سؤال أصحاب المصلحة عن مدى إلمامهم بالتكنولوجيا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "راعي المشروع يتجنب المخاطر، وبالتالي يشعر بالقلق من الآثار السلبية على المشروع. للمساعدة، حدد فريق المشروع أربع مخاطر، ثم قام بتقييم احتمال حدوث كل منها وتأثيرها إذا حدثت، باستخدام مقياس من 1 إلى 5 (1 هو الأدنى، و5 هو الأعلى).\n\nالجدول التالي يوضح تفاصيل المخاطر:\n\nالمخاطـر | الاحتمالية | التأثير\n--------|-------------|---------\nأ        |     3       |    3\nب        |     5       |    1\nج        |     2       |    4\nد        |     4       |    4\n\nبناءً على هذا الجدول، بأي ترتيب يجب على مدير المشروع تصنيف هذه المخاطر (من الأعلى إلى الأدنى) لأغراض إدارة المخاطر؟",
      "explanation": "لترتيب المخاطر حسب الأولوية لإدارة المخاطر، يتم حساب مستوى المخاطر بضرب الاحتمالية في التأثير لكل خطر:\n\n- خطر أ: 3 × 3 = 9\n- خطر ب: 5 × 1 = 5\n- خطر ج: 2 × 4 = 8\n- خطر د: 4 × 4 = 16\n\nبالتالي، يجب ترتيب المخاطر حسب القيمة من الأعلى إلى الأدنى:\nد (16)، أ (9)، ج (8)، ب (5).\n\nالشرح:\n- هذا الترتيب يساعد مدير المشروع على التركيز أولًا على المخاطر ذات الأثر والاحتمالية الأعلى.\n- تصنيف المخاطر بهذه الطريقة يسهل اتخاذ قرارات مستندة إلى أولوية إدارة فعالة للمخاطر.\n\nشرح الخيارات الخاطئة:\n- الخيارات التي تبدأ بخطر ب تعطي أولوية لمخاطر ذات تأثير منخفض، وهذا غير مناسب لإدارة المخاطر الفعالة.\n- ترتيب المخاطر يعتمد على حاصل ضرب الاحتمالية والتأثير وليس على الاحتمالية أو التأثير فقط.",
      "choices": [
        {
          "text": "ب، أ، د، ج",
          "correct": false
        },
        {
          "text": "ب، ج، أ، د",
          "correct": false
        },
        {
          "text": "د، أ، ج، ب",
          "correct": true
        },
        {
          "text": "ج، د، أ، ب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع بحدث مناخي قد يؤثر على المشروع. المتنبئون لا يمكنهم تحديد مساره أو شدته. أي تأخير سيؤدي إلى تأخير في إنهاء المشروع وزيادة التكاليف. ما أول إجراء يجب على مدير المشروع اتخاذه؟",
      "explanation": "أول خطوة صحيحة هي مراجعة سجل المخاطر الموجود مسبقًا، حيث من المحتمل أن يكون هذا الحدث قد تم التعرف عليه كخطر محتمل وتم تخطيط كيفية التعامل معه أو مراقبته. مراجعة سجل المخاطر تساعد مدير المشروع في اتخاذ قرارات مدروسة وتقييم مدى جاهزية الفريق لمواجهة هذا الحدث.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن الحدث هو خطر محتمل وليس مشكلة حالية، لذلك يجب الرجوع إلى سجل المخاطر لمعرفة الإجراءات المخططة أو تحديثها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ أصحاب المصلحة وتحديث الميزانية: خطوة لاحقة بعد تقييم المخاطر، وليست الإجراء الأول.\n- اتخاذ إجراء وقائي بناءً على المعلومات الجديدة: غير ممكن دون تقييم شامل للمخاطر والإعداد.\n- تسجيل الحدث في سجل المشكلات: الحدث لم يتحول إلى مشكلة بعد، لذلك لا يجب تسجيله كسجل مشكلة.",
      "choices": [
        {
          "text": "إبلاغ أصحاب المصلحة وتحديث الميزانية.",
          "correct": false
        },
        {
          "text": "اتخاذ إجراء وقائي بناءً على المعلومات الجديدة.",
          "correct": false
        },
        {
          "text": "مراجعة سجل المخاطر للحصول على مزيد من المعلومات.",
          "correct": true
        },
        {
          "text": "تسجيل الحدث في سجل المشكلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن الموارد الداخلية غير كافية لإنتاج مكون حيوي لأحد المخرجات. هذا يشكل تهديدًا كبيرًا لأن جودة هذا المكون ضرورية للمشروع، ولا يمكن للموارد الداخلية ضمان جودة عالية. قرر مدير المشروع التعاقد مع مورد خارجي لإنتاج المكون. ما هي استراتيجية الاستجابة التي استخدمها؟",
      "explanation": "الاستراتيجية المستخدمة هنا هي التخفيف (Mitigation)، حيث قرر مدير المشروع تقليل خطر عدم تحقيق الجودة المطلوبة من خلال التعاقد مع مورد خارجي يمكنه تقديم جودة أعلى. التخفيف يعني اتخاذ إجراءات لتقليل احتمال حدوث الخطر أو تأثيره.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن المدير لم يقبل الخطر كما هو، ولم يعزز أو يصعده، بل اتخذ إجراءً عمليًا لتقليل احتمالية التأثير السلبي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- القبول: يعني تحمل الخطر دون اتخاذ إجراءات، وهذا غير صحيح هنا.\n- التعزيز: يعني زيادة فرص حدوث الخطر أو تأثيره، وهذا غير مناسب.\n- التصعيد: يعني نقل إدارة الخطر إلى جهة أعلى، وهذا ليس ما حدث.",
      "choices": [
        {
          "text": "القبول.",
          "correct": false
        },
        {
          "text": "التخفيف.",
          "correct": true
        },
        {
          "text": "التعزيز.",
          "correct": false
        },
        {
          "text": "التصعيد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة الاختبار في مشروع تقني لبنك عالمي، علم مدير المشروع بوجود خرق أمني أدى إلى تسريب بيانات شخصية لآلاف المستخدمين. أوقف راعي المشروع العمل حتى يتم التحقيق. تم تحديد هذا التهديد أثناء تخطيط إدارة المخاطر، وتأثيره كبير. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عند حدوث خرق أمني كبير يُصنف كخطر محقق (Issue)، يجب على مدير المشروع تحديث سجل المشكلات لتعكس هذا الحدث الجديد، وكذلك مراجعة استراتيجية الاستجابة للمخاطر في سجل المخاطر لمعرفة ما إذا كانت الإجراءات المخططة فعالة أو تحتاج تعديلًا.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن الخرق الأمني تحول إلى مشكلة فعلية ويجب التعامل معه على هذا الأساس مع تحديث الوثائق ذات الصلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الرجوع إلى خطة تفاعل أصحاب المصلحة: ليست الخطوة الأولى للتعامل مع الخرق الأمني.\n- إجراء تحليل شجرة القرار: قد يكون مفيدًا لاحقًا لكن أول خطوة هي تحديث السجلات.\n- الاجتماع مع راعي المشروع: خطوة لاحقة بعد توثيق المشكلة ومراجعة الاستراتيجية.",
      "choices": [
        {
          "text": "الرجوع إلى خطة تفاعل أصحاب المصلحة لتحديد مالك الخطر.",
          "correct": false
        },
        {
          "text": "إجراء تحليل شجرة القرار لتحديد أفضل مسار للحل.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع للتفاوض على خطة جديدة لإدارة المتطلبات.",
          "correct": false
        },
        {
          "text": "تحديث سجل المشكلات ومراجعة استراتيجية الاستجابة للمخاطر في سجل المخاطر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تخطط شركة إلكترونيات لإطلاق خط جديد من أجهزة المنزل الذكية. تتطلب الأجهزة مجموعة متنوعة من المهارات لتصنيعها، لكن فريق الإنتاج الحالي لا يمتلك كل المهارات اللازمة. ما هو أكثر أسلوب شمولًا لمدير المشروع لتحديد المخاطر المحتملة ومعالجتها؟",
      "explanation": "تقييم المخاطر على مستوى عالٍ هو أسلوب شامل يمكن لمدير المشروع استخدامه لتحديد جميع المخاطر المحتملة التي قد تواجه المشروع، بما في ذلك نقص المهارات في الفريق. هذا التقييم يمكن أن يشمل مخاطر فنية، تنظيمية، وتلك المرتبطة بالموارد البشرية ويتيح وضع خطط لمعالجتها بشكل شامل.\n\n- لماذا الخيار الصحيح؟\nلأنه يسمح بفهم شامل للمخاطر المحتملة بدلاً من التركيز على جانب محدد فقط.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تعديل نطاق المشروع: قد يكون حلًا لاحقًا لكنه لا يساعد في تحديد المخاطر.\n- مراجعة متطلبات مراقبة الجودة: تركز على الجودة ولا تغطي جميع أنواع المخاطر.\n- تحليل عملية الإنتاج لدى المنافسين: قد يساعد في تحسين العمليات لكنه ليس أسلوبًا مباشرًا لتحديد المخاطر.",
      "choices": [
        {
          "text": "تعديل نطاق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة متطلبات مراقبة الجودة.",
          "correct": false
        },
        {
          "text": "تقييم المخاطر على مستوى عالٍ.",
          "correct": true
        },
        {
          "text": "تحليل عملية الإنتاج لدى المنافسين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد ليحل محل مدير مشروع قد استقال. أثناء التقييم الأولي لوثائق المشروع، اكتشف المدير الجديد أن سجل المخاطر لم يتم تحديثه منذ عدة أسابيع. الخطوة التالية لمدير المشروع هي الرجوع إلى خطة إدارة المخاطر. لماذا؟",
      "explanation": "الرجوع إلى خطة إدارة المخاطر يساعد مدير المشروع الجديد على فهم الطريقة التي استخدمها المدير السابق في تصنيف المخاطر وترتيبها حسب الأولوية. هذا الأمر ضروري لفهم الأولويات الحالية والتعامل مع المخاطر بطريقة منهجية تتوافق مع أسلوب إدارة المشروع.\n\n- لماذا الخيار الصحيح؟\nلأن خطة إدارة المخاطر تحتوي على معايير تقييم وترتيب المخاطر مما يمكن المدير الجديد من استيعاب حالة إدارة المخاطر الحالية بدقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد عدد مرات ظهور المخاطر في الماضي: غير مرتبط مباشرة بخطة إدارة المخاطر.\n- معرفة عدد مرات تحديث سجل المخاطر: معلومات إجرائية فقط ولا تساعد في تقييم المخاطر.\n- تحديد مستوى عدم اليقين المقبول: جزء من تقييم المخاطر لكنه ليس السبب الرئيسي للرجوع للخطة.",
      "choices": [
        {
          "text": "لتحديد عدد مرات ظهور المخاطر في الماضي.",
          "correct": false
        },
        {
          "text": "لفهم كيفية ترتيب المدير السابق للمخاطر حسب الأولوية.",
          "correct": true
        },
        {
          "text": "لمعرفة عدد مرات تحديث سجل المخاطر.",
          "correct": false
        },
        {
          "text": "لتحديد مستوى عدم اليقين المقبول للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أول اجتماع للفريق، استخدم مدير المشروع المخاطر المذكورة في ميثاق المشروع كنقطة انطلاق لتطوير سجل المخاطر. بعد تحديد المخاطر، ما الذي يجب على فريق المشروع القيام به بعد ذلك؟",
      "explanation": "بعد تحديد المخاطر، الخطوة التالية هي تقييم هذه المخاطر من خلال إنشاء مصفوفة الاحتمالية والتأثير. تساعد هذه المصفوفة في تحديد أولويات المخاطر بناءً على مدى احتمال حدوثها وتأثيرها على المشروع، مما يمكن الفريق من التركيز على المخاطر الأكثر أهمية والتخطيط لاستجابتها بشكل فعّال.\n\n- لماذا الخيار الصحيح؟\nلأن إنشاء مصفوفة الاحتمالية والتأثير هو أسلوب قياسي لتقييم المخاطر وتحديد أولوياتها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- حساب الاحتياطي الإداري: يتم بعد تقييم المخاطر وتحديد استراتيجيات الاستجابة.\n- تطوير استراتيجيات استجابة طارئة: تأتي بعد تقييم وتصنيف المخاطر.\n- إجراء نشاط تحديد وتصنيف: تم بالفعل في المرحلة السابقة.",
      "choices": [
        {
          "text": "حساب الاحتياطي الإداري.",
          "correct": false
        },
        {
          "text": "تطوير استراتيجيات استجابة طارئة.",
          "correct": false
        },
        {
          "text": "إنشاء مصفوفة الاحتمالية والتأثير.",
          "correct": true
        },
        {
          "text": "إجراء نشاط تحديد وتصنيف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بمراجعة بيانات أداء العمل استعدادًا لإغلاق المشروع. تكشف البيانات أن أحد المخرجات لم يتم قبوله. ويُقدّر أن العمل المطلوب لقبول المخرج سيؤدي إلى تأخير تاريخ الانتهاء بمقدار شهرين. ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "عندما يتم اكتشاف أن مخرج المشروع غير مقبول ويستلزم عملًا إضافيًا يؤدي إلى تأخير في الجدول الزمني، يجب على مدير المشروع إصدار طلب تغيير رسمي لتعديل الجدول الزمني. هذا الإجراء يتم عبر مجلس التحكم في التغيير (CCB) لضمان مراجعة وموافقة التغيير ضمن عمليات إدارة المشروع الرسمية.\n\n- لماذا الخيار الصحيح؟\nإصدار طلب تغيير هو الإجراء الصحيح لإدارة التأخيرات التي تؤثر على خط الأساس للمشروع ويتطلب موافقة رسمية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تخصيص الاحتياطي للطوارئ: لا يتم ذلك دون مراجعة رسمية وتحديث الجدول الزمني.\n- تحديث الجدول وتنفيذ العمل: غير ممكن قبل الموافقة على التغيير.\n- تحديث قائمة المراقبة في سجل المخاطر: هذه خطوة ثانوية ولا تعالج التأخير الفعلي.",
      "choices": [
        {
          "text": "تخصيص الاحتياطي للطوارئ للحصول على الموارد المطلوبة.",
          "correct": false
        },
        {
          "text": "تحديث الجدول الزمني وتنفيذ العمل.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير لمراجعته من قبل مجلس التحكم في التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تحديث قائمة المراقبة في سجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الانتهاء من أحد المخرجات الرئيسية للمشروع. ما الذي يجب أن يفعله مدير المشروع والفريق لتأكيد أن المواصفات قد تم تحقيقها؟",
      "explanation": "عند الانتهاء من مخرج رئيسي، يجب على مدير المشروع والفريق إجراء ضبط الجودة (Quality Control) للتأكد من أن المخرج يطابق المواصفات والمتطلبات المحددة في خطة المشروع. ضبط الجودة يتضمن فحص المنتجات أو المخرجات للتحقق من مطابقتها للمعايير، واكتشاف العيوب وتصحيحها قبل تسليم المخرج.\n\n- لماذا الخيار الصحيح؟\nلأن ضبط الجودة يضمن توافق المخرجات مع المعايير والمواصفات المطلوبة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التحقق من الأصول التنظيمية للعمليات: وثائق داعمة ولا تعبر عن تحقق المنتج.\n- تقارير تدقيق الجودة: تقارير نتائج وليست نشاط تحقق فعلي.\n- التحقق من النطاق: يركز على تحديد ما يجب تضمينه، وليس التحقق من جودة المخرجات.",
      "choices": [
        {
          "text": "التحقق من الأصول التنظيمية للعمليات.",
          "correct": false
        },
        {
          "text": "التحقق من تقارير تدقيق الجودة.",
          "correct": false
        },
        {
          "text": "التحقق من النطاق.",
          "correct": false
        },
        {
          "text": "إجراء ضبط الجودة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وافق العميل على المعايير التي ستُستخدم لتقييم المخرجات النهائية قبل التسليم، ولكنه الآن يطلب تحسينات لأن المخرجات لا تفي بالمعايير. ما الوثيقة التي يجب أن يرجع إليها مدير المشروع لحل هذه المشكلة؟",
      "explanation": "عندما يطلب العميل تحسينات على المخرجات بسبب عدم توافقها مع المعايير المتفق عليها، يجب على مدير المشروع الرجوع إلى خطة إدارة الجودة. هذه الخطة تحتوي على المعايير، العمليات، وأساليب التحقق من جودة المخرجات التي تم الاتفاق عليها مع العميل.\n\n- لماذا الخيار الصحيح؟\nلأن خطة إدارة الجودة تحدد كيفية قياس وتقييم جودة المخرجات، مما يساعد على حل النزاعات حول مدى مطابقة المنتج للمعايير.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة النطاق تركز على تعريف ما سيتم تسليمه، لكنها لا تحدد معايير الجودة.\n- توثيق المتطلبات يصف ما يحتاجه العميل، لكنه لا يحدد معايير التقييم التفصيلية.\n- ميثاق المشروع يحدد الأهداف والسلطات، لكنه لا يحتوي تفاصيل عن معايير الجودة.",
      "choices": [
        {
          "text": "خطة إدارة النطاق.",
          "correct": false
        },
        {
          "text": "خطة إدارة الجودة.",
          "correct": true
        },
        {
          "text": "توثيق المتطلبات.",
          "correct": false
        },
        {
          "text": "ميثاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد المخرجات لا يلبي المتطلبات الوظيفية اللازمة لتلبية احتياجات أصحاب المصلحة. نتيجة لذلك، رفض العميل قبول المخرج. كيف كان من الممكن أن تساعد تعريف مقاييس الجودة مدير المشروع على تجنب هذا الموقف؟",
      "explanation": "تعريف مقاييس الجودة يعني تحديد الخصائص التي يجب أن تتوفر في المخرج وكيفية قياس هذه الخصائص لضمان تحقيق المتطلبات الوظيفية. هذه المقاييس تساعد على التحقق من جودة المخرجات قبل تقديمها للعميل وبالتالي تقليل احتمال رفضها.\n\n- لماذا الخيار الصحيح؟\nمقاييس الجودة تحدد خصائص المنتج بوضوح وتشرح طرق قياسها مما يسمح بمراقبة الجودة بدقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة الاختبارات تركز على التحقق من الوظائف لكنها لا تغطي تعريف المقاييس الشاملة.\n- هيكل تقسيم العمل (WBS) لا يحدد معايير جودة وإنما يركز على تقسيم العمل.\n- خطة المتطلبات ليست مرتبطة بإجراء مشتريات في حالات الفشل.",
      "choices": [
        {
          "text": "كانت خطة إدارة الاختبارات ستقيّم المخرج وفقًا لمقاييس الجودة قبل القبول النهائي.",
          "correct": false
        },
        {
          "text": "المقاييس المحددة في هيكل تقسيم العمل (WBS) كانت ستحدد معايير الامتثال.",
          "correct": false
        },
        {
          "text": "مقاييس الجودة كانت ستصف خصائص المخرج وكيفية قياسها.",
          "correct": true
        },
        {
          "text": "المقاييس ضمن خطة المتطلبات كانت ستسمح بإجراء عملية شراء جديدة في حال فشل أحد المكونات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد موافقة الراعي على المشروع، دعا مدير المشروع الراعي وأعضاء الفريق المختارين وبعض أصحاب المصلحة إلى اجتماع. الهدف الرئيسي من الاجتماع هو تحديد كيفية الحصول على القبول الرسمي للمخرجات المكتملة. ما الوثيقة التي سيتم تطويرها كنتيجة نهائية لهذا الاجتماع؟",
      "explanation": "الهدف من الاجتماع هو تحديد كيفية الحصول على قبول رسمي للمخرجات، وهذا يتطلب تحديث أو وضع خطة إدارة النطاق التي توضح كيفية توثيق القبول وكيفية التعامل مع التغييرات المرتبطة بالنطاق.\n\n- لماذا الخيار الصحيح؟\nخطة إدارة النطاق تحدد الإجراءات والعمليات المتعلقة بتحديد النطاق وقبوله رسمياً.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- سجل التغييرات هو سجل يتابع التغييرات لكنه ليس وثيقة لقبول النطاق.\n- سجل أصحاب المصلحة يركز على تفاعل أصحاب المصلحة وليس على قبول النطاق.\n- خطة إدارة المتطلبات تركز على توثيق المتطلبات لكنها ليست وثيقة قبول النطاق.",
      "choices": [
        {
          "text": "سجل التغييرات.",
          "correct": false
        },
        {
          "text": "سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "خطة إدارة النطاق.",
          "correct": true
        },
        {
          "text": "خطة إدارة المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إغلاق المشروع ويجب على فريق خدمة العملاء قياس رضا العملاء عن المخرجات. ما الذي يجب القيام به بعد ذلك؟",
      "explanation": "بعد إغلاق المشروع، من المهم تقييم مخرجات المشروع ومدى رضا العميل لضمان تحقيق الأهداف وجودة التسليم. تقييم مخرجات المشروع ومراجعة ملاحظات العميل تساعد على فهم نقاط القوة والضعف، وتوفر أساسًا لتحسين المشاريع المستقبلية.\n\n- لماذا الخيار الصحيح؟\nلأنه يعكس خطوة تقييم الأداء والمخرجات بناءً على ردود فعل العميل بعد التسليم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التفاوض على عقد إضافي ليس مرتبطًا بقياس الرضا.\n- اجتماع لمناقشة الدروس المستفادة مهم لكنه يأتي بعد تقييم رضا العميل.\n- مراجعة الإغلاق لكل مرحلة جزء من العمليات الداخلية وليس مرتبطًا بقياس رضا العميل.",
      "choices": [
        {
          "text": "التفاوض على عقد إضافي مع العميل لخدمة مشابهة.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع أصحاب المصلحة والعميل لمناقشة الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "تقييم مخرجات المشروع ومراجعة وثائق ملاحظات العميل.",
          "correct": true
        },
        {
          "text": "مراجعة نجاح المشروع من خلال الاطلاع على وثائق الإغلاق لكل مرحلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "العميل قلق من أن المخرج الحالي للمشروع لن يفي بالمتطلبات المحددة. ما الذي يمكن فعله لتخفيف قلق العميل؟",
      "explanation": "للتخفيف من قلق العميل بشأن المخرجات، من المهم مراجعة معايير القبول التي تم الاتفاق عليها سابقًا والتأكد من أن المخرجات تلبي هذه المعايير. إشراك مالك المنتج في هذه المراجعة يعزز التواصل ويؤكد التفاهم بين الفريق والعميل.\n\n- لماذا الخيار الصحيح؟\nلأن مراجعة معايير القبول مع مالك المنتج تساعد على معالجة المخاوف بشكل مباشر وفعّال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تذكير العميل بالمتطلبات قد لا يهدئ قلقه إذا لم يتم التحقق فعليًا من القبول.\n- تسجيل القلق كمخاطر يحتاج إلى خطة استجابة ولا يخفف القلق مباشرة.\n- إدارة القلق أثناء مراجعة كل مخرج مهمة لكن دون مراجعة معايير القبول قد تكون غير كافية.",
      "choices": [
        {
          "text": "جدولة اجتماع لتذكير العميل بالمتطلبات التي تم إبلاغ الفريق بها سابقًا.",
          "correct": false
        },
        {
          "text": "تسجيل قلق العميل كمخاطر في سجل المخاطر والتخطيط بناءً عليه.",
          "correct": false
        },
        {
          "text": "إدارة القلق أثناء مراجعة كل مخرج مع العميل.",
          "correct": false
        },
        {
          "text": "طلب من مالك المنتج مراجعة معايير القبول التي تم مناقشتها مسبقًا مع العميل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع مع أصحاب المصلحة لتحديد الخطوات التي يجب تنفيذها كجزء من مهمة معينة. يحتاج المدير إلى التأكد من أن أعضاء الفريق قد أتموا جميع الخطوات المطلوبة عند أداء مهمة متكررة. ما الذي يجب أن يستخدمه مدير المشروع؟",
      "explanation": "في حالة المهام المتكررة التي تتطلب تنفيذ خطوات محددة بشكل منتظم، تُستخدم قائمة التحقق (Checklist) لضمان إتمام جميع الخطوات بشكل صحيح ومنتظم.\n\n- لماذا الخيار الصحيح؟\nقائمة التحقق هي أداة بسيطة وفعالة لضمان استكمال جميع الخطوات في المهمة المتكررة، مما يقلل الأخطاء ويزيد الدقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مخطط انسيابي يُستخدم لتصوير سير العمليات وليس للتحقق من إتمام خطوات.\n- الرسم البياني التكراري يُستخدم لتحليل البيانات وليس لمتابعة خطوات.\n- التيسير هو أسلوب قيادة لجلسات العمل وليس أداة متابعة تنفيذ المهام.",
      "choices": [
        {
          "text": "مخطط انسيابي.",
          "correct": false
        },
        {
          "text": "قائمة تحقق (Checklist).",
          "correct": true
        },
        {
          "text": "الرسم البياني التكراري (Histogram).",
          "correct": false
        },
        {
          "text": "التيسير (Facilitation).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لم يقم فريق المشروع بإجراء اختبارات قبول المستخدم على أحد المخرجات لأن المنتج كان يعمل كما هو متوقع في مشاريع أخرى. ومع ذلك، بعد التنفيذ، لم يعمل المنتج كما ينبغي. ما الذي يجب على مدير المشروع فعله لتحديد مصدر المشكلة؟",
      "explanation": "عندما يظهر خلل بعد التنفيذ رغم عدم إجراء اختبار قبول المستخدم، يجب على مدير المشروع استخدام تحليل السبب الجذري (Root Cause Analysis) لتحديد السبب الأساسي للمشكلة بدقة والعمل على إصلاحه.\n\n- لماذا الخيار الصحيح؟\nتحليل السبب الجذري يركز على تحديد الأسباب الحقيقية للمشكلة بدلاً من معالجة الأعراض فقط.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة وثيقة مقاييس الجودة قد لا تكشف السبب الحقيقي.\n- مخطط التبعثر يستخدم لعلاقات متغيرات وليس لتحليل أسباب المشكلة.\n- التدقيق يركز على التحقق من الالتزام بالإجراءات لكنه ليس أداة تحليل السبب الأساسي.",
      "choices": [
        {
          "text": "مراجعة وثيقة مقاييس الجودة.",
          "correct": false
        },
        {
          "text": "إنشاء مخطط تبعثر (Scatter Diagram).",
          "correct": false
        },
        {
          "text": "إجراء تحليل السبب الجذري (Root Cause Analysis).",
          "correct": true
        },
        {
          "text": "تنفيذ تدقيق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تلقت شركة تصنيع شكاوى من العملاء تفيد بأن المنتج معيب. وقد ذكر راعي المشروع أن هذه الشكاوى قد تكون حالات شاذة. ما الأداة التي يجب على مدير المشروع استخدامها للتحقيق في سبب وكمية العيوب؟",
      "explanation": "الرسم البياني التكراري (Histogram) هو أداة إحصائية تستخدم لعرض توزيع البيانات، مثل عدد العيوب وأنواعها، مما يساعد مدير المشروع على فهم مدى شيوع العيوب ونمطها.\n\n- لماذا الخيار الصحيح؟\nالرسم البياني التكراري يعرض كمية وأنواع العيوب بطريقة بصرية تساعد على تحليلها بدقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المخططات الانسيابية تُستخدم لتوضيح سير العمليات وليست لتحليل البيانات الكمية.\n- مخطط التقارب يُستخدم لتنظيم أفكار ومشكلات لكنها ليست أداة تحليل كمية للعيوب.\n- مخطط الضبط يستخدم لمراقبة العمليات عبر الزمن وليس لتحديد عدد أو أسباب العيوب بشكل مباشر.",
      "choices": [
        {
          "text": "المخططات الانسيابية (Flowcharts).",
          "correct": false
        },
        {
          "text": "مخطط التقارب (Affinity Diagram).",
          "correct": false
        },
        {
          "text": "مخطط الضبط (Control Chart).",
          "correct": false
        },
        {
          "text": "الرسم البياني التكراري (Histogram).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تحتاج شركة إلى مقارنة نتائج رضا العملاء مع منظمات رائدة في مجال خدمة العملاء. ما الأداة التي يجب أن يستخدمها مدير المشروع لقياس الأداء؟",
      "explanation": "المقارنة المرجعية (Benchmarking) هي عملية قياس أداء الشركة أو المشروع ومقارنته بأفضل الممارسات في الصناعة أو مع منافسين رائدين لتحسين الأداء.\n\n- لماذا الخيار الصحيح؟\nالمقارنة المرجعية تساعد على تحديد الفجوات في الأداء وتحقيق تحسين مستمر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- رسم الخرائط الذهنية أداة لتنظيم الأفكار وليس لقياس الأداء.\n- المقابلات تستخدم لجمع المعلومات وليست أداة مقارنة أداء.\n- مخططات التقارب تُستخدم لتنظيم المعلومات وليس لتحليل الأداء.",
      "choices": [
        {
          "text": "المقارنة المرجعية (Benchmarking).",
          "correct": true
        },
        {
          "text": "رسم الخرائط الذهنية (Mind Mapping).",
          "correct": false
        },
        {
          "text": "المقابلات (Interviews).",
          "correct": false
        },
        {
          "text": "مخططات التقارب (Affinity Diagrams).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع باختبار المنتج وقد حدد عدة مشاكل جودة. ويريد تحديد السبب الجذري لهذه المشكلات ومعالجته. ما الذي يجب على مدير المشروع تحليله؟",
      "explanation": "عندما يواجه مدير المشروع مشاكل جودة متكررة، فإن استخدام مخطط السمكة (Ishikawa/Fishbone Diagram) يساعد في تحليل السبب الجذري للمشكلة.\n\n- لماذا الخيار الصحيح؟\nمخطط السمكة يُستخدم لتحديد وتحليل الأسباب الجذرية لمشكلة ما من خلال تقسيم الأسباب المحتملة إلى فئات مثل المعدات، العمليات، الأشخاص، المواد، البيئة، وغيرها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مخطط التقارب يُستخدم لتنظيم الأفكار وليس لتحديد الأسباب الجذرية.\n- الرسم البياني التكراري يعرض توزيع تكرار المشكلات وليس علاقات السبب والنتيجة.\n- مخطط المصفوفة يُستخدم لإظهار العلاقات بين عناصر مختلفة، لكنه لا يُستخدم للتحليل السببي.",
      "choices": [
        {
          "text": "تحليل مخطط التقارب.",
          "correct": false
        },
        {
          "text": "تحليل الرسم البياني التكراري.",
          "correct": false
        },
        {
          "text": "تحليل مخطط السمكة (Ishikawa/Fishbone Diagram).",
          "correct": true
        },
        {
          "text": "تحليل مخطط المصفوفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "أنت مدير مشروع يتم تنفيذه من قبل فريق يستخدم إطار العمل Scrum. لا يملك الرعاة المعرفة الكافية بـ Scrum وقد تمت دعوتهم لحضور أول اجتماع مراجعة للإصدار (Sprint Review). يسألونك عن نطاق هذا الحدث.\n\nما أهداف هذا الاجتماع؟ (اختر 3)",
      "explanation": "اجتماع مراجعة السبرنت (Sprint Review) هو حدث رسمي يُعقد في نهاية كل سبرنت لمعاينة ما تم إنجازه، والحصول على ملاحظات من أصحاب المصلحة، وتحديد التوجه التالي بناءً على التقدم المحرز.\n\n- لماذا الخيارات الصحيحة؟\n- عرض ما أنجزه الفريق ومقارنة ذلك بهدف السبرنت هو أحد أهداف الاجتماع.\n- التعاون مع أصحاب المصلحة للحصول على ملاحظاتهم يساعد على تحسين المنتج والتخطيط للسبرنت التالي.\n- مراجعة التقدم نحو الهدف العام للمنتج يضمن توافق العمل مع رؤية المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل أداء الفريق يتم في اجتماع الاستعراض الرجعي (Sprint Retrospective) وليس في مراجعة السبرنت.\n- مناقشة التحديات الشخصية للفريق ليست من أهداف الاجتماع الرسمي، بل من الممكن مناقشتها في جلسات منفصلة داخلية.",
      "choices": [
        {
          "text": "عرض ما أنجزه الفريق خلال السبرنت ومناقشة مدى توافقه مع هدف السبرنت.",
          "correct": true
        },
        {
          "text": "التعاون مع أصحاب المصلحة للحصول على ملاحظاتهم ومناقشة الخطوات التالية.",
          "correct": true
        },
        {
          "text": "مراجعة التقدم المحرز نحو تحقيق الهدف العام للمنتج أو المشروع.",
          "correct": true
        },
        {
          "text": "تحليل أداء الفريق وتحديد ما يجب تحسينه في العمليات الداخلية.",
          "correct": false
        },
        {
          "text": "مناقشة التحديات الشخصية التي واجهها أعضاء الفريق خلال السبرنت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير المشروع إلى إغلاق المشروع، لكنه لا يملك الوقت لتحديث سجل الدروس المستفادة. ما العاقبة التي قد تترتب عن هذا الإهمال؟",
      "explanation": "تحديث سجل الدروس المستفادة هو جزء أساسي من مرحلة إغلاق المشروع. يساعد هذا السجل المؤسسات في تحسين الأداء وتجنب تكرار الأخطاء في المشاريع المستقبلية.\n\n- لماذا الخيار الصحيح؟\nعدم تحديث هذا السجل قد يؤدي إلى تفويت فرص قيمة لتفادي مشكلات مماثلة لاحقًا، مما يُفقد المؤسسة فرصة التعلم والتحسين المستمر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- بيانات أداء العمل تُجمع أثناء التنفيذ وليست مرتبطة مباشرة بإغلاق المشروع.\n- خطة إدارة المشروع تُعد في المراحل الأولى ولا تُحدث في نهاية المشروع.\n- عدم تحديث الدروس المستفادة لا يؤدي مباشرة إلى رفض أصحاب المصلحة المشاركة في مشاريع لاحقة.",
      "choices": [
        {
          "text": "ستكون بيانات أداء العمل غير مكتملة وغير متاحة للتحليل.",
          "correct": false
        },
        {
          "text": "قد يتم تفويت فرص منع مشاكل مشابهة في المشاريع المستقبلية.",
          "correct": true
        },
        {
          "text": "قد تكون خطة إدارة المشروع غير دقيقة ومضللة.",
          "correct": false
        },
        {
          "text": "سيرفض أصحاب المصلحة الرئيسيون المشاركة في مشاريع مستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "سيتم تأخير إكمال المشروع لأن مكونًا أساسيًا لن يتم تسليمه في الوقت المحدد. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عند مواجهة تأخير محتمل، يجب على مدير المشروع أولًا تقييم أثر هذا التأخير على الجدول والتكلفة والنطاق وجودة المشروع.\n\n- لماذا الخيار الصحيح؟\nتقييم الأثر قبل اتخاذ أي إجراء يضمن أن القرار سيكون مبنيًا على تحليل دقيق للمخاطر والتبعيات، وليس على ردة فعل غير مدروسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التشاور والتعديل قبل فهم التأثير قد يؤدي إلى قرارات غير مدروسة.\n- مراجعة خطة النطاق لا تعالج مباشرة مشكلة التأخير.\n- التحقق من العقوبات خطوة لاحقة بعد تقييم الأثر وليست الإجراء الأول.",
      "choices": [
        {
          "text": "التشاور مع أصحاب المصلحة وتعديل الجدول الزمني ليعكس التأخير.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة النطاق لفهم كيفية قبول المخرجات رغم التأخير.",
          "correct": false
        },
        {
          "text": "التحقق من عقد الشراء لمعرفة العقوبات الممكن فرضها على المورد.",
          "correct": false
        },
        {
          "text": "تقييم أثر التأخير قبل اتخاذ أي إجراء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير المشروع إلى إغلاق مرحلة من المشروع. ما الخطوة التي يجب أن يتخذها؟",
      "explanation": "إغلاق المرحلة من المشروع يتطلب التأكد من تحقيق أهدافها كما هو مخطط له. لذلك، مراجعة خطة إدارة المشروع تساعد على التأكد من أن جميع الأنشطة المطلوبة قد أُنجزت وأن المخرجات مستوفية للمعايير.\n\n- لماذا الخيار الصحيح؟\nمراجعة خطة إدارة المشروع تُظهر ما إذا كانت أهداف المرحلة قد تحققت فعلاً، وهي الخطوة الأساسية قبل الانتقال للمرحلة التالية أو الإغلاق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاتفاق على المخرجات قد يكون جزءًا من القبول، لكنه لا يكفي لإغلاق المرحلة بالكامل.\n- مقارنة المخرجات بميثاق المشروع مهمة لكنها تتعلق بإغلاق المشروع ككل، وليس المرحلة فقط.\n- مراجعة الافتراضات والقيود تخص نطاقًا أوسع من مجرد الإغلاق المرحلي.",
      "choices": [
        {
          "text": "التأكد من وجود اتفاق تام على المخرجات وفقًا لعملية اتخاذ القرار المعتمدة للمرحلة.",
          "correct": false
        },
        {
          "text": "مقارنة المخرجات مع ميثاق المشروع وطلب توقيع العميل.",
          "correct": false
        },
        {
          "text": "مراجعة الافتراضات والقيود الاستراتيجية والتشغيلية رفيعة المستوى مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المشروع للتأكد من تحقيق أهداف المرحلة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إلغاء مشروع أثناء مرحلة البدء بسبب نقص الموارد. ما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "عند إلغاء مشروع في أي مرحلة، من المهم اتباع الإجراءات التنظيمية الرسمية لإغلاق المشروع بطريقة منظمة. الرجوع إلى إرشادات الإغلاق يضمن استيفاء جميع الخطوات المطلوبة.\n\n- لماذا الخيار الصحيح؟\nإرشادات إغلاق المشروع الخاصة بالشركة تحتوي على الإجراءات والسياسات الواجب اتباعها لضمان إنهاء المشروع بشكل رسمي وسليم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ الفريق مهم، لكنه جزء من خطة التواصل ولا يكفي وحده.\n- إجراء تحليل المخاطر غير مفيد في هذه المرحلة بعد اتخاذ قرار الإلغاء.\n- إعادة تعيين الموارد يجب أن تتم بعد إغلاق المشروع رسميًا، وليس كأولوية أولى.",
      "choices": [
        {
          "text": "إبلاغ جميع أعضاء الفريق وفقًا لخطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "الرجوع إلى إرشادات إغلاق المشاريع الخاصة بالشركة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل مخاطر لتحديد أثر إلغاء المشروع.",
          "correct": false
        },
        {
          "text": "إعادة تعيين جميع الموارد وإعادة توزيع الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تحديد صاحب مصلحة جديد لديه اهتمام بالمشروع، لكنه يتمتع بسلطة أو تأثير محدود. كيف يجب على مدير المشروع التعامل مع هذا الطرف؟",
      "explanation": "في تحليل أصحاب المصلحة، يتم تصنيفهم بناءً على مستوى السلطة والتأثير والاهتمام. بالنسبة لأصحاب المصلحة الذين لديهم اهتمام مرتفع لكن تأثيرهم أو سلطتهم منخفضة، فإن الاستراتيجية الأنسب هي 'إبقاؤهم على اطلاع' (Keep Informed).\n\n- لماذا الخيار الصحيح؟\nتزويده بالمعلومات عند الحاجة هو أسلوب عملي لتلبية اهتمامه مع تجنب صرف الموارد على إشراكه بدرجة غير ضرورية، بما يتناسب مع تأثيره المحدود.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 'العمل معه عن كثب' هو نهج يُستخدم لأصحاب المصلحة ذوي التأثير العالي.\n- 'المتابعة والاستجابة' تناسب من لديهم تأثير متوسط.\n- 'إشراكه في التحديثات الدورية' أكثر ملاءمة لأصحاب المصلحة ذوي التأثير العالي والاهتمام العالي.",
      "choices": [
        {
          "text": "تزويده بالمعلومات عند الحاجة.",
          "correct": true
        },
        {
          "text": "العمل معه عن كثب لمعالجة مخاوفه بشكل استباقي.",
          "correct": false
        },
        {
          "text": "متابعته والاستجابة لاحتياجاته.",
          "correct": false
        },
        {
          "text": "إشراكه في التحديثات الدورية وإبقاؤه راضيًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدرك مدير المشروع ضرورة تحسين ديناميكية الفريق ومشاركة المعرفة خلال مشروع ضخم. ما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "في المشاريع المعقدة والضخمة، تزداد الحاجة إلى التعاون الفعال ومشاركة المعرفة. أحد أفضل الأساليب هو تيسير النقاشات المفتوحة داخل الفريق.\n\n- لماذا الخيار الصحيح؟\nتيسير المناقشات المفتوحة يسمح للفريق بمشاركة التحديات، ويعزز الشفافية، ويحفّز الأعضاء على المساهمة بأفكارهم وخبراتهم. هذا يساعد على معالجة المشكلات التنظيمية أو الفردية قبل أن تتفاقم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تنظيم جلسات للمهارات جيد، لكنه لا يضمن الحوار أو معالجة التحديات.\n- تكليف الأعضاء الجدد بمهام صعبة بدون دعم يمكن أن يضعف الأداء.\n- البرنامج التوجيهي قد يكون فعالًا، لكن الحل الأسرع والأكثر شمولًا هو الحوار الجماعي الذي يشارك فيه الجميع.",
      "choices": [
        {
          "text": "تنظيم جلسات مشاركة معرفة يعرض فيها الأعضاء ذوو الخبرة مهاراتهم.",
          "correct": false
        },
        {
          "text": "تكليف الأعضاء الجدد بمهام تتجاوز مستواهم وتقديم دعم محدود.",
          "correct": false
        },
        {
          "text": "تطبيق برنامج توجيه رسمي بأهداف وهيكل اجتماعات محدد.",
          "correct": false
        },
        {
          "text": "تيسير مناقشات مفتوحة للفريق لتحديد ومعالجة التحديات الفردية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند إعداد قائمة أصحاب المصلحة، اكتشف مدير المشروع طرفًا مهتمًا لكنه لا يمتلك سلطة حقيقية. كيف يجب التعامل معه؟",
      "explanation": "في إدارة أصحاب المصلحة، يُستخدم نموذج 'السلطة مقابل الاهتمام' لتصنيفهم. أصحاب المصلحة ذوي الاهتمام العالي والسلطة المنخفضة يُنصح بإبقائهم على اطلاع دائم (Keep Informed).\n\n- لماذا الخيار الصحيح؟\nلأن هذا الطرف لديه اهتمام بالمشروع، فيجب إعلامه بما يجري دون الحاجة لإشراكه بعمق، مما يحافظ على انسيابية التواصل دون استنزاف الموارد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 'إبقاؤه راضيًا' يُستخدم للذين يملكون سلطة عالية واهتمام منخفض.\n- 'إدارته عن كثب' يُطبق على أصحاب النفوذ العالي والاهتمام العالي.\n- 'مراقبته' مناسب لمن لديهم اهتمام وسلطة منخفضين.",
      "choices": [
        {
          "text": "إبقاؤه راضيًا.",
          "correct": false
        },
        {
          "text": "إدارته عن كثب.",
          "correct": false
        },
        {
          "text": "مراقبته.",
          "correct": false
        },
        {
          "text": "إبقاؤه على اطلاع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتغيب أحد أصحاب المصلحة في المشروع عن ورشات العمل المجدولة، وقد فوض المهام الموكلة إليه إلى عضو آخر من مجتمع أصحاب المصلحة. ما الذي يجب على مدير المشروع فعله لإشراك هذا الطرف؟",
      "explanation": "عند وجود ضعف في مشاركة أحد أصحاب المصلحة، فإن الخطوة الأولى هي التحقق مما إذا كانت أدواره ومسؤولياته واضحة ومفهومة. مراجعة الميثاق تساعد على إعادة تحديد التزامات كل طرف.\n\n- لماذا الخيار الصحيح؟\nمراجعة الأدوار كما هي محددة في ميثاق المشروع تسلط الضوء على مسؤوليات صاحب المصلحة وتعيد ضبط التوقعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- شرح الفروق في المهام لا يحل المشكلة الأساسية.\n- الطلب من مدير البرنامج التدخل هو تصعيد غير ضروري في هذه المرحلة.\n- إقرانه بعضو فريق كموجه مناسب في حالة ضعف الكفاءة، وليس ضعف الالتزام.",
      "choices": [
        {
          "text": "مراجعة أدوار ومسؤوليات جميع المشاركين مع صاحب المصلحة، كما هو محدد في ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "شرح لصاحب المصلحة الفروق بين المهام الموكلة إلى كل عضو في الفريق.",
          "correct": false
        },
        {
          "text": "طلب من مدير البرنامج إبلاغ صاحب المصلحة ومطالبته بحضور الاجتماعات ذات الصلة.",
          "correct": false
        },
        {
          "text": "إقران صاحب المصلحة بعضو فريق أكثر خبرة يعمل كموجه له.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مشروع على وشك التأخر، يجب على مدير المشروع تشغيل معدات جديدة. يطلب طرفان محليان متأثران بإطلاق هذه المعدات وقف المشروع فورًا لأنهما لم يُمنحا الفرصة لتقديم الموافقة. كيف كان من الممكن لخطة إشراك أصحاب المصلحة أن تساعد في تجنب هذا الموقف؟",
      "explanation": "خطة إشراك أصحاب المصلحة تهدف إلى تحديد جميع الأطراف المعنية بالمشروع، وتحديد استراتيجيات لإدماجهم في الوقت المناسب. إذا تم تحديد الأطراف المحلية كأصحاب مصلحة في الخطة، لكانوا قد أدرجوا في قنوات الاتصال الرسمية وتلقوا المعلومات اللازمة لإبداء آرائهم أو موافقتهم مسبقًا.\n\n- لماذا الخيار الصحيح؟ لأن تضمين الأطراف المتأثرة في خطة الاتصال ضمن خطة إشراك أصحاب المصلحة يضمن اطلاعهم ومشاركتهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - استخدام تقنيات إدارة النزاع يفترض وجود نزاع فعلي، وليس وسيلة وقائية.\n  - توقيعهم على ميثاق المشروع غير مطلوب دائمًا، وقد لا يكون ممكنًا.\n  - تقنيات التفاوض لا تُطبق إلا بعد التواصل، وليست بديلاً عن إدراجهم مسبقًا.",
      "choices": [
        {
          "text": "من خلال استخدام تقنيات إدارة النزاع الواردة في الخطة، كان بإمكان مدير المشروع الحصول على الموافقة من الأطراف المحلية.",
          "correct": false
        },
        {
          "text": "إدراج الأطراف المحلية في الخطة كان سيضمن توقيعهم على ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "من خلال فهم توقعات الأطراف المحلية، كان بإمكان مدير المشروع استخدام تقنيات التفاوض المناسبة لإشراكهم.",
          "correct": false
        },
        {
          "text": "من خلال تحديد الأطراف المحلية كأصحاب مصلحة، كانوا سيُدرجون في الاتصالات ذات الصلة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "رفض صاحب مصلحة رئيسي الموافقة على المنتج لأنه لا يلبي التوقعات المحددة في نطاق المشروع. ما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "إدارة تفاعل أصحاب المصلحة تتطلب إشراكهم المستمر خلال دورة حياة المشروع، خاصة أصحاب المصالح الرئيسيين الذين يؤثرون على القبول النهائي للمخرجات. جمع التغذية الراجعة المستمرة يضمن توافق المخرجات مع توقعاتهم وتعديل النطاق أو التصميم عند الحاجة.\n\n- لماذا الخيار الصحيح؟ لأن جمع الآراء بشكل مستمر يسمح بالكشف المبكر عن الفجوات بين التوقعات والنطاق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - تقييم المخاطر يخص التهديدات أو الفرص، وليس توقعات القبول.\n  - تقنيات إدارة النزاع تُستخدم عندما تحدث مشكلة فعلية.\n  - إشراكه فقط في مرحلة الاختبار متأخر جدًا لتعديل النطاق أو المنتج.",
      "choices": [
        {
          "text": "جمع آراء أصحاب المصلحة طوال دورة حياة المشروع.",
          "correct": true
        },
        {
          "text": "إجراء تقييمات للمخاطر بناءً على توقعات صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "تطبيق تقنيات إدارة النزاع أثناء عملية التوقيع.",
          "correct": false
        },
        {
          "text": "إشراك صاحب المصلحة الرئيسي خلال مرحلة الاختبار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتطلب جدول المشروع أن يعمل فريقان في وقت واحد على أجزاء منفصلة من مشروع معقد. وتعتمد هاتان الجزئيتان على بعضهما البعض. يحتاج مدير المشروع إلى ضمان عدم حدوث تعارضات عند دمج مخرجات الفريقين. ما الإجراء الذي يجب على مدير المشروع اتخاذه أولًا لإدارة أي تعارض محتمل؟",
      "explanation": "عندما تعمل فرق مختلفة على أجزاء مترابطة من مشروع، يكون التنسيق المنتظم أمرًا ضروريًا لتجنب التعارضات عند دمج المخرجات. الاجتماعات الأسبوعية توفر منصة لتبادل التقدم والتحديات والمستجدات الفنية والتكاملية بين الفرق.\n\n- لماذا الخيار الصحيح؟\nتنظيم اجتماعات أسبوعية بين الفريقين يسمح بالمتابعة المستمرة والتعرف على أي مشاكل أو اختلافات مبكرًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعطاء الأولوية للمسار الحرج لا يحل التعارضات بين الفرق، بل يتعلق بالجدولة الزمنية.\n- مراجعة الدروس المستفادة مهمة، لكنها لا تكفي كإجراء أولي لإدارة التعارضات في الوقت الحقيقي.\n- إشراك أصحاب المصلحة مفيد للدعم العام، ولكن لا يعالج التنسيق الفني اليومي بين الفرق.",
      "choices": [
        {
          "text": "تنظيم اجتماعات أسبوعية بين الفريقين لمراقبة أعمال بعضهما البعض.",
          "correct": true
        },
        {
          "text": "إعطاء أولوية لحل النزاعات في الجزء من المشروع الواقع على المسار الحرج.",
          "correct": false
        },
        {
          "text": "مراجعة سجل الدروس المستفادة لتوقّع التعارضات المحتملة والتخطيط لحلها.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة لضمان دعمهم عند ظهور تعارضات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على إعداد ميثاق المشروع، لكن أحد أصحاب المصلحة الرئيسيين لا يقدم معلومات حول الفوائد المتوقعة من المشروع. لماذا يجب على مدير المشروع الاجتماع مع راعي المشروع في هذه الحالة؟",
      "explanation": "راعي المشروع هو المسؤول التنفيذي الذي يملك سلطة دعم المشروع على المستوى السياسي والإستراتيجي. عندما يواجه مدير المشروع مقاومة أو غياب تعاون من أحد أصحاب المصلحة المهمين، فإن راعي المشروع يمكنه التدخل لمعالجة المسائل السياسية أو حث الأطراف على التعاون.\n\n- لماذا الخيار الصحيح؟\nلأن راعي المشروع يمتلك النفوذ داخل المنظمة لمعالجة الأمور الداخلية التي تعرقل تقدم المشروع، خاصة عندما تتعلق بالمعلومات الحيوية مثل الفوائد المتوقعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إدارة المعرفة الضمنية ليست الدور الأساسي للراعي.\n- التغيير في مجتمع أصحاب المصلحة يتم بالتعاون مع أصحاب المصلحة أنفسهم، وليس من خلال مجلس التغيير (CCB).\n- الإجراءات التأديبية ليست من مسؤوليات راعي المشروع، بل عادةً من مسؤوليات الموارد البشرية.",
      "choices": [
        {
          "text": "راعي المشروع هو المسؤول الرئيسي عن إدارة المعرفة الضمنية والصريحة في المشروع.",
          "correct": false
        },
        {
          "text": "راعي المشروع هو الشخص القادر على معالجة القضايا السياسية والاستراتيجية الداخلية التي قد تؤثر على جودة المشروع.",
          "correct": true
        },
        {
          "text": "راعي المشروع يمكنه طلب تغيير في مجتمع أصحاب المصلحة من خلال مجلس التحكم في التغيير (CCB).",
          "correct": false
        },
        {
          "text": "الإجراءات التأديبية المرتبطة بأصحاب المصلحة يديرها راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحل متدرب محل مورد حرج في منتصف دورة Sprint. ولمساعدة المتدرب على الاندماج، يكلّفه مدير المشروع بمهندس كبير ليعمل كموجه. بعد شهرين، يدخل المشروع في حالة حرجة، ما يؤخر إطلاق المنتج لمدة شهر. ما الذي كان يجب على مدير المشروع فعله لتجنب هذا السيناريو؟",
      "explanation": "عندما يتم استبدال مورد حرج بمتدرب، فإن ذلك يمثل مخاطرة كبيرة على أداء المشروع. من مسؤولية مدير المشروع تحليل الأثر على الجدول الزمني واتخاذ تدابير وقائية. الخيار الأفضل هنا هو التفاوض على وقت إضافي لتعديل الجدول بما يتناسب مع قدرات المورد الجديد.\n\n- لماذا الخيار الصحيح؟ لأن التفاوض على وقت إضافي يمنح المتدرب والموجه الوقت الكافي دون الضغط، ويقلل من احتمالات التأخير.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - إقناع المورد الحرج بالبقاء قد لا يكون ممكنًا.\n  - طلب مورد ذو خبرة قد لا يكون خيارًا متاحًا دائمًا.\n  - تخصيص وقت للتوجيه مفيد، لكنه لا يعالج الحاجة الزمنية الناتجة عن نقص الخبرة.",
      "choices": [
        {
          "text": "إقناع المورد الحرج بالبقاء في المشروع.",
          "correct": false
        },
        {
          "text": "طلب مورد بديل ذو خبرة.",
          "correct": false
        },
        {
          "text": "التفاوض على وقت إضافي لاستكمال المشروع.",
          "correct": true
        },
        {
          "text": "تخصيص وقت إضافي لعملية التوجيه والإرشاد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم مدير مشروع جديد إلى مشروع أثناء تسليم معلم رئيسي حرج. المشروع يحتوي على عدة أصحاب مصلحة، ولكل منهم مستوى مختلف من الاهتمام. يحتاج مدير المشروع إلى تحديد مقدار التفاصيل التي يجب تقديمها لأصحاب المصلحة بخصوص التسليم. إلى أي وثيقة يجب أن يرجع مدير المشروع؟",
      "explanation": "تُستخدم خطة إشراك أصحاب المصلحة لتحديد مستويات التأثير والاهتمام لدى أصحاب المصلحة، واستراتيجيات التواصل المناسبة لكل فئة. تساعد هذه الخطة في تحديد نوع المعلومات، ومستوى التفاصيل، وتكرار التواصل لكل صاحب مصلحة.\n\n- لماذا الخيار الصحيح؟ لأن خطة إشراك أصحاب المصلحة تحتوي على تحليل التفصيل لمستويات التأثير والاحتياج للمعلومات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - خطة الاتصالات تحدد الوسائل والتكرار وليس المحتوى التفصيلي المخصص لكل طرف.\n  - سجل أصحاب المصلحة يحتوي على معلومات عامة، لكنه لا يحدد مستوى التفاصيل المطلوب.\n  - خطة إدارة المشروع هي وثيقة شاملة، لكنها لا تتناول استراتيجية تخصيص التفاصيل لكل طرف.",
      "choices": [
        {
          "text": "خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "خطة إشراك أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة مشروع، أبلغ مدير البناء أن معدل إنتاج الخرسانة تغير خلال الأشهر الثلاثة الماضية. ويرغب في معرفة ما يمكن توقعه خلال الأشهر الثلاثة القادمة. ما نوع التحليل الذي يجب إجراؤه؟",
      "explanation": "التحليل المناسب لهذا النوع من الحالات هو تحليل الاتجاه (Trend Analysis). هذا النوع من التحليل يستخدم البيانات السابقة لتحديد النمط أو الاتجاه الذي يسير فيه الأداء، مما يسمح بالتنبؤ بما سيحدث في المستقبل إذا استمرت الظروف كما هي.\n\n- لماذا الخيار الصحيح؟\n  - تحليل الاتجاه يوضح التغيرات في الأداء عبر الزمن، مثل إنتاج الخرسانة، ويساعد في التوقعات المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - تحليل القيمة المكتسبة يركز على التقدم مقابل الميزانية والجدول الزمني وليس على الاتجاهات الزمنية.\n  - تحليل المسار الحرج يحدد الأنشطة التي تؤثر على مدة المشروع، ولا يُستخدم لتوقع تغيرات الأداء.\n  - تحليل التكلفة مقابل الفائدة يُستخدم لتقييم ما إذا كانت المبادرات تستحق التكلفة، وليس لتوقع الأداء.",
      "choices": [
        {
          "text": "تحليل القيمة المكتسبة.",
          "correct": false
        },
        {
          "text": "تحليل المسار الحرج.",
          "correct": false
        },
        {
          "text": "تحليل الاتجاه.",
          "correct": true
        },
        {
          "text": "تحليل التكلفة مقابل الفائدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد اجتماع مراجعة، كرر المسؤول عن Scrum أهمية الجودة، مع التركيز على تكلفة التغيير. أي مما يلي **لا** يشير إليه المسؤول؟",
      "explanation": "في منهجيات Agile مثل Scrum، يتم التركيز على تقليل تكلفة التغيير من خلال الاكتشاف المبكر للمشاكل. المسؤول هنا يتحدث عن الجودة وأثر العيوب على المشروع. الخيار الذي لا يشير إليه المسؤول هو دعم المزيد من الميزات، لأنه لا يتعلق بجودة المنتج أو تكلفة التغيير.\n\n- لماذا الخيار الصحيح؟\n  - دعم المزيد من الميزات يتعلق بالنطاق أو الوظائف، وليس بالجودة أو تكلفة التغيير.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - تقليل دورة معالجة العيوب هو عنصر أساسي في تحسين الجودة.\n  - إصلاح العيوب التي تم اكتشافها بعد التسليم من أكثر الأنشطة تكلفةً، ويجب تجنبها.\n  - تقليل الديون التقنية جزء مهم من إدارة الجودة في Scrum.",
      "choices": [
        {
          "text": "تقليل دورة معالجة العيوب.",
          "correct": false
        },
        {
          "text": "إصلاح العيوب التي تم اكتشافها بعد التسليم.",
          "correct": false
        },
        {
          "text": "دعم المزيد من الميزات.",
          "correct": true
        },
        {
          "text": "تقليل الديون التقنية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع أن العمل الذي بدأ به الفريق غير متوافق مع اللوائح التنظيمية الخاصة بالصناعة. ما الذي يجب على مدير المشروع تحديثه؟",
      "explanation": "عند اكتشاف أن العمل لا يتوافق مع اللوائح التنظيمية، فإن هذا يمثل **قضية (Issue)** تؤثر على سير المشروع، وقد تتطلب اتخاذ إجراءات تصحيحية. لذلك يجب على مدير المشروع تحديث **سجل القضايا (Issue Log)** لتوثيق هذه المشكلة، وتحديد تأثيرها، ومتابعة الحلول.\n\n- لماذا الخيار الصحيح؟\n  - سجل القضايا يُستخدم لتوثيق المشكلات غير المتوقعة التي تحدث أثناء التنفيذ.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - أصول العمليات التنظيمية لا يتم تحديثها من قبل مدير المشروع بل من المنظمة.\n  - بيانات أداء العمل هي ناتج عن التنفيذ ولا تُستخدم لتوثيق المشكلات.\n  - خطة إدارة المشروع يمكن تعديلها لاحقًا إذا تطلبت القضية تغييرًا في الخطة، ولكنها ليست أول ما يُحدث.",
      "choices": [
        {
          "text": "أصول العمليات التنظيمية.",
          "correct": false
        },
        {
          "text": "بيانات أداء العمل.",
          "correct": false
        },
        {
          "text": "سجل القضايا.",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا بنهج أجايل (Agile) وقد تم تحديد العديد من المخاطر في سجل المخاطر. تتعامل الدورة الحالية مع جانب حرج من المشروع. أثناء الدورة، وقع أحد المخاطر المحددة مما أوقف التطوير. قام مدير المشروع بتسجيل وقوع الخطر. ما الإجراء التالي الذي يجب اتخاذه؟",
      "explanation": "عند وقوع خطر في مشروع أجايل، وخاصة إذا أثر على التقدم، يجب على مدير المشروع اتخاذ إجراء فوري لتخفيف الأثر. **زيادة وتيرة الاتصالات** مع الفريق وأصحاب المصلحة والاستفادة من دعمهم هو الأسلوب الأكثر فعالية في بيئة Agile للتعامل مع الأزمات.\n\n- لماذا الخيار الصحيح؟\n  - Agile تركز على التعاون والاستجابة السريعة، ولذلك زيادة الاتصالات والتعاون مع المعنيين أمر حاسم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - تعيين عضو مسؤول عن الاتصالات لا يعالج الخطر الحالي.\n  - الاجتماع الرجعي (Sprint Retrospective) يحدث بعد الدورة، ولا يُستخدم لحل المشاكل الفورية.\n  - تأجيل العمل ليس الحل الأول عند وقوع خطر؛ يجب محاولة التعامل معه أولًا.",
      "choices": [
        {
          "text": "زيادة وتيرة الاتصالات والاستفادة من أصحاب المصلحة للمساعدة في حل المشكلات.",
          "correct": true
        },
        {
          "text": "تعيين أحد كبار أعضاء الفريق مسؤولًا عن خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "دعوة أصحاب المصلحة للاجتماع الرجعي التالي وإبلاغهم بالمشكلة.",
          "correct": false
        },
        {
          "text": "تأجيل تطوير الجزء الحرج إلى الدورة التالية والعمل على عناصر من قائمة الأعمال المؤجلة (Backlog).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يغادر عضو رئيسي في الفريق المؤسسة في منتصف المشروع. ما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "عند مغادرة عضو رئيسي في الفريق، أول خطوة يجب على مدير المشروع اتخاذها هي **تقييم أثر خسارة هذا العضو على المشروع**. هذا التقييم يساعد في فهم التأثير على الجدول الزمني، جودة العمل، والموارد المتاحة، وبالتالي تحديد الخطوات التالية بشكل فعال.\n\n- لماذا الخيار الصحيح؟\n  - تقييم الأثر يوفر أساسًا لاتخاذ قرارات مستنيرة حول تعويض الموارد أو إعادة الجدولة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - الاجتماع مع الفريق لإعادة توزيع العبء قد يكون لاحقًا بعد تقييم الأثر.\n  - العمل مع المدير الوظيفي لإيجاد بديل خطوة لاحقة بعد تقييم التأثير.\n  - إعادة تقييم الأدوار والتكوين تحتاج لتقييم أثر الخسارة أولًا.",
      "choices": [
        {
          "text": "الاجتماع مع أعضاء الفريق المتبقين لإعادة توزيع عبء العمل.",
          "correct": false
        },
        {
          "text": "العمل مع المدير الوظيفي لإيجاد بديل.",
          "correct": false
        },
        {
          "text": "تقييم أثر خسارة هذا العضو على المشروع.",
          "correct": true
        },
        {
          "text": "إعادة تقييم أدوار الفريق وتكوينه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال جلسة مراجعة أجايل (Agile Retrospective)، أشار عدة أعضاء في الفريق إلى أنهم شعروا بالارتباك بشأن تقدم الدورة. ما الذي يجب على مدير المشروع فعله لتفادي هذا الارتباك؟",
      "explanation": "إذا شعر أعضاء الفريق بالارتباك حول تقدم الدورة، يجب على مدير المشروع توضيح الوضع عبر **إرشاد الفريق لمراجعة لوحة الدورة (Iteration Board)** التي تعرض حالة المهام بشكل مرئي ومباشر، مما يعزز فهم الجميع لتقدم العمل.\n\n- لماذا الخيار الصحيح؟\n  - لوحة الدورة هي أداة مرئية تساعد الفريق على متابعة تقدم المهام بشكل واضح.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - إعداد تقارير حالة يومية قد لا يكون فعالًا كما التفاعل المباشر مع الأدوات المرئية.\n  - مطالبة الفريق بمراجعة قائمة الأعمال لا تعطي صورة شاملة كما تفعل اللوحة.\n  - تأجيل معالجة المشكلة لجلسة لاحقة يؤخر الحل ولا يعالج الارتباك الحالي.",
      "choices": [
        {
          "text": "إرشاد الفريق لمراجعة لوحة الدورة (Iteration Board).",
          "correct": true
        },
        {
          "text": "إعداد تقرير حالة يومي ومشاركته مع الفريق.",
          "correct": false
        },
        {
          "text": "مطالبة الفريق بمراجعة تقرير قائمة الدورة (Iteration Backlog).",
          "correct": false
        },
        {
          "text": "معالجة المشكلة في جلسة المراجعة التالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع جديد لتطوير برمجيات وقد التقى بالعميل لمناقشة المتطلبات. قدم العميل قائمة بالمتطلبات، لكنه لم يميز بين المتطلبات التقنية ومتطلبات العميل. أي من المتطلبات التالية يُعد متطلبًا من متطلبات العميل؟",
      "explanation": "متطلبات العميل هي الخصائص أو الوظائف التي يحتاجها العميل من المنتج أو الخدمة، وغالبًا ما تكون مرتبطة بتجربة المستخدم ورضاه. في هذا السؤال:\n\n- يجب أن يكون البرنامج سهل الاستخدام والتنقل هو متطلب من متطلبات العميل لأنه يعكس احتياجات المستخدم النهائي للبرنامج.\n\n- المتطلبات الأخرى مثل القدرة على معالجة معاملات بسرعة معينة أو استخدام خوارزميات تشفير أو العمل على أنظمة تشغيل متعددة هي متطلبات تقنية تهتم بكيفية تنفيذ النظام داخليًا.\n\nبالتالي، الخيار الصحيح هو متطلب العميل الذي يعبر عن سهولة الاستخدام.",
      "choices": [
        {
          "text": "يجب أن يكون البرنامج قادرًا على معالجة 1000 معاملة في الثانية.",
          "correct": false
        },
        {
          "text": "يجب أن يستخدم البرنامج خوارزمية تشفير آمنة لقاعدة البيانات.",
          "correct": false
        },
        {
          "text": "يجب أن يعمل البرنامج على أنظمة تشغيل متعددة.",
          "correct": false
        },
        {
          "text": "يجب أن يكون البرنامج سهل الاستخدام والتنقل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار قبول أحد المخرجات، اشتكى بعض أصحاب المصلحة الكبار من أن ميزة أساسية لقسمهم لم تُدرج. ما الذي كان يجب على مدير المشروع فعله لتفادي ذلك؟",
      "explanation": "هذه المشكلة تحدث بسبب عدم وضوح نطاق المشروع أو سوء إدارة متطلبات أصحاب المصلحة. \n\n- الحل الصحيح هو تحليل ميثاق المشروع وتطوير خطة إدارة النطاق، لأن ميثاق المشروع يحدد حدود المشروع، ومتطلبات أصحاب المصلحة يجب أن تدار ضمن خطة النطاق لضمان تضمين كل المتطلبات المهمة وتفادي الاستبعادات.\n\n- الخيارات الأخرى مثل الرجوع للدروس المستفادة، أو خطة إدارة التغيير أو إعداد نموذج أولي مهمة لكنها لا تعالج المشكلة الأساسية المتمثلة في تحديد النطاق بوضوح.",
      "choices": [
        {
          "text": "الرجوع إلى الدروس المستفادة من مشاريع مشابهة لتكييف العمليات.",
          "correct": false
        },
        {
          "text": "إعداد خطة لإدارة التغيير وتوثيق التغييرات أثناء تنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "تحليل ميثاق المشروع وتطوير خطة إدارة النطاق.",
          "correct": true
        },
        {
          "text": "إعداد نموذج أولي وعرض المنتج على أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لمشروع في مرحلة التنفيذ. وأثناء مراجعة هيكل تقسيم العمل (WBS)، اكتشف المدير أن بعض المخرجات قد تم تجاهلها. يحتاج مدير المشروع إلى التأكد من عدم استبعاد أي عمل من نطاق المشروع وعدم تنفيذ عمل زائد. ما الخطوة التالية التي يجب اتخاذها؟",
      "explanation": "عندما يكتشف مدير المشروع أن بعض المخرجات تم تجاهلها في هيكل تقسيم العمل (WBS)، يجب عليه أولًا تحديث WBS بإضافة الأعمال أو المخرجات الناقصة. \n\nهذه الخطوة تضمن أن جميع الأعمال المطلوبة مُدرجة في نطاق المشروع، مما يمنع استبعاد العمل الضروري أو تنفيذ عمل زائد. بعدها، يجب إعادة حساب مقاييس المشروع مثل الجدول الزمني والتكلفة لتضمين التغييرات الجديدة.\n\n- سؤال أصحاب المصلحة قد يكون مفيدًا لكن أول خطوة هي تحديث WBS.\n- دمج المخرجات ذات المستوى الأدنى دون مراجعة قد يسبب استبعاد عمل.\n- طلب تغيير عبر PMO قد يكون ضروريًا لاحقًا إذا استدعى التغيير ذلك، لكنه ليس الخطوة الأولى.",
      "choices": [
        {
          "text": "إضافة العمل إلى هيكل WBS وإعادة حساب مقاييس المشروع.",
          "correct": true
        },
        {
          "text": "سؤال أصحاب المصلحة عمّا إذا كان ينبغي إدراج هذه المخرجات في WBS.",
          "correct": false
        },
        {
          "text": "دمج المخرجات ذات المستوى الأدنى ضمن أعمال ذات مستوى أعلى موجودة بالفعل في WBS.",
          "correct": false
        },
        {
          "text": "بدء طلب تغيير من خلال مكتب إدارة المشروع (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثار راعي المشروع تساؤلات حول ما إذا كانت بعض القدرات المفصلة في تصميم المنتج تتطابق مع النطاق وفقًا لميثاق المشروع. ما الأداة التي يجب على مدير المشروع استخدامها لإدارة هذا؟",
      "explanation": "مصفوفة تتبع المتطلبات (Requirements Traceability Matrix) هي أداة رئيسية تساعد مدير المشروع على تتبع كل متطلب من ميثاق المشروع إلى مخرجات التصميم والتنفيذ والتسليم. تضمن هذه الأداة أن جميع القدرات والخصائص في التصميم متوافقة مع نطاق المشروع المحدد.\n\n- الحكم الخبير يستخدم للاستشارة ولكنه ليس أداة لتتبع.\n- النموذج الأولي يساعد في تصور المنتج لكنه لا يوفر تتبعاً منهجياً.\n- مخطط السياق يحدد حدود النظام لكنه لا يربط المتطلبات بالمنتجات.",
      "choices": [
        {
          "text": "الحكم الخبير.",
          "correct": false
        },
        {
          "text": "مصفوفة تتبع المتطلبات (Requirements Traceability Matrix).",
          "correct": true
        },
        {
          "text": "النموذج الأولي.",
          "correct": false
        },
        {
          "text": "مخطط السياق (Context Diagram).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم مدير المشروع نهج التسليم المرن (Agile) في المشروع. ومع ذلك، لا يمتلك أعضاء الفريق وأصحاب المصلحة خبرة في طرق تحديد أولوية المتطلبات. ويريد مدير المشروع التأكد من أن المتطلبات الحرجة يتم تخطيطها وتسليمها. ما التقنية التي يجب أن يستخدمها مدير المشروع لتحديد الأولويات؟",
      "explanation": "في بيئة Agile، حيث يمكن أن يكون تحديد الأولويات متعدد الأطراف وغير واضح، من الأفضل استخدام نموذج رياضي متفق عليه لتحديد أولوية المتطلبات بشكل موضوعي وواضح. هذا يسمح بتوزيع الأولويات بناءً على معايير محددة ويتم قبولها من الفريق وأصحاب المصلحة.\n\n- أخذ آراء الجميع بشكل غير منظم قد يؤدي إلى نتائج غير واضحة.\n- جمع الاحتياجات وفهمها مهم لكنه لا يحدد الأولويات بدقة.\n- الوصول إلى فهم مشترك هو عملية مستمرة لكنها ليست تقنية تحديد أولوية بحد ذاتها.",
      "choices": [
        {
          "text": "أخذ آراء جميع أعضاء الفريق وأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "استخدام نموذج رياضي يتم الاتفاق عليه من قِبل الفريق وأصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "جمع احتياجات الفريق وأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الوصول إلى فهم مشترك مع أعضاء الفريق وأصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير وظيفي بإجراء تغييرات على المشروع خارج الخطة الإدارية المتفق عليها، كما تواصل مؤخرًا مباشرة مع راعي المشروع لطلب تغيير إضافي. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة هي 'إبلاغ المدير الوظيفي بأن جميع التغييرات يجب أن تمر عبر عملية التحكم بالتغيير'. السبب هو أن مدير المشروع مسؤول عن تطبيق العمليات المعتمدة لتغيير النطاق، ولا يجوز السماح بتجاوزها. \n\n- 'تحديد ما إذا كان يجب على لجنة التحكم في التغيير (CCB) مراجعة التغييرات' غير صحيحة لأن التغييرات قد حصلت بالفعل خارج العملية الرسمية.\n- 'تعديل خطة إدارة المشروع للسماح بالمرونة' غير مناسبة لأنها تشرّع السلوك غير المنضبط.\n- 'الاجتماع مع راعي المشروع لمناقشة التغييرات' ليس كافيًا بدون معالجة الجذر وهو تجاوز المدير الوظيفي لعملية التغيير.",
      "choices": [
        {
          "text": "تحديد ما إذا كان يجب على لجنة التحكم في التغيير (CCB) مراجعة التغييرات.",
          "correct": false
        },
        {
          "text": "إبلاغ المدير الوظيفي بأن جميع التغييرات يجب أن تمر عبر عملية التحكم بالتغيير.",
          "correct": true
        },
        {
          "text": "تعديل خطة إدارة المشروع للسماح بالمرونة في إجراءات التحكم بالتغيير.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة تفاصيل التغييرات المطلوبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت لجنة التحكم بالتغيير (CCB) مؤخرًا بتقييم والموافقة على عدة طلبات تغيير بسرعة. ولكن تنفيذ هذه التغييرات يستغرق وقتًا أطول من المتوقع. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة هي 'مراقبة تنفيذ التغييرات للتأكد من اتباع إجراءات إدارة التغيير'. هذا يعني أن دور مدير المشروع لا يتوقف عند الموافقة بل يتضمن متابعة التنفيذ وضمان الالتزام بالخطط.\n\n- 'تعديل نظام التحكم بالتغيير' غير صحيح لأنه لا يعالج تأخير التنفيذ.\n- 'الحصول على موارد إضافية' غير مناسب قبل فهم السبب الجذري للتأخير.\n- 'إجراء تحليل مخاطر' قد يكون لاحقًا ولكن الخطوة الأولى هي المتابعة الفعلية للتنفيذ.",
      "choices": [
        {
          "text": "تعديل نظام التحكم في التغيير للسماح فقط بالتغييرات الحرجة.",
          "correct": false
        },
        {
          "text": "الحصول على موارد إضافية لضمان الوفاء بالمواعيد النهائية للمشروع.",
          "correct": false
        },
        {
          "text": "إجراء تحليل مخاطر مفصل لتحديد تأثير مدة تنفيذ التغييرات على نجاح المشروع.",
          "correct": false
        },
        {
          "text": "مراقبة تنفيذ التغييرات للتأكد من اتباع إجراءات إدارة التغيير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتشف مدير مشروع لمشروع معقد أن أحد أعضاء الفريق لم يحقق عدة أهداف. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة هي 'مناقشة المشكلة مع العضو وعرض تقديم المساعدة إذا لزم الأمر'. لأن أفضل نهج في البداية هو الحوار المباشر لفهم الأسباب وتقديم الدعم اللازم.\n\n- 'التحقق من ارتباطه بمشروع آخر' ليس خاطئًا تمامًا، لكنه لا يحل المشكلة مباشرةً.\n- 'فرض العقوبات' غير فعال كخطوة أولى وقد يزيد التوتر.\n- 'الطلب من المدير الوظيفي التدخل' قد يكون لاحقًا إذا لم تحل المشكلة، لكن الحوار المباشر أولًا هو الأنسب.",
      "choices": [
        {
          "text": "التحقق مما إذا كان العضو مشاركًا في مشروع آخر في نفس الوقت.",
          "correct": false
        },
        {
          "text": "فرض عقوبة عن كل يوم يتأخر فيه عن تحقيق الأهداف.",
          "correct": false
        },
        {
          "text": "طلب من المدير الوظيفي للعضو معالجة المسألة.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة مع العضو وعرض تقديم المساعدة إذا لزم الأمر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتشف مدير مشروع يعمل على مشروع بنهج أجايل أن الميزانية والموارد المخصصة غير كافية لتغطية التكلفة الكلية المقدّرة. أوصى مكتب إدارة المشاريع (PMO) بوضع نموذج لتحديد أولوية المتطلبات. ما الذي يجب أن يأخذه مدير المشروع بعين الاعتبار في هذا النموذج؟",
      "explanation": "الإجابة الصحيحة هي: 'التكلفة والمخاطر المرتبطة'. في بيئة أجايل، حين تكون الموارد محدودة، من المهم ترتيب الأولويات بناءً على القيمة مقابل التكلفة، مع الأخذ في الاعتبار المخاطر.\n\n- 'التكلفة، والمخاطر المرتبطة، وثقافة الشركة' غير صحيحة لأن ثقافة الشركة لا تُعد عاملاً مباشرًا في تحديد الأولويات.\n- 'المخاطر المرتبطة وثقافة الشركة' تتجاهل التكلفة، وهي عنصر محوري في اتخاذ القرار.\n- 'معوقات التكلفة المرتبطة' ليست مصطلحًا دقيقًا أو معتمدًا لتحديد الأولوية.",
      "choices": [
        {
          "text": "التكلفة، والمخاطر المرتبطة، وثقافة الشركة.",
          "correct": false
        },
        {
          "text": "المخاطر المرتبطة وثقافة الشركة.",
          "correct": false
        },
        {
          "text": "التكلفة والمخاطر المرتبطة.",
          "correct": true
        },
        {
          "text": "معوقات التكلفة المرتبطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع هجين. أداء الفريق متدهور وقد أشار العديد من أعضاء الفريق إلى أن أحد أصحاب المصلحة يمثل عائقًا دائمًا. حيث يطلب باستمرار تحديثات من الفريق ويحاول إدخال تغييرات على المشروع مباشرةً من خلالهم. كيف يمكن لمدير المشروع تحسين أداء المشروع؟",
      "explanation": "الإجابة الصحيحة هي: 'الاجتماع مع راعي المشروع لمعالجة وإزالة المعوقات والعوائق أمام الفريق'. راعي المشروع لديه السلطة اللازمة للتعامل مع أصحاب المصلحة المتدخلين وضمان تركيز الفريق.\n\n- 'تحديد صاحب المصلحة كمصدر مخاطرة' لا يعالج المشكلة جذريًا بل يوثقها فقط.\n- 'مطالبة الفريق بتوجيه الطلبات إلى مدير المشروع' حل سطحي، وقد يزيد الضغط على الفريق.\n- 'العمل مع PMO لإزالة صاحب المصلحة' غير عملي لأن صاحب المصلحة جزء من المشروع ولا يمكن استبعاده بهذه الطريقة.",
      "choices": [
        {
          "text": "تحديد صاحب المصلحة كمصدر مخاطرة في سجل المخاطر والعمل مع الفريق على استراتيجية تخفيف.",
          "correct": false
        },
        {
          "text": "مطالبة الفريق بتوجيه جميع الطلبات من صاحب المصلحة إلى مدير المشروع.",
          "correct": false
        },
        {
          "text": "العمل مع مكتب إدارة المشاريع (PMO) لإزالة صاحب المصلحة من المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمعالجة وإزالة المعوقات والعوائق أمام الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق على مشروع باستخدام نهج هجين، ويواجه العديد من العوائق والعقبات من بعض أصحاب المصلحة. ما الذي يجب أن يفعله مدير المشروع لتحسين أداء المشروع؟",
      "explanation": "الإجابة الصحيحة هي: 'معالجة وإزالة العوائق والعقبات التي تواجه الفريق'. في المشاريع الهجينة، من مسؤوليات مدير المشروع إزالة العوائق التي تؤثر على الأداء وتعيق التقدم.\n\n- 'إضافة العوائق إلى سجل القضايا وخطة إدارة المخاطر' لا يحل المشكلة بل يوثقها فقط.\n- 'مطالبة أصحاب المصلحة بالتواصل مع مدير المشروع فقط' قد يحد من التعاون دون معالجة جوهر المشكلة.\n- 'تمكين أعضاء الفريق من إزالة العقبات بأنفسهم' غير مناسب دائمًا، خاصة إن كانت العقبات تتعلق بأصحاب مصلحة ذوي سلطة.",
      "choices": [
        {
          "text": "إضافة العوائق إلى سجل القضايا وخطة إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "مطالبة أصحاب المصلحة بالتواصل مع مدير المشروع فقط وعدم التواصل المباشر مع الفريق.",
          "correct": false
        },
        {
          "text": "تمكين أعضاء الفريق من إزالة العقبات بأنفسهم.",
          "correct": false
        },
        {
          "text": "معالجة وإزالة العوائق والعقبات التي تواجه الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لفريق عالمي، ويجب على الفريق خلال الأيام القادمة إعداد هيكل تقسيم الموارد (RBS) للمشروع. ومع ذلك، تنص خطة إدارة الموارد على أن RBS يجب أن يتم إنشاؤه ومراجعته فقط في بداية المشروع. ما الخطوة الأولى التي يجب على مدير المشروع اتخاذها؟",
      "explanation": "الإجابة الصحيحة هي: 'تحديث خطة إدارة الموارد'. بما أن الوثيقة الحالية لا تسمح بإنشاء أو تعديل RBS في هذه المرحلة، يجب تعديل الخطة لتتماشى مع واقع المشروع الحالي.\n\n- 'تحديث خطة إدارة المشروع' ليست الخطوة المناسبة لأن المشكلة تتعلق مباشرة بخطة الموارد.\n- 'تحديث هيكل تقسيم الموارد' غير ممكن إلا بعد تعديل الخطة التي تحكمه.\n- 'تحديث هيكل تقسيم العمل (WBS)' لا علاقة له بالمشكلة لأنه يخص نطاق العمل وليس الموارد.",
      "choices": [
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "تحديث خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تحديث هيكل تقسيم الموارد.",
          "correct": false
        },
        {
          "text": "تحديث هيكل تقسيم العمل (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقوم فريق المشروع بتحديد الشهادات والكفاءات التقنية والناعمة للأشخاص والآلات وبرمجيات التصور المتقدمة ومحطات العمل للأطباء وغيرها من الإمدادات لمشروع معقد يجب تنفيذه خلال 5 أشهر. إذا استخدم الفريق هيكل تقسيم الموارد (RBS)، كيف سيساعد ذلك في تنظيم وتصور الموارد؟ (اختر ثلاثة)",
      "explanation": "الإجابات الصحيحة هي: 'حسب التسلسل الهرمي'، 'حسب المصدر'، و'حسب الفئة'.\n\n- الهيكل الهرمي يساعد على تنظيم الموارد بشكل منطقي من الأعلى إلى الأدنى.\n- التصنيف حسب المصدر يفصل الموارد بحسب أصلها، مثل الموارد البشرية أو المعدات.\n- التصنيف حسب الفئة يربط الموارد بفئات متشابهة مما يسهل إدارتها.\n\n- 'حسب النوع' غير دقيق كتصنيف مستقل في RBS، لأنه قد يتداخل مع الفئة أو المصدر.\n- 'حسب الاسم الأخير' غير منطقي في تنظيم الموارد لأنه لا يعكس خصائص أو تصنيفات ذات صلة.",
      "choices": [
        {
          "text": "حسب التسلسل الهرمي.",
          "correct": true
        },
        {
          "text": "حسب المصدر.",
          "correct": true
        },
        {
          "text": "حسب الفئة.",
          "correct": true
        },
        {
          "text": "حسب النوع.",
          "correct": false
        },
        {
          "text": "حسب الاسم الأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تأخر مشروع بسبب توفر الموارد، مما يعرض ميزانيته للخطر. ما الوثيقة التي يجب على مدير المشروع استخدامها لمراجعة وتحديث الموارد؟",
      "explanation": "الوثيقة الصحيحة هي هيكل تقسيم الموارد (RBS) لأنها تساعد في تنظيم الموارد بشكل هيكلي وتسمح لمدير المشروع بمراجعة وتحديث الموارد المطلوبة للمشروع.\n\n- مصفوفة تتبع المتطلبات تتعلق بتتبع المتطلبات، وليست خاصة بالموارد.\n- هيكل تقسيم العمل (WBS) ينظم نطاق العمل وليس الموارد.\n- مصفوفة تعيين المسؤوليات تحدد المسؤوليات وليس مراجعة الموارد.",
      "choices": [
        {
          "text": "مصفوفة تتبع المتطلبات.",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "هيكل تقسيم الموارد (RBS).",
          "correct": true
        },
        {
          "text": "مصفوفة تعيين المسؤوليات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع وجود تعارضات بين أعضاء الفريق المحليين والافتراضيين في فهمهم للمخرجات. كيف يمكن لمدير المشروع حل هذه التعارضات؟",
      "explanation": "التعاون مع أعضاء الفريق لمعالجة التعارضات هو الخيار الصحيح لأنه يشجع الحوار المفتوح، تبادل وجهات النظر، والوصول إلى توافق جماعي.\n\n- مطالبة راعي المشروع بالاجتماع مع الفريق قد لا تحل المشكلة بشكل فعال لأنها لا تركز على الحوار بين الأعضاء.\n- استضافة جلسة وساطة قد تكون مفيدة لكنها ليست الخطوة الأولى.\n- التركيز على نقاط الاتفاق فقط يتجاهل الخلافات التي يجب حلها.",
      "choices": [
        {
          "text": "مطالبة راعي المشروع بالاجتماع مع الفريق.",
          "correct": false
        },
        {
          "text": "التعاون مع أعضاء الفريق لمعالجة هذه التعارضات.",
          "correct": true
        },
        {
          "text": "استضافة جلسة وساطة تحقق قدرًا من الرضا لجميع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "التركيز على نقاط الاتفاق بدلاً من نقاط الخلاف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع متقدم قليلًا عن الجدول الزمني. ومع ذلك، تم إبلاغ مدير المشروع بأن مخرجًا حرجًا لن يكون متاحًا في الوقت المحدد. إذا تمكن مدير المشروع من تسريع العمل المتأخر، فما التأثير المتوقع؟",
      "explanation": "الإجابة الصحيحة هي سترتفع التكاليف والمخاطر.\n\n- لماذا الخيار صحيح؟\nتسريع العمل عادةً يتطلب موارد إضافية مثل العمل الإضافي أو معدات إضافية، مما يؤدي إلى زيادة التكاليف. كما أن الضغط الزمني قد يؤدي إلى أخطاء أو مشاكل أخرى، مما يزيد من المخاطر المرتبطة بالمشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ستنجم مشكلات تتعلق بضمان المشروع قد تحدث، لكنها ليست التأثير المباشر المتوقع من التسريع.\n- ستنخفض التكاليف والمخاطر عكس الواقع لأن التسريع يزيد عادة من التكلفة والمخاطر.\n- سيتم تنفيذ أعمال إعادة ليست بالضرورة نتيجة مباشرة لتسريع العمل، وقد تحدث لأسباب أخرى.",
      "choices": [
        {
          "text": "ستنجم مشكلات تتعلق بضمان المشروع.",
          "correct": false
        },
        {
          "text": "ستنخفض التكاليف والمخاطر.",
          "correct": false
        },
        {
          "text": "سترتفع التكاليف والمخاطر.",
          "correct": true
        },
        {
          "text": "سيتم تنفيذ أعمال إعادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لدى مشروع جدول زمني أساسي معتمد مدته 180 يومًا وميزانية أساسية قدرها 250,000 دولار أمريكي. بعد 21 يومًا، تم إنفاق 60,000 دولار وتم تحقيق قيمة مكتسبة قدرها 75,000 دولار. ما هو مؤشر الأداء التكلفي (CPI) لهذا المشروع؟",
      "explanation": "الإجابة الصحيحة هي 1.25.\n\n- لماذا الخيار صحيح؟\nمؤشر الأداء التكلفي (CPI) يُحسب بقسمة القيمة المكتسبة (EV) على التكلفة الفعلية (AC). هنا: CPI = 75,000 ÷ 60,000 = 1.25، مما يشير إلى أن المشروع يحقق قيمة أعلى من التكلفة المدفوعة، وهذا دليل على كفاءة التكلفة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 0.8 و 0.75 أقل من 1، مما يعني أداء أقل من المتوقع وهذا غير صحيح حسب المعطيات.\n- 1.02 غير مطابق للحساب الصحيح بناءً على الأرقام المعطاة.",
      "choices": [
        {
          "text": "0.8",
          "correct": false
        },
        {
          "text": "0.75",
          "correct": false
        },
        {
          "text": "1.25",
          "correct": true
        },
        {
          "text": "1.02",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن مديرًا وظيفيًا قام بتكليف عضو من الفريق بمهمة لمدة أسبوعين في مشروع آخر، مما قد يعرض الجدول الزمني للمشروع للخطر. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة هي مراجعة خطة إدارة الموارد لتحديد كيفية التفاوض مع المدير الوظيفي.\n\n- لماذا هذا صحيح؟\nلأن خطة إدارة الموارد توضح كيفية تخصيص الموارد وكيفية التعامل مع تضارب الجدول الزمني والمهام، وبالتالي يمكن استخدامها كأساس للتفاوض مع المدير الوظيفي لحل المشكلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب تغيير إلى لجنة التحكم بالتغيير غير مناسب لأنه لم يتم طلب تغيير رسمي بعد.\n- الاجتماع مع راعي المشروع قد يكون لاحقًا لكنه ليس الخطوة الأولى.\n- تعيين عضو آخر من الفريق بدون تقييم الموارد والتأثير قد يسبب مشاكل أخرى.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الموارد لتحديد كيفية التفاوض مع المدير الوظيفي.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB) للحصول على مورد بديل.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة أولويات المشروعين.",
          "correct": false
        },
        {
          "text": "تعيين عضو آخر من الفريق للقيام بعمل العضو الغائب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الوثيقة التي يجب على مدير المشروع الرجوع إليها لتخصيص الموارد لمشروع؟",
      "explanation": "الإجابة الصحيحة هي خطة إدارة الموارد.\n\n- لماذا هذا صحيح؟\nخطة إدارة الموارد توضح كيفية تخصيص الموارد وإدارتها طوال دورة حياة المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الحكم الخبير هو أسلوب وليس وثيقة.\n- مصفوفة RACI توضح المسؤوليات لكن لا تخص تخصيص الموارد بشكل مباشر.\n- متطلبات الموارد توضح ما هو مطلوب فقط لكنها ليست وثيقة تخصيص الموارد.",
      "choices": [
        {
          "text": "الحكم الخبير.",
          "correct": false
        },
        {
          "text": "مصفوفة RACI.",
          "correct": false
        },
        {
          "text": "خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "متطلبات الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع عملية تحول في شركة تواجه تحديات مالية كبيرة نتيجة تراجع حصتها السوقية. يبدي أصحاب المصلحة شكوكًا حيال الحاجة للتغيير ويترددون في الاستثمار بالمشروع. ما الذي يجب على مدير المشروع فعله لإظهار أهمية وفوائد التغيير؟",
      "explanation": "الإجابة الصحيحة هي تطوير دراسة جدوى تكمية فوائد المشروع وربطها بأهداف الشركة لأن هذه الدراسة توفر تحليلاً معمقًا وواضحًا للمنفعة المالية وغير المالية للمشروع. \n\n- من خلال هذه الدراسة، يتم تقديم بيانات وأرقام ملموسة تبين كيف سيساهم المشروع في تحسين الوضع المالي للشركة وزيادة حصتها السوقية، مما يساعد أصحاب المصلحة على تخطي الشكوك والقلق.\n- دراسة الجدوى تعزز الثقة في المشروع وتوضح العائد المتوقع، مما يسهل اتخاذ قرار الاستثمار.\n\nلماذا الخيارات الأخرى أقل مناسبة؟\n- إنشاء خطة اتصال مفصلة هو جزء مهم من التواصل لكنه لا يقدم إثباتًا موضوعيًا للفوائد.\n- تفويض المهام وتوفير الموارد يتعامل مع التنفيذ وليس مع إقناع أصحاب المصلحة.\n- عقد اجتماعات منتظمة مع أصحاب المصلحة يحسن الحوار لكنه قد لا يكون كافيًا إذا لم يكن مدعومًا بأدلة قوية على جدوى المشروع.",
      "choices": [
        {
          "text": "إنشاء خطة اتصال مفصلة تتضمن الأهداف والمعالم والفوائد.",
          "correct": false
        },
        {
          "text": "تفويض المهام وتوفير الموارد الضرورية لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات منتظمة مع أصحاب المصلحة لإطلاعهم ومعالجة تساؤلاتهم.",
          "correct": false
        },
        {
          "text": "تطوير دراسة جدوى تكمية فوائد المشروع وربطها بأهداف الشركة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بتطوير منتج ثوري في سوق تنافسية وسريعة التطور. يدرك مدير المشروع أنه بسبب البيئة التنافسية، من المرجح أن تتغير 'تعريف الانتهاء' (DoD). ما الذي يجب أن يفعله مدير المشروع لضمان تقديم قيمة ناجحة؟",
      "explanation": "الإجابة الصحيحة هي تنفيذ إجراءات قوية لتتبع وتقرير تقدم المشروع.\n\n- السبب: في بيئة تنافسية وسريعة التغير، من الضروري وجود آليات مراقبة وتقييم مستمرة لضمان أن المنتج يتماشى مع متطلبات السوق المتغيرة والتوقعات المتجددة من أصحاب المصلحة.\n- إجراءات التتبع والتقرير تسمح باكتشاف الانحرافات أو التغيرات مبكرًا، مما يمكن الفريق من التكيف بسرعة مع المتطلبات الجديدة أو تعديل تعريف الانتهاء بما يتوافق مع أولويات السوق.\n\nلماذا الخيارات الأخرى غير مناسبة؟\n- توسيع الجدول الزمني والميزانية قد يؤخر التسليم ويكلف المشروع موارد إضافية غير مضمونة.\n- تخصيص موارد إضافية بدون خطة واضحة قد يؤدي إلى عدم كفاءة وارتفاع التكاليف دون ضمان جودة المنتج.\n- تقييد نطاق المشروع يمكن أن يقلل من قيمة المنتج ويجعله غير ملائم للسوق المتغير، مما يؤثر سلبًا على النجاح التجاري.",
      "choices": [
        {
          "text": "تنفيذ إجراءات قوية لتتبع وتقرير تقدم المشروع.",
          "correct": true
        },
        {
          "text": "توسيع الجدول الزمني والميزانية لمواجهة المخاطر المحتملة.",
          "correct": false
        },
        {
          "text": "تخصيص موارد إضافية لتسريع تطوير المنتج.",
          "correct": false
        },
        {
          "text": "تقييد نطاق المشروع والتركيز على الالتزام بالمواعيد النهائية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب أحد أصحاب المصلحة الرئيسيين إضافة ميزات جديدة إلى المنتج أثناء تنفيذ المشروع، وأصر على أن هذه الميزات ستضيف قيمة. ما الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "الإجابة الصحيحة هي تقييم ومراجعة تأثير التغييرات على ميزانية المشروع وجدوله لأن أي إضافة جديدة يمكن أن تؤثر على نطاق المشروع والموارد والجدول الزمني والميزانية.\n\n- تقييم التأثير يساعد مدير المشروع في فهم مدى جدوى التغيير، والتأكد من أن التغيير لا يهدد نجاح المشروع.\n- هذا الإجراء يسمح باتخاذ قرار مدروس قبل تنفيذ أي تغيير.\n\nأما الخيارات الأخرى فهي أقل مناسبة لأن:\n- الاجتماع مع راعي المشروع قد يكون خطوة لاحقة بعد التقييم.\n- مراجعة خطة إشراك أصحاب المصلحة لا تحل المشكلة المباشرة لتقييم التغيير.\n- تنفيذ التغيير مباشرة دون تقييم قد يؤدي إلى مخاطر وتأثير سلبي على المشروع.",
      "choices": [
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة فوائد الميزات الجديدة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إشراك أصحاب المصلحة لتحديد مستوى مشاركة صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "تقييم ومراجعة تأثير التغييرات على ميزانية المشروع وجدوله.",
          "correct": true
        },
        {
          "text": "تنفيذ التغيير وتوثيقه في سجل الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "مدير مشروع جزء من مشروع كبير لتحول الأعمال. الهدف الرئيسي من المشروع هو زيادة الإنتاج وإنشاء قدرة لإطلاق منتجات جديدة في السوق. لاحظ مدير المشروع أثناء استراحة الغداء أن الموظفين يتحدثون عن التغييرات ويشعرون بالخوف من أن تؤدي إلى تسريحهم، رغم أن ذلك غير صحيح. ما هي الجهات التي يجب على مدير المشروع التواصل معها لمعالجة هذه المخاوف وضمان تحقيق أهداف المشروع؟ (اختر 3)",
      "explanation": "الإجابات الصحيحة هي:\n\n- قسم الموارد البشرية (HR) لطلب الدعم في معالجة المشكلة: لأن الموارد البشرية مختصة بإدارة مخاوف الموظفين والتواصل حول التغييرات التي تؤثر عليهم.\n- مدير التغيير لتعديل خطة إدارة الاتصال: لأنه المسؤول عن توجيه خطة الاتصالات والتأكد من أن الرسائل تناسب الموقف وتزيل المخاوف.\n- المديرون الوظيفيون للموظفين لطلب الدعم في شرح التغيير: لأنهم يتواصلون مباشرة مع الموظفين ويمكنهم توضيح التغييرات وتقديم الدعم.\n\nلماذا خيار المديرون الوظيفيون للموظفين لتضمين المشكلة في تقييم الأداء غير صحيح؟\n- لأن تضمين المخاوف في تقييم الأداء قد يزيد من التوتر والخوف لدى الموظفين، ولا يعالج السبب الحقيقي للمخاوف.\n\nخيار الراعي لطلب دعم تنفيذي وتعزيز التوضيح قد يكون مفيداً لكنه ليس من أولويات التعامل المباشر مع مخاوف الموظفين في هذه الحالة.",
      "choices": [
        {
          "text": "قسم الموارد البشرية (HR) لطلب الدعم في معالجة المشكلة",
          "correct": true
        },
        {
          "text": "مدير التغيير لتعديل خطة إدارة الاتصال",
          "correct": true
        },
        {
          "text": "المديرون الوظيفيون للموظفين لتضمين المشكلة في تقييم الأداء",
          "correct": false
        },
        {
          "text": "المديرون الوظيفيون للموظفين لطلب الدعم في شرح التغيير",
          "correct": true
        },
        {
          "text": "الراعي لطلب دعم تنفيذي وتعزيز التوضيح",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مرحلة تنفيذ المشروع، تلقى مدير المشروع خبرًا بأن قائد فريق سيغادر المنظمة. تم إعلام راعي المشروع بذلك واقترح بديلاً. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
      "explanation": "الإجابة الصحيحة هي مراجعة الخطط الأساسية للمشروع لتقييم تأثير التغيير.\n\n- السبب: يجب على مدير المشروع أولاً فهم تأثير مغادرة قائد الفريق على الجدول الزمني، الموارد، ونطاق العمل، وذلك من خلال مراجعة الخطط الأساسية مثل خطة الموارد وخطة إدارة المشروع.\n- هذا التقييم يساعد في تحديد ما إذا كانت هناك حاجة لتعديلات أو إجراءات إضافية.\n\nلماذا الخيارات الأخرى غير مناسبة؟\n- تحديد مستوى كفاءة المورد المقترح هو خطوة مهمة لكن تأتي بعد فهم تأثير التغيير.\n- توثيق التغيير وفقًا لخطة إدارة التغيير يجب أن يتم بعد تقييم التأثير والموافقة على التغيير.\n- تعديل خطة إدارة الاتصالات إجراء لاحق يعكس التغييرات بعد اتخاذ القرار المناسب.",
      "choices": [
        {
          "text": "تحديد مستوى كفاءة المورد المقترح.",
          "correct": false
        },
        {
          "text": "مراجعة الخطط الأساسية للمشروع لتقييم تأثير التغيير.",
          "correct": true
        },
        {
          "text": "توثيق التغيير وفقًا لخطة إدارة التغيير.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة الاتصالات لتعكس التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تطوير خطة إدارة المشروع، أغفلت الفريق مكونًا أساسيًا مطلوبًا للمنتج. قام الفريق بوضع حل بديل بسرعة، ولكن خلال مراجعة التوافق مع الجودة، قرر مكتب إدارة المشاريع (PMO) أن الحل البديل غير فعال. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة هي اتباع عملية التحكم المتكاملة بالتغيير الرسمية وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).\n\n- السبب: الحل البديل غير فعال، لذا يجب العودة إلى عملية التحكم بالتغيير الرسمية لضمان أن أي تعديل يتم دراسته، تقييمه، والموافقة عليه بشكل منهجي من قبل لجنة التحكم بالتغيير.\n- هذا الإجراء يحافظ على نزاهة المشروع ويضمن توثيق التغييرات بشكل صحيح.\n\nلماذا الخيارات الأخرى غير مناسبة؟\n- تصميم نموذج معدل للحل البديل قد يكون مفيدًا لاحقًا لكن يجب أن يتم بعد الموافقة الرسمية على التغيير.\n- مراجعة مصفوفة تتبع المتطلبات خطوة مهمة لكن ليست الحل الأول عندما يكون هناك مشكلة في الحل المقترح.\n- إجراء تحليل نوعي للمخاطر مهم لكن يجب أن يكون جزءًا من عملية التحكم بالتغيير وليس بديلاً عنها.",
      "choices": [
        {
          "text": "تصميم نموذج معدل للحل البديل يتضمن تعديلًا جديدًا.",
          "correct": false
        },
        {
          "text": "مراجعة مصفوفة تتبع المتطلبات لتحديد القيمة التجارية للمكون المفقود.",
          "correct": false
        },
        {
          "text": "اتباع عملية التحكم المتكاملة بالتغيير الرسمية وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": true
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر لتقييم تأثير تصميم بديل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تطوير برمجيات في مرحلة الاختبار. فرض تنظيم حكومي جديد تقديم وثائق إضافية ضمن العقد. ما الإجراء الأول الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "الإجابة الصحيحة هي: تقديم طلب تغيير.\n\n- السبب: التنظيم الحكومي الجديد يمثل تغييرًا خارجيًا يؤثر على نطاق المشروع. وفقًا لإدارة التغيير المتكاملة، يجب تقديم **طلب تغيير رسمي** إلى لجنة التحكم بالتغيير (CCB) ليتم تقييم تأثير التغيير على النطاق، والجدول الزمني، والتكلفة، والجودة.\n- لا يمكن تعديل العقد أو المتطلبات دون المرور بالإجراءات الرسمية للتغيير لضمان الامتثال والتوثيق.\n\nلماذا الخيارات الأخرى غير مناسبة؟\n- إنهاء المشروع قرار جذري وغير مبرر في هذه المرحلة؛ التغيير التنظيمي لا يستدعي الإيقاف بل التكيف.\n- تحديث التوقعات الزمنية للجدول الزمني قد يكون مطلوبًا لاحقًا، لكن يجب أن يحدث فقط بعد تقييم وقبول طلب التغيير.\n- مراجعة ميزانية المشروع خطوة تالية بعد تقييم الأثر المالي للتغيير، لكنها ليست الخطوة الأولى.",
      "choices": [
        {
          "text": "إنهاء المشروع.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير.",
          "correct": true
        },
        {
          "text": "تحديث التوقعات الزمنية للجدول الزمني.",
          "correct": false
        },
        {
          "text": "مراجعة ميزانية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب ممثل العميل من مدير المشروع ميزة جديدة في المنتج. ما الوثيقة التي يجب أن يرجع إليها مدير المشروع؟",
      "explanation": "الإجابة الصحيحة هي: خطة إدارة التغيير.\n\n- السبب: طلب ميزة جديدة من العميل يُعد تغييرًا في نطاق المشروع، ويجب التعامل معه من خلال الإجراءات الرسمية لإدارة التغيير حسب دليل PMBOK.\n- خطة إدارة التغيير توضح الخطوات اللازمة لتقديم التغييرات، الجهات المسؤولة (مثل CCB)، وكيفية تقييم أثر التغيير على النطاق والوقت والتكلفة.\n\nلماذا الخيارات الأخرى غير صحيحة؟\n- خطة إدارة النطاق: توضح كيفية تعريف وتوثيق النطاق، لكنها لا توضح كيفية التعامل مع التغييرات بعد اعتماده.\n- مصفوفة RACI: تُستخدم لتحديد المسؤوليات، وليس لإدارة التغييرات.\n- مصفوفة تتبع المتطلبات: تساعد في تتبع المتطلبات المعتمدة، لكنها لا تقدم آلية لقبول أو رفض تغييرات جديدة.",
      "choices": [
        {
          "text": "خطة إدارة النطاق.",
          "correct": false
        },
        {
          "text": "خطة إدارة التغيير.",
          "correct": true
        },
        {
          "text": "مصفوفة RACI.",
          "correct": false
        },
        {
          "text": "مصفوفة تتبع المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقود مدير مشروع مشروعًا كبيرًا لتحول الأعمال يشمل المنظمة بالكامل. يعمل على إعداد خطة إدارة الاتصالات. ما العنصران اللذان يجب مراعاتهما عند التخطيط للاتصالات؟ (اختر 2)",
      "explanation": "الإجابات الصحيحة هي: جمع التغذية الراجعة وقنوات اتصال متعددة.\n\n- عند التخطيط للاتصالات، يجب على مدير المشروع التفكير في كيفية ضمان إيصال الرسائل بفعالية لجميع الأطراف المعنية، وهو ما يتطلب استخدام قنوات متنوعة تتناسب مع تفضيلات كل طرف.\n- كما أن جمع التغذية الراجعة يساعد على تقييم فعالية الاتصال وتعديل أساليبه لضمان وضوح الرسائل واستيعابها.\n\nالخيارات الأخرى مثل الرسائل الأساسية والأهداف والقيم تُعد عناصر مهمة لكنها تُحدد لاحقًا، وليست من أولويات التخطيط المباشر.\nأما أفضل قناة اتصال فهي مضللة، لأن أفضل الممارسات تقتضي استخدام قنوات متعددة، وليس الاكتفاء بواحدة.",
      "choices": [
        {
          "text": "الرسائل الأساسية",
          "correct": false
        },
        {
          "text": "الأهداف والقيم",
          "correct": false
        },
        {
          "text": "جمع التغذية الراجعة",
          "correct": true
        },
        {
          "text": "قنوات اتصال متعددة",
          "correct": true
        },
        {
          "text": "أفضل قناة اتصال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة تخطيط المشروع، أهمل أصحاب المصلحة توثيق ميزة أساسية في النظام. لاحظ العميل هذا الإغفال خلال المراجعة الأولية للمخرجات. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة هي: تحديد تأثير الإغفال وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).\n\n- هذا الإغفال يُعد تغييرًا في النطاق بعد بدء التنفيذ، لذلك يجب اتباع عملية إدارة التغيير الرسمية.\n- لا يجوز إدخال التغيير مباشرة أو التفاوض على السعر دون المرور بالإجراءات المعتمدة لتقييم الأثر على النطاق والوقت والتكلفة.\n\nالخيار المتعلق بمراجعة خطة إدارة المشتريات غير ذي صلة، حيث أن الميزة ليست جزءًا من التعاقدات.\nأما التفاوض على تخفيض السعر أو تعديل السعر بدون تقييم رسمي فهو يخالف ممارسات إدارة التغيير.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المشتريات لتحديد ما إذا كان يمكن إضافة الميزة إلى المخرجات النهائية.",
          "correct": false
        },
        {
          "text": "تحديد تأثير الإغفال وتقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع الموافقة على خصم سعر للعميل.",
          "correct": false
        },
        {
          "text": "العمل مع العميل للاتفاق على سعر جديد يعوض عن الإغفال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد مراجعة خطة إدارة المشروع مع أصحاب المصلحة الرئيسيين، أُبلغ مدير المشروع أن خطة الإصدار لمدة 18 شهرًا غير مقبولة ويجب إطلاق المنتج خلال ستة أشهر. ما هو أول إجراء يجب على مدير المشروع اتخاذه؟",
      "explanation": "الإجابة الصحيحة هي: تحليل تأثير تقليص الجدول الزمني على نطاق المشروع والميزانية والموارد.\n\n- عند مواجهة تغيير جذري في الجدول الزمني مثل هذا، فإن أول خطوة يجب أن يقوم بها مدير المشروع هي إجراء تحليل للأثر (impact analysis) لتحديد مدى تأثر نطاق العمل، الكلفة، الموارد، وجودة النتائج.\n- بناءً على التحليل، يمكن مناقشة البدائل مثل تقليل النطاق أو زيادة الموارد.\n\nالخيارات الأخرى مثل توظيف موارد إضافية أو التفاوض مباشرة ليست قرارات مناسبة دون فهم كامل لتأثير التغيير.",
      "choices": [
        {
          "text": "تحليل تأثير تقليص الجدول الزمني على نطاق المشروع والميزانية والموارد.",
          "correct": true
        },
        {
          "text": "إعادة التفاوض على نطاق المشروع لتقليل العمل المطلوب.",
          "correct": false
        },
        {
          "text": "توظيف موارد إضافية للمساعدة في إنجاز المشروع في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "العمل مع أصحاب المصلحة للاتفاق على تاريخ إصدار جديد أكثر واقعية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع يضم سبعة شركاء بدأ يتأخر عن الجدول الزمني. قررت اللجنة التوجيهية تسريع جهود حل النزاعات وطلبت من مدير المشروع إزالة شرط التنازلات من جميع الأطراف. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة هي: إلغاء تقنية التوفيق/الحل الوسط.\n\nأسلوب التوفيق (الحل الوسط) يقوم على تقديم كل طرف تنازلات من أجل الوصول إلى اتفاق، ولكن بما أن اللجنة التوجيهية طلبت إزالة التنازلات، فهذا يعني أن هذا الأسلوب لم يعد مقبولًا. لذلك يجب على مدير المشروع التوقف عن استخدام هذا الأسلوب والتركيز على أساليب أخرى أكثر فاعلية مثل التعاون أو الفرض.\n\nالخيار الانسحاب/التجنب لا يتطلب تنازلات بل يهدف إلى تأجيل النزاع. أما التهدئة/الاستيعاب فتعني أن طرفًا واحدًا يتنازل وليس كلا الطرفين. والفرض لا يعتمد على التنازلات بل على فرض حل من طرف واحد.",
      "choices": [
        {
          "text": "إلغاء تقنية الانسحاب/التجنب.",
          "correct": false
        },
        {
          "text": "إلغاء تقنية التهدئة/الاستيعاب.",
          "correct": false
        },
        {
          "text": "إلغاء تقنية الفرض/التوجيه.",
          "correct": false
        },
        {
          "text": "إلغاء تقنية التوفيق/الحل الوسط.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع برمجي معقد، ويجب على عضوين من الفريق التعاون على وحدة حرجة. سرعان ما بدأ العضوان في الجدال مما أثر على التقدم. كيف يجب على مدير المشروع معالجة هذا النزاع؟",
      "explanation": "الإجابة الصحيحة هي: جدولة اجتماع جماعي لمناقشة المشكلة علنًا والوصول إلى حل.\n\nأفضل ممارسة في إدارة النزاعات داخل الفريق هي التعامل معها مباشرة عبر التعاون. عقد اجتماع جماعي يساعد الفريق على فهم أسباب الخلاف ومعالجتها بطريقة تعاونية تعزز من أداء الفريق.\n\nأما تجاهل النزاع فقد يزيد من التوتر. فصل المهام لا يعالج السبب الجذري. نقل أحد الأعضاء هو إجراء مفرط لا يُوصى به إلا إذا استنفدت الحلول التعاونية.",
      "choices": [
        {
          "text": "تجاهل النزاع وأمل أن يتمكنا من حله بنفسيهما.",
          "correct": false
        },
        {
          "text": "تعيين كل عضو لمهام منفصلة لتجنب المزيد من النزاعات.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع جماعي لمناقشة المشكلة علنًا والوصول إلى حل.",
          "correct": true
        },
        {
          "text": "نقل أحد العضوين إلى مشروع آخر لإزالة النزاع تمامًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع مع أصحاب المصلحة، وقع خلاف بين اثنين منهم حول كيفية تطوير مكون برمجي، وارتفعت أصواتهم. ماذا يجب على مدير المشروع أن يفعل في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة هي: تحديد سبب الخلاف، محاولة تهدئة الموقف والتركيز على إيجاد حل مشترك.\n\nعندما ينشأ نزاع حاد بين أصحاب المصلحة أثناء الاجتماع، فإن دور مدير المشروع هو التهدئة المباشرة ثم محاولة فهم جذور الخلاف والعمل على حل يُرضي الطرفين دون تصعيد.\n\nإنهاء الاجتماع بدون حل يترك النزاع قائمًا. التصويت ليس مناسبًا للنزاعات العاطفية. تصعيد المشكلة للراعي في هذه المرحلة يعتبر تسرعًا وضعفًا في إدارة الخلافات.",
      "choices": [
        {
          "text": "إنهاء الاجتماع والاجتماع مع بقية أصحاب المصلحة لتحديد كيفية المتابعة.",
          "correct": false
        },
        {
          "text": "تحديد سبب الخلاف، محاولة تهدئة الموقف والتركيز على إيجاد حل مشترك.",
          "correct": true
        },
        {
          "text": "تدوين مواقف الطرفين بالتفصيل وطلب تصويت من بقية أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بالمشكلة وطلب إيجاد حل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يؤدي مدير المشروع دور scrum master في مشروع هجين ويواجه نزاعًا بين أعضاء الفريق. ما هي الاستراتيجية الأنسب لمعالجة النزاع؟",
      "explanation": "الإجابة الصحيحة هي: تنظيم النزاعات إلى فئتين: هيكلية وشخصية.\n\nScrum Master يحتاج إلى فهم طبيعة النزاع لتحديد الطريقة المناسبة للتعامل معه. النزاعات الهيكلية تتعلق بالأدوار أو العمليات، أما النزاعات الشخصية فترتبط بالعلاقات والتواصل.\n\nتصنيف النزاعات إلى إيجابية وسلبية غير فعال لأنه لا يقدم حلاً جذريًا. وضع النزاعات في قائمة مرئية قد يحرج الأفراد. مناقشتها في اجتماع الوقوف اليومي غير ملائم لطبيعة ذلك الاجتماع.",
      "choices": [
        {
          "text": "وضع النزاعات في قائمة مرئية مشتركة للفريق.",
          "correct": false
        },
        {
          "text": "تصنيف النزاعات إلى مجموعتين: إيجابية وسلبية.",
          "correct": false
        },
        {
          "text": "مراجعة النزاعات خلال اجتماع الوقوف اليومي.",
          "correct": false
        },
        {
          "text": "تنظيم النزاعات إلى فئتين: هيكلية وشخصية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن الفريق يواجه نزاعًا مستمرًا مع فريق المورد الخارجي، مما بدأ يؤثر على أداء الفريق. بعد مراجعة ميثاق الفريق، ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة هي: تنظيم اجتماع افتراضي مع فريق المورد لمعالجة النزاع وحله.\n\nبعد مراجعة ميثاق الفريق الذي يوضح القواعد السلوكية والتزامات التواصل، يجب اتخاذ إجراء مباشر لحل النزاع. تنظيم اجتماع افتراضي مع فريق المورد يسمح بالتواصل المفتوح، وتحديد نقاط الخلاف، والتوصل إلى حل متفق عليه يحسن من الأداء.\n\nالخيارات الأخرى مثل الاجتماع الشخصي أو إرسال البريد الإلكتروني لا توفر التفاعل الديناميكي المطلوب لحل النزاع بسرعة وكفاءة. إرسال اتفاقية الشراء لا يعالج الخلاف العملي أو الثقافي الذي يسبب النزاع.",
      "choices": [
        {
          "text": "الاجتماع مع مدير فريق المورد شخصيًا لإيجاد حل.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع افتراضي مع فريق المورد لمعالجة النزاع وحله.",
          "correct": true
        },
        {
          "text": "إرسال نسخة من اتفاقية الشراء إلى مدير فريق المورد.",
          "correct": false
        },
        {
          "text": "إرسال بريد إلكتروني يشرح المشكلة ويطلب ردًا من مدير فريق المورد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة التخطيط الأولية لمشروع تطوير معقد، حدد فريق المشروع العديد من أصحاب المصلحة، بما في ذلك راعي المشروع، والمستخدمين النهائيين، والجهات التنظيمية، وفريق التطوير. ماذا يجب أن يفعل مدير المشروع لضمان فهم شامل لمستوى تأثير هؤلاء أصحاب المصلحة على متطلبات المشروع؟",
      "explanation": "الإجابة الصحيحة هي: عقد ورشة عمل مع أصحاب المصلحة لمناقشة وتحديد أولويات متطلبات المشروع بشكل جماعي.\n\nعقد ورشة العمل يُعد من أدوات جمع المتطلبات التعاونية التي تسمح بجمع وجهات نظر متعددة، وتحديد التوقعات، وترتيب الأولويات، وبناء توافق جماعي. يُفضّل استخدام هذه الطريقة في المشاريع المعقدة التي تتطلب توافقات فنية وتنظيمية.\n\nإجراء مقابلات أو إرسال استبيانات قد يكون مناسبًا في بعض الحالات، لكنها لا تعكس التفاعلية المطلوبة في هذه المرحلة. مراجعة المشاريع السابقة مفيدة لكن لا تعطي فهماً حاليًا أو دقيقًا لتأثير كل صاحب مصلحة.",
      "choices": [
        {
          "text": "إجراء مقابلات فردية مع كل صاحب مصلحة لجمع مدخلاتهم وتفضيلاتهم.",
          "correct": false
        },
        {
          "text": "إرسال استبيان إلى أصحاب المصلحة لجمع ملاحظاتهم حول متطلبات المشروع.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل مع أصحاب المصلحة لمناقشة وتحديد أولويات متطلبات المشروع بشكل جماعي.",
          "correct": true
        },
        {
          "text": "مراجعة وثائق المشاريع السابقة لتحديد أنماط تأثير أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إلغاء مشروع التحول الرقمي السابق بسبب عدم توافق العمليات التجارية مع قسم المحاسبة. سيتم البدء بمشروع مماثل قريبًا، وسيتم التخطيط لنشاط مواءمة العمليات لتحديد تغييرات النطاق المحتملة. ماذا يجب أن يفعل مدير المشروع لضمان اتباع نهج تعاوني وتدريجي في أعمال المواءمة؟",
      "explanation": "الإجابة الصحيحة هي: تخطيط لتكرارات مبكرة في المشروع تسمح لأصحاب المصلحة المتعددين بالاتفاق على خطوات تعديل العمليات.\n\nعند تنفيذ مشاريع معقدة مثل التحول الرقمي، من المهم دمج أصحاب المصلحة من البداية في صياغة الحلول من خلال تكرارات أو دورات تطوير مبكرة. هذا يضمن توافق الحلول المقترحة مع احتياجات الأعمال، ويمنع إلغاء المشروع لاحقًا.\n\nتحديد خبراء خارجيين أو التخطيط لتكييف فوري أو متأخر لا يضمن مشاركة داخلية فعالة ولا يعكس طبيعة التطوير التكراري التدريجي الذي يدعو إليه Agile وPMI.",
      "choices": [
        {
          "text": "تحديد فريق خبراء خارجي للبحث وتطبيق أفضل الممارسات في التكيف مع التحول الرقمي.",
          "correct": false
        },
        {
          "text": "تخطيط نشاط مبكر لمدة أسبوعين تعمل خلاله الوحدات المتأثرة معًا لتكييف العمليات التجارية.",
          "correct": false
        },
        {
          "text": "تخطيط لتكرارات مبكرة في المشروع تسمح لأصحاب المصلحة المتعددين بالاتفاق على خطوات تعديل العمليات.",
          "correct": true
        },
        {
          "text": "تخطيط لتكرارات متأخرة في المشروع لتعديل العمليات بناءً على الأعمال المنجزة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند إتمام مدير المشروع لعملية تحديد أصحاب المصلحة، ما هو الناتج الرئيسي لهذه العملية؟",
      "explanation": "الإجابة الصحيحة هي: سجل يحتوي على الاسم، مجال الاهتمام، ومستوى التأثير الإيجابي أو السلبي لكل صاحب مصلحة.\n\nالناتج الرسمي لعملية تحديد أصحاب المصلحة هو سجل أصحاب المصلحة (Stakeholder Register)، والذي يتضمن معلومات أساسية مثل الاسم، الموقف، الاهتمامات، مستوى التأثير، والاستراتيجية المناسبة لإشراكهم. هذا السجل هو مدخل أساسي لعملية تخطيط إشراك أصحاب المصلحة.\n\nالخيار المتعلق بطلبات التغيير يخص عمليات أخرى مثل تنفيذ المشروع. خطة إشراك أصحاب المصلحة لا تُنتَج في هذه المرحلة بل في مرحلة لاحقة. التحديثات على مستندات المشروع تحدث بعد تحديد السجل وليس بدلاً عنه.",
      "choices": [
        {
          "text": "سجل يحتوي على الاسم، مجال الاهتمام، ومستوى التأثير الإيجابي أو السلبي لكل صاحب مصلحة.",
          "correct": true
        },
        {
          "text": "وثيقة تحتوي على طلبات تغيير للمنتج أو خطة إدارة المشروع أو مستندات المشروع.",
          "correct": false
        },
        {
          "text": "خطة إشراك أصحاب المصلحة تحدد الاستراتيجيات والإجراءات المطلوبة لتعزيز مشاركتهم.",
          "correct": false
        },
        {
          "text": "تحديثات على مستندات المشروع مثل سجل الافتراضات وسجل القضايا وسجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحضر مالك المنتج الاجتماعات اليومية، لكنه يركز فقط على الميزانية وتكاليف كل دورة. عند معالجة استفساراته، يشرح مدير المشروع مبررات الإنفاق وتأثيرها على تطوير المنتج، لكن المالك لا يهتم إلا بالمبلغ المصروف. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة هي: الاجتماع مع مالك المنتج لتوعيته بقيمة المشروع وليس فقط تكلفته.\n\nمن المهم أن يساعد مدير المشروع مالك المنتج على فهم كيف ترتبط التكاليف بالقيمة المتحققة، مثل التقدم في إنجاز الميزات أو تحقيق أهداف الأعمال. التركيز فقط على الأرقام دون النظر للقيمة المضافة قد يؤدي إلى قرارات غير متوازنة.\n\nأما تعديل الاجتماعات اليومية أو إرسال تقارير تفصيلية فقد يُرضي فضوله المالي مؤقتًا، لكنه لا يعالج الجذر الأساسي للمشكلة وهو ضعف الفهم الاستراتيجي لدى المالك. الاجتماعات اليومية ليست مخصصة لمراجعة الميزانية بالتفصيل.",
      "choices": [
        {
          "text": "تعديل الاجتماعات اليومية للبدء بمناقشة الميزانية ثم مناقشة حالة المشروع بعد مغادرة المالك.",
          "correct": false
        },
        {
          "text": "تعديل خطة إدارة الاتصالات لإرسال تحديثات يومية عن الميزانية إلى مالك المنتج.",
          "correct": false
        },
        {
          "text": "الاجتماع مع مالك المنتج لتوعيته بقيمة المشروع وليس فقط تكلفته.",
          "correct": true
        },
        {
          "text": "تفصيل الميزانية حسب الإنفاق اليومي وتقديمها لمالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد فريق التسويق الجمهور المستهدف لموقع الشركة الجديد. هذا الجمهور متنوع وموزع جغرافيًا، ويرغب الفريق بجمع تحليل إحصائي بسرعة. ما الأداة أو التقنية التي يجب على مدير المشروع استخدامها؟",
      "explanation": "الإجابة الصحيحة هي: استبيان.\n\nالاستبيانات تُعد من أفضل الأدوات لجمع معلومات كمية وإحصائية من جمهور واسع ومنتشر جغرافيًا في وقت قصير. يمكن تصميمها بأسئلة مغلقة تسهل التحليل باستخدام أدوات إحصائية.\n\nمجموعات التركيز والمقابلات أدوات نوعية وليست إحصائية، وتحتاج وقتًا أطول وتنظيمًا مباشرًا. التحليل المقارن (Benchmarking) لا يجمع بيانات من الجمهور، بل يستخدم بيانات خارجية لمقارنة الأداء أو الممارسات.",
      "choices": [
        {
          "text": "مجموعات التركيز.",
          "correct": false
        },
        {
          "text": "استبيان.",
          "correct": true
        },
        {
          "text": "مقابلة.",
          "correct": false
        },
        {
          "text": "تحليل المقارنة المرجعية (Benchmarking).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعاني أصحاب المصلحة في مشروع متعدد الجنسيات من سوء فهم ثقافي. أدى تفسير ثقافي خاطئ بسيط في مرحلة التخطيط إلى عدم الموافقة على خطة إدارة المشروع. ماذا كان يجب على مدير المشروع أن يفعل لتفادي هذا الموقف؟",
      "explanation": "الإجابة الصحيحة هي: عقد ورشة عمل مع أصحاب المصلحة قبل الاجتماع الأول لتطوير لغة تواصل مشتركة.\n\nفي المشاريع متعددة الثقافات، من المهم تأسيس لغة مفهومة ومقبولة للجميع، ليس فقط من ناحية اللغة المستخدمة، بل من حيث الأسلوب، الرموز، التوقعات، والسياق الثقافي. ورشة العمل تساعد على بناء الثقة وتقليل الفجوات التفسيرية مبكرًا.\n\nأما مراقبة التواصل أو مراجعة الأخطاء الثقافية، فهما ردود فعل لاحقة وليست إجراءات استباقية فعالة. تجنب سوء الفهم يجب أن يتم قبل حدوثه وليس بعده.",
      "choices": [
        {
          "text": "مراجعة سجل الدروس المستفادة لفهم الأخطاء الثقافية السابقة.",
          "correct": false
        },
        {
          "text": "البحث عن الأخطاء الثقافية الشائعة عند التعامل مع أصحاب المصلحة في تلك الدول.",
          "correct": false
        },
        {
          "text": "مراقبة التواصل المباشر وغير المباشر خلال اللقاءات الأولية لتقليل احتمال حدوث سوء الفهم.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل مع أصحاب المصلحة قبل الاجتماع الأول لتطوير لغة تواصل مشتركة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كيف يمكن لمدير المشروع زيادة احتمال نجاح المشروع؟",
      "explanation": "الإجابة الصحيحة هي: الحصول على دعم أصحاب المصلحة منذ البداية.\n\nالحصول على التزام ودعم أصحاب المصلحة الأساسيين يعزز التوافق حول الأهداف، ويسهّل إزالة العوائق، ويساعد في اتخاذ قرارات فعالة طوال دورة حياة المشروع. هذه من أهم عوامل النجاح حسب أبحاث PMI.\n\nالخيار المتعلق بإنشاء احتياطي كبير في الميزانية قد يُنظر له على أنه تضخيم غير مبرر. المبالغة في تقدير الكفاءة قد تخلق توقعات غير واقعية. تغيير لجنة الحوكمة بشكل مستمر يضر بالاستقرار والتوجيه الاستراتيجي.",
      "choices": [
        {
          "text": "المبالغة في تقدير كفاءة الموارد المطلوبة لتنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "الحصول على دعم أصحاب المصلحة منذ البداية.",
          "correct": true
        },
        {
          "text": "تغيير أعضاء لجنة الحوكمة بشكل مستمر.",
          "correct": false
        },
        {
          "text": "إنشاء احتياطي كبير في الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تتعاقد شركة مع مزود برمجيات لتنفيذ وتخصيص تطبيق برمجي جديد وتعيّن مدير مشروع لبدء وقيادة المشروع. أي من المدخلات التالية إلى ميثاق المشروع تصف النتائج الرئيسية المتوقعة؟",
      "explanation": "الإجابة الصحيحة: بيان نطاق المشروع لأنه يوضح بالتفصيل ما سيتم تسليمه من مخرجات نهائية وما هو خارج النطاق. هذا البيان يُعد مدخلًا رئيسيًا لميثاق المشروع لأنه يشرح النتائج الرئيسية المطلوبة. بينما دراسة الجدوى تقيم مدى جدوى تنفيذ المشروع من حيث القيمة أو العائد، لكنها لا تحتوي على وصف تفصيلي للمخرجات. الاتفاقيات تصف التزامات الأطراف لكنها ليست مصممة لشرح النتائج. أما جدول المشروع فيتم تطويره لاحقًا أثناء التخطيط وليس في ميثاق المشروع.",
      "choices": [
        {
          "text": "دراسة الجدوى",
          "correct": false
        },
        {
          "text": "الاتفاقيات",
          "correct": false
        },
        {
          "text": "بيان نطاق المشروع",
          "correct": true
        },
        {
          "text": "جدول المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتهاء من ميثاق المشروع، يرسله مدير المشروع إلى أصحاب المصلحة. ما الذي يجب على مدير المشروع فعله قبل بدء عملية تخطيط المشروع؟",
      "explanation": "الإجابة الصحيحة: الحصول على موافقة ميثاق المشروع، إذ لا يحق لمدير المشروع البدء بالتخطيط أو تخصيص الموارد أو دعوة الاجتماعات إلا بعد أن يحصل على التفويض الرسمي من الراعي أو السلطة العليا. هذه الموافقة تجعل الميثاق مستندًا رسميًا. أما عقد اجتماع الانطلاق فهو يتم لاحقًا بعد الموافقة. تطوير سجل المخاطر وإنشاء WBS هي عمليات ضمن خطة المشروع، وتُجرى بعد بدء مرحلة التخطيط وليس قبلها، وبالتالي لا تسبق الموافقة على الميثاق.",
      "choices": [
        {
          "text": "عقد اجتماع انطلاق المشروع.",
          "correct": false
        },
        {
          "text": "تطوير سجل المخاطر.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تجزئة العمل (WBS).",
          "correct": false
        },
        {
          "text": "الحصول على موافقة ميثاق المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع جديد يقوم بتطوير خطة إدارة الموارد، لكنه غير ملم بمهارات الفريق المطلوبة لهذا المشروع. كيف يمكن أن يساعد إشراك الخبراء المتخصصين مدير المشروع في إعداد خطة إدارة الموارد؟",
      "explanation": "الإجابة الصحيحة: تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع، حيث تساعد مساهمة الخبراء على فهم نوعية المهارات الفنية، والشهادات أو الخبرات التي يحتاجها الفريق لإنجاز المهام بكفاءة. هذه المساهمة ضرورية لتحديد المتطلبات بدقة ضمن خطة إدارة الموارد. أما تحديد الأصول التنظيمية، أو فهم الهيكل التنظيمي، أو إدارة فرق افتراضية، فهي أنشطة تنظيمية وليست كافية لتحديد المهارات الفنية والسلوكية المطلوبة فعليًا.",
      "choices": [
        {
          "text": "من خلال عرض كيفية تحديد الأصول التنظيمية للعمل.",
          "correct": false
        },
        {
          "text": "من خلال مساعدة مدير المشروع على فهم العلاقات التنظيمية الموضحة في مخطط هيكل المشروع.",
          "correct": false
        },
        {
          "text": "من خلال تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع.",
          "correct": true
        },
        {
          "text": "من خلال تمكين مدير المشروع من إدارة الفرق الافتراضية ذات المهارات العالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء واحدة من عمليات التسليم النهائية لمشروع ما، أبلغ المستخدم النهائي قائد المشروع بعدم رضاه عن النتيجة وطلب إزالة أحد أعضاء الفريق الذي تسبب في النتيجة غير المرغوبة.\n\nما الذي يجب على قائد المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: مناقشة المشكلة خلال اجتماع التغذية الراجعة الدوري لأصحاب المصلحة واتخاذ إجراء لمعالجتها. هذا الإجراء يضمن أن القرار يُتخذ بناء على تقييم جماعي وشامل ضمن حوكمة المشروع. لا يجوز إقالة عضو الفريق مباشرة دون تقييم الأداء وفق الإجراءات المتبعة. الاعتراف بالمشكلة أو تبرير العضو للمستخدم لا يعالج السبب الجذري. القرار يجب أن يكون مبنيًا على تحليل ومشاركة أصحاب العلاقة، وليس مجرد استجابة عاطفية لطلب المستخدم النهائي.",
      "choices": [
        {
          "text": "الاعتراف بالمشكلة، والوعد للمستخدم النهائي بأن المشكلة سيتم حلها.",
          "correct": false
        },
        {
          "text": "إبلاغ المستخدم النهائي بأن العضو هو عنصر رئيسي، والوعد بحل المشكلة.",
          "correct": false
        },
        {
          "text": "إزالة عضو الفريق حسب الطلب لتجنب تأخير القبول.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة خلال اجتماع التغذية الراجعة الدوري لأصحاب المصلحة واتخاذ إجراء لمعالجتها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع هجين، متى يجب تقديم التغذية الراجعة؟",
      "explanation": "الإجابة الصحيحة: من أجل الأداء الفعّال للفريق، يتم تقديم التغذية الراجعة بشكل منتظم ومستمر. في المشاريع الهجينة التي تمزج بين النهج الرشيق (Agile) والتنبؤي (Predictive)، يعتمد نجاح المشروع على سرعة التكيف والتحسين المستمر. التغذية الراجعة المنتظمة تسمح بتعديل السلوك، تحسين جودة التسليمات، وتعزيز التعاون بين أفراد الفريق وأصحاب المصلحة. الاقتصار على الاجتماعات الداخلية أو التوقيتات المحددة مسبقًا لا يتماشى مع طبيعة البيئة الهجينة التي تتطلب تكرارًا وتفاعلية مستمرة. تقديم التغذية الراجعة بعد كل تسليم فقط هو أمر محدود لأن الفرق تحتاج معلومات أداء متواصلة لتتطور.",
      "choices": [
        {
          "text": "يعتمد توقيت التغذية الراجعة على خطة قياس الأداء التي يحددها قائد المشروع في بداية المشروع.",
          "correct": false
        },
        {
          "text": "مدير المشروع مسؤول عن إيصال التغذية الراجعة أثناء الاجتماعات الداخلية.",
          "correct": false
        },
        {
          "text": "مع كل تسليم، يجب على قائد المشروع الحصول على تغذية راجعة من أصحاب المصلحة ومشاركتها مع الفريق.",
          "correct": false
        },
        {
          "text": "من أجل الأداء الفعّال للفريق، يتم تقديم التغذية الراجعة بشكل منتظم ومستمر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء بيئة تسليم مستمر، يلاحظ قائد المشروع أن أحد أعضاء الفريق الرئيسيين يعاني من تدني الروح المعنوية، مما يؤثر على تسليم المشروع ويتسبب في تأخير كبير في جدول المشروع. وعند مناقشة المشكلة مع العضو، يكتشف القائد أن السبب هو الغموض في معايير مراجعة الأداء.\n\nما الذي كان ينبغي على قائد المشروع فعله لتفادي هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: مشاركة التغذية الراجعة ونتائج الأداء. في بيئة تسليم مستمر (Continuous Delivery)، يشعر أعضاء الفريق بالحافز عندما تكون معايير النجاح واضحة ويُقدم لهم تقييم دوري لأدائهم. الغموض يؤدي إلى شعور بالإحباط وقلة الثقة بالنفس، مما يضعف الإنتاجية. مشاركة التغذية الراجعة بانتظام تساعد على بناء الوضوح، وتحفيز الفريق، وتوجيه الأفراد نحو التحسين. أما شرح القواعد العامة أو عرض الحوافز فهي لا تكفي إذا لم يتم ربط الأداء بالنتائج الحقيقية. استراتيجيات بناء الفريق مهمة ولكن تأتي كمرحلة لاحقة لدعم بيئة يسودها وضوح التوقعات والتقييمات.",
      "choices": [
        {
          "text": "شرح القواعد الأساسية للفريق.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بالحوافز والمكافآت.",
          "correct": false
        },
        {
          "text": "مشاركة التغذية الراجعة ونتائج الأداء.",
          "correct": true
        },
        {
          "text": "تحديد استراتيجيات بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتهاء من ميثاق المشروع، يرسله مدير المشروع إلى أصحاب المصلحة في المشروع. ما الذي يجب على مدير المشروع فعله قبل بدء عملية تخطيط المشروع؟",
      "explanation": "الإجابة الصحيحة: الحصول على موافقة ميثاق المشروع.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن ميثاق المشروع لا يصبح ملزمًا أو رسميًا حتى تتم الموافقة عليه من الجهات المعنية مثل الراعي أو الإدارة العليا. بدون هذه الموافقة، لا يحق لمدير المشروع بدء عملية التخطيط.\n\n- لماذا الإجابات الأخرى خاطئة؟\n• عقد اجتماع انطلاق المشروع يتم عادة بعد اكتمال خطة المشروع وليس قبلها.\n• تطوير سجل المخاطر يتم خلال مرحلة التخطيط.\n• إنشاء هيكل تجزئة العمل (WBS) أيضًا جزء من التخطيط، ولا يبدأ إلا بعد الموافقة على ميثاق المشروع.",
      "choices": [
        {
          "text": "عقد اجتماع انطلاق المشروع.",
          "correct": false
        },
        {
          "text": "تطوير سجل المخاطر.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تجزئة العمل (WBS).",
          "correct": false
        },
        {
          "text": "الحصول على موافقة ميثاق المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع جديد يطور خطة إدارة الموارد، لكنه غير ملم بمجموعة المهارات المطلوبة للمشروع. كيف يمكن أن يساعد إشراك الخبراء المتخصصين (SMEs) مدير المشروع في إعداد خطة إدارة الموارد؟",
      "explanation": "الإجابة الصحيحة: من خلال تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالخبراء المتخصصون (SMEs) يمتلكون خبرة تقنية أو تخصصية تمكّنهم من تحديد ما يحتاجه المشروع من مهارات بشرية وتقنية. وهذا ضروري لتحديد الموارد وتوزيعها.\n\n- لماذا الإجابات الأخرى خاطئة؟\n• عرض كيفية تحديد الأصول التنظيمية ليس من اختصاص SMEs.\n• فهم العلاقات السلطوية مرتبط أكثر بالهيكل التنظيمي، وليس بتحديد المهارات.\n• إدارة الفرق الافتراضية تخص إدارة الموارد ولكنها ليست مرتبطة مباشرة بتحديد المهارات المطلوبة.",
      "choices": [
        {
          "text": "من خلال عرض كيفية تحديد الأصول التنظيمية للعمل.",
          "correct": false
        },
        {
          "text": "من خلال مساعدة مدير المشروع على فهم العلاقات السلطوية المحددة في هيكل تنظيم المشروع.",
          "correct": false
        },
        {
          "text": "من خلال تمكين مدير المشروع من تحديد المهارات المطلوبة لتحقيق أهداف المشروع.",
          "correct": true
        },
        {
          "text": "من خلال تمكين مدير المشروع من إدارة الفرق الافتراضية من أصحاب المهارات العالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال واحدة من عمليات التسليم الأخيرة لمشروع ما، أبلغ المستخدم النهائي قائد المشروع بعدم رضاه عن النتيجة وطلب إزالة عضو من الفريق بسبب تأثيره السلبي. ماذا يجب أن يفعل قائد المشروع؟",
      "explanation": "الإجابة الصحيحة: مناقشة المسألة خلال اجتماع ملاحظات أصحاب المصلحة المنتظم واتخاذ إجراء لحلها.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن اتخاذ قرارات فردية استنادًا إلى طلب واحد فقط قد يؤدي إلى مشاكل أخرى في المشروع. يجب أن تُناقش هذه الأمور بشكل رسمي ومنظم في الاجتماعات المخصصة، بحيث يتم الاستماع لجميع الأطراف وتقييم الوضع بشكل عادل. هذه الطريقة تدعم الشفافية والحوكمة الجيدة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• الاعتراف بالمشكلة والوعد بحلها بدون مناقشة داخل الفريق قد يؤدي إلى قرارات غير مدروسة.\n• إبلاغ المستخدم النهائي بأن العضو عنصر رئيسي مع الوعد بحل المشكلة يفتقر إلى معالجة حقيقية للوضع.\n• إزالة العضو مباشرة دون تقييم داخلي قد يضعف الفريق ويخلق إحساسًا بعدم العدالة أو الشفافية.",
      "choices": [
        {
          "text": "الاعتراف بالمشكلة، والوعد بحلها.",
          "correct": false
        },
        {
          "text": "إبلاغ المستخدم النهائي بأن العضو هو عنصر رئيسي، والوعد بحل المشكلة.",
          "correct": false
        },
        {
          "text": "إزالة العضو كما طُلب لتجنب تأخير القبول.",
          "correct": false
        },
        {
          "text": "مناقشة المسألة خلال اجتماع ملاحظات أصحاب المصلحة المنتظم واتخاذ إجراء لحلها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع هجين، متى يجب تقديم التغذية الراجعة؟",
      "explanation": "الإجابة الصحيحة: من أجل أداء فعّال للفريق، يتم تقديم التغذية الراجعة بانتظام وبشكل مستمر.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nفي المشاريع الهجينة التي تجمع بين العناصر التنبؤية والرشيقة، تعتمد نجاحات الفريق بشكل كبير على تحسين العمليات والتعلم المستمر. التغذية الراجعة المستمرة تمكن الفريق من التكيف وتحسين الأداء بشكل سريع ومتدرج.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• ربط التغذية الراجعة بخطة قياس الأداء فقط قد يجعلها مقيدة وغير مرنة.\n• حصر مسؤولية التغذية الراجعة بمدير المشروع يحجب دور الفريق وأصحاب المصلحة.\n• انتظار كل تسليم لتقديم التغذية الراجعة يعني إضاعة فرص التحسين أثناء العمل.",
      "choices": [
        {
          "text": "يعتمد توقيت التغذية الراجعة على خطة قياس الأداء التي يحددها قائد المشروع في بداية المشروع.",
          "correct": false
        },
        {
          "text": "مدير المشروع مسؤول عن توصيل التغذية الراجعة خلال الاجتماعات الداخلية.",
          "correct": false
        },
        {
          "text": "مع كل تسليم، من المفترض أن يتلقى قائد المشروع ملاحظات من أصحاب المصلحة ويشاركها مع الفريق.",
          "correct": false
        },
        {
          "text": "من أجل أداء فعّال للفريق، يتم تقديم التغذية الراجعة بانتظام وبشكل مستمر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء العمل في بيئة تسليم مستمر، يلاحظ قائد المشروع أن أحد الأعضاء الأساسيين في الفريق يعاني من انخفاض في المعنويات، مما يؤثر على تسليم المشروع ويتسبب في تأخير كبير في الجدول الزمني. وأثناء مناقشة المشكلة مع عضو الفريق، يكتشف قائد المشروع أن السبب يعود إلى عدم وضوح معايير تقييم الأداء. ماذا كان يجب على قائد المشروع أن يفعل لتفادي هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: مشاركة التغذية الراجعة ونتائج الأداء.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن توضيح توقعات الأداء ومشاركة نتائج تقييم الأداء بشكل مستمر يساهم في الحفاظ على معنويات الفريق مرتفعة ويمنع سوء الفهم الذي يؤدي إلى تراجع الإنتاجية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• شرح القواعد الأساسية لا يغطي جانب تقييم الأداء.\n• إبلاغ الفريق بالمكافآت والحوافز وحده لا يعالج مشكلة عدم الوضوح حول الأداء.\n• تحديد استراتيجيات بناء الفريق مهم، لكن في هذا السياق سبب المشكلة هو تقييم الأداء وليس العمل الجماعي.",
      "choices": [
        {
          "text": "شرح القواعد الأساسية للفريق.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بالمكافآت والحوافز.",
          "correct": false
        },
        {
          "text": "مشاركة التغذية الراجعة ونتائج الأداء.",
          "correct": true
        },
        {
          "text": "تحديد استراتيجيات بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق التسويق على تطوير أفكار لإعادة تصميم منتج موجود. يتواصل المدير التنفيذي للتسويق مع مدير المشروع للتأكد من أن الإجراءات اللازمة متوفرة لضمان إطلاق ناجح. على ماذا يجب أن يركز مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تحديد وتنسيق مؤشرات الأداء التي ستساعد في تقييم نجاح التسليم.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن نجاح الإطلاق يتطلب وجود مؤشرات أداء واضحة KPIs لمراقبة الأداء والجودة والنتائج بعد الإطلاق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• خطة إدارة النطاق مهمة لكنها لا تركز على نجاح الإطلاق.\n• خطة إدارة التغيير ضرورية لكن السياق هنا يتعلق بتقييم النجاح.\n• التحديثات الدورية تساعد في المتابعة لكنها ليست كافية لتقييم الأداء النهائي.",
      "choices": [
        {
          "text": "ضمان وجود خطة إدارة النطاق لتغطية جميع الأهداف ذات الصلة.",
          "correct": false
        },
        {
          "text": "ضمان أن الفريق يركز أيضًا على خطة إدارة التغيير الشاملة.",
          "correct": false
        },
        {
          "text": "التخطيط لتحديثات دورية للمشروع لتغطية حالة التسليمات الحرجة.",
          "correct": false
        },
        {
          "text": "تحديد وتنسيق مؤشرات الأداء التي ستساعد في تقييم نجاح التسليم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مؤسسة وظيفية، تم تعيين محلل منتجات لمهمة تطوير تطبيق قصيرة المدة. أعرب المحلل عن قلقه وطلب من مدير المشروع دعم زميل يمتلك خبرة في هذا المجال. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: ضمان عقد اجتماعات دورية بين المحلل والعضو الآخر طوال تنفيذ المهمة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن الدعم الفني المستمر يعزز ثقة المحلل ويضمن نقل المعرفة دون تعطيل المشروع أو استبدال الأشخاص.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• إعادة تعيين المهمة قد يخلق عبئًا جديدًا ويؤثر على التوازن.\n• تسجيل المحلل في برنامج تدريبي قد لا يكون عمليًا في مشروع قصير المدة.\n• نقل العمل بعد بدء التنفيذ يسبب فقدان الاستمرارية ويؤثر على الجودة.",
      "choices": [
        {
          "text": "الاعتراف بمخاوف المحلل وإعادة تعيين المهمة لعضو آخر في الفريق.",
          "correct": false
        },
        {
          "text": "تسجيل المحلل في برنامج لبناء القدرات والإبقاء عليه في المهمة.",
          "correct": false
        },
        {
          "text": "الطلب من المحلل استخدام مهاراته لتطوير الأداة، ثم نقل العمل إلى عضو آخر.",
          "correct": false
        },
        {
          "text": "ضمان عقد اجتماعات دورية بين المحلل والعضو الآخر طوال تنفيذ المهمة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد للعمل على مشروع نظام رعاية صحية معقد في ثلاث دول. يحتاج مدير المشروع إلى تفصيل جميع المتطلبات وتقدير كل مهمة لإعداد الجدول الزمني. ما هو النهج الذي يستخدمه مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تقليدي (Traditional).\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن المشروع يعتمد على تحديد جميع المتطلبات بشكل مفصل مسبقًا، وهو ما يعكس خصائص النهج التقليدي الذي يركز على التخطيط المسبق الكامل قبل التنفيذ.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• أجايل (Agile): لا يتطلب تحديد جميع المتطلبات مسبقًا بل يعتمد على التكرار والتعديل المستمر.\n• خيط فولاذي (Steel Thread): يُستخدم لاختبار نظام عبر طبقات متعددة وليس لتخطيط مفصل.\n• موجة متدحرجة (Rolling Wave): يعتمد على تخطيط تفصيلي للأجزاء القريبة فقط، وليس المشروع بالكامل.",
      "choices": [
        {
          "text": "أجايل (Agile)",
          "correct": false
        },
        {
          "text": "تقليدي (Traditional)",
          "correct": true
        },
        {
          "text": "خيط فولاذي (Steel Thread)",
          "correct": false
        },
        {
          "text": "موجة متدحرجة (Rolling Wave)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصبح أحد الموردين الأساسيين غير متاح، ووجد مدير المشروع بديلاً معتمدًا. ومع ذلك، فإن إدخال المورد الجديد سيضيف 10 أيام إلى الجدول الزمني. أحد أصحاب المصلحة لا يريد تمديد الجدول. يجب استخدام المورد الجديد للانتقال إلى مرحلة التنفيذ. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إبلاغ صاحب المصلحة بأن الجدول الزمني الحالي سيتطلب تحديثات، والاستمرار بمراجعات دورية لمناقشة هذه التحديثات.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن مدير المشروع مطالب بالشفافية والتواصل المستمر، ويجب أن يُطلع أصحاب المصلحة على أثر التغييرات بطريقة رسمية ومنظمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• الاجتماع مع صاحب المصلحة وحده لا يكفي إذا لم يتم تحديث الجدول الزمني رسميًا.\n• تسريع المهام قد لا يكون ممكنًا دائمًا ويحتاج تحليلًا.\n• إعادة البدء من جديد ليست ضرورية بل تمثل مبالغة في الإجراء.",
      "choices": [
        {
          "text": "الاجتماع مع صاحب المصلحة لشرح أن المورد الجديد سيزيد المدة الزمنية ولكنه سيحقق أهداف المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ صاحب المصلحة بأن الجدول الزمني الحالي سيتطلب تحديثات، والاستمرار بمراجعات دورية لمناقشة هذه التحديثات.",
          "correct": true
        },
        {
          "text": "إبلاغ صاحب المصلحة بتأخير الجدول لمدة 10 أيام، ولكن سيتم تسريع المهام على المسار الحرج.",
          "correct": false
        },
        {
          "text": "إبلاغ صاحب المصلحة أن استخدام المورد الجديد سيتطلب إعادة البدء في بداية مرحلة التخطيط التالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر مدير المشروع بعدم اليقين بشأن مدة مرحلة جديدة، فاستشار ثلاث مجموعات من الخبراء المختصين. المجموعة الأولى أوضحت أن المرحلة يمكن إنجازها في 20 يومًا. والمجموعة الثانية أشارت إلى بعض المخاطر التي قد تمدد المدة حتى 35 يومًا. أما المجموعة الثالثة فقد اقترحت نهجًا جديدًا يمكن أن يختصر المدة إلى 11 يومًا. ما هي المدة التقديرية للمرحلة الجديدة؟",
      "explanation": "الإجابة الصحيحة: 21 يومًا.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن السؤال يعتمد على طريقة بيرت (PERT) التي تستخدم ثلاث تقديرات:\n(المتفائلة + 4 × المتوقعة + المتشائمة) ÷ 6 = (11 + 4×20 + 35) ÷ 6 = 21\n\n- لماذا الخيارات الأخرى خاطئة؟\nلأنها لا تعكس الحساب الرياضي الدقيق باستخدام صيغة بيرت، التي تساعد في تقدير متوسط واقعي للمدة عند وجود عدم يقين.",
      "choices": [
        {
          "text": "19 يومًا",
          "correct": false
        },
        {
          "text": "21 يومًا",
          "correct": true
        },
        {
          "text": "23 يومًا",
          "correct": false
        },
        {
          "text": "25 يومًا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يوجد ثلاث حزم عمل رئيسية في مشروع تطوير منتج جديد. يجب تسليم الحزمة A قبل أسبوع من بدء الحزمة C، وستبدأ الحزمة C في نفس وقت بدء الحزمة B. ما هي العلاقة بين الحزمتين A و B؟",
      "explanation": "الإجابة الصحيحة: إنهاء إلى بدء (Finish-to-Start).\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن الحزمة A يجب أن تنتهي قبل أن تبدأ الحزمة C، وبما أن الحزمة C تبدأ في نفس وقت بدء الحزمة B، فهذا يعني أن هناك علاقة زمنية أساسية: انتهاء A ضروري لكي تبدأ B. هذا النوع من العلاقات هو الأكثر شيوعًا في إدارة المشاريع ويدل على أن إنهاء المهمة الأولى شرط لبدء المهمة الثانية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• إنهاء إلى إنهاء: هذا يعني أن كلا الحزمتين يجب أن تنتهيا في نفس الوقت تقريبًا، وهذا لا ينطبق هنا.\n• بدء إلى بدء: يعني أن الحزمتين تبدأان معًا، لكن في المعطى العلاقة تعتمد على انتهاء A، وليس بدايته.\n• بدء إلى إنهاء: علاقة نادرة تعني أن بدء مهمة مرتبط بإنهاء مهمة أخرى، وهذا غير منطقي هنا وفقًا للسيناريو.",
      "choices": [
        {
          "text": "إنهاء إلى بدء (Finish-to-start)",
          "correct": true
        },
        {
          "text": "إنهاء إلى إنهاء (Finish-to-finish)",
          "correct": false
        },
        {
          "text": "بدء إلى بدء (Start-to-start)",
          "correct": false
        },
        {
          "text": "بدء إلى إنهاء (Start-to-finish)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم مؤسسة إدارة المشاريع نهج الشلال (Waterfall) في مرحلة جمع المتطلبات، ونهج أجايل (Agile) في مراحل التطوير والاختبار. لم يكن جميع أعضاء الفريق على دراية بكلا النهجين، مما أدى إلى تأخيرات بسبب عدم اليقين. ما الذي كان يجب فعله لتجنب هذا السيناريو؟",
      "explanation": "الإجابة الصحيحة: جدولة اجتماعات وقوف يومية لإبقاء الفريق على اطلاع ومعالجة المشكلات فورًا.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن البيئة الهجينة تحتاج إلى تواصل مستمر حتى مع وجود فرق لا تملك خبرة كاملة بكل المنهجيات. الاجتماعات اليومية (Daily Stand-ups) تعزز تبادل المعلومات بشكل سريع وتكشف المشكلات والمعوقات فورًا بدلًا من تركها تتراكم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تدريب الفريق على فوائد الهجين: جيد لكن يحتاج وقت، بينما في المشروع كان الهدف معالجة مشكلة فورية.\n• توزيع الأدوار: هذا قد يعزل الأعضاء ويضعف التعاون المشترك.\n• اعتماد نهج واحد: يقلل من مرونة المشروع ويعارض فكرة الهجين أصلًا.",
      "choices": [
        {
          "text": "تدريب الفريق على فوائد إدارة المشاريع الهجينة.",
          "correct": false
        },
        {
          "text": "توزيع الأدوار بحيث يتعامل من يعرف الشلال مع جمع المتطلبات، ومن يعرف أجايل مع التطوير والاختبار.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعات وقوف يومية لإبقاء الفريق على اطلاع ومعالجة المشكلات فورًا.",
          "correct": true
        },
        {
          "text": "الطلب من مكتب إدارة المشاريع (PMO) اعتماد نهج واحد بسبب ضيق الوقت للتدريب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف مشروع أجايل يتكون من 100 قصة مستخدم مقسمة إلى خمس تكرارات، تبلغ قيمة كل قصة مستخدم 50 دولارًا. وقد تم إنفاق 2000 دولار وتم تسليم 50 قصة مستخدم. ما العبارة الصحيحة؟",
      "explanation": "الإجابة الصحيحة: المشروع أقل من الميزانية وفي الوقت المحدد.\n\n- الحساب:\n50 قصة × 50 دولار = 2500 دولار قيمة مكتسبة.\nولكن الذي صُرف فقط هو 2000 دولار، مما يعني أن الفريق أنجز أكثر مما أنفق:\nCPI = EV / AC = 2500 / 2000 = 1.25\nبالتالي الفريق يعمل بأداء أفضل من المتوقع (أقل من الميزانية).\n\n- من جانب الجدول الزمني:\nلو المشروع 100 قصة على 5 تكرارات = 20 قصة لكل تكرار. تسليم 50 قصة يعني أنهم تقدموا على الجدول.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• المشروع يتجاوز الميزانية ومتأخر: خاطئ لأن الأداء المالي إيجابي.\n• المشروع ضمن الميزانية: غير دقيق لأنه أفضل من الميزانية.\n• المشروع أقل من الميزانية ومسبق عن الجدول: غير مضمون تمامًا حسب المعطيات، لذلك الخيار الأدق حسب PMI هو (أقل من الميزانية وفي الوقت المحدد) بما أن الزمن لم يُذكر فيه تأخير أو تقدم محدد.",
      "choices": [
        {
          "text": "المشروع يتجاوز الميزانية ومتأخر عن الجدول.",
          "correct": false
        },
        {
          "text": "المشروع أقل من الميزانية وفي الوقت المحدد.",
          "correct": true
        },
        {
          "text": "المشروع ضمن الميزانية وفي الوقت المحدد.",
          "correct": false
        },
        {
          "text": "المشروع أقل من الميزانية ومسبق عن الجدول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم الشركة نهجًا تنبؤيًا (Predictive) لتطوير مكون محدد في خطة إدارة النطاق. وبسبب تغير اللوائح باستمرار، طلب فريق التطوير استخدام نهج أجايل. ما الذي يجب أن يفعله مدير المشروع حيال هذا الطلب؟",
      "explanation": "الإجابة الصحيحة: تحليل المتطلبات التي سيتم التعامل معها بموجب النهج المطلوب.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأنه قبل اتخاذ أي قرار بخصوص تغيير المنهجية، يجب على مدير المشروع فهم طبيعة المتطلبات التي تغيرت: هل هي تتطلب تكرارات سريعة؟ هل تحتاج لتعديلات مستمرة بسبب التغيرات في اللوائح؟ تحليل المتطلبات هو أول خطوة لضمان أن قرار التحول لمنهجية أجايل مبرر ومستند إلى احتياجات حقيقية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تصعيد الطلب للحصول على موارد مالية: ليس منطقيًا أن يتم طلب موارد إضافية قبل التأكد من ضرورة تغيير المنهجية.\n• إحالة الطلب إلى مكتب إدارة المشاريع: PMO ليس مسؤولًا عن اتخاذ القرار الفني في هذه المرحلة بل دوره يكون بعد التحليل.\n• طلب موافقة الراعي: الراعي يُستشار بعد إعداد مبررات واضحة بناءً على التحليل، وليس قبل ذلك.",
      "choices": [
        {
          "text": "تصعيد الطلب للحصول على موارد مالية إضافية.",
          "correct": false
        },
        {
          "text": "تحليل المتطلبات التي سيتم التعامل معها بموجب النهج المطلوب.",
          "correct": true
        },
        {
          "text": "إحالة الطلب إلى مكتب إدارة المشاريع (PMO) لتعديل الأصول التنظيمية.",
          "correct": false
        },
        {
          "text": "طلب موافقة الراعي لتنفيذ النهج الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من أجل تحديد العوامل المساعدة والمعيقة التي قد تؤثر على تسليم المشروع نتيجة للبيئة الخاصة بالمؤسسة، يقوم مدير المشروع بإجراء مسح بيئي. أي من المجموعات التالية تمثل بعض العوامل التي سيتم أخذها بعين الاعتبار في هذا المسح؟",
      "explanation": "الإجابة الصحيحة: القوانين واللوائح، اتجاهات السوق، والتكنولوجيا الجديدة.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن هذه العناصر تدخل ضمن العوامل البيئية المؤسسية (EEFs) التي تؤثر على المشروع: \n• القوانين واللوائح: قد تمنع أو تفرض شروطًا معينة على المشروع.\n• اتجاهات السوق: تؤثر على جدوى المشروع.\n• التكنولوجيا الجديدة: قد تفتح فرصًا أو تفرض تحديثات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• البحوث والمنشورات: هذه تعتبر مصادر معلومات ثانوية وليست جزءًا مباشرًا من المسح البيئي.\n• الندوات والمعارض: نشاطات خارجية للتعلم والتسويق وليست مؤثرًا مباشرًا على بيئة المشروع.\n• التكنولوجيا الجديدة مع الندوات: مزج غير دقيق، لأن الندوات ليست عامل بيئي مؤسسي بحد ذاتها.",
      "choices": [
        {
          "text": "القوانين واللوائح، اتجاهات السوق، والتكنولوجيا الجديدة.",
          "correct": true
        },
        {
          "text": "البحوث المنشورة، والمقالات، والمجلات.",
          "correct": false
        },
        {
          "text": "الندوات، والمعارض، والمؤتمرات القادمة.",
          "correct": false
        },
        {
          "text": "التكنولوجيا الجديدة، الندوات، والويبينارات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء عملية التصميم لمشروع بناء متعدد الجنسيات، أجرى مدير المشروع تحليل التكلفة والفائدة بناءً على أسعار صرف العملات الأجنبية الحالية. تم تسجيل مخاطر تغير أسعار الصرف في سجل المخاطر. خلال مرحلة تنفيذ المشروع، انخفض سعر الصرف بدرجة تجعل مدير المشروع يعتقد أن المشروع قد لا ينجح. ما الذي يجب على مدير المشروع القيام به كإجراء استباقي؟",
      "explanation": "الإجابة الصحيحة: إجراء تحليل جديد للتكلفة والفائدة.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن الوضع المالي تغير بشكل جوهري بسبب انخفاض سعر الصرف، ويجب إعادة تقييم المشروع بناءً على الظروف الجديدة. هذا التحليل الجديد هو الذي سيوضح إن كان المشروع ما زال مجديًا أو يحتاج إلى تعديل أو إيقاف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تحديث خطة إدارة المخاطر: تحديث الخطة خطوة لاحقة بعد إعادة التحليل، وليس قبل التأكد من حجم التأثير.\n• تصعيد المسألة إلى الراعي: لا يمكن التصعيد إلا بعد وجود بيانات دقيقة من تحليل جديد.\n• طلب تغيير لزيادة الميزانية: خطوة متسرعة وغير مبنية على تحليل شامل للوضع الجديد.",
      "choices": [
        {
          "text": "تحديث خطة إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "تصعيد المسألة إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير لزيادة الميزانية.",
          "correct": false
        },
        {
          "text": "إجراء تحليل جديد للتكلفة والفائدة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعبر أحد أصحاب المصلحة في مشروع هجين عن إحباطه من عدد اجتماعات مراجعة التكرارات التي يُتوقع حضوره لها. ماذا يجب أن يفعل مدير المشروع في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: تثقيف صاحب المصلحة حول منهجيات المشاريع الهجينة وكيف أن المراجعات المنتظمة تزيد من قيمة المنتج وتقلل من العمل الإضافي.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن جزءًا أساسيًا من إدارة المشاريع الهجينة هو إشراك أصحاب المصلحة بشكل مستمر لضمان التوافق مع احتياجاتهم المتغيرة وللتحقق من جودة المنتج باستمرار. إذا لم يفهم صاحب المصلحة فائدة هذه الاجتماعات، قد يؤدي ذلك إلى سوء فهم أو ضعف في التعاون لاحقًا. بالتالي، على مدير المشروع توعية صاحب المصلحة، وليس فقط تلبية طلبه مباشرة، حتى لا يفقد المشروع عنصرًا مهمًا من عناصر الجودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• مناقشة مستوى المشاركة المفضل لصاحب المصلحة: قد يعطي انطباعًا خاطئًا بأن حضور الاجتماعات اختياري، وهذا يتعارض مع طبيعة المنهج الهجين الذي يعتمد على التفاعل المستمر.\n• إعداد اجتماع مع الجميع: خطوة معقدة وغير ضرورية في هذه المرحلة. المشكلة تتعلق بفرد واحد فقط.\n• تسجيل ذلك في سجل المخاطر: ليس خطرًا تقنيًا أو إداريًا، بل هو مسألة توعية وإدارة توقعات.",
      "choices": [
        {
          "text": "تثقيف صاحب المصلحة حول منهجيات المشاريع الهجينة وكيف أن المراجعات المنتظمة تزيد من قيمة المنتج وتقلل من العمل الإضافي.",
          "correct": true
        },
        {
          "text": "مناقشة مستوى المشاركة المفضل لصاحب المصلحة وتعديل خطة إشراك أصحاب المصلحة وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "إعداد اجتماع مع جميع أصحاب المصلحة لتحديد الاجتماعات التي يجب أن يحضرها كل منهم وتحديث خطة إشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسجيل ذلك في سجل المخاطر والعمل مع الراعي لتحديد الاستجابات المناسبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يرغب مدير المشروع في تعيين عضو جديد في الفريق ليحل محل مهندس معماري استقال مؤخرًا. أي مستند يجب الرجوع إليه لهذا التغيير؟",
      "explanation": "الإجابة الصحيحة: الأصول التنظيمية للمؤسسة (OPA).\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن OPA تحتوي على السياسات والإجراءات المتعلقة بالتوظيف وتعيين الموارد، مثل:\n• معايير اختيار الموظفين.\n• سياسات التوظيف الداخلية والخارجية.\n• قواعد الأجور والتعاقد.\nلذلك، قبل تعيين أي عضو جديد، على مدير المشروع مراجعة هذه السياسات لضمان أن التعيين يتم وفق القوانين الداخلية للشركة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• سجل أصحاب المصلحة: لا يحتوي على بيانات متعلقة بتعيين الموظفين.\n• خطة إدارة المشروع: قد تحتوي على هيكل الفريق ولكن ليس الإجراءات اللازمة لاستبدال الأعضاء.\n• مصفوفة تعيين المسؤوليات (RAM): تحدد من مسؤول عن ماذا، لكنها لا توفر آليات التعيين والاستبدال.",
      "choices": [
        {
          "text": "سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "مصفوفة تعيين المسؤوليات (RAM).",
          "correct": false
        },
        {
          "text": "الأصول التنظيمية للمؤسسة (OPA).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الموافقة على المشروع، يتم تعيين فريق المشروع ويتم إعداد خطة إدارة المشروع. ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: عقد اجتماع إطلاق المشروع (Kickoff) مع الفريق وأصحاب المصلحة.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن اجتماع الانطلاق يعتبر الخطوة الرسمية لبدء تنفيذ المشروع. من خلال هذا الاجتماع:\n• يتم التأكيد على أهداف المشروع.\n• يتم استعراض خطة إدارة المشروع.\n• توضيح الأدوار والمسؤوليات.\n• معالجة أي غموض لدى الفريق وأصحاب المصلحة.\nبدون هذا الاجتماع، قد يحدث تداخل في الأدوار أو سوء فهم بشأن الأولويات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تطوير جدول زمني تفصيلي: يتم عادةً أثناء إعداد خطة إدارة المشروع وليس بعد ذلك.\n• بدء عمليات الشراء: خطوة تنفيذية تحدث بعد اجتماع الانطلاق.\n• إجراء مراجعات أداء فردية: يتم ذلك لاحقًا أثناء مراقبة أداء المشروع، وليس كخطوة أولى بعد الموافقة على المشروع.",
      "choices": [
        {
          "text": "عقد اجتماع إطلاق المشروع (Kickoff) مع الفريق وأصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تطوير جدول زمني تفصيلي للمشروع.",
          "correct": false
        },
        {
          "text": "بدء عمليات الشراء للموارد المطلوبة.",
          "correct": false
        },
        {
          "text": "إجراء مراجعات أداء فردية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتكوّن فريق مشروع تم تشكيله حديثًا من أعضاء من عدة بلدان وقارات، مع وجود فروق كبيرة في الأعمار وتنوع في الخلفيات الاجتماعية. كيف يجب على مدير المشروع التعامل مع هذا التحدي؟",
      "explanation": "الإجابة الصحيحة: مساعدة الفريق على اكتشاف كيف يمكن لوجهات نظرهم المختلفة أن توسّع مهاراتهم وتعزز إنتاجية الفريق.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن التنوع في الفرق الحديثة يُعتبر مصدر قوة وليس ضعف. مدير المشروع الناجح هو من يستثمر هذا التنوع لتعزيز الإبداع وحل المشكلات بطرق متعددة. هذه الطريقة تعزز بيئة الاحترام المتبادل بدلاً من تقسيم الفريق حسب الخلفيات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تعيين مندوب لكل مجموعة: يعزز الانقسام بدل التعاون.\n• إلزام الفريق بدورة تنوع وشمول: أداة مفيدة ولكنها ليست كافية لوحدها لحل تحديات التنوع.\n• التخطيط للتدخل عند المواجهة: إجراء دفاعي وليس استباقي، ومن الأفضل التركيز على بناء فريق متفاهم قبل ظهور المشاكل.",
      "choices": [
        {
          "text": "مساعدة الفريق على اكتشاف كيف يمكن لوجهات نظرهم المختلفة أن توسّع مهاراتهم وتعزز إنتاجية الفريق.",
          "correct": true
        },
        {
          "text": "تعيين مندوب لكل مجموعة عرقية/اجتماعية للمساهمة في اتخاذ قرارات شاملة.",
          "correct": false
        },
        {
          "text": "إلزام جميع أعضاء الفريق بحضور دورة تدريبية افتراضية حول التنوع والشمول.",
          "correct": false
        },
        {
          "text": "التخطيط للتدخل بسلطة إذا نشأت مواجهات بين أعضاء الفريق غير المتوافقين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في المراحل المبكرة من المشروع، كان لدى اثنين من أصحاب المصلحة الرئيسيين آراء مختلفة بشأن أهداف المشروع. لماذا يجب على مدير المشروع التفاوض على اتفاق بين هذين الطرفين؟",
      "explanation": "الإجابة الصحيحة: للحصول على موافقة ميثاق المشروع.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن ميثاق المشروع هو الوثيقة الرسمية التي تحدد أهداف المشروع وتُعتمد من أصحاب المصلحة الرئيسيين. إذا كان هناك خلاف بينهم، لا يمكن اعتماد الميثاق إلا بعد التوصل إلى اتفاق بينهم. التفاوض هو الأسلوب الأنسب في هذه المرحلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• فهم قدرة أصحاب المصلحة: خطوة تحليلية، لكنها لا تحل الخلاف.\n• إشراكهم في حل النزاع: جزء من التفاوض، لكن الهدف الرئيسي هو الوصول إلى موافقة.\n• السماح لهم بمناقشة الآراء: لا يكفي بحد ذاته، لأن المهم هو إنهاء الخلاف والاتفاق.",
      "choices": [
        {
          "text": "لفهم قدرة أصحاب المصلحة على التأثير على اتجاه المشروع.",
          "correct": false
        },
        {
          "text": "للحصول على موافقة ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "لإشراك أصحاب المصلحة في حل النزاع.",
          "correct": false
        },
        {
          "text": "للسماح لأصحاب المصلحة بمناقشة آرائهم في اجتماع بدء المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع لتصميم وتطوير معدات جديدة في مرحلة التخطيط. لا يمتلك الفريق خبرة كافية بالميزات والوظائف الجديدة للمعدات، لذلك تلقوا تدريبًا عليها. كيف يمكن لمدير المشروع تعزيز فعالية أنشطة التدريب الخاصة بالفريق؟",
      "explanation": "الإجابة الصحيحة: إدراج التوجيه من زميل لزميل ضمن خطة التدريب حول الميزات والوظائف الجديدة.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن التدريب التقليدي قد لا يكون كافيًا لفهم التفاصيل الدقيقة. التوجيه بين الزملاء يعزز التعلم المستمر ويتيح تبادل الخبرات داخل الفريق بشكل عملي وواقعي خلال العمل اليومي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• دعوة خبير: مفيد ولكن ليس كافيًا، خصوصًا بعد انتهاء التدريب الرسمي.\n• جدولة عرض توضيحي: مفيد كبداية لكن لا يوفر دعمًا مستمرًا.\n• تعيين مدير وظيفي: يضيف طبقة إدارية قد لا تكون ضرورية في هذه الحالة، خاصة أن الهدف هو تطوير المهارات الفنية داخل الفريق.",
      "choices": [
        {
          "text": "دعوة خبير موضوع لشرح كيفية استخدام الميزات والوظائف للفريق.",
          "correct": false
        },
        {
          "text": "إدراج التوجيه من زميل لزميل ضمن خطة التدريب حول الميزات والوظائف الجديدة.",
          "correct": true
        },
        {
          "text": "جدولة عرض توضيحي للميزات والوظائف كجزء من أنشطة التدريب.",
          "correct": false
        },
        {
          "text": "تعيين مدير وظيفي للعمل مع الفريق للتأكد من فهمهم للميزات والوظائف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في كافيتيريا الشركة، يسمع مدير المشروع أحد أصحاب المصلحة غير المنخرطين يسخر من أسلوب اللغة المستخدم في تقرير حالة المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة: الاجتماع مع صاحب المصلحة على انفراد لمعرفة كيفية جعل التواصل أكثر جاذبية له.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن التواصل الفعال مع أصحاب المصلحة يتطلب فهم احتياجاتهم وتفضيلاتهم. حتى وإن لم يكن هذا الشخص منخرطًا بشكل مباشر، من الأفضل الاستماع لرأيه ومعرفة ما إذا كان يمكن تحسين التقارير بطريقة تناسب الجميع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• طلب نصائح من مسؤول العلاقات العامة: خطوة مبالغ فيها بالنسبة لموقف بسيط كهذا.\n• إيقاف إرسال تقارير الحالة: يضر بمبدأ الشفافية.\n• تحديث العقد الاجتماعي: تصرف رسمي مبالغ فيه لملاحظة غير رسمية.",
      "choices": [
        {
          "text": "الاجتماع مع صاحب المصلحة على انفراد لمعرفة كيفية جعل التواصل أكثر جاذبية له.",
          "correct": true
        },
        {
          "text": "طلب نصائح من مسؤول العلاقات العامة حول كيفية جعل التقارير المكتوبة أكثر جذبًا.",
          "correct": false
        },
        {
          "text": "إيقاف إرسال تقارير الحالة لهذا الشخص والاكتفاء بالتواصل عبر البريد الإلكتروني المباشر.",
          "correct": false
        },
        {
          "text": "تحديث العقد الاجتماعي للمشروع لحظر التصريحات غير المحترمة بحق أعضاء المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المبيعات يبالغ في الوعود بشأن تسليمات المشروع خارج نطاق العقد. لحل الخلاف، يرغب مدير المشروع في العثور على شخص أعلى رتبة في قسم المبيعات ويدعم المشروع. ما البيانات التي يجب أن يرجع إليها مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: شبكة السلطة/الاهتمام لأصحاب المصلحة.\n\n- لماذا هذا هو الخيار الصحيح؟\nشبكة السلطة/الاهتمام توضح من يمتلك نفوذًا وتأثيرًا داخل المؤسسة ومن يهمه المشروع أكثر، مما يسمح لمدير المشروع باختيار الشخص المناسب لدعمه في تصحيح الأمور مع قسم المبيعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• خطة إدارة الاتصالات: تحدد القنوات ولكن لا تظهر النفوذ.\n• هيكل توزيع الموارد: يركز على توزيع العمل والموارد وليس النفوذ.\n• الأصول التنظيمية: قد تحتوي معلومات، لكن شبكة السلطة أكثر تحديدًا لهذا الغرض.",
      "choices": [
        {
          "text": "شبكة السلطة/الاهتمام لأصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "هيكل توزيع الموارد.",
          "correct": false
        },
        {
          "text": "الأصول التنظيمية للمؤسسة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو سلوك القيادة الأقل احتمالاً لتعزيز التحفيز في فريق مشروع Agile؟",
      "explanation": "الإجابة الصحيحة: أمر الفريق باستخدام أداة إنتاجية جديدة على الفور.\n\n- لماذا هذا هو الخيار الصحيح؟\nالقيادة في Agile تعتمد على التمكين الذاتي والتشاور وليس الفرض. إصدار أوامر مباشرة يتعارض مع ثقافة Agile التي تعزز القرار الجماعي والتجريب والتكيف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• التصويت على طريقة جديدة: يعزز التفاعل.\n• تعيين مهام فردية: مقبول حسب ظروف الفريق.\n• طلب متطوع: يشجع المبادرة الذاتية.",
      "choices": [
        {
          "text": "أمر الفريق باستخدام أداة إنتاجية جديدة على الفور.",
          "correct": true
        },
        {
          "text": "اطلب من الفريق التصويت إذا كان ينبغي اعتماد طريقة عمل جديدة.",
          "correct": false
        },
        {
          "text": "تعيين مهام فردية لأعضاء الفريق من سجل الأعمال المتراكمة.",
          "correct": false
        },
        {
          "text": "اطلب متطوعًا لإجراء استبيان رضا العملاء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو مثال على القيادة التوجيهية مقابل القيادة التعاونية؟",
      "explanation": "الإجابة الصحيحة: التصرف كمصدر معلومات سلطوي وحيد للفريق.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن القيادة التوجيهية تعتمد على إصدار الأوامر والاعتماد على مصدر واحد للقرارات والمعلومات، حيث يكون القائد هو المحور الوحيد. هذا عكس القيادة التعاونية التي تعتمد على إشراك الفريق في اتخاذ القرار.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• قبول وتعلم من أخطاء الفريق: سلوك تعاوني يعزز التعلم الذاتي.\n• الثقة في أعضاء الفريق لاتخاذ المبادرات: جزء من القيادة التعاونية.\n• تشجيع الفريق على مشاركة أفكار التحسين: أيضًا ضمن القيادة التعاونية.",
      "choices": [
        {
          "text": "التصرف كمصدر معلومات سلطوي وحيد للفريق.",
          "correct": true
        },
        {
          "text": "قبول وتعلم من أخطاء الفريق.",
          "correct": false
        },
        {
          "text": "الثقة في أعضاء الفريق لاتخاذ المبادرات.",
          "correct": false
        },
        {
          "text": "تشجيع الفريق على مشاركة أفكار التحسين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد إعداد خطة إدارة المشروع، يحدد مدير المشروع اجتماعًا مع أصحاب المصلحة الرئيسيين لإنهاء مرحلة التخطيط. المدير يستعد الآن لمرحلة التنفيذ. ما هو الإجراء التالي الذي يجب أن يقوم به؟",
      "explanation": "الإجابة الصحيحة: تنفيذ خطة المشروع.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن مدير المشروع بعد إغلاق مرحلة التخطيط يصبح مسؤولاً عن بدء تنفيذ الخطة المعتمدة، والتي تشمل العمل على تحقيق التسليمات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• تعريف المشروع وإنشاء ميثاق المشروع: يتم قبل مرحلة التخطيط.\n• ضمان اكتمال جميع التسليمات: هذا جزء من المراقبة والإغلاق وليس بداية التنفيذ.\n• معالجة المخاطر: يتم بشكل مستمر لكن ليس كخطوة أولى مباشرة بعد التخطيط.",
      "choices": [
        {
          "text": "تعريف المشروع وإنشاء ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ خطة المشروع.",
          "correct": true
        },
        {
          "text": "ضمان اكتمال جميع التسليمات.",
          "correct": false
        },
        {
          "text": "معالجة المخاطر لضمان بقاء المشروع على المسار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع على تطوير وإطلاق منتج جديد. وامتثالًا لإرشادات مكتب إدارة المشاريع (PMO)، يجب على مدير المشروع التأكد من إعداد خطة تحقيق الفوائد التي توضح القيمة التجارية التي سيتم تسليمها. وهو يقوم حاليًا بتوثيق الأدوار والمسؤوليات في شكل مخطط RACI. من هو المسؤول عن ضمان تحقيق المشروع لقيمة للمنظمة؟",
      "explanation": "الإجابة الصحيحة: راعي المشروع.\n\n- لماذا هذا هو الخيار الصحيح؟\nلأن راعي المشروع هو صاحب السلطة في المشروع والمسؤول عن ربط المشروع بأهداف العمل وضمان تحقيق العائد المتوقع. مدير المشروع يدير التنفيذ، لكن ضمان القيمة يقع ضمن مسؤوليات الراعي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n• مدير المشروع: يدير التنفيذ والتسليم لكنه ليس صاحب القرار في القيم التجارية.\n• مهندس الحلول: مسؤول عن الجانب الفني وليس القيم التجارية.\n• لجنة التوجيه: تراقب وتدعم ولكن لا تتحمل المسؤولية المباشرة مثل الراعي.",
      "choices": [
        {
          "text": "راعي المشروع",
          "correct": true
        },
        {
          "text": "مدير المشروع",
          "correct": false
        },
        {
          "text": "مهندس الحلول",
          "correct": false
        },
        {
          "text": "لجنة التوجيه",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد مراجعة تقرير استثناء القيمة المكتسبة للمشروع، لاحظ مدير المشروع أن هناك مهمتين تم الإبلاغ عنهما بأنهما تمتلكان مؤشر أداء التكلفة (CPI) قدره 0.5. ما هو الاستنتاج الصحيح الذي يجب أن يستخلصه مدير المشروع من هذا التقرير؟",
      "explanation": "الإجابة الصحيحة: كل مهمة أنفقت ضعف المبلغ المخصص لها في هذه المرحلة.\n\n- شرح مفصل:\nمؤشر أداء التكلفة (CPI) هو نسبة القيمة المكتسبة إلى التكلفة الفعلية. مؤشر CPI بقيمة 0.5 يعني أن المشروع يحصل على نصف القيمة مقابل كل وحدة من التكلفة، أي أن التكلفة الفعلية مرتفعة مقارنة بالقيمة المكتسبة. بعبارة أخرى، يتم إنفاق ضعف الميزانية المقررة.\n\n- سبب خطأ الخيارات الأخرى:\n• نصف الميزانية التي يجب إنفاقها أو نصف المبلغ المخصص: تعني CPI > 1، وليس 0.5.\n• ربع الميزانية: تعني CPI = 0.25، أقل من 0.5.",
      "choices": [
        {
          "text": "كل مهمة أنفقت ضعف المبلغ المخصص لها في هذه المرحلة.",
          "correct": true
        },
        {
          "text": "كل مهمة أنفقت نصف الميزانية التي يجب أن تنفقها في هذه المرحلة.",
          "correct": false
        },
        {
          "text": "كل مهمة أنفقت نصف المبلغ المخصص لها في هذه المرحلة.",
          "correct": false
        },
        {
          "text": "كل مهمة أنفقت ربع الميزانية التي كان ينبغي إنفاقها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع للمشروع، تم إعلام مدير المشروع أن أعضاء الفريق يجدون صعوبة كبيرة في التحقق من التسليمات المكتملة من حيث المطابقة نظرًا لعدم وجود مستندات مرجعية تحتوي على معلومات المواصفات واحتياجات العميل ذات الصلة. قرر الفريق توثيق معايير قبول واضحة لمعالجة هذا الأمر. ما هو المستند الذي يمكن استخدامه لتحديد وربط احتياجات العميل المحددة في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: مصفوفة تتبع المتطلبات (Requirement traceability matrix).\n\n- شرح مفصل:\nمصفوفة تتبع المتطلبات هي أداة تربط متطلبات العميل مع التسليمات أو المنتجات أو الاختبارات لضمان تحقق كل متطلب. تساعد في متابعة تلبية كل حاجة والتأكد من عدم فقد أي متطلب.\n\n- سبب خطأ الخيارات الأخرى:\n• دراسة الجدوى: توضح سبب المشروع ولا توثق متطلبات.\n• ميثاق المشروع: يحدد أهداف المشروع لكنه لا يحتوي على تفاصيل المتطلبات.\n• مصفوفة تعيين المسؤوليات: تحدد من المسؤول عن ماذا لكنها لا تحدد متطلبات العميل.",
      "choices": [
        {
          "text": "دراسة الجدوى (Business case)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project charter)",
          "correct": false
        },
        {
          "text": "مصفوفة تتبع المتطلبات (Requirement traceability matrix)",
          "correct": true
        },
        {
          "text": "مصفوفة تعيين المسؤوليات (Responsibility assignment matrix)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع مشروعًا معقدًا مع أصحاب مصلحة متنوعين وبيئة تنظيمية صارمة. يواجه فريق المشروع صعوبة في تحقيق الالتزام باستمرار مع عمليات المشروع، مما يؤدي إلى تأخيرات وإعادة عمل. ما الذي يجب على مدير المشروع فعله لتحفيز الفريق بفعالية على الالتزام بعمليات المشروع؟",
      "explanation": "الإجابة الصحيحة: تنظيم ورش عمل للفريق لتحديد ومعالجة تحديات الامتثال بشكل تعاوني.\n\n- شرح مفصل:\nتحفيز الفريق على الالتزام بعمليات المشروع يتطلب إشراكهم في فهم التحديات والعمل على حلها بشكل مشترك، مما يعزز المسؤولية المشتركة ويقلل المقاومة. ورش العمل التعاونية تساعد على بناء فهم مشترك وتحفيز الفريق على الالتزام.\n\n- سبب خطأ الخيارات الأخرى:\n• تقديم مكافآت فردية: قد يكون تحفيزًا مؤقتًا لكنه لا يحل جذور المشكلة.\n• نظام تدقيق متكرر: قد يسبب توترًا ويزيد المقاومة.\n• تطوير رؤية مقنعة: مهم لكنه غير كافٍ وحده بدون مشاركة الفريق في الحلول.",
      "choices": [
        {
          "text": "تقديم مكافآت فردية بناءً على الأداء عند تجاوز أهداف الالتزام.",
          "correct": false
        },
        {
          "text": "تنفيذ نظام تدقيق وفحص متكرر للامتثال.",
          "correct": false
        },
        {
          "text": "تطوير وتوصيل رؤية مقنعة وأسباب منطقية لأهداف المشروع الكلية.",
          "correct": false
        },
        {
          "text": "تنظيم ورش عمل للفريق لتحديد ومعالجة تحديات الامتثال بشكل تعاوني.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى فريق المشروع مؤخرًا إنجاز مرحلة رئيسية مهمة، وهو الآن على المسار الصحيح لتسليم المشروع قبل الموعد النهائي. يرغب مدير المشروع في استخدام المكافآت للحفاظ على تماسك الفريق ورفع الإنتاجية. أي نوع من المكافآت التالية من شأنه تحسين تماسك الفريق والإنتاجية لما تبقى من المشروع؟",
      "explanation": "الإجابة الصحيحة: تقديم مكافأة جماعية لجميع المشاركين في المشروع للحفاظ على الإنتاجية والتماسك.\n\n- شرح مفصل:\nالمكافآت الجماعية تعزز روح الفريق وتشجع الجميع على العمل بتعاون للحفاظ على الأداء العالي. إنها تحفز الأعضاء على دعم بعضهم البعض وتبني بيئة عمل إيجابية، ما يزيد من تماسك الفريق وإنتاجيته.\n\n- سبب خطأ الخيارات الأخرى:\n• مكافآت لقادة الفرق فقط قد تُشعر بقية الأعضاء بالتهميش وتقلل الحافز.\n• المكافآت الفردية للأكثر إنتاجية قد تخلق تنافسًا سلبيًا وتفكك الفريق.\n• مكافآت للأعضاء المتعثرين فقط قد تُشجع الاعتماد على المكافآت بدلاً من تطوير الأداء العام.",
      "choices": [
        {
          "text": "تقديم مكافأة جماعية لجميع المشاركين في المشروع للحفاظ على الإنتاجية والتماسك.",
          "correct": true
        },
        {
          "text": "تقديم مكافآت لقادة الفرق فقط ليقودوا فرقهم بشكل أكثر إنتاجية وتماسكًا.",
          "correct": false
        },
        {
          "text": "تقديم مكافآت فردية للأعضاء الأكثر إنتاجية للحفاظ على الأداء والتماسك.",
          "correct": false
        },
        {
          "text": "تقديم مكافآت فردية فقط للأعضاء المتعثرين لتحفيزهم على تحسين الأداء والتماسك.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين عضو جديد في الفريق لمشروع جديد وسيتعين عليه تقديم تقارير حول تقدم جميع مهام المشروع إلى مدير المشروع، بينما سيكون مديره الوظيفي الحالي مسؤولاً عن نموه وتطوره المهني. ما هو الهيكل التنظيمي الذي يصف هذا السيناريو؟",
      "explanation": "الإجابة الصحيحة: مصفوفي (Matrix).\n\n- شرح مفصل:\nفي الهيكل المصفوفي، يمتلك الموظف مديرًا وظيفيًا مسؤولاً عن تطويره المهني، ومدير مشروع مسؤول عن مهامه المتعلقة بالمشروع. هذا النموذج يسمح بمشاركة الموارد بين المشاريع والإدارات، ويوفر مرونة أكبر في تخصيص الموارد.\n\n- سبب خطأ الخيارات الأخرى:\n• الهيكل الوظيفي: يكون للموظف مدير وظيفي فقط ولا يكون هناك مدير مشروع.\n• الهيكل المشروع بحت: الموظفون ينتمون فقط للمشاريع ولا توجد مدراء وظيفيون.\n• الهيكل متقاطع الوظائف: يشير إلى فرق متعددة الوظائف تعمل بشكل مشترك، لكنه ليس هيكلًا تنظيميًا رسميًا.",
      "choices": [
        {
          "text": "مصفوفي (Matrix)",
          "correct": true
        },
        {
          "text": "مشروع بحت (Projectised)",
          "correct": false
        },
        {
          "text": "وظيفي (Functional)",
          "correct": false
        },
        {
          "text": "متقاطع الوظائف (Cross-functional)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق Agile على مشروع تطوير منتج جديد. طلب مالك المنتج تغييرًا جديدًا ليتماشى مع متطلبات التكنولوجيا الحديثة الناتجة عن تغيرات في السوق. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: ضمان إضافة طلب التغيير إلى قائمة الأعمال المتراكمة (Backlog).\n\n- شرح مفصل:\nفي منهجية Agile، يتم التعامل مع طلبات التغيير عن طريق إضافتها إلى Backlog ليتم تقييمها وأولويتها ضمن التكرارات القادمة. هذا يسمح بالمرونة وإدارة التغيير بشكل منظم دون تعطيل سير العمل الحالي.\n\n- سبب خطأ الخيارات الأخرى:\n• تنفيذ التغيير فورًا: قد يسبب تعطيل التخطيط الحالي ويفقد السيطرة على الأولويات.\n• تسجيل طلب تغيير وإنشاء مجلس إدارة: هذا الأسلوب ينتمي إلى منهجيات تقليدية وليس Agile.\n• رفض التغيير: يتعارض مع مبدأ Agile في التكيف مع التغيير لتحقيق القيمة.",
      "choices": [
        {
          "text": "تنفيذ التغيير فورًا.",
          "correct": false
        },
        {
          "text": "تسجيل طلب تغيير وإنشاء مجلس إدارة لتقييم التغيير.",
          "correct": false
        },
        {
          "text": "ضمان إضافة طلب التغيير إلى قائمة الأعمال المتراكمة (Backlog).",
          "correct": true
        },
        {
          "text": "رفض التغيير لأنه قد يزيد من التكاليف ويؤخر المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع مع فريق Agile على تسليم المشروع. أثناء التخطيط، على ماذا يجب أن يركز الفريق لضمان تحقيق أهداف المشروع؟",
      "explanation": "الإجابة الصحيحة: ترتيب تقييم التسليم كخطوة نهائية لضمان الجودة.\n\n- شرح مفصل:\nفي بيئة Agile، يُعتبر ضمان جودة التسليمات من أولويات الفريق. ترتيب تقييم التسليم كخطوة نهائية يضمن أن جميع المتطلبات والقصص قد تم تحقيقها وفقًا لمعايير الجودة المتفق عليها قبل تسليم المنتج أو الميزات للعميل أو المستخدم النهائي.\n\n- سبب خطأ الخيارات الأخرى:\n• تنظيم ورش عمل مع أصحاب المصلحة وفريق المشروع هو أمر مهم ولكنه جزء من عمليات التواصل ولا يضمن وحده تحقيق أهداف المشروع.\n• التحقق من توقيع مالك المنتج على جميع قصص المستخدم هو إجراء إداري لكنه لا يغطي جودة التسليم أو تحقيق الهدف الكامل.\n• التأكد من وجود تعريف للانتهاء (DoD) في كل قصة مستخدم مهم، لكنه جزء من مرحلة التطوير وليس ضمانًا نهائيًا لتحقيق أهداف المشروع بالكامل.",
      "choices": [
        {
          "text": "تنظيم ورش عمل مع أصحاب المصلحة من الأعمال وفريق المشروع.",
          "correct": false
        },
        {
          "text": "التحقق من توقيع مالك المنتج على جميع قصص المستخدم.",
          "correct": false
        },
        {
          "text": "التحقق من أن كل قصة مستخدم تحتوي على تعريف للانتهاء (DoD).",
          "correct": false
        },
        {
          "text": "ترتيب تقييم التسليم كخطوة نهائية لضمان الجودة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتطلب مشروع معقد يضم عدة أصحاب مصلحة ذوي أولويات متباينة مفاوضات طويلة وصعبة لإنهاء اتفاقية المشروع. يجب على مدير المشروع تسهيل وضع الأولويات الصحيحة لهذه المفاوضات الحاسمة. ما هو أول إجراء يجب أن يقوم به مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تحديد معايير نجاح واضحة للمشروع.\n\n- شرح مفصل:\nقبل الدخول في مفاوضات معقدة بين أصحاب المصلحة، من الضروري أن يحدد مدير المشروع معايير واضحة لنجاح المشروع تتفق عليها الأطراف المعنية. هذه المعايير تعمل كمرجع لتوجيه النقاشات وتساعد في تحديد الأولويات الحاسمة التي تحقق مصلحة المشروع ككل.\n\n- سبب خطأ الخيارات الأخرى:\n• تطوير سجل مفصل للمخاطر هو أمر هام لكنه يأتي لاحقًا ولا يحل نزاعات الأولويات.\n• تنظيم جلسة عصف ذهني مع جميع أصحاب المصلحة قد يكون مفيدًا لكنه قد لا يكون الخطوة الأولى قبل وضع معايير واضحة للنجاح.\n• إجراء مقابلات فردية مع أصحاب المصلحة يمكن أن يوفر رؤى، لكنه لا يغني عن تحديد معايير النجاح بشكل واضح ومشترك.",
      "choices": [
        {
          "text": "تطوير سجل مفصل للمخاطر.",
          "correct": false
        },
        {
          "text": "تنظيم جلسة عصف ذهني مع جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد معايير نجاح واضحة للمشروع.",
          "correct": true
        },
        {
          "text": "إجراء مقابلات فردية مع أصحاب المصلحة الرئيسيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متضاربة. ما الذي يجب أن يفعله مدير المشروع فيما يتعلق بأصحاب المصلحة لتحقيق نتيجة أفضل للمشروع؟",
      "explanation": "الإجابة الصحيحة: تحديد والسعي إلى توافق أصحاب المصلحة حول أهداف المشروع وتسليمه.\n\n- شرح مفصل:\nفي المشاريع المعقدة حيث تتباين الأولويات، من الضروري أن يقوم مدير المشروع بتوحيد وجهات النظر من خلال التوافق على الأهداف الأساسية للمشروع. هذا التوافق يقلل من النزاعات ويضمن أن جميع أصحاب المصلحة يعملون لتحقيق نفس الأهداف، مما يحسن فرص نجاح المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n• الحفاظ على العلاقات والتفاهم مهم ولكنه لا يكفي بدون توافق فعلي حول الأهداف.\n• تلبية المصالح الشخصية قد تؤدي إلى تنازلات قد تضر بالمشروع.\n• تشجيع أصحاب المصلحة على قبول وجهة نظر واحدة قد يثير مقاومة ويزيد النزاعات بدلاً من التوافق.",
      "choices": [
        {
          "text": "تحديد والسعي إلى توافق أصحاب المصلحة حول أهداف المشروع وتسليمه.",
          "correct": true
        },
        {
          "text": "الحفاظ على العلاقات والتفاهم مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تلبية المصالح الشخصية لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تشجيع أصحاب المصلحة على قبول وجهة النظر المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متنافسة. خلال اجتماع مع أصحاب المصلحة، أجرى مدير المشروع جلسة عصف ذهني لتسهيل الوصول إلى توافق. ما الذي فعله مدير المشروع لتحقيق حالة من التوافق العام؟",
      "explanation": "الإجابة الصحيحة: ركز على إيجاد حل يلبي احتياجات أصحاب المصلحة.\n\nشرح مفصل:\nركز مدير المشروع على إيجاد حل يلبي احتياجات جميع أصحاب المصلحة لتحقيق توافق عام. هذا النهج يضمن تقبل الجميع للنتائج ويقلل من النزاعات، مما يدعم نجاح المشروع.\n\nسبب خطأ الخيارات الأخرى:\nركز على الحفاظ على العلاقات والتفاهم مهم لكنه لا يكفي بدون إيجاد حلول عملية.\nركز على تلبية المصالح الشخصية قد يؤدي إلى نتائج غير متوازنة وتفضيل بعض الأطراف على حساب المشروع.\nركز على دفع أصحاب المصلحة لقبول الرؤية المقترحة قد يخلق مقاومة ونزاعات بدلًا من التوافق.",
      "choices": [
        {
          "text": "ركز على الحفاظ على العلاقات والتفاهم مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "ركز على إيجاد حل يلبي احتياجات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "ركز على تلبية المصالح الشخصية لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "ركز على دفع أصحاب المصلحة لقبول الرؤية المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع معقد يتطلب خبرة في مهارات التفاوض. ما الذي يجب أن يفعله مدير المشروع لإقناع أصحاب المصلحة بقبول وجهة النظر المقترحة؟",
      "explanation": "الإجابة الصحيحة: فهم أسباب عدم الاتفاق المحتملة.\n\nشرح مفصل:\nلفهم أسباب عدم الاتفاق المحتملة يسمح لمدير المشروع بمعالجة المخاوف الحقيقية لأصحاب المصلحة، وبناء حوار فعال يؤدي إلى قبول وجهة النظر المقترحة.\n\nسبب خطأ الخيارات الأخرى:\nمناقشة دراسة الجدوى وحدها قد لا تكون كافية لإقناع الجميع.\nتحديد الجدول الزمني والتدابير الاحتياطية مهم لكن لا يعالج أسباب الخلاف.\nتقييم مخاطر فشل التفاوض مهم لكن لا يحل الخلافات القائمة.",
      "choices": [
        {
          "text": "مناقشة دراسة الجدوى الخاصة بالمشروع.",
          "correct": false
        },
        {
          "text": "تحديد الجدول الزمني والتدابير الاحتياطية.",
          "correct": false
        },
        {
          "text": "فهم أسباب عدم الاتفاق المحتملة.",
          "correct": true
        },
        {
          "text": "تقييم مخاطر فشل التفاوض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق المشروع بكتابة الدروس المستفادة في نهاية السبرينت. وقد صرحوا بوضوح برغبتهم في تحسين خبراتهم باستخدام نهج الاستعراض (Retrospective). بناءً على ميثاق الأجايل، على ماذا يجب أن يركز الفريق؟",
      "explanation": "الإجابة الصحيحة: الحوار.\n\nشرح مفصل:\nنهج الاستعراض في الأجايل يركز على الحوار المفتوح بين أعضاء الفريق لمناقشة النجاحات والتحديات بهدف التحسين المستمر.\n\nسبب خطأ الخيارات الأخرى:\nالتنافس والجدال والدفاع قد يعيقون التواصل الفعال ويزيدون النزاعات بدلًا من تعزيز التعاون والتحسين.",
      "choices": [
        {
          "text": "التنافس",
          "correct": false
        },
        {
          "text": "الجدال",
          "correct": false
        },
        {
          "text": "الدفاع",
          "correct": false
        },
        {
          "text": "الحوار",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يساعد مدير مشروع منظمته على الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الأجايل. اشتكى فريق القيادة من أن الإنتاجية انخفضت منذ تنفيذ طرق الأجايل. كيف يجب أن يرد مدير المشروع على هذا القلق؟",
      "explanation": "الإجابة الصحيحة: يشرح أن انخفاض الإنتاجية أمر متوقع في البداية أثناء محاولة الفرق فهم الأجايل والتأقلم معها.\n\nشرح مفصل:\nعند الانتقال إلى طرق أجايل، من الطبيعي أن تواجه الفرق انخفاضًا مؤقتًا في الإنتاجية نتيجة للتكيف مع الأساليب الجديدة وأسلوب العمل المختلف. هذا التحدي يكون مؤقتًا، ومع مرور الوقت وتحسن الخبرة، تعود الإنتاجية للارتفاع.\n\nسبب خطأ الخيارات الأخرى:\nطلب تفسير سبب الانخفاض قد يخلق ضغطًا غير ضروري.\nفرض سبرينت موحد على المؤسسة بأكملها قد لا يكون مناسبًا لجميع الفرق.\nالتوقف عن تطبيق الأجايل بسبب الإحباط يمنع الاستفادة من الفوائد طويلة الأمد للمنهجية.",
      "choices": [
        {
          "text": "يطلب من جميع قادة الفرق تفسير سبب انخفاض الإنتاجية منذ بدء تنفيذ الأجايل.",
          "correct": false
        },
        {
          "text": "يشرح أن انخفاض الإنتاجية أمر متوقع في البداية أثناء محاولة الفرق فهم الأجايل والتأقلم معها.",
          "correct": true
        },
        {
          "text": "يفرض سبرينت لمدة أسبوعين على مستوى المؤسسة بأكملها لتوحيد وتيرة التسليم.",
          "correct": false
        },
        {
          "text": "يتوقف عن تطبيق الأجايل إذا لم تُحقق تحسينات وكانت الفرق تشعر بالإحباط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام منهج أجايل. يسأل الراعي ما إذا كان من الممكن استخدام عقد بسعر ثابت بدلاً من عقد زمني ومادي مع العميل. يحتاج العميل إلى عقد بسعر ثابت لتلبية أهدافه التجارية. ما هو الرد المناسب من مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: يوافق على استخدام عقد بسعر ثابت لأن الأجايل لا تمنع ذلك.\n\nشرح مفصل:\nمنهجية الأجايل مرنة بما يكفي لتُستخدم مع عقود بسعر ثابت، طالما تم الاتفاق على التوقعات والنطاق بوضوح. الأجايل تركز على التعاون والتكيف، لكن لا تمنع استخدام أنواع مختلفة من العقود.\n\nسبب خطأ الخيارات الأخرى:\nقول أن الأجايل لا تدعم العقود بسعر ثابت غير صحيح.\nالتركيز فقط على العقود الزمنية والمادية يختزل قدرة الأجايل على التكيف.\nإجبار العميل على عقد زمني ومادي قد يخلق توترات غير ضرورية.",
      "choices": [
        {
          "text": "يُبلغ العميل أن الأجايل لا تدعم العقود بسعر ثابت لأنها تفضل التعاون على التفاوض.",
          "correct": false
        },
        {
          "text": "يُبلغ العميل أن الأجايل تدعم فقط العقود الزمنية والمادية لأن النطاق غير ثابت.",
          "correct": false
        },
        {
          "text": "يوافق على استخدام عقد بسعر ثابت لأن الأجايل لا تمنع ذلك.",
          "correct": true
        },
        {
          "text": "يؤثر على العميل لاستخدام عقد زمني ومادي لأن مخاطر التكلفة تقع على عاتق العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يترك مدير المشروع الحالي المشروع ويتم استبداله بمدير مشروع جديد. ما هو أول إجراء يجب على المدير الجديد اتخاذه لضمان نجاح المشروع؟",
      "explanation": "الإجابة الصحيحة: التعرف على أهداف المشروع كما هي محددة في ميثاق المشروع.\n\nشرح مفصل:\nفهم أهداف المشروع من ميثاق المشروع هو الأساس لفهم نطاق وغايات المشروع وضمان استمرار العمل بشكل صحيح. هذه الخطوة تساعد المدير الجديد على اتخاذ قرارات مستنيرة ومتابعة سير المشروع.\n\nسبب خطأ الخيارات الأخرى:\nاستشارة سجل المشكلات والدروس المستفادة مهمة لكنها تأتي بعد فهم الأهداف الأساسية.\nتعديل الجدول والميزانية يجب أن يتم بناءً على فهم كامل للمشروع.\nالاجتماع مع أصحاب المصلحة مهم لكنه ليس الخطوة الأولى دون فهم الأهداف.",
      "choices": [
        {
          "text": "التعرف على أهداف المشروع كما هي محددة في ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "استشارة سجل المشكلات وسجل الدروس المستفادة الذي يحتفظ به المدير السابق.",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني والميزانية لتضمين أنشطة نقل المعرفة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة الرئيسيين وتحديث استراتيجية التواصل حسب الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "علم مدير المشروع أن قانونًا جديدًا سيدخل حيز التنفيذ وسينظم نوع المنتجات التي يمكن للشركة تصنيعها. تخطط الشركة لإطلاق منتج جديد في الأسابيع القادمة لا يتوافق مع اللوائح الجديدة. اجتمع مدير المشروع مع الراعي وأصحاب المصلحة لمناقشة التغييرات. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تحديث ميثاق المشروع ليعكس نتائج الاجتماع.\n\nشرح مفصل:\nبعد اجتماع مع الراعي وأصحاب المصلحة حول تغييرات تنظيمية تؤثر على المشروع، يجب تحديث ميثاق المشروع ليعكس التغيرات في نطاق وأهداف المشروع. هذا يضمن توثيق رسمي للتعديلات التي تم الاتفاق عليها ويوجه المشروع وفق اللوائح الجديدة.\n\nسبب خطأ الخيارات الأخرى:\nتخطيط الإطلاق بدون تعديل قد يؤدي إلى تعارض مع اللوائح.\nتعديل المنتج فقط دون تحديث الميثاق يفتقد للتوثيق الرسمي.\nإلغاء الإطلاق قد يكون قرارًا مبكرًا قبل تقييم البدائل.",
      "choices": [
        {
          "text": "تحديث ميثاق المشروع ليعكس نتائج الاجتماع.",
          "correct": true
        },
        {
          "text": "تخطيط لإطلاق المنتج في الوقت المحدد دون تعديل وتحديث خطة إدارة المخاطر فقط.",
          "correct": false
        },
        {
          "text": "تخطيط لتعديل المنتج للامتثال للأنظمة الجديدة قبل دخول القانون حيز التنفيذ.",
          "correct": false
        },
        {
          "text": "نصح الراعي وأصحاب المصلحة بإلغاء الإطلاق حتى يتم تعديل المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير المشروع إلى مقارنة فعالية الإجراءات التصحيحية المتخذة خلال المشروع الحالي مع الإجراءات المتخذة في مشروع مماثل من أجل توليد أفكار للتحسين. ما الأداة التي يجب أن يستخدمها مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: المقارنة المعيارية (Benchmarking).\n\nشرح مفصل:\nالمقارنة المعيارية هي أداة تستخدم لمقارنة العمليات أو النتائج الحالية مع أفضل الممارسات في مشاريع أو مؤسسات أخرى مماثلة بهدف تحديد مجالات التحسين وتوليد أفكار جديدة.\n\nسبب خطأ الخيارات الأخرى:\nتحليل العمليات يركز على العمليات الداخلية وليس المقارنة مع مشاريع أخرى.\nالحكم الخبير يعتمد على آراء الخبراء وليس مقارنة مباشرة.\nتدقيق الجودة يركز على التوافق مع المعايير ولا يقارن الأداء مع مشاريع أخرى.",
      "choices": [
        {
          "text": "تحليل العمليات",
          "correct": false
        },
        {
          "text": "الحكم الخبير",
          "correct": false
        },
        {
          "text": "المقارنة المعيارية (Benchmarking)",
          "correct": true
        },
        {
          "text": "تدقيق الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا باستخدام منهج أجايل. يذكر مهندس معماري ذو خبرة ضمن الفريق أنه من المهم إنشاء وثيقة تصميم حل مفصلة مسبقًا بناءً على تعقيد المشروع. أحد أعضاء الفريق يقول إن ذلك يخالف مبادئ الأجايل التي تعارض التوثيق المسبق. كيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: السماح للمهندس بإنشاء وثيقة التصميم المفصلة مسبقًا حسب متطلبات المشروع.\n\nشرح مفصل:\nالأجايل تشجع على التوثيق المناسب والحاجي فقط الذي يخدم الفريق والمشروع، وليس التوثيق المفرط. إذا كان تعقيد المشروع يتطلب وثيقة تصميم مفصلة لضمان جودة الحل، يجب التكيف مع ذلك بدلاً من فرض قواعد أجايل بشكل جامد.\n\nسبب خطأ الخيارات الأخرى:\nالتدريب قد يكون مفيدًا لكن لا يحل النزاع بالضرورة.\nطلب إنشاء التصميم على مراحل قد يعقد الأمور.\nطلب التوجيه من الراعي بسبب اختلاف فهم الأجايل قد يعرقل التقدم.",
      "choices": [
        {
          "text": "تقديم تدريب حول الأجايل للمهندس والعمل مع الفريق على حل النزاع.",
          "correct": false
        },
        {
          "text": "السماح للمهندس بإنشاء وثيقة التصميم المفصلة مسبقًا حسب متطلبات المشروع.",
          "correct": true
        },
        {
          "text": "الاتفاق مع عضو الفريق وطلب من المهندس إنشاء التصميم على مراحل بمرور الوقت.",
          "correct": false
        },
        {
          "text": "طلب التوجيه من الراعي لأن الأجايل لا تدعم التوثيق الشامل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا يعتمد على بائع معين. يعتمد فريق المشروع على هذا البائع لإكمال بعض الأعمال أولاً، لكن البائع يفشل باستمرار في تسليم الأعمال في الوقت المحدد. كيف يجب على مدير المشروع التخفيف من هذا الخطر؟",
      "explanation": "الإجابة الصحيحة: إنشاء جدول مشروع متكامل مع البائع وعقد نقاط تحقق منتظمة معه.\n\n- شرح مفصل:\nعندما يعتمد المشروع على طرف خارجي (بائع) وهناك تكرار في التأخر عن التسليمات، فإن أنسب إجراء حسب دليل PMBOK هو دمج جداول العمل مع البائع وعمل نقاط تحقق دورية. هذا يتيح متابعة الأداء والتأكد من الالتزام بالمواعيد بمرونة أكثر، كما يعزز التواصل ويقلل احتمالية التأخير دون علم مدير المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n• إضافة احتياطي زمني فقط قد يغطي التأخير لكنه لا يعالج المشكلة الأساسية.\n• استبعاد البائع مباشرة دون تقييم البدائل قد يؤدي إلى تأخير أكبر وتكاليف إضافية.\n• طلب إضافة موارد من البائع لا يضمن حلاً مستدامًا إذا لم تتم متابعة العمل بنظام وتنسيق.",
      "choices": [
        {
          "text": "إنشاء جدول مشروع متكامل مع البائع وعقد نقاط تحقق منتظمة معه.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة الراعي لإضافة احتياطي زمني وإبلاغ البائع بذلك.",
          "correct": false
        },
        {
          "text": "استبعاد هذا البائع فورًا وبدء عملية طلب العروض لاختيار بائع جديد.",
          "correct": false
        },
        {
          "text": "طلب من البائع إضافة موارد جديدة والموافقة على العمل الإضافي للموارد الحالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا حيث تم التعاقد مع بائع بموجب عقد بسعر ثابت. على الرغم من أن متطلبات المشروع والجدول الزمني قد تم تحديدها بوضوح ومشاركتها مع البائع، إلا أن الراعي قلق بشأن تجاوز التكاليف. كيف يجب أن يرد مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إبلاغ الراعي أن خطر تجاوز التكاليف قد تم نقله إلى البائع.\n\n- شرح مفصل:\nفي العقود ذات السعر الثابت (Fixed Price Contract)، يتحمل البائع مسؤولية تحمل التكاليف الإضافية إذا تجاوز العمل المتفق عليه القيمة المحددة في العقد. حسب PMP، هذا النوع من العقود يُستخدم لتثبيت التكلفة وتقليل المخاطر المالية على صاحب المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n• مناقشة المسألة مع الفريق لا تفيد لأن الخطر ليس داخليًا بل مرتبط بالعقد.\n• طلب تمويل احتياطي يُخالف طبيعة عقد السعر الثابت.\n• إصدار طلب عروض جديد غير مبرر طالما البائع ملتزم قانونيًا بالعقد.",
      "choices": [
        {
          "text": "إبلاغ الراعي أن خطر تجاوز التكاليف قد تم نقله إلى البائع.",
          "correct": true
        },
        {
          "text": "مناقشة هذه المسألة في الاجتماع القادم مع الفريق وطلب ملاحظاتهم.",
          "correct": false
        },
        {
          "text": "طلب تمويل احتياطي من الراعي لتخفيف الخطر.",
          "correct": false
        },
        {
          "text": "إصدار طلب عروض لتحديد بائعين بديلين في حال تطور الأمر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يحتاج مدير المشروع إلى التعاقد مع مزود لخدمة مشروع حكومي كبير. تنص إرشادات المشروع على ضرورة حصول جميع المزودين المحتملين على نفس الفهم لعملية الشراء. ما الذي يجب أن يعقده مدير المشروع لضمان الامتثال للإرشادات؟",
      "explanation": "الإجابة الصحيحة: مؤتمر للمزايدين (Bidder Conference).\n\n- شرح مفصل:\nمؤتمر المزايدين هو اجتماع يتم فيه دعوة جميع الموردين أو البائعين المحتملين للحصول على نفس المعلومات المتعلقة بالمشروع والشراء. هذه العملية تضمن الشفافية والعدالة، وتمنع تقديم عروض مبنية على فهم خاطئ أو غير مكتمل. هذا يُعتبر جزءًا من عمليات إدارة المشتريات حسب PMBOK.\n\n- سبب خطأ الخيارات الأخرى:\n• المفاوضات المباشرة تتعارض مع مبادئ الشفافية في المشاريع الحكومية.\n• الاجتماعات الفردية قد تؤدي لمعلومات غير موحدة بين الموردين.\n• الاجتماع مع فريق الشراء لا يُحقق الهدف الرئيسي، وهو توحيد فهم جميع المزودين.",
      "choices": [
        {
          "text": "مفاوضات مباشرة مع مزودين لمشاريع سابقة مشابهة",
          "correct": false
        },
        {
          "text": "مؤتمر للمزايدين (Bidder Conference)",
          "correct": true
        },
        {
          "text": "اجتماعات فردية مع كل مزود محتمل",
          "correct": false
        },
        {
          "text": "اجتماع افتراضي مع فريق الشراء",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الاستعانة بمورد خارجي لإنتاج مكون رئيسي في مشروع بناء. أبلغ المورد مدير المشروع بأنه بسبب نقص المكونات، سيصل المنتج بكميات متغيرة وعلى جدول تسليم أطول.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: مراجعة شروط تسليم المورد الخارجي كما هو محدد في العقد.\n\n- شرح مفصل:\nفي إدارة المشتريات حسب دليل PMBOK، عندما يُخطر المورد بتغيير في الجدول الزمني أو الكميات، أول إجراء رسمي هو مراجعة بنود العقد لمعرفة ما إذا كان هناك شروط تحدد كيفية التعامل مع مثل هذه الحالات. هذا الإجراء يضمن التصرف وفقًا للالتزامات القانونية المتفق عليها، سواء بفرض عقوبات أو طلب تعديلات رسمية.\n\n- سبب خطأ الخيارات الأخرى:\n• الاجتماع مع الراعي لمناقشة العقوبات خطوة تالية وليس أول خطوة، لأن العقوبات محددة بالعقد.\n• تعديل مراحل المشروع دون مراجعة العقد قد يعرض المشروع لمخاطر قانونية.\n• البحث عن موردين بديلين قبل التأكد من الوضع القانوني مع المورد الحالي يعتبر قفزًا على الإجراءات.",
      "choices": [
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة العقوبات التي يمكن فرضها بسبب التغييرات.",
          "correct": false
        },
        {
          "text": "تعديل مراحل المشروع لتتناسب مع جدول تسليم هذا المكون الحرج.",
          "correct": false
        },
        {
          "text": "مراجعة شروط تسليم المورد الخارجي كما هو محدد في العقد.",
          "correct": true
        },
        {
          "text": "مراجعة خطة الشراء لإجراءات إلغاء العقد أثناء البحث عن موردين بديلين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مورد لتوفير مواد مختلفة لمشروع بناء بموجب عقد بسعر ثابت. وقد استلم المورد جميع الوثائق اللازمة المتعلقة بمعايير المواد والمواصفات. وبموجب العقد، يجب على المورد تسليم جميع المواد إلى موقع البناء في تاريخ محدد.\n\nعندما تصل المواد في الوقت المحدد، لماذا يجب على مدير المشروع إبلاغ فريق الفحص؟",
      "explanation": "الإجابة الصحيحة: لضمان أن المواد تتوافق مع معايير ومواصفات العقد.\n\n- شرح مفصل:\nحتى وإن تم تسليم المواد في الموعد المحدد، وفقًا لمبادئ إدارة الجودة في المشاريع حسب PMBOK، من الضروري التأكد أن هذه المواد مطابقة للمواصفات والعقد. عملية الفحص تضمن أن المورد التزم بالمعايير المطلوبة قبل استخدام المواد في المشروع، مما يمنع إعادة العمل أو المشكلات لاحقًا.\n\n- سبب خطأ الخيارات الأخرى:\n• إبلاغ عضو الفريق بالاستلام ليس كافيًا ولا يغني عن الفحص.\n• قسم المالية يدفع بعد التأكد من جودة المواد، ليس قبله.\n• قسم الشراء قد يُبلغ لاحقًا ولكن الأولوية لفريق الفحص لضمان الجودة أولًا.",
      "choices": [
        {
          "text": "لإبلاغ عضو الفريق المسؤول عن المواد باستلامها.",
          "correct": false
        },
        {
          "text": "لتزويد قسم المالية بالمستندات اللازمة لدفع فاتورة المورد.",
          "correct": false
        },
        {
          "text": "لإبلاغ قسم الشراء بأن العقد قد تم تنفيذه.",
          "correct": false
        },
        {
          "text": "لضمان أن المواد تتوافق مع معايير ومواصفات العقد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "ما الذي قد يدفع القادة إلى تجاهل الإمكانيات القيادية المشتركة ضمن فرقهم؟ (اختر 2)",
      "explanation": "الإجابات الصحيحة: الثقة الزائدة في دورهم الخاص، والخوف من أن يصبحوا غير ضروريين.\n\n- شرح مفصل:\nفي بيئات القيادة الحديثة وخاصة في المشاريع الرشيقة (Agile)، يتم تشجيع توزيع القيادة بين أعضاء الفريق. ومع ذلك، بعض القادة قد يعارضون ذلك:\n\n• الثقة الزائدة في دورهم الخاص تجعل القائد يشعر أنه المصدر الوحيد الصالح للقرارات.\n• الخوف من أن يصبحوا غير ضروريين يدفع البعض لعدم تمكين الفريق، خشية فقدان السيطرة أو الوظيفة.\n\n- سبب خطأ الخيارات الأخرى:\n• توفير الاستقلالية والتحكم هو أحد المبادئ الإيجابية ولا يؤدي لتجاهل الإمكانيات.\n• الثقة بالفريق تعزز القيادة المشتركة ولا تعيقها.",
      "choices": [
        {
          "text": "الثقة الزائدة في دورهم الخاص",
          "correct": true
        },
        {
          "text": "توفير الاستقلالية والتحكم",
          "correct": false
        },
        {
          "text": "الخوف من أن يصبحوا غير ضروريين",
          "correct": true
        },
        {
          "text": "الثقة بالفريق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من التالي يقلل من تعقيد المشروع؟",
      "explanation": "الإجابة الصحيحة: أعضاء الفريق يستخدمون عملية متفق عليها لإنجاز العمل.\n\n- شرح مفصل:\nعندما يتم الاتفاق على عمليات وإجراءات واضحة لإنجاز العمل داخل الفريق، يتم تقليل الغموض وتوحيد طريقة العمل، مما يسهل التنسيق ويقلل الحاجة إلى إعادة العمل أو التدخل لحل خلافات بسبب اختلاف الطرق.\n\n- سبب خطأ الخيارات الأخرى:\n• أعضاء الفريق يعملون ضمن مناطق زمنية مختلفة يزيد من التعقيد بسبب اختلاف التوقيت.\n• وجود مكاتب عالمية متعددة يعني توزيع جغرافي قد يؤدي لصعوبات في التنسيق.\n• تنوع الخلفيات الثقافية يؤدي أحيانًا إلى اختلاف في طرق العمل والتواصل، ما يزيد من التعقيد.",
      "choices": [
        {
          "text": "أعضاء الفريق يعملون ضمن مناطق زمنية مختلفة",
          "correct": false
        },
        {
          "text": "أعضاء الفريق من مكاتب عالمية متعددة",
          "correct": false
        },
        {
          "text": "أعضاء الفريق من خلفيات ثقافية متنوعة",
          "correct": false
        },
        {
          "text": "أعضاء الفريق يستخدمون عملية متفق عليها لإنجاز العمل",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا بيئيًا ويدرك أنه قد فاتته مشاركة أحد أصحاب المصلحة الأجانب المؤثرين. بعد التواصل مع صاحب المصلحة، طلب نسخة من مستندات المشروع بلغته المحلية.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تحديث سجل أصحاب المصلحة.\n\n- شرح مفصل:\nحسب دليل PMBOK، إدارة أصحاب المصلحة تتطلب تحديث سجل أصحاب المصلحة باستمرار عند ظهور معلومات جديدة أو متطلبات خاصة. عندما يطلب صاحب مصلحة وثائق بلغة معينة، فهذا يؤثر على خطة إدارة التواصل والمخاطر، ويجب توثيقه رسميًا.\n\n- سبب خطأ الخيارات الأخرى:\n• تصعيد المشكلة لراعي المشروع غير ضروري في هذه المرحلة.\n• إبلاغ صاحب المصلحة بعدم توفر المستندات بلغة أخرى قد يؤدي لفشل التواصل.\n• تجاهل الطلب يعتبر مخالفة لمبدأ إدارة أصحاب المصلحة.",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ صاحب المصلحة أن المستندات متاحة فقط بلغة المؤسسة المنفذة.",
          "correct": false
        },
        {
          "text": "تحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تجاهل الطلب والاستمرار في العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع معقد يضم موارد من عدة دول. ما الذي يجب أن يقوم به مدير المشروع لضمان وصول الموارد إلى المعلومات التي يحتاجونها؟",
      "explanation": "الإجابة الصحيحة: خطة إدارة الاتصالات.\n\n- شرح مفصل:\nخطة إدارة الاتصالات هي المستند الرئيسي الذي يحدد كيف ومتى وأين تصل المعلومات إلى كل الأطراف المعنية بالمشروع. هذا يشمل قنوات التواصل، وتواتر الاجتماعات، واللغة المستخدمة، والمستندات المشتركة.\n\n- سبب خطأ الخيارات الأخرى:\n• الأصل التنظيمي (OPA) لا يوفر خطة مفصلة للمشروع نفسه.\n• إطار العمل المؤسسي (OPM) يعالج منهجية المنظمة العامة وليس تفاصيل مشروع معين.\n• التركيز الهرمي الأفقي يتعلق ببنية المؤسسة، ولا يعالج تدفق المعلومات تحديدًا.",
      "choices": [
        {
          "text": "أصل تنظيمي (OPA) يعالج ثقافة وهيكل المؤسسة.",
          "correct": false
        },
        {
          "text": "إطار عمل إدارة المشاريع المؤسسية (OPM).",
          "correct": false
        },
        {
          "text": "خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "تركيز هرمي أفقي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكتشف مدير المشروع في مشروع مرن أن فريق المشروع يعاني من مشكلات في التواصل، مما يؤدي إلى تأخيرات أثناء السبرينتات.\n\nما هو أول إجراء يجب على مدير المشروع اتخاذه لحل المشكلة؟",
      "explanation": "الإجابة الصحيحة: تحديث خطة إدارة الاتصالات.\n\n- شرح مفصل:\nفي المشاريع المرنة (Agile)، التواصل هو عنصر أساسي للحفاظ على سير العمل بكفاءة. عندما تظهر مشاكل في التواصل، أول خطوة هي مراجعة وتحديث خطة إدارة الاتصالات لتتوافق مع الواقع الجديد للفريق. هذه الخطة تحدد قنوات التواصل، توقيتها، الأدوات المستخدمة، وأدوار كل شخص.\n\n- سبب خطأ الخيارات الأخرى:\n• مشاركة مخطط الانحدار يساعد على تتبع الأداء، لكنه لا يعالج مشكلة التواصل نفسها.\n• إعداد اجتماعات الوقوف اليومية قد يكون موجودًا مسبقًا، لكن المشكلة هنا أكبر وتتطلب تحديث الخطة كاملة.\n• معالجة المشكلة في الاستعراض الرجعي قد يتأخر كثيرًا، والأولوية هنا لإجراء فوري.",
      "choices": [
        {
          "text": "تحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "مشاركة مخطط الانحدار (burndown chart) مع الفريق.",
          "correct": false
        },
        {
          "text": "إعداد اجتماعات الوقوف اليومية (stand-ups).",
          "correct": false
        },
        {
          "text": "معالجة هذه المشكلة خلال اجتماع الاستعراض الرجعي (retrospective).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بتجميع وثائق المشروع مثل مقاطع الفيديو والصور والصوتيات، لضمان مشاركة الفريق لتجارب المشروع. أين يجب وضع هذه المعلومات؟",
      "explanation": "الإجابة الصحيحة: سجل الدروس المستفادة.\n\n- شرح مفصل:\nسجل الدروس المستفادة (Lessons Learned Register) هو المكان الذي تُجمع فيه كل المعلومات التي قد تفيد الفريق أو مشاريع أخرى مستقبلاً. وهذا يشمل ليس فقط المستندات النصية، بل أيضًا الوسائط مثل الصور والفيديوهات والصوتيات، التي توثق كيفية تنفيذ المشروع وما تم تعلمه.\n\n- سبب خطأ الخيارات الأخرى:\n• سجل مشاركة المعرفة غير معتمد كأداة رسمية في منهجية PMP.\n• سجل المخاطر خاص بالمخاطر فقط، ولا يتضمن هذا النوع من الوثائق.\n• سجل المشكلات يعالج مشكلات المشروع قيد التنفيذ وليس توثيق المعرفة.",
      "choices": [
        {
          "text": "سجل الدروس المستفادة.",
          "correct": true
        },
        {
          "text": "سجل مشاركة المعرفة.",
          "correct": false
        },
        {
          "text": "سجل المخاطر.",
          "correct": false
        },
        {
          "text": "سجل المشكلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع في سوق تنافسي. يجب تكييف المنتج باستمرار بناءً على تغيّرات السوق وتوقعات المستهلكين. يقوم فريق المشروع بتطوير ومشاركة المعرفة الصريحة باستمرار، لكن مدير المشروع يرغب أيضًا في تضمين المعرفة الضمنية.\n\nما هو الأسلوب الذي يجب أن يتبعه الفريق لجمع المعرفة الضمنية؟",
      "explanation": "الإجابة الصحيحة: إنشاء منصة للمستهلكين لمشاركة تجاربهم.\n\n- شرح مفصل:\nالمعرفة الضمنية (Tacit Knowledge) هي المعرفة التي يصعب كتابتها أو توثيقها، مثل تجارب العملاء، والمشاعر، والانطباعات. طريقة فعالة لجمع هذه المعرفة هي من خلال منصات تتيح للمستهلكين مشاركة تجاربهم بشكل مباشر. هذا يمكن أن يشمل منتديات، استطلاعات رأي تفاعلية، أو مراجعات عبر الإنترنت.\n\n- سبب خطأ الخيارات الأخرى:\n• نقل المعرفة في شكل دليل مكتوب يتعلق بالمعرفة الصريحة وليس الضمنية.\n• جلسات التدريب مع شركات خارجية لا تجمع تجارب المستخدمين.\n• مراجعة متواصلة لمتطلبات المنتج وأدائه هي تحليل بيانات، وليست جمع معرفة ضمنية.",
      "choices": [
        {
          "text": "نقل المعرفة في الوقت الفعلي على شكل دليل مكتوب.",
          "correct": false
        },
        {
          "text": "تنظيم جلسات تدريب مع شركة بيانات خارجية.",
          "correct": false
        },
        {
          "text": "مراجعة متواصلة لمتطلبات المنتج وأدائه.",
          "correct": false
        },
        {
          "text": "إنشاء منصة للمستهلكين لمشاركة تجاربهم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي مما يلي لا يُؤخذ بعين الاعتبار خلال إغلاق المشروع أو المرحلة؟",
      "explanation": "الإجابة الصحيحة: التنفيذ السريع (Fast-tracking)\n\n- شرح مفصل:\nأثناء إغلاق المشروع أو المرحلة، يتم التركيز على الأنشطة التي تضمن إنهاء العمل رسميًا مثل الاحتفال بالفريق، مراجعة عوامل النجاح، ونقل المعرفة. أما التنفيذ السريع (Fast-tracking) فهو أسلوب يستخدم أثناء تنفيذ المشروع لتقليل مدة المشروع عبر تداخل الأنشطة، وليس له علاقة بمرحلة الإغلاق.\n\n- سبب خطأ الخيارات الأخرى:\n- أفكار الاحتفال بالفريق: مهمة لتقدير جهود الفريق وتعزيز الروح المعنوية.\n- عوامل النجاح الحرجة: يتم مراجعتها لتقييم مدى تحقيقها.\n- نقل المعرفة: يتم لتوثيق الخبرات والدروس المستفادة.",
      "choices": [
        {
          "text": "أفكار الاحتفال بالفريق.",
          "correct": false
        },
        {
          "text": "عوامل النجاح الحرجة.",
          "correct": false
        },
        {
          "text": "التنفيذ السريع (Fast-tracking).",
          "correct": true
        },
        {
          "text": "نقل المعرفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من التالي يتم تنفيذه في مرحلة إغلاق المشروع/المرحلة؟",
      "explanation": "الإجابة الصحيحة: جدولة وعقد اجتماع للدروس المستفادة\n\n- شرح مفصل:\nاجتماع الدروس المستفادة (Lessons Learned) يتم في مرحلة إغلاق المشروع لجمع الخبرات والمعلومات من جميع المشاركين بهدف تحسين أداء المشاريع المستقبلية.\n\n- سبب خطأ الخيارات الأخرى:\n- اجتماع بدء المشروع: يتم في بداية المشروع.\n- اجتماع مراقبة التغييرات: يتم أثناء تنفيذ المشروع.\n- اجتماع حالة المشروع: يحدث خلال المشروع وليس عند الإغلاق.",
      "choices": [
        {
          "text": "جدولة وعقد اجتماع بدء المشروع.",
          "correct": false
        },
        {
          "text": "جدولة وعقد اجتماع للدروس المستفادة.",
          "correct": true
        },
        {
          "text": "جدولة وعقد اجتماع لمراقبة التغييرات.",
          "correct": false
        },
        {
          "text": "جدولة وعقد اجتماع لحالة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من الخيارات التالية ليس جزءًا من التحقق من الإصدار في مرحلة الانتقال؟",
      "explanation": "الإجابة الصحيحة: تسجيل النشر\n\n- شرح  مفصل:\nالتحقق من الإصدار يركز على التأكد من جودة وتسليم المنتج بشكل صحيح للمستخدم النهائي، بما في ذلك اختبار النشر ومشاركة أصحاب المصلحة واستبيانات رضاهم. أما تسجيل النشر فهو خطوة إدارية تحدث بعد التحقق من الإصدار.\n\n- سبب خطأ الخيارات الأخرى:\n- اختبار النشر: ضروري للتأكد أن النظام يعمل.\n- مشاركة فعالة من أصحاب المصلحة: تضمن قبولهم للمنتج.\n- استبيان رضا أصحاب المصلحة: للتأكد من توافق المنتج مع التوقعات.",
      "choices": [
        {
          "text": "اختبار النشر في بيئة الإنتاج.",
          "correct": false
        },
        {
          "text": "مشاركة فعالة من أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "استبيان رضا أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسجيل النشر.",
          "correct": true
        }
      ]
    }
  ]
}
