{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "في مشروع متعدد التخصصات، يقوم مدير المشروع بتفويض بعض أنشطة إدارة المشروع لعدة أعضاء في الفريق.\n\nما الذي يجب على مدير المشروع القيام به أولاً؟",
      "explanation": "الإجابة الصحيحة: تطوير مصفوفة المسؤوليات (RACI)\n\n- شرح مفصل:\nمصفوفة RACI (Responsible, Accountable, Consulted, Informed) توضح من هو المسؤول، ومن يتحمل المسؤولية، ومن يتم استشارته، ومن يجب إبلاغه بكل مهمة أو نشاط. لذلك، قبل تفويض أي مهام، على مدير المشروع أن يحدد هذه الأدوار بوضوح لتجنب التداخلات وسوء الفهم.\n\n- سبب خطأ الخيارات الأخرى:\n- خطة إدارة الاتصالات: يتم تطويرها لاحقًا بعد تحديد الأدوار.\n- خطة الإرشاد: ليست أولوية في هذه الحالة.\n- هيكل تقسيم العمل: يركز على الأنشطة وليس على الأشخاص والأدوار.",
      "choices": [
        {
          "text": "تطوير خطة إدارة الاتصالات في المشروع وتوزيعها على أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تطوير خطة إرشاد ودمجها في تقرير حالة المشروع.",
          "correct": false
        },
        {
          "text": "تطوير هيكل تقسيم تنظيمي وهيكل تقسيم العمل.",
          "correct": false
        },
        {
          "text": "تطوير مصفوفة المسؤوليات (RACI).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت مؤسسة تستخدم نهجًا تنبؤيًا التحول إلى نهج رشيق (Agile). تعتقد المؤسسة أن هذا سيسمح بتقديم قيمة أكبر للعملاء، وقررت أن تعتمد جميع المشاريع هذا النهج.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق الفوائد؟",
      "explanation": "الإجابة الصحيحة: مواءمة خطة إدارة الفوائد مع سجل المنتج (Product Backlog)\n\n- شرح مفصل:\nفي بيئة Agile، يتم التعبير عن الفوائد والقيمة من خلال سجل المنتج، والذي يمثل قائمة الأولويات التي يجب على الفريق العمل عليها لتلبية احتياجات العملاء. لذلك يجب على مدير المشروع التأكد من أن خطة إدارة الفوائد مرتبطة مباشرة بالعناصر الموجودة في سجل المنتج.\n\n- سبب خطأ الخيارات الأخرى:\n- تقييم الفوائد يوميًا أو في نهاية السباق غير كافٍ بدون وجود مواءمة واضحة.\n- الطلب من سكرم ماستر يوميًا ليس من دوره حسب منهجية Scrum.",
      "choices": [
        {
          "text": "تقييم تحقيق الفوائد أثناء الاجتماعات اليومية للفريق.",
          "correct": false
        },
        {
          "text": "مواءمة خطة إدارة الفوائد مع سجل المنتج (Product Backlog).",
          "correct": true
        },
        {
          "text": "تقييم خطة إدارة الفوائد في نهاية كل سباق (Sprint).",
          "correct": false
        },
        {
          "text": "طلب تحديثات يومية حول تحقيق الفوائد من سكرم ماستر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع بملايين الدولارات وهو قيد التنفيذ. خلال اجتماع حالة المشروع، ذكر أحد أعضاء الفريق أن هناك تأخيرات لأن أحد التنفيذيين لا يستجيب للاتصالات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: استخدام العلاقات للتواصل مع المسؤول التنفيذي والحصول على استجابة\n\n- شرح مفصل:\nفي المشاريع الكبيرة، بناء علاقات جيدة واستخدام شبكة العلاقات يعد أمرًا مهمًا لتسريع اتخاذ القرارات وحل المشكلات. تصعيد المشكلة مباشرة قد يؤثر على العلاقات أو يؤخر الحل، بينما استخدام قنوات غير رسمية أحيانًا يكون أكثر فاعلية.\n\n- سبب خطأ الخيارات الأخرى:\n- إرسال تذكيرات يومية قد يصبح مزعجًا وغير فعال.\n- إزالة المهمة من المسار الحرج يضر بالمشروع.\n- التصعيد يجب أن يكون خطوة لاحقة بعد محاولة حل المشكلة بطرق أخرى.",
      "choices": [
        {
          "text": "إنشاء عملية لإرسال تذكيرات يومية إلى المسؤول التنفيذي.",
          "correct": false
        },
        {
          "text": "إزالة المهمة من المسار الحرج حتى لا تؤثر على الجدول الزمني.",
          "correct": false
        },
        {
          "text": "استخدام العلاقات للتواصل مع المسؤول التنفيذي والحصول على استجابة.",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى مدير المسؤول التنفيذي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في وقت مبكر من المشروع، يدرك مدير المشروع أن أحد أعضاء الفريق الرئيسيين غير مستعد لأداء المهمة الموكلة إليه.\n\nكيف يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: مراجعة متطلبات التدريب مع عضو الفريق.\n\n- شرح مفصل:\nعندما يكتشف مدير المشروع أن أحد أعضاء الفريق غير مستعد، يجب أولاً تحديد السبب ومعالجة الثغرات. مراجعة متطلبات التدريب مع عضو الفريق تساعد على التأكد مما إذا كان يحتاج إلى تدريب إضافي أو موارد داعمة لكي يتمكن من أداء مهمته بفعالية.\n\n- سبب خطأ الخيارات الأخرى:\n- ضمان أن التدريب مدمج في خطة إدارة الموارد: هذا إجراء وقائي يتم خلال التخطيط وليس حلاً مباشرًا للمشكلة الحالية.\n- مراجعة كل مهمة مطلوبة مع عضو الفريق عند بدايتها: هذا قد يكون مفيدًا، لكن لا يعالج مشكلة نقص الاستعداد بشكل مباشر.\n- تصعيد المشكلة إلى المدير الوظيفي للموارد: هذا يعتبر تصعيدًا مبكرًا قبل محاولة معالجة الأمر داخليًا ضمن الفريق.",
      "choices": [
        {
          "text": "ضمان أن التدريب مدمج في خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "مراجعة متطلبات التدريب مع عضو الفريق.",
          "correct": true
        },
        {
          "text": "مراجعة كل مهمة مطلوبة مع عضو الفريق عند بدايتها.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى المدير الوظيفي للموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخطط مدير المشروع لفريق سيبدأ قريبًا العمل على نظام فرعي حرج. تم تحديد بديلين تقنيين لهذا النظام الفرعي، لكن من غير الواضح ما إذا كان أي من البديلين سيؤدي أداءً مرضيًا. سيتعرض المشروع للخطر إذا لم يكن أداء النظام الفرعي جيدًا.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "الإجابة الصحيحة: توجيه الفريق لتقييم وتحليل البدائل للنظام الفرعي.\n\n- شرح مفصل:\nفي الحالات التي توجد فيها بدائل تقنية غير مؤكدة الأداء، فإن الخطوة الأولى التي يجب على مدير المشروع اتخاذها هي توجيه الفريق لتقييم وتحليل هذه البدائل. هذا يشمل إجراء دراسات جدوى، واختبارات أولية (Prototyping) وتحليل المخاطر المتعلقة بكل بديل. هذه المقاربة تمكن مدير المشروع من اتخاذ قرار مستند إلى معلومات واضحة بدلاً من الاعتماد على الافتراضات أو التوقعات.\n\n- سبب خطأ الخيارات الأخرى:\n- إضافة أداء النظام الفرعي إلى سجل القضايا: يتم ذلك لاحقًا إذا تم تأكيد وجود مشكلة فعلية، لكن الآن ما زلنا في مرحلة التقييم.\n- جدولة العمل لأكثر البدائل وعدًا وإضافة احتياطي إداري للبديل الآخر: هذا تصرف متسرع دون وجود تحليل واضح أو بيانات داعمة.\n- إبلاغ أصحاب المصلحة بالمخاطر الكبيرة: يجب أولاً تقييم وتحليل الوضع قبل تصعيده.\n",
      "choices": [
        {
          "text": "توجيه الفريق لتقييم وتحليل البدائل للنظام الفرعي.",
          "correct": true
        },
        {
          "text": "إضافة أداء النظام الفرعي إلى سجل القضايا وتعيين مالك لها.",
          "correct": false
        },
        {
          "text": "جدولة العمل لأكثر البدائل وعدًا وإضافة احتياطي إداري للبديل الآخر.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بالمخاطر الكبيرة التي يشكلها أداء النظام الفرعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواصل أحد أعضاء فريق المشروع تعديل تسليمات زميله خلال كل سباق (Sprint). وقد طلب الزميل من مدير المشروع التدخل.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: التحدث مع عضو الفريق لمعرفة سبب التعديلات.\n\n- شرح مفصل:\nعندما يقوم عضو في الفريق بتعديل عمل زميله بشكل متكرر، فإن أول خطوة يجب أن يقوم بها مدير المشروع هي التحدث مباشرة مع هذا العضو لفهم الدافع وراء تصرفه. قد يكون السبب هو شعوره بوجود مشكلة في الجودة، أو قد يكون هناك سوء تفاهم حول الأدوار والمسؤوليات. فهم الأسباب سيساعد على اتخاذ الإجراءات التصحيحية المناسبة بطريقة تعزز التعاون والثقة بين أعضاء الفريق.\n\n- سبب خطأ الخيارات الأخرى:\n- مناقشة أي قصور في الجودة في التسليم مع الزميل: هذا لا يعالج السبب الأساسي بل يتعامل مع النتيجة فقط.\n- مراجعة أداء كلا العضوين مع مديريهما الوظيفيين: هذا تصعيد غير ضروري في البداية، وقد يؤثر على روح الفريق.\n- التحكم في التنفيذ والتسليم لضمان عدم تغيير التسليمات: هذا قد يعطل سير العمل ويخلق أجواء من عدم الثقة بدلًا من حل المشكلة بشكل جذري.\n",
      "choices": [
        {
          "text": "التحدث مع عضو الفريق لمعرفة سبب التعديلات.",
          "correct": true
        },
        {
          "text": "مناقشة أي قصور في الجودة في التسليم مع الزميل.",
          "correct": false
        },
        {
          "text": "مراجعة أداء كلا العضوين مع مديريهما الوظيفيين.",
          "correct": false
        },
        {
          "text": "التحكم في التنفيذ والتسليم لضمان عدم تغيير التسليمات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة التنفيذ وتم ضم أعضاء جدد إلى الفريق. قبل ضم الأعضاء الجدد، ما الذي يجب على مدير المشروع فعله لتقليل تأثير هذا الإجراء على أداء المشروع؟",
      "explanation": "الإجابة الصحيحة: إجراء جلسة لتحديث الاتفاق الاجتماعي الحالي حول كيفية تعاون الفريق.\n\n- شرح مفصل:\nالاتفاق الاجتماعي (Team Working Agreement) هو مجموعة القواعد والسلوكيات التي يتفق عليها الفريق لضمان العمل بسلاسة وفعالية. عندما يتم ضم أعضاء جدد، من المهم جدًا مراجعة هذا الاتفاق مع الفريق ككل وتحديثه حسب الحاجة. الهدف هو ضمان أن الجميع—الجدد والقدامى—يفهمون طريقة العمل المتفق عليها لتفادي أي سوء تفاهم أو تعطيل لوتيرة المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n- جدولة جلسة ليشرح الأعضاء الحاليون للأعضاء الجدد العقد الاجتماعي الحالي: هذا يُفقد روح المشاركة لأن مناقشة الاتفاق الاجتماعي يجب أن تشمل الجميع.\n- تنظيم اجتماع مع جميع الأعضاء للتواصل حول الاتفاق الاجتماعي الحالي: هذا جيد لكن لا يكفي إذا لم يتضمن تحديث الاتفاق ليناسب الوضع الجديد.\n- تخطيط اجتماع مع الأعضاء الجدد لشرح القواعد المدرجة في العقد الاجتماعي: هذا يحصر المعلومات على فئة معينة ولا يعزز الانسجام الجماعي.\n",
      "choices": [
        {
          "text": "إجراء جلسة لتحديث الاتفاق الاجتماعي الحالي حول كيفية تعاون الفريق.",
          "correct": true
        },
        {
          "text": "جدولة جلسة ليشرح الأعضاء الحاليون للأعضاء الجدد العقد الاجتماعي الحالي.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع مع جميع الأعضاء للتواصل حول الاتفاق الاجتماعي الحالي.",
          "correct": false
        },
        {
          "text": "تخطيط اجتماع مع الأعضاء الجدد لشرح القواعد المدرجة في العقد الاجتماعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتبع المشروع خطة استراتيجية تتضمن معالم رئيسية تم الاتفاق عليها مع أصحاب المصلحة. أثناء تنفيذ العمل، تظهر مهام جديدة مع تبعيات هامة تمنع التقدم حسب الخطة. الفريق غير قادر على تحديد من يجب أن يتخذ القرارات ويتصرف في هذه المهام الجديدة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: استخدام مصفوفة المسؤوليات (RACI) لتسهيل المساءلة عن المهام.\n\n- شرح مفصل:\nعندما تظهر مهام جديدة خلال تنفيذ المشروع، ويواجه الفريق صعوبة في معرفة من يتخذ القرار بشأنها، يكون الحل الأنسب هو الرجوع إلى مصفوفة المسؤوليات (RACI). هذه الأداة تُوضح بدقة من هو المسؤول (Responsible)، من هو صاحب القرار النهائي (Accountable)، من يُستشار (Consulted)، ومن يتم إعلامه (Informed). استخدام RACI يعيد توجيه الفريق ويقلل الغموض ويوضح خطوط اتخاذ القرار.\n\n- سبب خطأ الخيارات الأخرى:\n- استخدام مخطط Gantt لضمان تحقيق المعالم: هذا يساعد على تتبع الجدول الزمني، لكنه لا يحل مشكلة تحديد المسؤوليات.\n- سؤال الرعاة عن من يتحمل المسؤولية: هذا تصعيد غير ضروري في المراحل الأولى.\n- استخدام هيكل تقسيم العمل (WBS) لضمان تغطية المتطلبات: WBS يركز على تقسيم العمل، لكنه لا يُحدد المسؤولين عن اتخاذ القرار.\n",
      "choices": [
        {
          "text": "استخدام مصفوفة المسؤوليات (RACI) لتسهيل المساءلة عن المهام.",
          "correct": true
        },
        {
          "text": "استخدام مخطط Gantt لضمان تحقيق المعالم.",
          "correct": false
        },
        {
          "text": "سؤال الرعاة عن من يتحمل المسؤولية.",
          "correct": false
        },
        {
          "text": "استخدام هيكل تقسيم العمل (WBS) لضمان تغطية المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا متكاملًا يتضمن تطوير الأجهزة والبرمجيات، مع مخطط Gantt معتمد من العميل وتوقعات بمشاركة العميل. اقترح فريق تطوير البرمجيات استخدام منهجيات Agile.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تقييم أفضل المنهجيات التي تضمن استمرار تحقيق القيمة للأعمال.\n\n- شرح مفصل:\nفي المشاريع المتكاملة التي تشمل مكونات مختلفة مثل الأجهزة والبرمجيات، من الطبيعي أن تظهر اختلافات في الطرق المثلى لإدارة العمل. مدير المشروع يجب أن يُقيّم المنهجيات (Agile, Waterfall, Hybrid) بما يتناسب مع طبيعة كل جزء من المشروع ومع توقعات العميل، مع التركيز على تحقيق القيمة. هذا التقييم يأخذ بعين الاعتبار الجدول الزمني، مرونة التغيير، ومشاركة أصحاب المصلحة.\n\n- سبب خطأ الخيارات الأخرى:\n- تبني Sprints رشيقة مباشرة: لا يجب اتخاذ القرار دون تقييم شامل.\n- إخبار الفريق باتباع مخطط Gantt المعتمد بدقة: هذا يقيّد الابتكار ويُغفل فرصة تحسين الأداء باستخدام منهجيات أخرى.\n- تقييم أدوار العميل مع مكتب إدارة المشاريع (PMO): هذا ليس هو الإجراء الأول المطلوب هنا، بل يندرج ضمن خطوات لاحقة بعد اتخاذ القرار المناسب بشأن المنهجية.\n",
      "choices": [
        {
          "text": "تقييم أفضل المنهجيات التي تضمن استمرار تحقيق القيمة للأعمال.",
          "correct": true
        },
        {
          "text": "تبني Sprints رشيقة لتطوير المشروع ضمن الإطار الزمني.",
          "correct": false
        },
        {
          "text": "إخبار الفريق باتباع مخطط Gantt المعتمد من العميل بدقة.",
          "correct": false
        },
        {
          "text": "تقييم أدوار العميل مع مكتب إدارة المشاريع (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مؤسسة كبيرة، يعاني مشروع من صعوبات في التواصل. يعبر أعضاء الفريق والقادة الوظيفيون عن شعورهم بأنهم يُبلغون بالمعلومات متأخرًا أو لا يتم إشراكهم في المناقشات، أو أنهم ببساطة غير مدركين لمعلومات تسليم المشروع.\n\nكيف يجب على مدير المشروع معالجة هذا الوضع؟",
      "explanation": "الإجابة الصحيحة: ضمان الالتزام بالعملية المتفق عليها كما هو موضح في خطة الاتصالات.\n\n- شرح مفصل:\nوجود صعوبات في التواصل داخل مؤسسة كبيرة عادة ما يعني أن العملية المتفق عليها ضمن خطة الاتصالات لا يتم تنفيذها بالشكل المطلوب. لذلك، الإجراء الأول الذي يجب على مدير المشروع اتخاذه هو التأكد من الالتزام بهذه العملية ومراجعتها مع الجميع إذا لزم الأمر. خطة الاتصالات تحتوي على تفاصيل مثل: من يتم إبلاغه؟ كيف؟ ومتى؟ وإذا تم تطبيقها بشكل صحيح، تقل احتمالات التأخر في إيصال المعلومات.\n\n- سبب خطأ الخيارات الأخرى:\n- إرسال تحديثات دورية عبر البريد الإلكتروني: هذا جزء من الخطة لكنه غير كافٍ كحل جذري.\n- تنسيق اجتماع مع قادة الفريق: إجراء مرحلي جيد لكنه لا يعالج المشكلة المستمرة بطريقة مستدامة.\n- الرجوع إلى مصفوفة RACI: يركز على تحديد المسؤوليات وليس حل مشكلة تدفق المعلومات.\n",
      "choices": [
        {
          "text": "ضمان الالتزام بالعملية المتفق عليها كما هو موضح في خطة الاتصالات.",
          "correct": true
        },
        {
          "text": "إرسال تحديثات دورية عبر البريد الإلكتروني لكل مدير وظيفي حول حالة المشروع والخطوات القادمة.",
          "correct": false
        },
        {
          "text": "تنسيق اجتماع مع قادة الفريق لإيجاد حل.",
          "correct": false
        },
        {
          "text": "الرجوع إلى مصفوفة RACI لمعرفة من يحتاج لمعرفة ماذا ومتى، وضمان الالتزام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في شركة تبنت مؤخرًا ممارسات هجينة، يواجه أحد المشاريع صعوبة في الأداء كما هو متوقع. لا يتمتع مدير المشروع ولا أعضاء الفريق بخبرة سابقة في هذا النهج الجديد لإدارة المشاريع. يريد مدير المشروع التأكد من أن الانتقال إلى الممارسات الهجينة يحقق النتائج المرجوة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تنظيم تدريب أساسي على المنهجية الهجينة لأعضاء الفريق وضمان إجراء اجتماعات تنسيقية.\n\n- شرح مفصل:\nعندما تكون هناك صعوبة في الأداء نتيجة تبني طريقة عمل جديدة مثل المنهجية الهجينة، فإن الحل الأول هو بناء الوعي والمهارة لدى الفريق. التدريب الأساسي يزود الجميع بالمفاهيم والأدوات المطلوبة، مما يساعد على توحيد طريقة العمل. كذلك، الاجتماعات التنسيقية تضمن معالجة أي استفسارات وتعديل التوجه حسب الحاجة.\n\n- سبب خطأ الخيارات الأخرى:\n- القيام بدور نشط في تعيين المهام: هذا أسلوب تحكم تقليدي لا يتماشى مع مبادئ العمل الهجين.\n- إصدار تقارير أداء: هذا يتعامل مع النتائج بدلاً من معالجة السبب الأساسي للمشكلة.\n- بناء WBS ومصفوفة RACI: أدوات مهمة لكنها غير كافية دون تأهيل الفريق لفهم المنهجية الهجينة.\n",
      "choices": [
        {
          "text": "القيام بدور نشط في تعيين المهام لأعضاء الفريق ومتابعة نتائجهم.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب أساسي على المنهجية الهجينة لأعضاء الفريق وضمان إجراء اجتماعات تنسيقية.",
          "correct": true
        },
        {
          "text": "إصدار تقارير أداء لجميع أعضاء الفريق ليقوموا بمراجعتها والتصرف بناءً عليها.",
          "correct": false
        },
        {
          "text": "بناء هيكل تقسيم العمل (WBS) ومصفوفة RACI لضمان وضوح المهام وتوزيع المسؤوليات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يقوم بتكوين فريق مشروع. جميع أعضاء الفريق عملوا معًا في مشاريع سابقة. أحد أعضاء الفريق معروف بتحديه لمعظم الإجراءات والعمليات التنظيمية.\n\nما الذي يجب على مدير المشروع فعله أولاً لضمان انطلاقة سلسة للمشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة الأصول التنظيمية للعمليات (OPAs) مع جميع أعضاء الفريق وتحديد القواعد الأساسية.\n\n- شرح مفصل:\nالأصول التنظيمية للعمليات (Organizational Process Assets) تحتوي على السياسات، الإجراءات، والقواعد التي تنظم العمل داخل المؤسسة. مراجعتها مع الفريق وتوضيح القواعد الأساسية يساعد على ضبط الأمور من البداية، خاصة مع وجود عضو معروف بتحديه للإجراءات. هذه الخطوة تخلق وضوحًا وتفاديًا للمشاكل المستقبلية.\n\n- سبب خطأ الخيارات الأخرى:\n- طلب من راعي المشروع تحديد القواعد: هذا يضعف دور مدير المشروع ولا يعزز استقلاليته.\n- طلب استبدال العضو المثير للمشاكل: إجراء مبكر وغير مبرر قبل محاولة التعامل مع الوضع بطريقة منظمة.\n- تنظيم اجتماع لمراجعة خطة إدارة المشروع: خطوة مهمة لكن تأتي لاحقًا بعد تحديد الأسس التنظيمية.\n",
      "choices": [
        {
          "text": "مراجعة الأصول التنظيمية للعمليات (OPAs) مع جميع أعضاء الفريق وتحديد القواعد الأساسية.",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع تحديد القواعد الأساسية ومشاركتها مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "طلب من راعي المشروع استبدال العضو المثير للمشاكل أو إزالته.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع مع أعضاء الفريق لمراجعة خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في الموقع (A) يعمل مع فريق محلي، بينما يتواجد المطورون في موقع بعيد، ومقيم الجودة في موقع بعيد آخر. يدرك مدير المشروع أن هذه المسافات قد تؤدي إلى صعوبة في التواصل.\n\nما الذي يمكن لمدير المشروع فعله للتخفيف من هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: إنشاء نافذة fishbowl (نافذة الشفافية).\n\n- شرح مفصل:\nنافذة Fishbowl هي تقنية تواصل تفاعلية توفر شفافية بين الفرق المتوزعة في أماكن مختلفة، سواء عبر أدوات رقمية أو بث مباشر للمناقشات أو تحديثات المشروع. هذا الأسلوب يعزز الشعور بالاتصال المباشر ويقلل الفجوات الناتجة عن المسافات الجغرافية.\n\n- سبب خطأ الخيارات الأخرى:\n- زيادة عدد جلسات الوقوف اليومية: قد يؤدي إلى إرهاق الفريق دون معالجة السبب الجذري.\n- تعيين أعضاء فريق جدد من الموقع المحلي: قد يعالج جزءًا من المشكلة لكنه ليس حلًا فعالًا دائمًا.\n- تقليل الحاجة إلى التواصل عبر تنظيم المهام: يقلل من فاعلية الفريق ويضر بالتنسيق الضروري.\n",
      "choices": [
        {
          "text": "زيادة عدد جلسات الوقوف اليومية (standup) في اليوم الواحد.",
          "correct": false
        },
        {
          "text": "تعيين أعضاء فريق جدد من الموقع المحلي.",
          "correct": false
        },
        {
          "text": "إنشاء نافذة fishbowl (نافذة الشفافية).",
          "correct": true
        },
        {
          "text": "تقليل الحاجة إلى التواصل من خلال تنظيم المهام الخلفية (backlog grooming).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تسليم مشروع ترقية طويل في سلسلة من المخرجات المرحلية. سيواجه المستخدمون النهائيون بعض الانقطاعات خلال كل مرحلة قبل تحقيق المخرجات.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تحقيق القيمة المقصودة في كل مرحلة؟",
      "explanation": "الإجابة الصحيحة: تتبع التقدم نحو كل فائدة بناءً على خطة إدارة الفوائد.\n\n- شرح مفصل:\nفي المشاريع التي يتم تسليمها على مراحل، يصبح تتبع تحقيق القيمة المقصودة أمرًا أساسيًا. خطة إدارة الفوائد (Benefits Management Plan) تُحدد متى وكيف يتم قياس الفوائد في كل مرحلة. باستخدام هذه الخطة، يمكن لمدير المشروع ضمان أن كل مخرج مرحلي يحقق النتائج التي تم الاتفاق عليها مع أصحاب المصلحة، وليس مجرد تسليم مهام فنية.\n\n- سبب خطأ الخيارات الأخرى:\n- جمع التعليقات: مفيد لكن ليس كافٍ لضمان تحقيق الفوائد.\n- مراجعة التكاليف: تركز على الميزانية وليس على القيمة المضافة.\n- التحقق من النطاق: يتعلق بالجودة والنطاق، وليس بالضرورة بتحقيق الفوائد.\n",
      "choices": [
        {
          "text": "جمع التعليقات باستخدام استبيانات حول تجربة المستخدم النهائي وتحليل النتائج.",
          "correct": false
        },
        {
          "text": "مراجعة التكاليف الفعلية لضمان بقاء المشروع ضمن الميزانية.",
          "correct": false
        },
        {
          "text": "التحقق من النطاق لضمان تحقيق الجودة المطلوبة للمخرجات.",
          "correct": false
        },
        {
          "text": "تتبع التقدم نحو كل فائدة بناءً على خطة إدارة الفوائد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال جلسة فردية، أعرب عضو جديد في الفريق عن إحباطه من عدم قدرته على إتمام المهمة الموكلة إليه بنجاح، رغم بذله أقصى جهد.\n\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة مخاوف عضو الفريق؟",
      "explanation": "الإجابة الصحيحة: تحديد السبب الجذري لعدم قدرة عضو الفريق على إكمال المهمة ومعالجته.\n\n- شرح مفصل:\nعندما يعبّر عضو الفريق عن إحباطه، من المهم جدًا ألا يقتصر دور مدير المشروع على التشجيع أو تقديم حلول سطحية. بل يجب البحث عن السبب الجذري للمشكلة، مثل نقص في المهارات، غموض في المتطلبات، أو موارد غير متوفرة. معالجة السبب الجذري تضمن حل المشكلة من الأساس وتعيد الثقة لعضو الفريق.\n\n- سبب خطأ الخيارات الأخرى:\n- التشجيع فقط: لا يعالج المشكلة الأساسية.\n- الموافقة على تدريب إضافي: إجراء ثانوي بعد تحديد السبب.\n- تكييف أسلوب القيادة: هذا يرتبط بتحسين طريقة التعامل لكن ليس هو الإجراء الأول المطلوب.\n",
      "choices": [
        {
          "text": "تشجيع عضو الفريق على الاستمرار في العمل بجد على مهامه.",
          "correct": false
        },
        {
          "text": "تحديد السبب الجذري لعدم قدرة عضو الفريق على إكمال المهمة ومعالجته.",
          "correct": true
        },
        {
          "text": "الموافقة على تدريب إضافي لعضو الفريق خلال سلسلة فرص التدريب القادمة.",
          "correct": false
        },
        {
          "text": "تكييف أسلوب القيادة حسب احتياجات عضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع لمشروع هجين جديد يحاول تشكيل فريق المشروع. أفضل المرشحين لأعضاء الفريق متوزعون جغرافيًا، لذلك هناك خطر أن تؤثر هذه الوضعية على أداء المشروع. الجمع في مكان واحد سيزيد التكاليف بشكل كبير؛ وبسبب المنافسة الشديدة، تكافح الشركة ماليًا للبقاء.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "الإجابة الصحيحة: ضمان توفر الأدوات المناسبة للتعاون الافتراضي للفريق.\n\n- شرح مفصل:\nفي ظل الظروف المالية الصعبة، الحل الأمثل هو الاعتماد على أدوات التعاون الافتراضي مثل منصات الاجتماعات، إدارة المهام، وتبادل الملفات بشكل فوري. هذا يضمن التواصل الفعال دون الحاجة لزيادة التكاليف عبر جمع الفريق في مكان واحد.\n\n- سبب خطأ الخيارات الأخرى:\n- الإصرار على جمع الفريق: غير عملي ماليًا.\n- طلب أموال إضافية: قد لا يتوافق مع الوضع المالي الحالي للشركة.\n- تنظيم العمل حسب المواقع: قد يسبب تعارض في أولويات الفريق وعدم انسجام.\n",
      "choices": [
        {
          "text": "ضمان توفر الأدوات المناسبة للتعاون الافتراضي للفريق.",
          "correct": true
        },
        {
          "text": "الإصرار على جمع الفريق معًا عن طريق تقليص الميزانية في مكان آخر.",
          "correct": false
        },
        {
          "text": "طلب أموال إضافية من مالك المنتج لدعم الجمع في مكان واحد.",
          "correct": false
        },
        {
          "text": "تنظيم العمل وفقًا لمواقع أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "مشروع تحويل كبير يتطلب جهدًا مشتركًا من فرق أعمال متعددة قيد التنفيذ.\n\nما هما الإجراءان اللذان يجب على مدير المشروع اتخاذهما أولاً لاستكمال سجل أصحاب المصلحة؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحـتان: عقد ورشة عمل مع أعضاء الفريق الرئيسيين للعصف الذهني وتحديد أصحاب المصلحة المحتملين + طلب الإحالات من راعي الأعمال أو القيادة العليا.\n\n- شرح مفصل:\nعند بدء مشروع معقد يتضمن فرق متعددة، يحتاج مدير المشروع أولاً إلى تحديد أصحاب المصلحة بدقة. يتم ذلك من خلال عقد ورشة عمل مع الفريق لجمع المعلومات، وكذلك طلب إحالات من القيادات العليا الذين يمتلكون رؤية شاملة عن الأطراف ذات العلاقة.\n\n- سبب خطأ الخيارات الأخرى:\n- تحليل الاهتمام والتأثير: خطوة لاحقة بعد تحديد القائمة الأولية.\n- مناقشة المشروع مع الفريق وتجميع السجل: ليست الطريقة الرسمية لبناء سجل أصحاب المصلحة.\n- الاتصال بكل صاحب مصلحة محتمل: هذا يتم بعد إعداد القائمة الأولية وليس كخطوة أولى.",
      "choices": [
        {
          "text": "عقد ورشة عمل مع أعضاء الفريق الرئيسيين للعصف الذهني وتحديد أصحاب المصلحة المحتملين.",
          "correct": true
        },
        {
          "text": "طلب الإحالات من راعي الأعمال أو القيادة العليا.",
          "correct": true
        },
        {
          "text": "تحليل اهتمام وتأثير وتأثير أصحاب المصلحة المحتملين من كل فريق عمل.",
          "correct": false
        },
        {
          "text": "مناقشة المشروع مع أعضاء الفريق وتجميع السجل في اجتماع الفريق.",
          "correct": false
        },
        {
          "text": "الاتصال بكل صاحب مصلحة محتمل مباشرة وسؤاله إذا كان مهتمًا بالانضمام إلى المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "أحد عناصر العمل من جلسة المراجعة الأخيرة تكرر في آخر جولتين، وهو متعلق بالتحقق من الوظيفة المقدمة وصلاحيتها قبل الاستعداد للإنتاج.\n\nما هما الحلان اللذان يجب على مدير المشروع استخدامهما؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحـتان: دمج معايير اختبار الوحدة والاختبار التكاملي كجزء من عملية التحقق + مراجعة اتفاقية العمل لمعايير القبول مع فريق المشروع.\n\n- شرح مفصل:\nالتكرار في ظهور نفس المشكلة يشير إلى خلل في عمليات التحقق ومعايير القبول. لذلك، يجب دمج اختبارات الوحدة والتكامل لضمان أن الوظائف تعمل كما هو متوقع. كذلك، مراجعة اتفاقية العمل يضمن أن معايير القبول واضحة للجميع.\n\n- سبب خطأ الخيارات الأخرى:\n- تعديل سرعة الفريق: لا يحل المشكلة الأساسية.\n- تعديل منهجية التسليم: تغيير جذري وغير مطلوب هنا.\n- إدراج عنصر في سجل المنتج: هذا إجراء تكتيكي وليس استراتيجي لحل السبب الجذري.",
      "choices": [
        {
          "text": "تعديل سرعة الفريق لمعالجة الاختبار الإضافي.",
          "correct": false
        },
        {
          "text": "دمج معايير اختبار الوحدة والاختبار التكاملي كجزء من عملية التحقق.",
          "correct": true
        },
        {
          "text": "تعديل منهجية التسليم إلى التطوير المعتمد على الاختبار.",
          "correct": false
        },
        {
          "text": "مراجعة اتفاقية العمل لمعايير القبول مع فريق المشروع.",
          "correct": true
        },
        {
          "text": "إدراج عنصر في سجل المنتج لإنشاء مجموعة اختبارات تكاملية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مراجعة الجولة النهائية، صرّح مالك المنتج أن المنتج لا يقدم أي قيمة. مدير المشروع يعتقد أن المنتج يلبي جميع المواصفات المقدمة. الفريق مرتبك من تصريح مالك المنتج.\n\nماذا يجب على مدير المشروع فعله عند استخدام نهج هجين؟",
      "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة الفوائد الخاصة بالمشروع مع مالك المنتج.\n\n- شرح مفصل:\nفي المنهجية الهجينة، التركيز لا يكون فقط على تلبية المواصفات بل على تحقيق القيمة للأعمال. إذا صرح مالك المنتج أن القيمة غير محققة، فيجب العودة إلى خطة إدارة الفوائد والتحقق مما إذا كانت المواصفات فعلاً تحقق الأهداف التي تم وضعها.\n\n- سبب خطأ الخيارات الأخرى:\n- التصعيد للمجلس التنفيذي: إجراء مبالغ فيه قبل محاولة حل المشكلة مع مالك المنتج.\n- أولوية سجل المنتج وطلب التصحيح: هذا يفترض أن هناك خطأ في المواصفات بينما المشكلة تتعلق بالقيمة.\n- طلب إنهاء المشروع: قرار نهائي وغير مناسب في هذه المرحلة.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الفوائد الخاصة بالمشروع مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "تصعيد الأمر إلى المجلس التنفيذي حتى يقرروا الخطوات التالية.",
          "correct": false
        },
        {
          "text": "أولوية سجل المنتج واطلب من فريق التطوير تصحيح المشكلات.",
          "correct": false
        },
        {
          "text": "اطلب من مالك المنتج إنهاء المشروع لأنه لم يعد متماشياً مع الفوائد المتوقعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا حيث تمت ترقية صاحب مصلحة منخفض المستوى إلى منصب جديد، وأصبح الآن صاحب مصلحة عالي المستوى. ما الذي يجب على مدير المشروع تحديثه لضمان المشاركة المناسبة لهذا صاحب المصلحة في المشروع؟",
      "explanation": "الإجابة الصحيحة: خطة إشراك أصحاب المصلحة.\n\n- شرح مفصل:\nعند حدوث تغيير في وضع أو أهمية أحد أصحاب المصلحة، من الضروري تحديث خطة إشراك أصحاب المصلحة (Stakeholder Engagement Plan) لتتناسب مع مستوى التأثير والأهمية الجديد. هذه الخطة تحدد كيفية تواصل المشروع مع أصحاب المصلحة حسب قوتهم وتأثيرهم واهتماماتهم.\n\n- سبب خطأ الخيارات الأخرى:\n- خطة إدارة الاتصالات: تركز على قنوات الاتصال لكن لا تعالج مستوى إشراك وتأثير صاحب المصلحة.\n- خطة إدارة الموارد: تركز على الفريق والموارد المادية وليس أصحاب المصلحة.\n- خطة إدارة المخاطر: لا علاقة مباشرة لها بإشراك أصحاب المصلحة.",
      "choices": [
        {
          "text": "خطة إدارة الاتصالات",
          "correct": false
        },
        {
          "text": "خطة إشراك أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "خطة إدارة الموارد",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تفاعلات العميل مع فريق المشروع كانت سلبية إلى حد ما. لم يعد أعضاء الفريق يرغبون في المشاركة في المشروع. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة: التفاوض مع العميل وفريق المشروع لتسوية الخلافات.\n\n- شرح مفصل:\nالتفاوض هو أفضل أسلوب لمعالجة الخلافات بين أصحاب المصلحة وأعضاء الفريق. مدير المشروع يحتاج إلى الجمع بين الطرفين لفهم وجهات النظر وتحديد نقاط الخلاف والتوصل إلى حلول وسطية تضمن استمرارية المشروع بأقل خسائر ممكنة.\n\n- سبب خطأ الخيارات الأخرى:\n- جدولة اجتماع مع العميل فقط: يهمل جانب الفريق.\n- الامتثال للعميل: قد يؤدي إلى فقدان ثقة الفريق.\n- إشراك الجميع في أنشطة إشراك أصحاب المصلحة: ليس هو الإجراء الأول بل خطوة لاحقة.",
      "choices": [
        {
          "text": "جدولة اجتماع مع العميل لمناقشة مخاوف الفريق.",
          "correct": false
        },
        {
          "text": "الامتثال لتوقعات ومشاعر العميل دون تردد.",
          "correct": false
        },
        {
          "text": "التفاوض مع العميل وفريق المشروع لتسوية الخلافات.",
          "correct": true
        },
        {
          "text": "إشراك جميع أعضاء الفريق في أنشطة إشراك أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على عناصر متراكمة ضمن دورة مدتها أربعة أسابيع. فجأة، أعلن عضو رئيسي في الفريق أنه سيكون غائبًا لمدة أسبوع بشكل غير متوقع، مما ترك المهام الجارية غير مكتملة. ما هو الإجراء الأنسب الذي يجب أن يتخذه مدير المشروع في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: إزالة بعض العناصر من الدورة الحالية بعد الحصول على موافقة مالك المنتج.\n\n- شرح مفصل:\nفي إطار العمل المرن (Agile)، عندما يتغير وضع الفريق أثناء دورة (Sprint)، يُفضل تعديل نطاق العمل لتتناسب مع القدرة المتاحة بدلاً من زيادة الموارد أو تغيير المدة الزمنية. إزالة بعض العناصر يحافظ على استقرار العملية ويضمن جودة التسليم.\n\n- سبب خطأ الخيارات الأخرى:\n- دعم نقل المعرفة: مهم لكنه لا يحل مشكلة السعة الحالية.\n- إضافة مورد مؤقت: قد يتطلب وقتًا إضافيًا للتدريب ولن يكون فعالًا فوريًا.\n- زيادة مدة الدورة: يتعارض مع مبادئ Agile ويحبط الفريق.",
      "choices": [
        {
          "text": "دعم نقل المعرفة بين العضو الذي سيغيب وباقي أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "إضافة مورد مؤقت إلى الفريق لزيادة السرعة وإنهاء العناصر خلال هذه الدورة.",
          "correct": false
        },
        {
          "text": "إزالة بعض العناصر من الدورة الحالية بعد الحصول على موافقة مالك المنتج.",
          "correct": true
        },
        {
          "text": "زيادة مدة الدورة حتى يتمكن الفريق من إكمال جميع العناصر المخطط لها وتقديمها لمالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في منظمة تشجع على الفرق الافتراضية. تظهر تحديات جديدة بشكل دوري في هذا النوع من البيئات، ومدير المشروع في المراحل المبكرة من مشروع رشيق جديد.\n\nما الذي يجب على مدير المشروع فعله لمساعدة الفريق في التغلب على هذه التحديات؟",
      "explanation": "الإجابة الصحيحة: إجراء تحليل SWOT (نقاط القوة، نقاط الضعف، الفرص، التهديدات) لتحديد حالة الفريق بسرعة واتخاذ الإجراء المناسب.\n\n- شرح مفصل:\nفي المراحل الأولى من مشروع رشيق مع فرق افتراضية، من المهم أن يكون لدى مدير المشروع تصور واضح عن وضع الفريق. استخدام تحليل SWOT يمكنه إبراز المشكلات المحتملة والمزايا الموجودة وتحديد مجالات التحسين بشكل منظم وعلمي.\n\n- سبب خطأ الخيارات الأخرى:\n- إيقاف جميع الأنشطة مؤقتًا: يؤدي لتعطيل العمل وقد لا يكون ضرورياً.\n- الانتظار حتى الاجتماع اليومي: يضيع وقتًا ثمينًا.\n- العمل مع مالك المنتج: يخص إزالة العوائق ولكن ليس دائمًا مناسبًا للتحديات الداخلية بين الفريق.",
      "choices": [
        {
          "text": "إجراء تحليل SWOT (نقاط القوة، نقاط الضعف، الفرص، التهديدات) لتحديد حالة الفريق بسرعة واتخاذ الإجراء المناسب.",
          "correct": true
        },
        {
          "text": "إيقاف جميع الأنشطة مؤقتًا وجمع الفريق في اجتماع لمناقشة التحديات الجديدة التي تم تحديدها.",
          "correct": false
        },
        {
          "text": "الانتظار حتى الاجتماع اليومي التالي لمناقشة التحديات حتى يكون الفريق على علم ومشاركة.",
          "correct": false
        },
        {
          "text": "العمل مع مالك المنتج لتحديد أفضل مسار عمل لإزالة العوائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكافح فريق مشروع رشيق في تتبع التغييرات التي يتم تطبيقها على المنتج، بسبب أن العملية المستخدمة معقدة وعرضة للأخطاء. ما الذي يجب أن يفعله مدير المشروع لمعالجة هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: استخدام الاجتماع التالي لجلسة المراجعة (الرتروسبيكتيف) لتقييم فعالية العملية وتحديد ما إذا كانت تحتاج إلى تغييرات.\n\n- شرح مفصل:\nفي المشاريع الرشيقة، جلسة المراجعة (رتروسبيكتيف) هي المساحة الطبيعية لمراجعة العمليات وتعديلها إذا لزم الأمر. بدلًا من اتخاذ قرارات فردية أو استعجال الحلول، تُستخدم هذه الجلسة لمشاركة الفريق في تقييم العملية وتحديد كيفية تحسينها.\n\n- سبب خطأ الخيارات الأخرى:\n- تعيين شخص واحد: يعالج النتيجة وليس السبب الجذري.\n- إلغاء العملية: تصرف متسرع وخطر.\n- شراء أدوات جديدة: حل مكلف قد لا يكون ضروريًا.",
      "choices": [
        {
          "text": "تعيين المسؤولية بوضوح لشخص واحد لضمان المحاسبة في حال الفشل.",
          "correct": false
        },
        {
          "text": "استخدام الاجتماع التالي لجلسة المراجعة (الرتروسبيكتيف) لتقييم فعالية العملية وتحديد ما إذا كانت تحتاج إلى تغييرات.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة الراعي لإيقاف اتباع هذه العملية وتحمل مخاطر إلغائها.",
          "correct": false
        },
        {
          "text": "تأمين تمويل للحصول على حل برمجي يمكنه تسريع العملية وتقليل الأخطاء.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع مع فريق متنوع ثقافيًا، ويكتشف وجود صراعات كبيرة داخل الفريق أثناء تنفيذ المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: جدولة اجتماع مع فريق المشروع لفهم أسباب الصراعات.\n\n- شرح مفصل:\nأول خطوة لحل الصراعات في الفرق المتنوعة ثقافيًا هي الاستماع إلى جميع الأطراف ومعرفة جذور المشكلة. بدون فهم الأسباب الحقيقية، لا يمكن لمدير المشروع اتخاذ قرارات صحيحة. الاجتماع يوفر بيئة آمنة للحوار المفتوح.\n\n- سبب خطأ الخيارات الأخرى:\n- نصح الفريق بالعمل بانسجام: حل سطحي وغير فعال.\n- تحديث خطة إدارة الموارد: لا يتعلق مباشرة بإدارة الصراعات.\n- إشراك الأعضاء في أنشطة بناء الفريق: قد يساعد لاحقًا ولكن ليس كخطوة أولى.",
      "choices": [
        {
          "text": "جدولة اجتماع مع فريق المشروع لفهم أسباب الصراعات.",
          "correct": true
        },
        {
          "text": "نصح أعضاء الفريق بالعمل بانسجام.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إشراك الأعضاء في أنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق استشاري عن بعد من الفريق الأساسي للمشروع. هناك تدفق مستمر للمعلومات بين الفريقين، وكلا الفريقين يوافق على مستندات المشروع. أي تأخير في الموافقات سيؤدي إلى تكاليف إضافية.\n\nأي ممارسة تضمن لمدير المشروع توفر جميع المستندات وتحديثها والموافقة عليها بشكل صحيح؟",
      "explanation": "الإجابة الصحيحة: الإشراف على سجل مستندات ونظام تحكم بالتغيير موحد يستخدمه الفريقان.\n\n- شرح مفصل:\nفي بيئة عمل تشمل فرقًا متعددة عن بعد، وجود نظام مركزي موحد لإدارة المستندات وتحديثها يضمن أن جميع الأطراف تعمل على نفس النسخة من الملفات، مع وضوح لمن يمكنه إجراء التغييرات وكيفية اعتمادها. هذا يقلل من مخاطر التكرار والأخطاء.\n\n- سبب خطأ الخيارات الأخرى:\n- السماح لكل فريق بأنظمة خاصة: يخلق تعارض وفوضى.\n- مطالبة الأعضاء الأفراد بالاحتفاظ بالسجلات: غير فعال ولا يمكن مراقبته بدقة.\n- تكليف الراعي: ليس دوره الفني أو التشغيلي عادة.",
      "choices": [
        {
          "text": "السماح للفريقين الاستشاري والرئيسي بتطوير أنظمة تسمية وتصنيف المستندات الخاصة بهم.",
          "correct": false
        },
        {
          "text": "طلب من كل عضو في الفريقين الاحتفاظ بسجلات محدثة.",
          "correct": false
        },
        {
          "text": "تكليف الراعي بالمحافظة على السجل المركزي للمستندات والموافقة على التغييرات.",
          "correct": false
        },
        {
          "text": "الإشراف على سجل مستندات ونظام تحكم بالتغيير موحد يستخدمه الفريقان.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بالتحول من استخدام النهج التنبؤي إلى تنفيذ مشاريع هجينة (تنبؤية-رشيقة). يشعر فريق القيادة بالقلق بشأن تحقيق الفوائد ويتابع إحدى دورات المشروع عن كثب مع مدير المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: مواصلة تسليم دورات الحل وعرض زيادات الفوائد على فريق القيادة.\n\n- شرح مفصل:\nأثناء الانتقال إلى أسلوب هجين، من المهم إظهار تقدم حقيقي وقيمة مضافة خلال كل دورة (Iteration). تقديم نتائج ملموسة هو أفضل وسيلة لبناء الثقة لدى القيادة بدلاً من الاكتفاء بالتقارير النظرية.\n\n- سبب خطأ الخيارات الأخرى:\n- إرسال تقارير كمية فقط: قد لا تعكس القيمة الفعلية.\n- انتظار القيادة لمشاركة التحديثات: إجراء سلبي وغير عملي.\n- عرض القيمة بدون تسليم النتائج: ناقص وغير كافٍ.",
      "choices": [
        {
          "text": "تحديث فريق القيادة بتقرير يحتوي على قيمة كمية لكل دورة.",
          "correct": false
        },
        {
          "text": "عرض القيمة التجارية لفريق القيادة والحصول على دعمهم.",
          "correct": false
        },
        {
          "text": "مواصلة تسليم دورات الحل وعرض زيادات الفوائد على فريق القيادة.",
          "correct": true
        },
        {
          "text": "انتظار فريق القيادة ليشارك تحديثات تحقيق الفوائد لكل دورة مع الإدارة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع هجين يشمل العديد من أصحاب المصلحة قيد التنفيذ. كما طلب مكتب إدارة المشاريع (PMO)، يتم تخزين تقارير حالة المشروع وغيرها من مستندات المشروع في مستودع مركزي. عند مراجعة المستندات المخزنة، اكتشف مدير المشروع أن بعض المستندات إما لم تُحدث أو مفقودة.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: العمل مع قادة الفرق لتحديث تقارير المشروع المطلوبة.\n\n- شرح مفصل:\nالخطوة العملية في مثل هذا الموقف هي التنسيق مع مسؤولي الفرق المعنية لضمان تحديث البيانات والمستندات. هذا يعيد الانضباط ويمنع تكرار المشكلة.\n\n- سبب خطأ الخيارات الأخرى:\n- تقليل مستوى التوثيق: يعرض المشروع لمخاطر أكبر.\n- إيقاف المشروع: إجراء مبالغ فيه.\n- جلسة نقل المعرفة في النهاية: إجراء متأخر لا يعالج المشكلة الحالية.",
      "choices": [
        {
          "text": "مناقشة الوضع مع راعي المشروع لتقليل مستوى التوثيق.",
          "correct": false
        },
        {
          "text": "العمل مع قادة الفرق لتحديث تقارير المشروع المطلوبة.",
          "correct": true
        },
        {
          "text": "إيقاف جميع أنشطة المشروع حتى يتم تحديث وتحميل مستندات المشروع.",
          "correct": false
        },
        {
          "text": "جدولة جلسة نقل معرفة في المرحلة النهائية من المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع على مشروع جارٍ به أعضاء فريق افتراضيين من دول مختلفة يعملون عن بُعد في مناطق زمنية مختلفة. يلاحظ مدير المشروع أن أعضاء الفريق لا يكملون أنشطة المشروع في الوقت المحدد ولا يستطيعون تقديم المنتجات المتوقعة بسبب الاتصالات غير المنتظمة.\n\nكيف يجب على مدير المشروع حل هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: التواصل مع أعضاء الفريق لفهم التحديات التي يواجهونها.\n\n- شرح مفصل:\nعندما يتعامل مدير مشروع مع فرق افتراضية عبر مناطق زمنية مختلفة ويلاحظ تأخيرًا في التسليمات، فإن أول خطوة ضرورية هي الحوار المباشر مع الفريق لفهم العقبات. قد تكون المشكلة متعلقة بالأدوات، أو اختلاف التوقيت، أو ضعف في تنظيم الاجتماعات. التواصل يتيح لمدير المشروع رؤية الأسباب الجذرية واختيار الحل المناسب.\n\n- سبب خطأ الخيارات الأخرى:\n- تزويد الفريق بقائمة التسليمات: هذا ليس كافيًا لحل مشكلة الاتصالات.\n- تدريب على إدارة الوقت: يفترض أن المشكلة مرتبطة بالتنظيم، لكنها قد تكون متعلقة بوسائل الاتصال نفسها.\n- جمع الفريق في نفس المكتب: خيار مكلف وغير عملي في فرق افتراضية موزعة جغرافيًا.",
      "choices": [
        {
          "text": "تزويد الفريق بقائمة التسليمات لتوجيههم.",
          "correct": false
        },
        {
          "text": "التواصل مع أعضاء الفريق لفهم التحديات التي يواجهونها.",
          "correct": true
        },
        {
          "text": "تنظيم تدريب على إدارة الوقت للفريق.",
          "correct": false
        },
        {
          "text": "اتخاذ خطوات لجمع الفريق في نفس المكتب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل مدير المشروع التسليمات وتم اجتياز معايير القبول. أي عبارة تؤكد أن فوائد المشروع قد تحققت؟",
      "explanation": "الإجابة الصحيحة: تمت الموافقة على التسليم وتم تأكيد القيمة.\n\n- شرح مبسط:\nاكتمال التسليمات واجتياز معايير القبول لا يعني بالضرورة تحقق الفوائد. حتى يتم التأكيد فعليًا، يجب أن يتم اعتماد النتائج النهائية ويقر أصحاب المصلحة أو العميل أن التسليمات تحقق القيمة المتفق عليها.\n\n- سبب خطأ الخيارات الأخرى:\n- حل جميع المشكلات: لا يعني دائمًا أن الفوائد تحققت بالكامل.\n- بعض التحسينات في اتخاذ القرار: ليس مؤشرًا كافيًا.\n- انتهاء المشروع حسب الجدول: يخص الجدول فقط وليس القيمة التجارية.",
      "choices": [
        {
          "text": "تمت الموافقة على التسليم وتم تأكيد القيمة.",
          "correct": true
        },
        {
          "text": "حلت التسليمة جميع المشكلات التي حددها رعاة المشروع.",
          "correct": false
        },
        {
          "text": "شهد المشروع بعض التحسينات في القدرة على اتخاذ القرارات.",
          "correct": false
        },
        {
          "text": "تم الانتهاء من المشروع حسب الجدول الزمني دون أي شكاوى من المستخدمين النهائيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينص عقد تكنولوجيا المعلومات لمشروع ما على أن جميع أعضاء الفريق يجب أن يكونوا معتمدين في أمن تكنولوجيا المعلومات. يكتشف مدير المشروع أن أحد أعضاء الفريق قدم شهادة مزورة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً للتعامل مع هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: تحديث سجل المشكلات وإزالة عضو الفريق من المشروع.\n\n- شرح مبسط:\nاكتشاف تزوير شهادة يعتبر خرقًا خطيرًا للأخلاقيات والقوانين التنظيمية في المشروع. لذلك الإجراء الأول هو إزالته فورًا وتوثيق الحالة في سجل المشكلات (Issue Log)، لتجنب أي تبعات قانونية أو تأثير على جودة المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n- تحديث خطة إدارة المشروع: يأتي لاحقًا وليس أولوية.\n- التأكد من الشهادات الأخرى: إجراء وقائي وليس الخطوة الأولى.\n- التحقيق في السبب: أيضًا ليس الأولوية مقارنة بإزالة المخالفة أولًا.",
      "choices": [
        {
          "text": "تحديث خطة إدارة المشروع لتشمل موارد لتدريب العضو على الاعتماد.",
          "correct": false
        },
        {
          "text": "تحديث سجل المشكلات وإزالة عضو الفريق من المشروع.",
          "correct": true
        },
        {
          "text": "التأكد من أن الأعضاء الآخرين يحملون شهادات صحيحة.",
          "correct": false
        },
        {
          "text": "التحقيق في سبب عدم اكتشاف هذا الموقف في وقت سابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع رشيق، أثار أحد أعضاء الفريق مخاوف بشأن قضايا الصحة والسلامة المتعلقة بالتسليمة. كيف يجب على مدير المشروع التعامل مع قضايا الصحة والسلامة؟",
      "explanation": "الإجابة الصحيحة: ضمان تضمين متطلبات الصحة والسلامة الضرورية في تعريف الإنجاز (DoD).\n\n- شرح مفصل:\nفي المشاريع الرشيقة، يتم تحديد متطلبات الجودة والمعايير في تعريف الإنجاز (Definition of Done). لذلك، عند ظهور مخاوف تتعلق بالصحة والسلامة، يتعين على مدير المشروع أولًا التأكد من أن هذه المتطلبات مذكورة بوضوح ضمن DoD، مما يضمن عدم اعتبار أي تسليمة مكتملة إلا إذا استوفت معايير الصحة والسلامة.\n\n- سبب خطأ الخيارات الأخرى:\n- تزويد العميل بوثائق: هذا إجراء خارجي بعد إكمال المنتج، وليس وسيلة لضمان صحة وسلامة التسليمات.\n- إرسال القضية للقسم المختص: قد يكون لاحقًا، لكن ليس أول خطوة.\n- تصميم سياسة: هذه مسؤولية على مستوى المؤسسة، وليست ضمن صلاحيات مدير المشروع مباشرة.",
      "choices": [
        {
          "text": "تزويد العميل بالوثائق الكافية حول معلومات الصحة والسلامة.",
          "correct": false
        },
        {
          "text": "إرسال القضية إلى قسم الصحة والسلامة.",
          "correct": false
        },
        {
          "text": "تصميم سياسة للصحة والسلامة للمؤسسة.",
          "correct": false
        },
        {
          "text": "ضمان تضمين متطلبات الصحة والسلامة الضرورية في تعريف الإنجاز (DoD).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت ترسية مشروع مدته سنتان على شركة قبل ستة أشهر، لكن لم يبدأ بعد إجراء عمليات الشراء. ما الذي يجب على مدير المشروع فعله لتحريك المشروع؟",
      "explanation": "الإجابة الصحيحة: جمع الفرق معًا لصياغة خطة إدارة المشتريات.\n\n- شرح مفصل:\nعدم بدء عمليات الشراء بعد ستة أشهر يشير إلى غياب أو تأخر في خطة إدارة المشتريات. لذلك، يجب على مدير المشروع أولًا جمع المعنيين بصياغة هذه الخطة بشكل رسمي، بما يشمل المواصفات، العقود، وأسلوب الشراء. هذه الخطوة أساسية لفتح مسار المشتريات وتحريك المشروع.\n\n- سبب خطأ الخيارات الأخرى:\n- إعداد خطة إدارة المشتريات بمفرده: غير كافٍ دون مشاركة الفرق المعنية.\n- تتبع العمليات وفق خطة غير موجودة: غير ممكن.\n- تصعيد للوضع: يأتي لاحقًا إذا فشل الحل التنظيمي الأول.",
      "choices": [
        {
          "text": "إعداد خطة إدارة المشتريات للمشروع.",
          "correct": false
        },
        {
          "text": "جمع الفرق معًا لصياغة خطة إدارة المشتريات.",
          "correct": true
        },
        {
          "text": "تتبع عمليات الشراء وفقًا لخطة إدارة المشتريات الحالية.",
          "correct": false
        },
        {
          "text": "تصعيد الوضع إلى الإدارة العليا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع على مشروع يقوم بتحويل المنظمة إلى اعتماد المبادئ الرشيقة. تعريف نطاق المشروع قيد التقدم، لكن الفريق يريد أن يكون التعريف أقل رسمية.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "الإجابة الصحيحة: تنظيم ورشة عمل مع مالك المنتج وفريق المشروع لإنشاء قائمة المنتجات ومعايير القبول.\n\n- شرح مفصل:\nفي بيئة رشيقة، يتم تعريف النطاق بشكل تفاعلي وتدريجي وليس بطريقة تقليدية رسمية. لذلك، أول خطوة منطقية هي تنظيم ورشة عمل مع مالك المنتج والفريق لتحديد قائمة المنتج (Product Backlog) ومعايير القبول التي توضح ما هو مطلوب وما هي حدود النطاق.\n\n- سبب خطأ الخيارات الأخرى:\n- مراجعة النطاق وإنشاء خطط طوارئ: هذه خطوات لاحقة.\n- إنشاء موقع تواصل: دعم إضافي وليس الخطوة الأولى.\n- تحديد المتطلبات الإلزامية: جزء من الورشة ولكن ليس بديلاً عنها.",
      "choices": [
        {
          "text": "مراجعة النطاق وتحديد التسليمات المطلوبة وإنشاء خطط طوارئ للمخاطر المحددة.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل مع مالك المنتج وفريق المشروع لإنشاء قائمة المنتجات ومعايير القبول.",
          "correct": true
        },
        {
          "text": "إنشاء موقع تواصل لمشاركة تعريف النطاق وقائمة المنتجات مع الفريق.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق المشروع لتحديد المتطلبات الإلزامية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروع تطوير منتج رئيسي. المشروع حاليًا في منتصف السبرينت الخامس، ومن المقرر إصدار المنتج في الربع القادم. يتلقى مدير المشروع خبرًا غير متوقع بأن الشركة قد تم الاستحواذ عليها رسميًا من قبل منافس رئيسي، والذي يمتلك بالفعل منتجًا مشابهًا في محفظته.\n\nما الإجراء الفوري الذي يجب أن يتخذه مدير المشروع لمعالجة الموقف بفعالية؟",
      "explanation": "الإجابة الصحيحة: طلب الدعم من راعي المشروع وبدء إجراءات إدارة التغيير المناسبة.\n\n- شرح مفصل:\nعند حدوث تغييرات تنظيمية كبيرة مثل الاستحواذ، تتأثر أهداف المشروع وقد تتغير الأولويات والقرارات الاستراتيجية. لذلك، يجب على مدير المشروع إبلاغ راعي المشروع مباشرة والتنسيق معه لبدء إجراءات إدارة التغيير. هذه الإجراءات تشمل تقييم المشروع الحالي وتحديد ما إذا كان يجب إيقافه، تعديله، أو دمجه مع مشاريع أخرى.\n\n- سبب خطأ الخيارات الأخرى:\n- إجراء تحليل مقارن: ليس الإجراء الأول، بل خطوة تحليلية قد تتم لاحقًا.\n- التعاون مع مدير المشروع المنافس: ليس دور مدير المشروع في هذه المرحلة.\n- إعداد تقرير إنهاء المشروع: لا يُتخذ هذا القرار إلا بعد التشاور مع الرعاة والقيادة.",
      "choices": [
        {
          "text": "إجراء تحليل مقارن للمنتجات لتحديد أوجه التشابه.",
          "correct": false
        },
        {
          "text": "التعاون مع مدير المشروع المسؤول عن منتج المنافس لمواءمة أنشطة المشروع.",
          "correct": false
        },
        {
          "text": "طلب الدعم من راعي المشروع وبدء إجراءات إدارة التغيير المناسبة.",
          "correct": true
        },
        {
          "text": "إعداد تقرير إنهاء المشروع وتوثيق الدروس المستفادة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينفذ مدير مشروع مرحلة من مشروع تكنولوجيا المعلومات في موقع عرضة لمشاكل أمنية. أبلغ عضو في الفريق يعمل عن بُعد أن الجهة التنظيمية المحلية لم تتلقَ رسوم التصريح، بينما مدير المشروع متأكد من أنه تم الدفع. يذكر العضو مدير المشروع أن اختبارًا حرجًا ضمن المسار الحرج مقرر في نفس اليوم في هذا الموقع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: طلب عقد اجتماع مع المسؤول في الجهة التنظيمية لعرض إثبات الدفع والتحقق من عواقب التأخير لضمان استمرار الاختبار كما هو مخطط.\n\n- شرح مفصل:\nالتعامل مع الجهات التنظيمية يتطلب تأكيد المعلومات رسميًا لضمان الامتثال وعدم المخاطرة بالمخالفات أو توقف العمل. لذلك، على مدير المشروع اتخاذ خطوة مباشرة بالاجتماع مع الجهة التنظيمية، وليس الاكتفاء بالإيصالات الداخلية أو التقديرات.\n\n- سبب خطأ الخيارات الأخرى:\n- إرسال الإيصال وانتظار الرد: قد يتسبب في تأخير.\n- مواصلة الاختبار دون التأكد: قرار غير مسؤول وقد يعرض المشروع لعواقب قانونية.\n- إعطاء تعليمات بمواصلة الاختبار اعتمادًا على الدفع: مغامرة غير مقبولة.",
      "choices": [
        {
          "text": "طلب إثبات الدفع من عضو الفريق من مكتب إدارة المشروع وإرسال إيصال الدفع المطبوع لاحقًا إلى الجهة التنظيمية وانتظار ردهم.",
          "correct": false
        },
        {
          "text": "طلب عقد اجتماع مع المسؤول في الجهة التنظيمية لعرض إثبات الدفع والتحقق من عواقب التأخير لضمان استمرار الاختبار كما هو مخطط.",
          "correct": true
        },
        {
          "text": "إعطاء تعليمات للعضو لمواصلة الاختبار لأن الغرامة الناتجة عن عدم الالتزام لا تؤثر كثيرًا، ولا يمكن تغيير عملية الاختبار.",
          "correct": false
        },
        {
          "text": "إعطاء تعليمات للعضو لمواصلة الاختبار لتجنب التأخير في المسار الحرج لأن الرسوم قد دُفعت بالتأكيد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أعضاء الفريق في إجازة مرضية لمدة أسبوع، وهو مكلف بمهمة تقع على المسار الحرج.\n\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تقييم التأثيرات المحتملة لتأخير المشروع.\n\n- شرح مفصل:\nعندما يغيب عضو أساسي في المسار الحرج، لا يُفضل التصرف الفوري دون تقييم التأثيرات على الجدول الزمني والتسليمات. التقييم هو الخطوة الأولى لفهم مدى خطورة الوضع، وبعد ذلك يمكن اتخاذ قرار بتوزيع المهام أو البحث عن بدائل.\n\n- سبب خطأ الخيارات الأخرى:\n- اختيار عضو آخر فورًا: قد يؤدي لحلول غير مدروسة.\n- الرجوع لخطة الاستجابة: خطوة لاحقة بعد التقييم.\n- إقناع العضو بالعمل رغم الإجازة المرضية: يتعارض مع الممارسات الأخلاقية ومعايير إدارة الموارد.",
      "choices": [
        {
          "text": "اختيار عضو آخر لاستلام المهمة فورًا.",
          "correct": false
        },
        {
          "text": "تقييم التأثيرات المحتملة لتأخير المشروع.",
          "correct": true
        },
        {
          "text": "الرجوع إلى خطة الاستجابة للمخاطر لمعالجة هذه المشكلة.",
          "correct": false
        },
        {
          "text": "إقناع العضو بمواصلة إتمام المهمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجتمع مدير المشروع مع مورد خارجي حاسم يوفر خدمات مخفضة. خلال الاجتماع، يشكو المورد من عدم رضاه عن العائد على الاستثمار.\n\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة وتجنب المخاطر على المشروع؟",
      "explanation": "الإجابة الصحيحة: مناقشة المشكلة مع أصحاب المصلحة والتوصل إلى خطة معالجة.\n\n- شرح مفصل:\nعندما يظهر مورد حاسم عدم رضاه المالي، قد يتسبب ذلك في خطر فعلي على المشروع من خلال تأخيرات أو توقف الخدمة. لذا يجب على مدير المشروع عدم اتخاذ قرارات فردية مثل دفع مبالغ إضافية مباشرة، بل إشراك أصحاب المصلحة لاتخاذ قرار جماعي متوازن قانونيًا وماليًا.\n\n- سبب خطأ الخيارات الأخرى:\n- التفاوض لزيادة المال: قد يخالف السياسات.\n- تذكير المورد بالعقد: يزيد التوتر دون حل.\n- البحث عن مورد بديل: قرار متسرع قد يؤثر على جودة المشروع.",
      "choices": [
        {
          "text": "التفاوض مع المورد لتقديم المزيد من المال حتى نهاية المشروع.",
          "correct": false
        },
        {
          "text": "تذكير المورد بأن العقد ملزم قانونيًا ويجب عليه الالتزام بالشروط.",
          "correct": false
        },
        {
          "text": "البحث عن موردين آخرين يقدمون خدمات مماثلة بأسعار مخفضة.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة مع أصحاب المصلحة والتوصل إلى خطة معالجة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أي مرحلة من مشروع رشيق (Agile) يجب على مدير المشروع إشراك أصحاب المصلحة؟",
      "explanation": "الإجابة الصحيحة: طوال دورة حياة المشروع.\n\n- شرح مفصل:\nفي المشاريع الرشيقة، يتم التركيز على إشراك أصحاب المصلحة بشكل مستمر للتأكد من أن العمل يتماشى مع احتياجاتهم ومتطلباتهم المتغيرة. الانتظار إلى نهاية المشروع أو بداية المشروع فقط لا يتماشى مع مبادئ Agile.\n\n- سبب خطأ الخيارات الأخرى:\n- البداية فقط: يفقد ميزة التحديث المستمر.\n- النهاية فقط: يؤدي لمنتج لا يحقق القيمة.\n- عند مواجهة التحديات: غير كافٍ.",
      "choices": [
        {
          "text": "في بداية المشروع",
          "correct": false
        },
        {
          "text": "في نهاية المشروع",
          "correct": false
        },
        {
          "text": "عندما تواجه تحديات في المشروع",
          "correct": false
        },
        {
          "text": "طوال دورة حياة المشروع",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة تستخدم نهج تسليم هجين. نطاق المشروع هو تنفيذ نظام موارد بشرية جديد. سيتم تسليم البنية التحتية بواسطة مشروع آخر، وكلا المشروعين جزء من برنامج تحويل الأعمال. يجب الانتهاء من جدول المشروع، ولكن مدير المشروع الآخر لا يمكنه تقديم تواريخ التسليم للبنية التحتية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تطوير جدول زمني استنادًا إلى المعلومات المتاحة من فريق إدارة البرنامج ثم مواءمة المعالم تدريجيًا مع مشروع البنية التحتية.\n\n- شرح مفصل:\nالاعتماد على فريق إدارة البرنامج يساعد على الموازنة بين المشاريع ضمن البرنامج نفسه. تأجيل العمل حتى يقدم مدير المشروع الآخر المعلومات سيجمد المشروع بلا داعٍ.\n\n- سبب خطأ الخيارات الأخرى:\n- الانتظار: يضر بالجدول.\n- الاتفاق على معالم بشكل مباشر: قد يكون غير واقعي.\n- طلب مواءمة المعالم دون اعتبار البرنامج: يتجاهل التنسيق الأوسع.",
      "choices": [
        {
          "text": "الانتظار حتى يحصل مشروع البنية التحتية على جدول زمني ثم تطوير جدول مشروع نظام الموارد البشرية.",
          "correct": false
        },
        {
          "text": "مناقشة الوضع مع مدير المشروع الآخر والاتفاق على بعض المعالم، ثم مواصلة العمل على جدول مشروع نظام الموارد البشرية.",
          "correct": false
        },
        {
          "text": "تطوير جدول زمني استنادًا إلى المعلومات المتاحة من فريق إدارة البرنامج ثم مواءمة المعالم تدريجيًا مع مشروع البنية التحتية.",
          "correct": true
        },
        {
          "text": "تطوير جدول زمني استنادًا إلى المعلومات المتوفرة وطلب من مدير المشروع الآخر مواءمة المعالم مع تواريخ تسليم مشروع الموارد البشرية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق على مشروع نشر تكنولوجيا جديدة. لم يتم تنفيذ هذا المنتج من قبل، ولا توجد بيانات تاريخية. يواجه الفريق تحديًا في تقديم الجدول الزمني والميزانية والتقديرات الحيوية للعميل.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: وضع التقديرات مع الفريق وشرح الافتراضات للعميل.\n\n- شرح مفصل:\nعند غياب البيانات التاريخية، يعتمد مدير المشروع على خبرة الفريق والعصف الذهني لوضع تقديرات أولية مع توضيح الافتراضات التي بنيت عليها هذه التقديرات، مما يحافظ على الشفافية ويضبط توقعات العميل.\n\n- سبب خطأ الخيارات الأخرى:\n- تطوير خطط إدارة المشروع مسبقًا: غير منطقي بدون تقديرات.\n- تقديم توجيهات: هذا دور الفريق.\n- التركيز على الاجتماعات الدورية: لا يحل مشكلة التقديرات.",
      "choices": [
        {
          "text": "تطوير خطط إدارة المشروع مسبقًا مع ميزانية مفصلة.",
          "correct": false
        },
        {
          "text": "تقديم توجيهات حول تكلفة المشروع والوقت والجودة.",
          "correct": false
        },
        {
          "text": "وضع التقديرات مع الفريق وشرح الافتراضات للعميل.",
          "correct": true
        },
        {
          "text": "تشجيع الفريق على إجراء مراجعات دورية (retrospectives).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "أحد العملاء غير راضٍ لأن مشكلة حرجة في أحد تسليمات المشروع لم تُحل من قبل الفريق الرشيق، على الرغم من أن عملية استكشاف الأخطاء كانت جارية منذ عدة أسابيع. خلال الاجتماعات اليومية، يشكو الفريق من التحدي التقني ونقص المعرفة لحل المشكلة.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لحل هذه المشكلة؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحتان: تصعيد القضية إلى مدير وظيفي لجلب خبير تقني إلى الفريق + شرح الوضع للعميل وتضمين خطة عمل.\n\n- شرح مفصل:\n1. استقدام خبير تقني يحل المشكلة التقنية التي لا يملك الفريق خبرة بها.\n2. الحفاظ على تواصل واضح مع العميل لطمأنته أن هناك خطة واضحة لحل المشكلة.\n\n- سبب خطأ الخيارات الأخرى:\n- إبقاء الفريق يعمل على السجل الحالي: تجاهل المشكلة الأساسية.\n- تحديث السجلات: ليس كافيًا بدون اتخاذ إجراء عملي.\n- تحديد تاريخ إصدار جديد: خطوة لاحقة بعد حل المشكلة.",
      "choices": [
        {
          "text": "تصعيد القضية إلى مدير وظيفي لجلب خبير تقني إلى الفريق.",
          "correct": true
        },
        {
          "text": "شرح الوضع للعميل وتضمين خطة عمل.",
          "correct": true
        },
        {
          "text": "إبقاء الفريق يعمل على سجل الأعمال الحالي لإنجاز معلم الإصدار التالي.",
          "correct": false
        },
        {
          "text": "تحديث سجلات القضايا والمخاطر، بما في ذلك خطة العمل لحل المشكلة.",
          "correct": false
        },
        {
          "text": "تحديد تاريخ إصدار جديد لهذا التسليم مع مالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أصحاب المصلحة الرئيسيين غير راضٍ عن الميزات الجديدة في التكرار الحالي للمنتج. لم يكن هذا الطرف متاحًا خلال المراجعة الأخيرة ولم تتح له الفرصة لتقديم مدخلاته.\n\nما الذي كان ينبغي على مدير المشروع فعله لمنع استياء صاحب المصلحة؟",
      "explanation": "الإجابة الصحيحة: التأكد من أن معلومات المشروع المحدثة متاحة دائمًا لجميع أصحاب المصلحة.\n\n- شرح مفصل:\nفي البيئة الرشيقة، من الضروري ضمان توفر المعلومات للجميع في أي وقت لضمان الشفافية وتجنب فقدان مدخلات مهمة.\n\n- سبب خطأ الخيارات الأخرى:\n- الانتظار حتى يوافق الجميع: يعطل العمل.\n- الاجتماع مع كل طرف بشكل فردي: غير عملي.\n- جدولة الاجتماعات حسب حضور الجميع: مستحيل في كثير من الحالات.",
      "choices": [
        {
          "text": "الانتظار حتى يوافق جميع أصحاب المصلحة على التغيير قبل تنفيذه.",
          "correct": false
        },
        {
          "text": "التأكد من أن معلومات المشروع المحدثة متاحة دائمًا لجميع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "الاجتماع بشكل فردي مع كل صاحب مصلحة لتجنب الخلاف.",
          "correct": false
        },
        {
          "text": "جدولة الاجتماعات فقط عندما يتمكن جميع أصحاب المصلحة من الحضور.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ مشروع لتقنية المعلومات، يكتشف اثنان من أعضاء الفريق ميزة جديدة ستغير مظهر المنتج وتجعله أكثر جاذبية من الناحية الجمالية. وبسبب حماسهما، يتوجهان إلى مدير المشروع لطلب الموافقة على إضافة هذه الميزة، التي من المحتمل أن تزيد من رضا العميل وربما تعزز فرص الشركة في الحصول على عقود إضافية من العميل.\n\nكيف يجب على مدير المشروع الرد؟",
      "explanation": "الإجابة الصحيحة: تذكير أعضاء الفريق بأنه من دون طلب تغيير معتمد، يجب التركيز على النطاق المتفق عليه.\n\nشرح مفصل:\n- في إدارة المشاريع الاحترافية، إضافة أي ميزة خارج النطاق المتفق عليه يسمى (Scope Creep) وهو سبب رئيسي في فشل المشاريع.\n- حتى وإن كانت الميزة مفيدة أو جذابة، لا يمكن تنفيذها دون المرور عبر عملية إدارة التغيير الرسمية.\n- الهدف الأساسي هو الالتزام بخطة المشروع وعدم التأثر بالحماس الشخصي أو التوقعات غير الرسمية.\n\nسبب خطأ الخيارات الأخرى:\n- الموافقة لتحقيق توقعات الفريق: يؤدي إلى تجاوز النطاق والميزانية.\n- الحصول على موافقة الفريق فقط: الفريق لا يمثل سلطة التغيير.\n- تنفيذ التغيير لتحسين الإيرادات: مخاطرة بإخراج المشروع عن السيطرة.",
      "choices": [
        {
          "text": "الموافقة على الفكرة لتحقيق توقعات أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تذكير أعضاء الفريق بأنه من دون طلب تغيير معتمد، يجب التركيز على النطاق المتفق عليه.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة بقية الفريق وتنفيذ الميزة بمجرد موافقتهم.",
          "correct": false
        },
        {
          "text": "تنفيذ التغيير بأسرع وقت ممكن لتحسين فرص الإيرادات المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مدير مشروع لإدارة مشروع لشركة ناشئة تتلقى تمويلاً من مصدر أجنبي. في منتصف المشروع، يتم إبلاغ مدير المشروع بأن هناك متطلبات تنظيمية حكومية قد تؤثر على المشروع بسبب التمويل الأجنبي.\n\nما الذي يجب أن يفعله مدير المشروع بالنظر إلى أنه قد تم الحصول على جميع الموافقات اللازمة؟",
      "explanation": "الإجابة الصحيحة: تأكيد التزام المشروع بجميع اللوائح ومتابعة جميع التداعيات القانونية.\n\nشرح مفصل:\n- حتى إذا تم الحصول على الموافقات في البداية، قد تظهر متطلبات تنظيمية جديدة أو يتم اكتشاف ثغرات.\n- مسؤولية مدير المشروع التأكد المستمر من التوافق مع القوانين واللوائح خاصةً عند وجود تمويل خارجي.\n- هذا يعزز الشفافية ويمنع تعرض المشروع لمشاكل قانونية لاحقًا.\n\nسبب خطأ الخيارات الأخرى:\n- تحديد ملكية المشروع ومتابعة العمل: غير كافٍ إذا وُجدت لوائح جديدة.\n- الرجوع إلى سجل المخاطر: الإجراء غير كافٍ في هذه الحالة.\n- إيقاف المشروع وطلب أموال: ليس ضروريًا مباشرةً قبل التحقق من الوضع القانوني.",
      "choices": [
        {
          "text": "تحديد ملكية المشروع بناءً على ميثاق المشروع المعتمد مسبقًا ومتابعة العمل.",
          "correct": false
        },
        {
          "text": "الرجوع إلى سجل المخاطر لتحديد احتمال قبول المشروع من قبل العميل وتوافقه مع المتطلبات التنظيمية.",
          "correct": false
        },
        {
          "text": "تأكيد التزام المشروع بجميع اللوائح ومتابعة جميع التداعيات القانونية.",
          "correct": true
        },
        {
          "text": "إيقاف المشروع وطلب أموال إضافية للحصول على تصاريح العمل ومواصلة المشروع دون تأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "مدير مشروع يدير مشروعًا طويل الأمد ومتأخر عن الجدول الزمني. يشعر العميل بالقلق من احتمال تأخر المشروع.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لمعالجة مخاوف العميل؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحتان: إضافة المزيد من الموارد إلى المهام الموجودة في المسار الحرج + تنفيذ بعض الأنشطة بشكل متزامن.\n\nشرح مفصل:\n- إضافة موارد إلى المسار الحرج: يساعد على تقليل مدة المهام الحرجة التي تحدد مدة المشروع بالكامل.\n- تنفيذ الأنشطة بشكل متزامن (Fast Tracking): هو أسلوب تسريع شائع لكنه يحتاج لمراجعة المخاطر.\n\nسبب خطأ الخيارات الأخرى:\n- إنشاء جدول خط أساس جديد: لا يحل المشكلة بل يوثقها فقط.\n- مراجعة عملية التحكم في التغيير: لا يعالج التأخير مباشرة.\n- تحليل احتياطي المخاطر: إجراء طويل وغير مناسب كأولوية في حالة التأخير الحاد.",
      "choices": [
        {
          "text": "إنشاء جدول خط أساس جديد.",
          "correct": false
        },
        {
          "text": "مراجعة عملية التحكم في التغيير.",
          "correct": false
        },
        {
          "text": "إضافة المزيد من الموارد إلى المهام الموجودة في المسار الحرج.",
          "correct": true
        },
        {
          "text": "إجراء تحليل احتياطي المخاطر.",
          "correct": false
        },
        {
          "text": "تنفيذ بعض الأنشطة بشكل متزامن.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير قسم دور مالك المنتج في مشروع حكومي لتطوير البرمجيات. لكن هذا المدير غير قادر باستمرار على التفاعل مع الفريق وتقديم ملاحظات منتظمة وهامة على مخرجات المشروع.\n\nماذا يجب أن يفعل مدير المشروع لحل هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: تحديد تفضيلات الاتصال ومراجعة المسؤوليات.\n\nشرح مفصل:\n- تحديد تفضيلات الاتصال: فهم الطريقة التي يفضلها مالك المنتج للتواصل (اجتماعات، بريد إلكتروني، مكالمات) يساعد على تحسين التواصل وجعله أكثر فعالية.\n- مراجعة المسؤوليات: توضيح دور ومسؤوليات مالك المنتج في المشروع لضمان التزامه بتقديم الملاحظات بشكل منتظم.\n\nسبب خطأ الخيارات الأخرى:\n- الحصول على ملاحظات بديلة من العميل: غير عملي ولا يعالج المشكلة مع مالك المنتج الأساسي.\n- التوصية بسياسة الباب المفتوح: ليست حلاً مباشراً لمشكلة التواصل غير المنتظم.\n- اعتماد نهج تعاوني: مصطلح عام ولا يعالج سبب المشكلة بوضوح.",
      "choices": [
        {
          "text": "تحديد تفضيلات الاتصال ومراجعة المسؤوليات.",
          "correct": true
        },
        {
          "text": "الحصول على ملاحظات بديلة من العميل.",
          "correct": false
        },
        {
          "text": "التوصية بسياسة الباب المفتوح للمشروع.",
          "correct": false
        },
        {
          "text": "اعتماد نهج تعاوني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع عملية ترقية من نظام قديم إلى إصدار جديد. في منتصف العملية، فشل النظام القديم في الترقية ولم يمكن استعادته.\n\nماذا يجب أن يفعل مدير المشروع لإدارة هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: تقييم تأثيرات الفشل والتواصل بشأنها مع أصحاب المصلحة المعنيين.\n\nشرح مفصل:\n- تقييم التأثيرات: يجب على مدير المشروع تحليل مدى تأثير فشل النظام على المشروع من حيث الوقت، التكلفة، والجودة.\n- التواصل مع أصحاب المصلحة: إعلام المعنيين بالمشكلة والتأثيرات المحتملة يضمن الشفافية ويساعد في اتخاذ قرارات مستنيرة بشأن الخطوات التالية.\n\nسبب خطأ الخيارات الأخرى:\n- التخلي عن النظام القديم وإخبار الفريق بتسريع العمل على المخرجات الأخرى: تجاهل المشكلة قد يؤدي إلى مزيد من التعقيدات.\n- طلب المزيد من الوقت لاستعادة النظام القديم مع الاستمرار في المشروع: قد لا يكون ممكنًا أو عمليًا دون تقييم دقيق.\n- إخبار الفريق بالاستمرار في العمل لأنهم غير مسؤولين عن النظام القديم: هذا يقلل من روح الفريق وقد يؤدي إلى فقدان التركيز على الحلول.",
      "choices": [
        {
          "text": "التخلي عن النظام القديم وإخبار الفريق بتسريع العمل على المخرجات الأخرى.",
          "correct": false
        },
        {
          "text": "طلب المزيد من الوقت لاستعادة النظام القديم مع الاستمرار في المشروع.",
          "correct": false
        },
        {
          "text": "تقييم تأثيرات الفشل والتواصل بشأنها مع أصحاب المصلحة المعنيين.",
          "correct": true
        },
        {
          "text": "إخبار الفريق بالاستمرار في العمل لأنهم غير مسؤولين عن النظام القديم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "على الرغم من أن العميل يتلقى تقارير السرعة ونتائج السبرينت من مدير المشروع عبر البريد الإلكتروني، إلا أن التصعيدات إلى راعي المشروع بشأن أداء المشروع شائعة. ماذا يجب أن يفعل مدير المشروع في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: جدولة جلسات منتظمة مع العميل لشرح التقارير ومعالجة الملاحظات.\n\nشرح مفصل:\n- التواصل المباشر: عقد اجتماعات منتظمة مع العميل يسمح بالشرح التفصيلي للتقارير والتعامل مع أي مخاوف فوراً.\n- معالجة الملاحظات: الاستجابة السريعة للتعليقات تساعد على بناء ثقة العميل وتقليل التصعيدات.\n\nسبب خطأ الخيارات الأخرى:\n- إشراك العميل في تخطيط واستعراض السبرينت للاتفاق على تواريخ الإطلاق: خطوة مهمة لكنها لا تعالج مباشرة مشكلة التصعيد.\n- إرسال مستند يوضح قدرة الفريق وتوزيع الأدوار إلى العميل: وثيقة فقط ولا تضمن التواصل الفعلي.\n- جعل القائد التقني يتصل بالعميل لشرح التفاصيل الفنية: قد يكون معقداً وغير مناسب للعميل غير التقني.",
      "choices": [
        {
          "text": "إشراك العميل في تخطيط واستعراض السبرينت للاتفاق على تواريخ الإطلاق.",
          "correct": false
        },
        {
          "text": "جدولة جلسات منتظمة مع العميل لشرح التقارير ومعالجة الملاحظات.",
          "correct": true
        },
        {
          "text": "إرسال مستند يوضح قدرة الفريق وتوزيع الأدوار إلى العميل.",
          "correct": false
        },
        {
          "text": "جعل القائد التقني يتصل بالعميل لشرح التفاصيل الفنية حول مشكلات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرر مدير المشروع أن استخدام نهج أجايل سيكون الأنسب لمشروع جديد. بعض أعضاء الفريق كانوا رافضين لاستخدام تقنيات أجايل وقرروا استخدام النهج التنبؤي لأداء عملهم.\n\nماذا كان يجب على مدير المشروع فعله في بداية المشروع؟",
      "explanation": "الإجابة الصحيحة: الدفاع عن استخدام تقنيات أجايل.\n\nشرح مفصل:\n- من الضروري في بداية المشروع أن يدافع مدير المشروع عن النهج المختار، ويوضح فوائده ومبررات اعتماده.\n- إقناع الفريق بخطوة التحول هو جزء من إدارة التغيير ويساعد على تقليل المقاومة.\n- الخيارات الأخرى مثل تقييم المهارات أو إشراك فقط من يوافقون أو توظيف مستشارين قد تكون ضرورية لاحقًا لكن الدفاع والإقناع المبدئي هو الأهم.\n\nسبب خطأ الخيارات الأخرى:\n- إجراء تقييم للمهارات: خطوة مهمة ولكن ليست كافية إذا لم يكن هناك قبول أولي للنهج.\n- إشراك فقط الموارد المرتاحة: يقلل من فرص نجاح المشروع ويخلق فرق.\n- توظيف مستشارين: مكلف وربما غير ضروري إذا تمت إدارة التغيير بشكل جيد.",
      "choices": [
        {
          "text": "إجراء تقييم للمهارات الخاصة بالفريق.",
          "correct": false
        },
        {
          "text": "الدفاع عن استخدام تقنيات أجايل.",
          "correct": true
        },
        {
          "text": "إشراك فقط الموارد التي كانت مرتاحة لاستخدام أجايل.",
          "correct": false
        },
        {
          "text": "توظيف مستشارين في أجايل لقيادة الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام نهج أجايل. يقترب المشروع من مراحله النهائية، ويقوم الفريق بمراجعة مخرجات المشروع. خلال هذه المراجعة، يتضح أن هناك ميزة حاسمة مفقودة من عناصر المشروع. هذه الميزة ضرورية لكي يتوافق النظام مع تنظيم حكومي جديد.\n\nكيف يجب على مدير المشروع حل هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: يطلب من مالك المنتج إنشاء قصة مستخدم للسبرينت التالي.\n\nشرح مفصل:\n- في أجايل، يتم التعامل مع الميزات الجديدة أو التغييرات عبر قصص المستخدم التي تُضاف إلى سجل الأعمال (Backlog).\n- طلب إضافة قصة مستخدم للسبرينت التالي يسمح بمعالجة الميزة بشكل رسمي ومرن ضمن دورة تطوير أجايل.\n- البدائل الأخرى مثل إعادة تقييم خارطة الطريق أو إعداد تقرير إنهاء ليست ملائمة في هذه المرحلة.\n\nسبب خطأ الخيارات الأخرى:\n- اجتماع إعادة تقييم خارطة الطريق: خطوة أكبر مما هو مطلوب حالياً.\n- تقرير إنهاء المشروع: غير مناسب لميزة مفقودة ضمن المشروع الجاري.\n- الاستمرار مع تحديث تعريف الانتهاء: لا يعالج الميزة المفقودة بشكل مباشر.",
      "choices": [
        {
          "text": "يطلب من مالك المنتج إنشاء قصة مستخدم للسبرينت التالي.",
          "correct": true
        },
        {
          "text": "يجتمع مع فريق المشروع لإعادة تقييم خارطة طريق المنتج.",
          "correct": false
        },
        {
          "text": "يُعد تقرير إنهاء المشروع ويُسجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "يواصل التسليم ويُحدث تعريف الانتهاء (DoD).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "هناك مخاوف من أن المنتج المقرر إطلاقه قد لا يلبي متطلبات المستخدم النهائي المتفق عليها.\n\nكيف يجب على مدير المشروع تجنب هذا الموقف في المستقبل؟",
      "explanation": "الإجابة الصحيحة: عقد جلسة لمراجعة المخرج بالتفصيل.\n\nشرح مفصل:\n- عقد جلسات مراجعة مفصلة للمنتج مع المستخدمين وأصحاب المصلحة يضمن أن المنتج يلبي التوقعات والمتطلبات.\n- التواصل المستمر يسمح بالكشف المبكر عن القضايا وتصحيح المسار قبل الإطلاق.\n- الخيارات الأخرى مثل مناقشة الفوائد أو وجود قائمة متطلبات لا تكفي وحدها لضمان تطابق المنتج مع الاحتياجات.\n\nسبب خطأ الخيارات الأخرى:\n- مناقشة الفوائد: غير كافٍ لمعالجة المخاوف الفنية أو المتطلبات.\n- التأكد من وجود قائمة متطلبات: ضروري ولكن لا يكفي بدون مراجعة فعلية.\n- تقديم أمثلة مشاريع مماثلة: قد تكون غير ذات صلة أو غير كافية لتجنب المشاكل.",
      "choices": [
        {
          "text": "مناقشة الفوائد مع العميل.",
          "correct": false
        },
        {
          "text": "التأكد من وجود قائمة متطلبات المنتج (backlog).",
          "correct": false
        },
        {
          "text": "تقديم أمثلة على مشاريع مماثلة.",
          "correct": false
        },
        {
          "text": "عقد جلسة لمراجعة المخرج بالتفصيل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لإدارة مشروع في بلد لم تقم فيه الشركة بأعمال من قبل. في بداية المشروع، يلاحظ مدير المشروع وجود متطلبات تنظيمية معينة لا يمتلك الفريق خبرة فيها.\n\nما الخطوة التالية التي يجب أن يتخذها مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: الاستعانة بخبير موضوع للتحقق مما إذا كانت المتطلبات تنطبق على المشروع.\n\nشرح مفصل:\n- في حالة وجود متطلبات تنظيمية جديدة أو معقدة، من الضروري استشارة خبراء متخصصين (Subject Matter Experts) لفهم مدى تأثير هذه المتطلبات على المشروع.\n- هذا يساعد في اتخاذ قرارات مبنية على معلومات دقيقة وتجنب المخاطر التنظيمية.\n- الخيارات الأخرى مثل تخصيص ميزانية أو تصعيد المخاوف قد تكون لاحقًا بعد فهم المتطلبات.\n- استشارة خبير لتجنب المتطلبات غير مناسبة لأنها قد تؤدي إلى مخالفة القوانين.",
      "choices": [
        {
          "text": "تخصيص ميزانية كافية في حال تطلب الأمر تلبية هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "استشارة خبير موضوع حول كيفية تجنب هذه المتطلبات.",
          "correct": false
        },
        {
          "text": "الاستعانة بخبير موضوع للتحقق مما إذا كانت المتطلبات تنطبق على المشروع.",
          "correct": true
        },
        {
          "text": "تصعيد المخاوف بشأن المتطلبات إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "أبلغ عضو في فريق داخل منظمة هجينة مدير المشروع بطريقة جديدة لتنفيذ نشاط ما تستغرق وقتًا أقل. لم يستخدم مدير المشروع هذه الطريقة من قبل، لكن عضو الفريق الموثوق يشرح أن لديه خبرة سابقة تؤكد فعالية هذه الطريقة.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحتان: تقييم تأثير اعتماد الطريقة الجديدة + التواصل بشأن التأثير مع أصحاب المصلحة الرئيسيين.\n\nشرح مفصل:\n- تقييم التأثير يساعد على فهم المخاطر والفرص المرتبطة بالطريقة الجديدة قبل تبنيها.\n- التواصل مع أصحاب المصلحة ضروري لضمان توافق الجميع وعدم المفاجأة.\n- الخيارات الأخرى مثل إشراك المدير الوظيفي أو تحديث هيكل تقسيم العمل غير مناسبة في هذه المرحلة، وكذلك تأجيل القرار قد يؤدي إلى تأخير.",
      "choices": [
        {
          "text": "إشراك المدير الوظيفي لعضو الفريق.",
          "correct": false
        },
        {
          "text": "تأجيل القرار حتى السبرينت التالي.",
          "correct": false
        },
        {
          "text": "تحديث هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "تقييم تأثير اعتماد الطريقة الجديدة.",
          "correct": true
        },
        {
          "text": "التواصل بشأن التأثير مع أصحاب المصلحة الرئيسيين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد البائعين في المشروع تأخر في توفير حل منتج مرتبط، مما يؤثر على تواريخ الإطلاق.\n\nماذا يجب أن يفعل مدير المشروع لمساعدة فريق أجايل في التعامل مع هذا العائق؟",
      "explanation": "الإجابة الصحيحة: العمل مع البائع لفهم البدائل.\n\nشرح مفصل:\n- التعاون مع البائع لمعرفة الحلول البديلة يمكن أن يساعد في تقليل التأثير السلبي على المشروع.\n- هذا يتماشى مع مبادئ أجايل التي تركز على التفاعل والتعاون لحل المشكلات بسرعة.\n- الخيارات الأخرى مثل مراجعة تاريخ الإطلاق قد تكون لاحقًا بعد استكشاف البدائل.\n- تصعيد المشكلة أو إجبار الفريق والخبراء على العمل معاً دون تنسيق قد لا يكون فعالاً.",
      "choices": [
        {
          "text": "العمل مع البائع لفهم البدائل.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث تاريخ الإطلاق مع الفريق.",
          "correct": false
        },
        {
          "text": "جعل القائد التقني يصعد المشكلة إلى المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "جعل أعضاء الفريق والخبراء يعملون معًا على الحل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لضمان الجودة، تم إجراء تدقيق جودة على العمليات المستخدمة في خطة تنفيذ المشروع. إحدى مشكلات عدم المطابقة التي أثارها المدقق كانت غياب قوائم الحضور لاجتماعات مراجعة مخاطر المشروع.\n\nلماذا تعتبر قائمة الحضور مهمة؟",
      "explanation": "الإجابة الصحيحة: هي دليل على أن اجتماعات مراجعة المخاطر عُقدت مع أعضاء فريق المشروع المناسبين.\n\nشرح مفصل:\n- قائمة الحضور توثق الحضور الفعلي للأشخاص المعنيين بالمخاطر، مما يؤكد أن مراجعات المخاطر تمت بشكل رسمي ووفق الجدول.\n- هذه الوثائق تساعد في تتبع من شارك في الاجتماعات وتأكيد الشفافية والمسؤولية.\n- الخيارات الأخرى غير صحيحة لأنها لا تعكس الدور الأساسي لقائمة الحضور في إثبات صحة الاجتماعات.",
      "choices": [
        {
          "text": "هي وثيقة يتم تسجيلها ضمن سجل الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "هي سجل يُظهر عدد الحاضرين في الاجتماع.",
          "correct": false
        },
        {
          "text": "هي ممارسة قياسية في المشاريع لعقد اجتماعات مراجعة المخاطر بشكل اختياري.",
          "correct": false
        },
        {
          "text": "هي دليل على أن اجتماعات مراجعة المخاطر عُقدت مع أعضاء فريق المشروع المناسبين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم اكتشاف مشكلة تتعلق بالامتثال خلال تنفيذ المشروع. تسبب ذلك في إجراء تدقيق داخلي على المنتج، مما أدى إلى تأخير في الجدول الزمني.\n\nماذا كان يجب أن يفعل مدير المشروع في البداية لتجنب هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: ضمان توثيق متطلبات الامتثال.\n\nشرح مفصل:\n- توثيق متطلبات الامتثال من البداية يضمن فهم الفريق لما يجب الالتزام به أثناء التنفيذ.\n- هذا يمنع المفاجآت والتأخيرات الناتجة عن التدقيقات أو مراجعات الجودة.\n- الخيارات الأخرى مثل إنشاء قوالب أو توظيف مستشارين قد تساعد ولكنها ليست أول خطوة رئيسية.\n- إشراك أصحاب المصلحة مهم لكنه غير كافٍ دون وجود توثيق واضح للامتثال.",
      "choices": [
        {
          "text": "ضمان توثيق متطلبات الامتثال.",
          "correct": true
        },
        {
          "text": "إنشاء قوالب لتوثيق الامتثال.",
          "correct": false
        },
        {
          "text": "توظيف مستشار امتثال.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة في بداية المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تواجه المؤسسات تحديات مختلفة في مجالاتها التشغيلية بسبب عوامل خارجية. وقد تطلب هذا من الشركات تطوير مستندات تفاعل رسمية لتوجيه عملياتها المختلفة.\n\nكيف يجب على مدير المشروع إطلاع أعضاء الفريق وأصحاب المصلحة على خصوصية المعايير التنظيمية للمؤسسة؟",
      "explanation": "الإجابة الصحيحة: ستكون العوامل الخارجية المختلفة مدخلاً إلى خطة إدارة المشروع وستشكل جزءًا من الإحاطة في اجتماع الانطلاق.\n\nشرح مفصل:\n- اجتماع الانطلاق هو المكان المناسب لتعريف الفريق والعاملين بالمشروع بجميع العوامل المؤثرة، بما في ذلك المعايير التنظيمية.\n- إدخال هذه العوامل في خطة إدارة المشروع يضمن توثيقها ومتابعتها طوال دورة حياة المشروع.\n- الخيارات الأخرى غير صحيحة لأنها تقلل من أهمية التنسيق الرسمي والمركز لإبلاغ الفريق وأصحاب المصلحة.",
      "choices": [
        {
          "text": "ستكون العوامل الخارجية المختلفة مدخلاً إلى خطة إدارة المشروع وستشكل جزءًا من الإحاطة في اجتماع الانطلاق.",
          "correct": true
        },
        {
          "text": "يجب أن يكون أعضاء الفريق وأصحاب المصلحة على دراية مسبقة بالعوامل الخارجية وإدراجها أمر اختياري.",
          "correct": false
        },
        {
          "text": "يجب على أي شخص يشارك في المشروع فهم هذه العوامل الخارجية المختلفة وبذل جهد للبحث عنها.",
          "correct": false
        },
        {
          "text": "سيتم إبلاغ أعضاء الفريق وأصحاب المصلحة بهذه العوامل الخارجية المختلفة من خلال قناة الاتصال الرسمية للمؤسسة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "اقترب المشروع من الاكتمال عندما ظهر أحد أصحاب المصلحة المؤثرين والذي لم يتم التعرف عليه مسبقًا وهدد بتعطيل المشروع بعدم الموافقة على مستندات الإغلاق.\n\nما الإجراءان اللذان كان يجب على مدير المشروع اتخاذهما لتجنب ذلك؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحان:\n- تنفيذ تحديد أصحاب المصلحة خلال مرحلة بدء المشروع: لتحديد جميع أصحاب المصلحة المؤثرين من البداية.\n- تحديد وتحليل أصحاب المصلحة بشكل مستمر طوال مدة المشروع: لأن أصحاب المصلحة قد يتغيرون أو يظهرون خلال مراحل المشروع المختلفة.\n\nشرح مفصل:\n- عدم التعرف على أصحاب المصلحة المهمين في البداية قد يؤدي لمشاكل وتعطيل المشروع.\n- تحليل مستمر لأصحاب المصلحة يساعد على إدارة توقعاتهم واحتياجاتهم وتجنب المفاجآت.\n- الخيارات الأخرى غير صحيحة لأن مالك المشروع ليس دائمًا المصدر الوحيد لمعلومات أصحاب المصلحة، ولا يمكن الاعتماد على أن أصحاب المصلحة سيعرفون أنفسهم، والتوعية المستمرة ليست إجراء وقائي بحد ذاته بل جزء من إدارة أصحاب المصلحة.",
      "choices": [
        {
          "text": "كان يجب على مدير المشروع تنفيذ تحديد أصحاب المصلحة خلال مرحلة بدء المشروع.",
          "correct": true
        },
        {
          "text": "كان يجب على مالك المشروع إبلاغ مدير المشروع بجميع أصحاب المصلحة في المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يتم تحديد وتحليل أصحاب المصلحة بشكل مستمر طوال مدة المشروع.",
          "correct": true
        },
        {
          "text": "كان ينبغي على صاحب المصلحة أن يتقدم للتعريف بنفسه في بداية المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يتم توعية أصحاب المصلحة بمخاوفهم بشكل مستمر طوال المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يواجه المشروع عددًا كبيرًا من المشكلات التي تؤدي إلى عيوب وشكاوى من أصحاب المصلحة. كان مدير المشروع يفكر في نهج سريع وفعال لمعالجة هذه المشكلات.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحان:\n- جمع أعضاء فريق المشروع وعقد جلسة عصف ذهني: لجمع الأفكار بسرعة لتحديد الأسباب والحلول.\n- استخدام مخطط إيشيكاوا للمساعدة في تحديد المشكلات: أداة فعالة لتحليل أسباب المشاكل الرئيسية بطريقة منهجية.\n\nشرح مفصل:\n- استخدام الأدوات التحليلية مثل إيشيكاوا يساعد في فهم جذور المشكلات بدقة.\n- جلسة العصف الذهني تساهم في إشراك الفريق وحثهم على الإبداع في إيجاد حلول.\n- الخيارات الأخرى أقل فاعلية أو مناسبة لهذه الحالة، مثل الرجوع إلى الأصول التنظيمية أو تحليل الاتجاهات أو مخطط باريتو، التي قد تكون أكثر تعقيدًا أو أقل سرعة في معالجة المشاكل الطارئة.",
      "choices": [
        {
          "text": "جمع أعضاء فريق المشروع وعقد جلسة عصف ذهني.",
          "correct": true
        },
        {
          "text": "الرجوع إلى الأصول التنظيمية للعمليات (OPAs) لتقييم الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "استخدام تحليل الاتجاه لإشراك بعض أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "استخدام مخطط إيشيكاوا للمساعدة في تحديد المشكلات.",
          "correct": true
        },
        {
          "text": "استخدام مخطط باريتو لتحديد كيفية معالجة تحديات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "دخل مدير المشروع إلى مكتب المشروع ووجد أحد أعضاء الفريق وممثل المورد في خلاف حول بند في اتفاقية التوريد. يدعو مدير المشروع المورد إلى جلسة تفاوض مع فريق المشروع لحل النزاع.\n\nوفقًا لمبادئ التفاوض، ما الهدف الذي يجب أن يسعى إليه مدير المشروع والفريق؟",
      "explanation": "الإجابة الصحيحة: تحقيق هدف المشروع بنتيجة رابح-رابح.\n\nشرح مفصل:\n- التفاوض الفعّال في إدارة المشاريع يهدف إلى إيجاد حلول تحقق مصلحة جميع الأطراف (رابح-رابح)، مما يحافظ على العلاقة ويضمن استمرار التعاون.\n- نتائج رابح-خاسر قد تسبب استياء الطرف الخاسر وتضر بالعلاقة وتؤثر سلبًا على المشروع.\n- التخلي عن هدف المشروع أو تحقيق الهدف بغض النظر عن النتيجة ليست من مبادئ التفاوض الناجح، لأنها قد تضر بالمشروع أو بالعلاقات بين الأطراف.",
      "choices": [
        {
          "text": "التخلي عن هدف المشروع لتحقيق نتيجة رابح-خاسر.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع بنتيجة رابح-خاسر.",
          "correct": false
        },
        {
          "text": "تحقيق هدف المشروع بنتيجة رابح-رابح.",
          "correct": true
        },
        {
          "text": "تحقيق هدف المشروع بغض النظر عن نتيجة التفاوض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير المشروع في الشهر الخامس من تنفيذ مشروع إنشاء. أبلغ المخطط أن مؤشر أداء الجدول الزمني الحالي (SPI) ومؤشر أداء التكلفة (CPI) هما 0.8 و0.9 على التوالي.\n\nما الخياران اللذان سيساعدان في تسريع المشروع؟ (اختر اثنين)",
      "explanation": "الإجابتان الصحيحتان: زيادة عدد الموارد لتنفيذ الأنشطة بشكل أسرع + إعادة ترتيب الجدول الزمني لتنفيذ بعض الأنشطة بالتوازي.\n\nشرح مفصل:\n- زيادة الموارد: تعني إحضار المزيد من الأشخاص أو المعدات لتسريع إنجاز المهام وتقليل الوقت اللازم.\n- التنفيذ المتوازي (Fast Tracking): يسمح ببعض الأنشطة التي كانت تسير بالتتابع أن تُنفذ في نفس الوقت، مما يقلل من مدة المشروع.\n\nسبب خطأ الخيارات الأخرى:\n- تعديل إجراءات العمل: رغم تحسين الكفاءة، إلا أنه قد لا يكون كافياً لتسريع المشروع بشكل كبير.\n- تغيير المسار الحرج: لا يمكن استبدال أنشطة المسار الحرج بأنشطة هامشها موجودة لأن ذلك قد يؤخر المشروع.\n- ساعات العمل الإضافية: قد تؤدي إلى إرهاق الفريق ولا تعتبر حلًا مستدامًا على المدى الطويل.",
      "choices": [
        {
          "text": "تعديل إجراءات العمل لتبسيطها وتحسين الكفاءة باستخدام الموارد الحالية.",
          "correct": false
        },
        {
          "text": "تغيير المسار الحرج عن طريق استبدال بعض أنشطة المسار الحرج بأنشطة تحتوي على هامش.",
          "correct": false
        },
        {
          "text": "زيادة عدد الموارد لإشراك مزيد من الأشخاص وإنجاز الأنشطة بشكل أسرع.",
          "correct": true
        },
        {
          "text": "إعادة ترتيب الجدول الزمني بحيث يمكن تنفيذ بعض الأنشطة على المسار الحرج بالتوازي لتقليل مدة المشروع.",
          "correct": true
        },
        {
          "text": "مطالبة الموارد بالعمل لساعات إضافية لتسريع المشروع وتحقيق نتائج أفضل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مع اقتراب المشروع من الاكتمال، نشأ صراع بين مالك المنتج وراعي المشروع حول من يمتلك الفوائد الناتجة عن التسليم، مما أدى إلى نزاع قانوني.\n\nماذا كان يجب على مدير المشروع فعله لمنع حدوث هذا الصراع؟",
      "explanation": "الإجابة الصحيحة: تطوير واعتماد الحالة التجارية بشكل مشترك مع مالك المنتج وراعي المشروع.\n\nشرح مفصل:\n- الحالة التجارية (business case) توضح القيمة والفوائد التي يتوقع الحصول عليها من المشروع.\n- تطويرها واعتمادها بشكل مشترك بين الأطراف المعنية يساعد على وضوح الملكية والمسؤوليات.\n- هذا يمنع النزاعات حول الفوائد ويعزز التفاهم المشترك.\n\nسبب خطأ الخيارات الأخرى:\n- تحديد راعي المشروع فقط لا يكفي لمنع النزاعات.\n- توثيق المشكلات ومراقبتها مفيد لكنه يأتي بعد ظهور المشكلات.\n- إنشاء هيكل العمل لا يعالج النزاعات المتعلقة بالملكية والفوائد.",
      "choices": [
        {
          "text": "تحديد راعي المشروع كأحد أصحاب المصلحة في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تطوير واعتماد الحالة التجارية (business case) بشكل مشترك مع مالك المنتج وراعي المشروع.",
          "correct": true
        },
        {
          "text": "تحديد وتوثيق أي مشكلات محتملة في سجل القضايا ومراقبتها بشكل متكرر.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تفصيلي للعمل (WBS) وتنفيذ تتبع منهجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا لمشروع في مجال تكنولوجيا المعلومات. المشروع في مرحلة البدء، واكتشف الفريق وجود مشكلة في التوافق في البنية التحتية التقنية المستخدمة من قبل البائع والمنظمة.\n\nما الخطوة الأولية التي يجب أن يتخذها مدير المشروع لمعالجة هذه المشكلة بفعالية؟",
      "explanation": "الإجابة الصحيحة: الرجوع إلى قاعدة بيانات الدروس المستفادة.\n\nشرح مفصل:\n- الدروس المستفادة من مشاريع سابقة قد توفر حلولًا أو تجنبًا لمشاكل التوافق التقنية.\n- هذا يوفر الوقت والجهد بدلًا من تجربة حلول جديدة دون معرفة نتائجها.\n- يمكن أن تساعد هذه المعلومات في تخطيط استراتيجيات التعامل مع المشكلة الحالية.\n\nسبب خطأ الخيارات الأخرى:\n- فحص البدائل أو تصعيد المشكلة ضروريان لاحقًا لكن أول خطوة منطقية هي البحث عن تجارب سابقة.\n- التشاور مع راعي المشروع مهم لكن لا يحل المشكلة الفنية بحد ذاته.",
      "choices": [
        {
          "text": "فحص ما إذا كانت هناك بدائل أخرى.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى فريق البنية التحتية التقنية.",
          "correct": false
        },
        {
          "text": "الرجوع إلى قاعدة بيانات الدروس المستفادة.",
          "correct": true
        },
        {
          "text": "التشاور مع راعي المشروع بشأن المشكلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أجرى مدير مشروع تحليلًا مع أصحاب المصلحة المعنيين للتحقق من توافق المشروع مع استراتيجية المؤسسة والقيمة التجارية المتوقعة. تغيب العديد من أصحاب المصلحة الرئيسيين عن جلسة التحليل ولم يتم تضمين مدخلاتهم.\n\nما العاقبة الرئيسية لغياب أصحاب المصلحة عن جلسة التحليل؟",
      "explanation": "الإجابة الصحيحة: مدخلات غير متسقة حول الفوائد من أصحاب المصلحة الرئيسيين.\n\n- شرح مفصل:\nغياب أصحاب المصلحة الرئيسيين في جلسات التحليل يؤدي إلى نقص في المعلومات المهمة التي تؤثر على فهم الفريق للفوائد والأهداف المطلوبة، مما يسبب تناقضًا في التوقعات. هذا بدوره قد يؤدي إلى سوء التخطيط والتنفيذ.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تأخر الموافقة على طلبات التغيير أمر محتمل لكنه ليس العاقبة الرئيسية للغياب.\n- عدم رضا أصحاب المصلحة قد يحدث لاحقًا لكنه نتيجة ثانوية وليست السبب المباشر.\n- الصراعات في المراحل اللاحقة قد تنجم عن أسباب متعددة وليس فقط غياب أصحاب المصلحة في جلسة التحليل.",
      "choices": [
        {
          "text": "تأخر الموافقة الرسمية على طلبات تغيير المشروع.",
          "correct": false
        },
        {
          "text": "عدم رضا أصحاب المصلحة عن التسليمات الأساسية للمشروع.",
          "correct": false
        },
        {
          "text": "قد يؤدي إلى صراعات في المراحل اللاحقة من المشروع.",
          "correct": false
        },
        {
          "text": "مدخلات غير متسقة حول الفوائد من أصحاب المصلحة الرئيسيين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع نشر لاستبدال بعض المعدات التي ستصبح قديمة قريبًا. كشفت مراجعة الجدول الزمني والتكلفة عن تأخير محتمل مدته 5 أشهر.\n\nكيف يجب على مدير المشروع معالجة المخاطر الناتجة عن هذا التأخير؟",
      "explanation": "الإجابة الصحيحة: تحليل الأثر التجاري من أجل إعادة ترتيب أولويات التسليمات.\n\n- شرح مفصل:\nيجب على مدير المشروع تقييم تأثير التأخير على العمل التجاري العام لترتيب أولويات التسليمات بطريقة تقلل الأثر السلبي.\n\n- لماذا الخيارات الأخرى خاطئة:\n- طلب التفاوض مع البائعين قد يكون مفيدًا لكنه ليس الحل الأول الذي يواجه المشكلة التجارية.\n- شراء معدات جديدة فورًا قد لا يكون ممكنًا أو اقتصاديًا دون تقييم دقيق.\n- الاعتراف بالقيود أثناء التخطيط لا يعالج المشكلة الفعلية للتأخير الموجود.",
      "choices": [
        {
          "text": "تحليل الأثر التجاري من أجل إعادة ترتيب أولويات التسليمات.",
          "correct": true
        },
        {
          "text": "طلب التفاوض مع البائعين لتمديد فترة الدعم.",
          "correct": false
        },
        {
          "text": "طلب شراء معدات جديدة فورًا لتجنب مشكلات الدعم.",
          "correct": false
        },
        {
          "text": "الاعتراف بهذه القيود وأخذها بعين الاعتبار أثناء التخطيط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، تم إبلاغ مدير المشروع بأن بعض الموارد سيتم سحبها من المشروع قريبًا. ماذا يجب على مدير المشروع أن يفعل لمعالجة هذا الوضع؟",
      "explanation": "الإجابة الصحيحة: طلب تسوية الموارد.\n\n- شرح مفصل:\nسحب الموارد قد يؤثر على الجدول الزمني والجودة، لذا يجب على مدير المشروع التواصل مع أصحاب المصلحة والجهات المعنية للتفاوض على بدائل أو تعويضات لتسوية نقص الموارد.\n\n- لماذا الخيارات الأخرى خاطئة:\n- جدولة اجتماع أو إبلاغ أصحاب المصلحة فقط لا يضمن معالجة المشكلة بفعالية.\n- تحديث سجل المخاطر هو إجراء ضروري لكنه لا يحل المشكلة العملية التي تتطلب تسوية فورية.",
      "choices": [
        {
          "text": "جدولة اجتماع لإبقاء أصحاب المصلحة على اطلاع.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة في اجتماع المراجعة التالي المجدول.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر بإدراج هذه المخاطرة المتعلقة بالموارد.",
          "correct": false
        },
        {
          "text": "طلب تسوية الموارد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التخطيط في المشروع، يجد مدير المشروع صعوبة في تحديد أصحاب المصلحة. وبدون مدخلات من أصحاب المصلحة المناسبين، سيكون من الصعب الحصول على ملاحظات المستخدمين.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: الرجوع إلى ميثاق المشروع لتحديد أصحاب المصلحة.\n\n- لماذا هذه الإجابة صحيحة: ميثاق المشروع يحتوي عادةً على قائمة مبدئية بأصحاب المصلحة الذين تمت الموافقة عليهم عند بدء المشروع، ويُعتبر مرجعًا رئيسيًا عند الحاجة لمراجعة أو تحديث معلومات أصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مراجعة خطة إشراك أصحاب المصلحة: هذه الخطة تُبنى بعد تحديد أصحاب المصلحة بالفعل.\n- إبلاغ رعاة المشروع: ليس الحل الأولي بل خطوة لاحقة لو تعذر الوصول إلى المعلومات.\n- مراجعة وثيقة نطاق المشروع: تركز على ما سيتم إنجازه وليس على من هم أصحاب المصلحة.",
      "choices": [
        {
          "text": "مراجعة خطة إشراك أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إبلاغ رعاة المشروع.",
          "correct": false
        },
        {
          "text": "الرجوع إلى ميثاق المشروع لتحديد أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "مراجعة وثيقة نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق المشروع في السبرينت الثالث عشر من مشروع مكون من أربعة عشر سبرينت. وضع الفريق ميزة مبتكرة على سجل المنتجات للنسخة القادمة. تم إعلام مالك المنتج بأن أحد المنافسين سيطلق منتجًا جديدًا يحتوي على ميزة مشابهة للتي تم وضعها في السجل. يطالب مالك المنتج بإدراج هذه الميزة المبتكرة في الإصدار الحالي.\n\nماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة: الاجتماع مع مالك المنتج وأصحاب المصلحة المعنيين لمناقشة التغيير وتحليل تأثيره.\n\n- لماذا هذه الإجابة صحيحة: أي تغيير متأخر في المشروع يجب أن يتم تقييم أثره أولًا قبل اتخاذ أي قرار، ويجب مشاركة أصحاب المصلحة الرئيسيين بذلك.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تنظيم اجتماع مع فريق التطوير فقط: هذا لا يشمل أصحاب المصلحة الذين قد يتأثرون.\n- إرسال طلب تغيير لـ CCB: خطوة لاحقة بعد التأكد من موافقة أصحاب المصلحة.\n- إبلاغ مالك المنتج بأنه سيتم تضمين الميزة في الإصدار القادم: هذا تجاوز لعملية إدارة التغيير بدون تقييم.",
      "choices": [
        {
          "text": "تنظيم اجتماع مراجعة مع فريق التطوير لفهم حجم العمل المطلوب.",
          "correct": false
        },
        {
          "text": "الاجتماع مع مالك المنتج وأصحاب المصلحة المعنيين لمناقشة التغيير وتحليل تأثيره.",
          "correct": true
        },
        {
          "text": "إجراء التقييمات المطلوبة ورفع طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "إبلاغ مالك المنتج بأنه سيتم تضمين هذه الميزة في الإصدار القادم من المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تصنيع معدات مشروع حاسمة من قبل مورد خارجي في الخارج. كشف مسح الجودة عن عدم الامتثال لبعض مواصفات المشروع.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: مراجعة عقد الإنتاج لتحديد ما إذا كانت المواصفات المشار إليها مدرجة فيه.\n\n- لماذا هذه الإجابة صحيحة: التعاقد هو المرجع القانوني والأساسي لضمان التزام الموردين. إذا لم تكن المواصفات منصوص عليها في العقد، فمن الصعب فرضها.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تعيين أفراد للإشراف: سيزيد التكاليف ولا يعالج المشكلة من جذورها.\n- ورشة عمل مع المورد: خطوة لاحقة بعد التأكد من بنود العقد.\n- اجتماعات منتظمة: لا تعالج نقطة الامتثال مباشرة دون الرجوع للعقد أولًا.",
      "choices": [
        {
          "text": "تعيين أفراد من المشروع للإشراف على منشأة المورد لضمان الامتثال للمواصفات.",
          "correct": false
        },
        {
          "text": "مراجعة عقد الإنتاج لتحديد ما إذا كانت المواصفات المشار إليها مدرجة فيه.",
          "correct": true
        },
        {
          "text": "جدولة ورشة عمل مع ممثلي المورد لتقديم نظرة عامة على مواصفات المشروع.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعات منتظمة مع المورد للتحكم شخصيًا في هذا الوضع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير المشروع على مشروع مشتريات لشركة تمتلك فريقًا مخصصًا لإدارة المشتريات يتولى جميع العقود. أظهر التقرير الفصلي وجود ستة عقود لا تتماشى مع أهداف الشركة.\n\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "الإجابة الصحيحة: اقتراح إنهاء جميع العقود غير المتوافقة.\n\nلماذا؟ العقود غير المتوافقة قد تضر بمصلحة الشركة واستمرارها مخالف لأهداف المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاحتفاظ بالعقود الستة: يؤدي إلى مخاطر إستراتيجية ومالية.\n- طلب من راعي المشروع مراجعة العقود: ليس دوره الرئيسي، بل هذا من مسؤولية مدير المشروع.\n- طلب من العميل مراجعة العقود: العميل ليس معنيًا بإدارة العقود الداخلية للشركة.",
      "choices": [
        {
          "text": "الاحتفاظ بالعقود الستة رغم عدم توافقها.",
          "correct": false
        },
        {
          "text": "اقتراح إنهاء جميع العقود غير المتوافقة.",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع مراجعة العقود.",
          "correct": false
        },
        {
          "text": "طلب من العميل مراجعة العقود.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع تقدم العمل، علم فريق المشروع أن خطرًا تم تحديده قد تحقق. قرر مدير المشروع تنفيذ خطة الاستجابة للمخاطر، لكن الاحتياطي المخصص للطوارئ لا يغطي الميزانية الكاملة لتلك الخطة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إصدار طلب تغيير لتعديل نطاق العمل والتكلفة وخطوط الأساس للجدول الزمني لدعم الخطة الجديدة.\n\nلماذا؟ طلب التغيير هو الإجراء الرسمي لتعديل خطة المشروع عندما تتجاوز الحالة الطارئة الاحتياطي.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استخدام الاحتياطي الإداري مباشرةً: غير ممكن بدون طلب تغيير.\n- طلب ميزانية إضافية: هذا يتم بعد الموافقة على التغيير.\n- تقليل الميزانية: يعرض المشروع لمخاطر أخرى غير مقبولة.",
      "choices": [
        {
          "text": "طلب من راعي المشروع استخدام الاحتياطي الإداري لتغطية باقي تكلفة الاستجابة.",
          "correct": false
        },
        {
          "text": "طلب من راعي المشروع تقديم ميزانية إضافية لتعويض الزيادة في التكاليف.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير لتعديل نطاق العمل والتكلفة وخطوط الأساس للجدول الزمني لدعم الخطة الجديدة.",
          "correct": true
        },
        {
          "text": "استخدام الاحتياطي المخصص وتقييم الخيارات لتقليل الميزانية لتغطية العمل المتبقي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق مشروع موزع سبرينت تضمن مهام معقدة قبل الموعد المحدد. أثناء اجتماع المراجعة، قاطع أحد الأعضاء الجدد الفريق وطلب من الجميع شرح أدوارهم وما ينوون العمل عليه في السبرينت التالي.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إبلاغ أعضاء الفريق أن من الأفضل مناقشة هذا في اجتماع آخر.\n\nلماذا؟ اجتماع المراجعة مخصص لمراجعة العمل المنجز، وليس لمناقشة الأدوار أو المهام المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الرد على العضو الجديد فورًا: يشتت تركيز الاجتماع.\n- مطالبة الجميع بشرح أدوارهم: ليس هو الهدف الآن.\n- تحديد اجتماعات فردية: يستهلك وقت وجهد زائدين بدون داعي.",
      "choices": [
        {
          "text": "التعامل مع الموقف فورًا والرد مباشرة على العضو الجديد.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق أن من الأفضل مناقشة هذا في اجتماع آخر.",
          "correct": true
        },
        {
          "text": "طلب من كل عضو في الفريق شرح دوره وما سيعمل عليه في السبرينت القادم.",
          "correct": false
        },
        {
          "text": "تحديد اجتماعات فردية بين كل عضو والعضو الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إغلاق المشروع، وجد العميل بعض العيوب في التسليم. ماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: مراجعة الناتج مقابل معايير القبول.\n\n- لماذا؟ قبل اتخاذ أي قرار أو تصعيد، يجب أولاً التأكد من أن ما يعتبره العميل عيوبًا هو فعلاً مخالف لمعايير القبول المحددة مسبقًا في خطة إدارة الجودة والمشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تمديد المشروع حتى يتم قبول جميع التسليمات: يتم فقط إذا ثبت وجود عدم تطابق مع معايير القبول.\n- إقناع العميل بقبول الناتج كما هو: يتعارض مع مبادئ إدارة الجودة.\n- دفع الغرامة عن العنصر المعيب: يتم اللجوء إليه فقط في حال ثبوت الخلل وبعد التأكد من الحقوق والالتزامات التعاقدية.",
      "choices": [
        {
          "text": "مراجعة الناتج مقابل معايير القبول.",
          "correct": true
        },
        {
          "text": "تمديد المشروع حتى يتم قبول جميع التسليمات.",
          "correct": false
        },
        {
          "text": "إقناع العميل بقبول الناتج كما هو.",
          "correct": false
        },
        {
          "text": "دفع الغرامة عن العنصر المعيب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تحول تنظيمي يحتوي على مسارين للعمل يعملان بالتوازي بين المقر الرئيسي ومكتب خارجي في الخارج. قبل بدء التنفيذ، من المقرر أن يلتقي مدير المشروع بقائد المكتب الخارجي.\n\nما الذي يجب أن يكون محور الاجتماع؟",
      "explanation": "الإجابة الصحيحة: إبلاغ قائد المكتب الخارجي بالقيمة الاستراتيجية للمشروع، والتسليمات الرئيسية، والمشاركة المتوقعة منه.\n\n- لماذا؟ قبل انطلاق أي مشروع، من الضروري ضمان أن جميع الأطراف المعنية تدرك أهمية المشروع، وماذا يُتوقع منهم تحديدًا.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التوصل إلى اتفاق بشأن استراتيجيات الشراء: هذه تفاصيل تنفيذية تأتي لاحقًا بعد تحديد الأهداف الكبرى.\n- مساعدة قائد المكتب الخارجي في التواصل: ليست أولوية مقارنة بتوضيح دوره ومسؤولياته.\n- تعيين خبير مختص (SME): قرار تنظيمي قد لا يكون ضروريًا أو من صلاحيات مدير المشروع مباشرة في هذه المرحلة.",
      "choices": [
        {
          "text": "إبلاغ قائد المكتب الخارجي بالقيمة الاستراتيجية للمشروع، والتسليمات الرئيسية، والمشاركة المتوقعة منه.",
          "correct": true
        },
        {
          "text": "التوصل إلى اتفاق بشأن استراتيجيات الشراء التي يجب اعتمادها من قبل المكتب الخارجي.",
          "correct": false
        },
        {
          "text": "مساعدة قائد المكتب الخارجي في التواصل مع موظفي المقر بشأن المشروع.",
          "correct": false
        },
        {
          "text": "تحديد وتعيين خبير مختص (SME) لتمثيل المشروع في المكتب الخارجي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تعاقد عميل مع شركة لإدارة مشروع كبير في بيئة رشيقة يضم العديد من المتعهدين الفرعيين.\n\nيقوم العميل بإعطاء أوامر مباشرة لهؤلاء المتعهدين بدلاً من التواصل مع مدير مشروع الشركة، مما تسبب في حدوث نزاعات داخل الفريق.\n\nما الذي يجب على مدير المشروع فعله لمنع تكرار هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: طلب من العميل عدم إعطاء أوامر مباشرة للمتعهدين الفرعيين.\n\n- لماذا؟ في بيئة المشاريع، المحافظة على خطوط الاتصال الرسمية أمر أساسي لتجنب الازدواجية في التعليمات وتضارب المسؤوليات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إبقاء الفريق على اطلاع بتوقعات العميل: لا يحل المشكلة التنظيمية المتعلقة بالاتصالات.\n- دعوة العميل إلى اجتماع تخطيط الفريق: قد يزيد التشويش بدل من تنظيم الأمور.\n- إخبار الفريق بتجنب النزاعات مع العميل: حل سلبي ولا يعالج السبب الجذري.",
      "choices": [
        {
          "text": "إبقاء الفريق على اطلاع بتوقعات العميل.",
          "correct": false
        },
        {
          "text": "دعوة العميل إلى اجتماع تخطيط الفريق.",
          "correct": false
        },
        {
          "text": "إخبار الفريق بتجنب النزاعات مع العميل.",
          "correct": false
        },
        {
          "text": "طلب من العميل عدم إعطاء أوامر مباشرة للمتعهدين الفرعيين.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، قرر الراعي استبدال خبير في الموضوع (SME) ضمن المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: ضمان وجود نقل معرفة كافٍ بين الخبير وخلفه.\n\n- الشرح: استبدال الخبير قد يؤدي لفقدان معلومات مهمة. لذا يجب التأكد من وجود عملية منظمة لنقل المعرفة لضمان استمرارية العمل دون تأثير سلبي.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التفاوض للاحتفاظ بالخبير: قد لا يكون ممكنًا دائمًا ولا يحل المشكلة بشكل مباشر.\n- إبلاغ الخبير الجديد بقاعدة المعرفة: غير كافٍ لنقل المعرفة العملية والتفصيلية.\n- الاجتماع مع الراعي لشرح النزاعات: لا علاقة له بالمشكلة الحالية.",
      "choices": [
        {
          "text": "التفاوض مع الراعي للاحتفاظ بالخبير ضمن المشروع.",
          "correct": false
        },
        {
          "text": "ضمان وجود نقل معرفة كافٍ بين الخبير وخلفه.",
          "correct": true
        },
        {
          "text": "إبلاغ الخبير الجديد أن قاعدة معارف المشروع تحتوي على جميع المعلومات المطلوبة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الراعي لشرح النزاعات داخل فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام العميل بمراجعة المنتج وطلب ميزات إضافية لم تكن موجودة في وثائق المتطلبات. وقد تم بالفعل تحسين حدود العمل قيد التقدم (WIP) للفرق التي تعمل على مكونات مختلفة.\n\nكيف يجب على مدير المشروع البدء في معالجة متطلبات العميل؟",
      "explanation": "الإجابة الصحيحة: مناقشة إمكانية وتأثير الميزات الجديدة مع مالك المنتج.\n\n- الشرح: مالك المنتج هو المسؤول عن إدارة سجل المنتجات وترتيب الأولويات، لذا يجب تقييم مدى إمكانية تضمين المتطلبات الجديدة وتأثيرها على الجدول والموارد.\n\n- لماذا الخيارات الأخرى خاطئة:\n- بناء المنتج حسب المتطلبات المتفق عليها: لا يتعامل مع التغيير الحالي.\n- تقسيم العمل على الفرق: يأتي بعد تقييم الميزة الجديدة.\n- إصدار إصدارات للتحقق من الميزات: خطوة لاحقة بعد اتخاذ قرار إدراج الميزات.",
      "choices": [
        {
          "text": "بناء المنتج وفقًا لمتطلبات العميل المتفق عليها مسبقًا.",
          "correct": false
        },
        {
          "text": "مناقشة إمكانية وتأثير الميزات الجديدة مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "تقسيم العمل المتعلق بالميزات الجديدة على الفرق القائمة.",
          "correct": false
        },
        {
          "text": "إصدار إصدارات من الميزات الإضافية للتحقق من صحتها لدى العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت منظمة بشراء منتج مشابه في منتصف دورة تطوير منتج محتمل، مما قد يؤدي إلى تداخل في محفظة المنتجات.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تقييم جدوى وقابلية استمرار المشروع مع مالك المنتج.\n\n- الشرح: يجب إعادة تقييم المشروع بناءً على التغيرات في محفظة المنتجات لضمان عدم وجود تداخل أو تضارب في الأهداف والقيمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مواصلة التطوير دون تقييم: قد يؤدي إلى هدر الموارد.\n- مناقشة الأثر مع الفريق فقط: ناقص دون اتخاذ قرار استراتيجي.\n- إيقاف المشروع دون تقييم: قرار متسرع وغير مدروس.",
      "choices": [
        {
          "text": "تقييم جدوى وقابلية استمرار المشروع مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "مواصلة تطوير المنتج من أجل مصلحة المنظمة.",
          "correct": false
        },
        {
          "text": "مناقشة الأثر المحتمل لعملية الشراء مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع حتى تظهر رؤية واضحة لخارطة طريق المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد إرسال تقرير الحالة الأخير عبر البريد الإلكتروني، علم مدير المشروع أن عددًا من المستلمين لم يعودوا مشاركين في المشروع. يحتاج مدير المشروع إلى التحقق من قائمة التوزيع لتقارير الحالة المستقبلية.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة وتحديث خطة إدارة الاتصالات.\n\n- الشرح: خطة إدارة الاتصالات تحتوي على تفاصيل حول كيفية وأين يتم إرسال المعلومات وأصحاب المصلحة المعنيين، لذلك يجب تحديثها لضمان وصول التقارير إلى الأشخاص الصحيحين.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خطة إدارة الجدول الزمني: لا تتعلق بتوزيع تقارير الحالة.\n- مصفوفة توزيع المسؤوليات: تركز على المسؤوليات وليس الاتصالات.\n- خطة إدارة الموارد: تهتم بالموارد البشرية والمادية وليس الاتصالات.",
      "choices": [
        {
          "text": "مراجعة وتحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث خطة إدارة الجدول الزمني.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث مصفوفة توزيع المسؤوليات.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث خطة إدارة الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق مشروع موزع على ثلاث دول مختلفة صعوبة في ترتيب الاجتماعات. كما أن أعضاء الفريق غير واضحين بشأن متطلبات المشروع ويجدون صعوبة في الحصول على إجابات لأسئلتهم.\n\nما الذي يجب فعله لزيادة نجاح المشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة الاتصالات وزيادة مشاركة المعلومات.\n\n- الشرح: خطة إدارة الاتصالات الجيدة تضمن تدفق المعلومات بفعالية وتساعد على تقليل الالتباس وتحسين وضوح المتطلبات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- العمل بشكل مستقل: يؤدي إلى ضعف التنسيق.\n- زيادة عدد الاجتماعات: قد لا يحل المشكلة إذا لم يكن هناك خطة تواصل فعالة.\n- طرح الأسئلة على المديرين الوظيفيين: قد يبطئ حل المشكلات ولا يعالج ضعف التواصل المباشر بين الفريق.",
      "choices": [
        {
          "text": "العمل بشكل مستقل حتى يحين وقت دمج الأعمال.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات وزيادة مشاركة المعلومات.",
          "correct": true
        },
        {
          "text": "زيادة عدد اجتماعات الفريق لمناقشة الأسئلة.",
          "correct": false
        },
        {
          "text": "طرح الأسئلة على المديرين الوظيفيين لحل المشكلات عبر الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق مشروع تكيفي موزع عالميًا ويتحدث أعضاؤه لغات رئيسية مختلفة. تُعقد الاجتماعات اليومية افتراضيًا بلغة مشتركة. تم إبلاغ مدير المشروع بوجود مشكلات في التواصل. تؤدي الفروقات في النطق واللهجات والمفردات إلى صعوبة الفهم بين الأعضاء.\n\nما الذي يجب أن يخصصه مدير المشروع لتحسين الاجتماعات اليومية وتجنب سوء الفهم؟",
      "explanation": "الإجابة الصحيحة: استخدام لوحة مهام إلكترونية لعرض حالة العمل وتقدمه بشكل مرئي.\n\n- الشرح: العرض المرئي يقلل الاعتماد على التواصل الشفهي فقط ويساعد على توضيح حالة العمل للجميع بغض النظر عن الفروقات اللغوية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تلخيص الحالة شفوياً: يزيد من سوء الفهم بسبب الفروقات اللغوية.\n- طلب ميزانية للترجمة: قد لا يكون عملي أو ممكن دائماً.\n- مطالبة الجميع بالتقارير الشفوية: لا يعالج مشكلة الفهم اللغوي.",
      "choices": [
        {
          "text": "استخدام المكالمة لتلخيص حالة العمل شفوياً كما يوضحها أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "استخدام لوحة مهام إلكترونية لعرض حالة العمل وتقدمه بشكل مرئي.",
          "correct": true
        },
        {
          "text": "طلب تغيير في ميزانية المشروع لتوفير خدمة الترجمة.",
          "correct": false
        },
        {
          "text": "مطالبة جميع أعضاء الفريق بالإبلاغ عن العمل المنجز والقادم والعوائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد. لا تزال المتطلبات قيد التطور، لكن هناك حاجة لتقديم قيمة تجارية بسرعة.\n\nما هو النهج الذي يجب أن يتبعه مدير المشروع في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: استخدام سجل المنتج (Product Backlog) وتنفيذ المتطلبات ذات الأولوية الأعلى أولاً.\n\n- الشرح: في حالة تطور المتطلبات والحاجة لتقديم قيمة بسرعة، من الأفضل التركيز على أولويات المتطلبات وتنفيذها بشكل تدريجي لضمان تحقيق قيمة مستمرة وتجنب التأخير.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تطوير استراتيجيات تخفيف المخاطر مهم لكنه لا يحقق القيمة بسرعة.\n- توثيق تغييرات النطاق ضروري لكنه لا يعالج أولوية التنفيذ.\n- مخطط تناقص المزايا يستخدم للمتابعة وليس لتحديد الأولويات التنفيذية.",
      "choices": [
        {
          "text": "تطوير استراتيجيات تخفيف لمعالجة مخاطر المتطلبات المتغيرة.",
          "correct": false
        },
        {
          "text": "استخدام سجل المنتج (Product Backlog) وتنفيذ المتطلبات ذات الأولوية الأعلى أولاً.",
          "correct": true
        },
        {
          "text": "ضمان توثيق تغييرات النطاق في مصفوفة تتبع المتطلبات.",
          "correct": false
        },
        {
          "text": "تطوير مخطط تناقص المزايا (Feature Burndown Chart) وإظهار التقدم في المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع ذو خبرة يوجه مدير مشروع جديد تم تعيينه في أول مشروع له. أثناء تحضير مدير المشروع الجديد للمشروع، شعر بالإرهاق بسبب العدد الكبير من أصحاب المصلحة الذين تم تحديدهم من قبل الفريق.\n\nماذا يجب أن يخبر مدير المشروع ذو الخبرة مدير المشروع الجديد ليفعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: إجراء تحليل لأصحاب المصلحة لتحديد الأهمية النسبية.\n\n- الشرح: تحليل أصحاب المصلحة يساعد في تصنيفهم بناءً على تأثيرهم واهتماماتهم، مما يسهل تركيز الجهود على أصحاب المصلحة الرئيسيين وعدم التشتت.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استخدام سجل العمل أو سجل أصحاب المصلحة وحده لا يكفي بدون تحليل.\n- تحديث خطة الاتصالات يعتمد على نتائج التحليل.\n- تحديد الأولويات بدون تحليل قد يكون غير منهجي وغير فعال.",
      "choices": [
        {
          "text": "إجراء تحليل لأصحاب المصلحة لتحديد الأهمية النسبية.",
          "correct": true
        },
        {
          "text": "تصنيف أصحاب المصلحة الرئيسيين باستخدام سجل العمل.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الاتصالات وفقًا لتفضيلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تحديد أولويات أصحاب المصلحة بناءً على سجل أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الوقوف اليومي، اكتشف مدير المشروع أن أحد مطوري البرمجيات يواجه صعوبة في إكمال العمل بسبب نقص الخبرة في اختبار الأتمتة، مما قد يؤثر على هدف السبرينت. يوجد مهندس ضمان الجودة في الفريق لديه خبرة في اختبار الأتمتة ولكنه مشغول حاليًا بإعداد عرض تقديمي للموظفين الجدد.\n\nما الإجراء الذي سيزيد من فرص تحقيق هدف السبرينت؟",
      "explanation": "الإجابة الصحيحة: طلب مساعدة مهندس ضمان الجودة لمطور البرمجيات في أقرب وقت ممكن.\n\n- الشرح: الاستفادة السريعة من خبرة مهندس ضمان الجودة تضمن حل المشكلة فورًا ودعم الفريق لتحقيق هدف السبرينت في الوقت المحدد.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إعادة التعيين بعد العرض التقديمي تؤخر الحل.\n- تدريب المطور قد يستغرق وقتًا أطول ولا يضمن الإنجاز الفوري.\n- إعادة جدولة الاختبار قد تؤثر على الجدول الزمني للسبرينت.",
      "choices": [
        {
          "text": "إعادة تعيين مهمة الأتمتة إلى المهندس بمجرد انتهائه من العرض التقديمي.",
          "correct": false
        },
        {
          "text": "تدريب مطور البرمجيات على اختبار الأتمتة فورًا ثم المتابعة.",
          "correct": false
        },
        {
          "text": "طلب مساعدة مهندس ضمان الجودة لمطور البرمجيات في أقرب وقت ممكن.",
          "correct": true
        },
        {
          "text": "إعادة جدولة اختبار الأتمتة حتى يتوفر مهندس ضمان الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع مصفاة نفط في منتصف مرحلة التنفيذ. اكتشف فريق المشروع أن المشروع تأخر بسبب تغيير في اللوائح البيئية، وتأخيرات في المشتريات، وتغير الحكومة. ومع ذلك، لا يزال التسليم النهائي مطلوبًا بشكل عاجل.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: مراجعة تأثير التغييرات، والامتثال للوائح الجديدة، ثم اقتراح خطة واقعية.\n\n- الشرح: \nفي هذا السيناريو، تأخرت المشروع بسبب عوامل خارجية مثل اللوائح البيئية الجديدة، وتأخيرات في المشتريات، وتغير الحكومة. إيقاف المشروع فورًا أو الاستمرار كما هو بدون مراجعة غير عملي.\n- على مدير المشروع تقييم تأثير هذه التغييرات على الجدول الزمني والتكلفة والنطاق.\n- يجب التأكد من الامتثال للوائح الجديدة لتجنب المخاطر القانونية.\n- بعد التقييم، يجب اقتراح خطة عمل جديدة تراعي الظروف المتغيرة مع محاولة تسليم المشروع بأفضل شكل ممكن وفي أقرب وقت.\n\n- سبب خطأ الخيارات الأخرى:\n- إيقاف المشروع فورًا قد يؤدي لخسائر كبيرة وغير ضروري إذا كان بالإمكان تعديل الخطة.\n- الاستمرار كما هو مخطط يتجاهل التغييرات المهمة ويؤدي لفشل المشروع.\n- التفاوض مع الحكومة دون مراجعة شاملة للخطة قد لا يحل المشكلة ويؤخر الإنجاز.",
      "choices": [
        {
          "text": "إيقاف المشروع فورًا لتجنب المزيد من الخسائر، وامتصاص الخسارة الحالية.",
          "correct": false
        },
        {
          "text": "مراجعة تأثير التغييرات، والامتثال للوائح الجديدة، ثم اقتراح خطة واقعية.",
          "correct": true
        },
        {
          "text": "ترتيب المشتريات اللازمة، ومواصلة المشروع كما هو مخطط.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع والتفاوض مع الحكومة الجديدة لدفع الفواتير حتى تلك النقطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في أولى دوراته الست. الفريق موزع عالميًا، لذلك تُعقد الاجتماعات افتراضيًا. بعد الاجتماع اليومي الخامس، يدرك مدير المشروع أن ليس جميع الأعضاء يشاركون بنشاط.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: الانخراط وتوجيه الفريق لتشجيع جميع الأعضاء على المشاركة.\n\n- الشرح:\n- ضعف المشاركة في فرق موزعة عالمياً هو تحدٍ شائع، ويجب أن يتدخل مدير المشروع بفعالية لتعزيز التواصل.\n- توجيه وتحفيز الفريق يساعد على خلق بيئة تفاعلية حيث يشعر الجميع بالمسؤولية والمساهمة.\n- طرح سؤال فقط عن سبب ضعف المشاركة دون تدخل مباشر قد لا يحل المشكلة.\n- مطالبة الأعضاء بالمشاركة الفردية دون دعم قد تسبب مقاومة أو ضغط غير مبرر.\n- السماح للفريق بالتعامل وحده بدون توجيه قد يؤدي لاستمرار المشكلة أو تفاقمها.",
      "choices": [
        {
          "text": "سؤال أعضاء الفريق عن سبب ضعف المشاركة.",
          "correct": false
        },
        {
          "text": "الانخراط وتوجيه الفريق لتشجيع جميع الأعضاء على المشاركة.",
          "correct": true
        },
        {
          "text": "مطالبة كل عضو بالمشاركة بشكل فردي في الاجتماعات القادمة.",
          "correct": false
        },
        {
          "text": "السماح للفريق بإيجاد طريقته الخاصة للمشاركة الكاملة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع لتحديث البنية التحتية لتقنية المعلومات في أحد البنوك. حصل مؤخرًا على موافقة خطة إدارة التغيير من الراعي. الآن، يطلب الراعي تنفيذ تقنية جديدة في الحل.\n\nماذا يجب أن يفعل مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).\n\n- الشرح:\n- تنفيذ تقنية جديدة يعتبر تعديلًا في نطاق المشروع يجب التعامل معه بشكل رسمي عبر إدارة التغيير.\n- طلب تغيير إلى لجنة مراقبة التغيير يضمن مراجعة الأثر المالي، الزمني، والموارد، ويؤمن الموافقة الرسمية.\n- إضافة التقنية كخطر في سجل المخاطر غير كافٍ لأنه يجب اتخاذ إجراء رسمي.\n- تحديث الجداول وخطوط الأساس يأتي بعد الموافقة على التغيير، وليس قبله.\n- طلب الشراء مباشرة من الراعي يتجاوز الإجراءات الرسمية لإدارة التغيير ويعرض المشروع للمخاطر.",
      "choices": [
        {
          "text": "إضافة التقنية الجديدة كخطر في سجل المخاطر.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تحديث الجداول وخطوط الأساس للتكلفة لتضمين التقنية الجديدة.",
          "correct": false
        },
        {
          "text": "طلب من الراعي شراء التقنية الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعبر أحد المطورين عن قلقه من الوقت الذي يقضيه في الاجتماعات اليومية وتحديث القصص وإنشاء المهام ومراجعة التبعيات، بدلاً من كتابة الشيفرة. يدعم باقي الفريق هذا الرأي.\n\nماذا يجب أن يفعل القائد الخادم (servant leader) بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: الاعتراف بإحباط المطور والتأكيد على فائدة كل نشاط.\n\n- الشرح:\nالقائد الخادم يدعم الفريق عبر الاستماع لمخاوفهم والتعاطف معهم، مع توضيح قيمة كل نشاط لتحسين العمل الجماعي وتحقيق أهداف المشروع.\n- تقليل التفاعل قد يضر بالتواصل والتنسيق.\n- طلب الاقتراحات مهم، لكنه يجب أن يأتي بعد فهم الموقف والاعتراف بمشاعر الفريق.\n- شرح مفهوم “رادياتور المعلومات” قد يكون مفيدًا لكن لا يعالج القلق الأساسي من فقدان الوقت.",
      "choices": [
        {
          "text": "طلب اقتراحات حول كيفية إدارة الوقت بشكل أكثر فعالية.",
          "correct": false
        },
        {
          "text": "تقليل التفاعل بين أعضاء الفريق لزيادة وقت التطوير.",
          "correct": false
        },
        {
          "text": "شرح مفهوم “رادياتور المعلومات” (information radiator) للفريق.",
          "correct": false
        },
        {
          "text": "الاعتراف بإحباط المطور والتأكيد على فائدة كل نشاط.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل أحد المطورين التسليم الخاص بميزة معينة. مالك المنتج غير متأكد من كيفية تقييم جودة التسليم.\n\nبالنظر إلى أن المشروع يستخدم نهج أجايل، ما الأداة أو التقنية التي يجب على مالك المنتج استخدامها؟",
      "explanation": "الإجابة الصحيحة: العروض التوضيحية / المراجعات.\n\n- الشرح:\nفي أجايل، تُستخدم العروض التوضيحية (demos) أو اجتماعات المراجعة لعرض المنتج على أصحاب المصلحة للحصول على تقييم مباشر وجودة العمل.\n- الحكم الخبير ليس دائمًا موثوقًا في بيئة أجايل المتغيرة.\n- اتخاذ القرار لا يحدد أداة تقييم بل هو عملية عامة.\n- قوائم التحقق مهمة لكنها أقل تفاعلية في تقديم تقييم عملي وفوري.",
      "choices": [
        {
          "text": "الحكم الخبير",
          "correct": false
        },
        {
          "text": "اتخاذ القرار",
          "correct": false
        },
        {
          "text": "العروض التوضيحية / المراجعات",
          "correct": true
        },
        {
          "text": "قوائم التحقق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا معقدًا لتطوير البرمجيات. لا يستطيع فريق المشروع الاتفاق على العملية التي يجب استخدامها عند حل مشكلة معينة.\n\nما النهج الذي يجب على مدير المشروع اتباعه لمساعدة الفريق في الوصول إلى توافق؟",
      "explanation": "الإجابة الصحيحة: تيسير اجتماع وتشجيع الأعضاء على اقتراح حلول محتملة.\n\n- الشرح:\nالتيسير هو أسلوب يعزز التعاون ويشجع مشاركة الجميع في إيجاد الحلول بدلاً من فرض قرارات خارجية.\n- فرض السلطة الخبيرة قد يقلل من حماس الفريق ويخلق مقاومة.\n- تحديث مصفوفة RACI أو تغيير الفريق لا يعالج سبب الخلاف أو يشجع الحوار.\n- تعيين قائد جديد قد يكون حلاً بعيد المدى لكن الأفضل أولاً محاولة التيسير لتحقيق التوافق داخل الفريق الحالي.",
      "choices": [
        {
          "text": "فرض السلطة الخبيرة وتحديد المسار للفريق.",
          "correct": false
        },
        {
          "text": "تحديث مصفوفة RACI وتعيين العمل لفريق مختلف.",
          "correct": false
        },
        {
          "text": "تعيين قائد فريق جديد لديه خبرة في حل مشاكل مشابهة.",
          "correct": false
        },
        {
          "text": "تيسير اجتماع وتشجيع الأعضاء على اقتراح حلول محتملة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إغلاق المشروع، يرى الفريق أن الاستعراض النهائي (retrospective) للسبرينت غير ضروري لأنه لم يتبقّ أي سبرينت.\n\nما النتيجة المفيدة المحتملة من عقد هذا الاستعراض؟",
      "explanation": "الإجابة الصحيحة: معلومات قد تكون مفيدة للمشاريع المستقبلية.\n\n- الشرح:\nالاستعراض النهائي للسبرينت هو فرصة للفريق لمراجعة الأداء والتعلم من النجاحات والإخفاقات. هذه الدروس تساعد في تحسين الأداء في المشاريع القادمة حتى لو لم يتبقّ سبرينت.\n- تحسين السرعة قد يحدث لكنه ليس الهدف الأساسي.\n- فرص الترقية ليست مرتبطة مباشرة بالاستعراض.\n- نصائح التكيف للعمل الجماعي مهمة لكن الاستعراض يركز على تحسين العملية بشكل عام.",
      "choices": [
        {
          "text": "تحسين السرعة إذا تم تشكيل نفس الفريق مستقبلًا",
          "correct": false
        },
        {
          "text": "فرص الترقية لأعضاء الفريق",
          "correct": false
        },
        {
          "text": "معلومات قد تكون مفيدة للمشاريع المستقبلية",
          "correct": true
        },
        {
          "text": "نصائح للتكيف مع العمل الجماعي إذا حدث قريبًا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم طلب بعض مواد المشروع من الخارج. أبلغ المورّد فريق المشروع بأن المواد لن تصل في الوقت المحدد بسبب تأخير في التخليص الجمركي، مما سيؤثر على المسار الحرج.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "الإجابة الصحيحة: مراجعة سجل المخاطر وتنفيذ الاستجابة المناسبة.\n\n- الشرح:\nعند مواجهة تأخير محتمل يؤثر على المسار الحرج، يجب على مدير المشروع مراجعة سجل المخاطر لمعرفة ما إذا كان هذا التأخير مغطى بخطة استجابة. تنفيذ الاستجابة المناسبة يساعد على تقليل التأثير السلبي على المشروع.\n- مطالبة فريق اللوجستيات بترتيب تخليص عاجل قد تكون خطوة لاحقة لكنها ليست الأولوية قبل مراجعة سجل المخاطر.\n- تحديد السبب الجذري مهم لكنه يأتي بعد التأكد من التعامل مع التأثير الفوري.\n- ضمان تغطية التكاليف للمورد إجراء تعاقدي ولا يعالج التأخير نفسه.",
      "choices": [
        {
          "text": "مطالبة فريق الخدمات اللوجستية بترتيب تخليص عاجل.",
          "correct": false
        },
        {
          "text": "مراجعة سجل المخاطر وتنفيذ الاستجابة المناسبة.",
          "correct": true
        },
        {
          "text": "تحديد السبب الجذري للتأخير وإضافته إلى وثائق العطاء.",
          "correct": false
        },
        {
          "text": "ضمان تغطية المورّد لأي تكاليف إضافية بسبب التأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مشروع مدته عام، سلّم الفريق كل ما طُلب وحدده مالك المنتج وحقق جميع أهداف السبرينت. كان المشروع يسير على المسار الصحيح من حيث الجدول والنطاق والميزانية. بعد بضعة أشهر من إطلاق المنتج، أظهرت استطلاعات رضا العملاء انخفاضًا مفاجئًا في رضا العملاء.\n\nما الذي يجب على مدير المشروع فعله لمنع تكرار هذا الوضع؟",
      "explanation": "الإجابة الصحيحة: إجراء مراجعات دورية بمشاركة العميل.\n\n- الشرح:\nرضا العملاء المتراجع بعد التسليم يشير إلى أن المشروع قد يكون لم يلبِ توقعات العميل بالكامل أو أن هناك تغييرات في احتياجات العميل. المراجعات الدورية تضمن تواصل مستمر مع العميل، تمكن من اكتشاف المشاكل مبكرًا وتعديل المسار.\n- عقد اجتماع انطلاق مهم لكنه في بداية المشروع فقط.\n- تحسين تقنيات اختبار الأتمتة لا يعالج مشكلة رضا العملاء بشكل مباشر.\n- زيادة مشاركة مكتب إدارة المشاريع لا تضمن تلبية توقعات العميل كما تفعل المراجعات المباشرة.",
      "choices": [
        {
          "text": "عقد اجتماع انطلاق (kick-off) في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تحسين تطبيق تقنيات اختبار الأتمتة.",
          "correct": false
        },
        {
          "text": "زيادة مشاركة مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "إجراء مراجعات دورية بمشاركة العميل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا في مشروع تحقيق. بسبب تعقيد المشروع، لم يكن مدير المشروع متأكدًا مما إذا كانت هناك أي لوائح تنطبق.\n\nكيف يجب على مدير المشروع تحديد اللوائح التي تنطبق على المشروع؟",
      "explanation": "الإجابة الصحيحة: جدولة اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين وفريق المشروع لفهم ما إذا كانت هناك أي لوائح تنطبق.\n\n- الشرح:\nمدير المشروع لا يمكنه تحديد اللوائح بشكل فردي دون معرفة شاملة. لذلك، يجب جمع أصحاب المصلحة والخبراء لفهم المتطلبات القانونية والتنظيمية التي تؤثر على المشروع. هذا يساعد في تجنب المخاطر القانونية وضمان التوافق.\n- التشاور مع مدير أعلى قد لا يعطي الإجابة الدقيقة.\n- مدير مكتب إدارة المشاريع (PMO) مسؤول بشكل عام عن السياسات وليس التفاصيل التنظيمية المحددة لكل مشروع.\n- طلب رسالة موقعة من العميل لا يضمن تحديد اللوائح بشكل دقيق.",
      "choices": [
        {
          "text": "التشاور مع مدير لديه سلطة أعلى لاتخاذ هذا القرار.",
          "correct": false
        },
        {
          "text": "الاتصال بمدير مكتب إدارة المشاريع (PMO) لأنه المسؤول عن تحديد اللوائح المطلوبة للمشاريع الأجايل.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين وفريق المشروع لفهم ما إذا كانت هناك أي لوائح تنطبق.",
          "correct": true
        },
        {
          "text": "طلب رسالة موقعة من العميل لتأكيد ما إذا كانت هناك لوائح تنطبق على أي من مخرجات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع الانطلاق مع الراعي وأعضاء مختلفين في المشروع، اتضح أن وجود بعض المشاركين لم يكن ضروريًا. بالإضافة إلى ذلك، لم يكن أحد الخبراء المطلوبين على علم بالاجتماع ولم يحضره.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "الإجابة الصحيحة: إدارة مشاركة أصحاب المصلحة من خلال إشراكهم في المراحل المناسبة من المشروع.\n\n- الشرح:\nإدارة أصحاب المصلحة تعني التأكد من أن كل شخص مشارك في الوقت المناسب وبالطريقة الصحيحة، وعدم إشراك غير الضروريين في الاجتماعات لتوفير الوقت وضمان التركيز. إشراك الخبراء في الوقت المناسب يمنع غيابهم عن الاجتماعات المهمة.\n- إنشاء منصة اتصال ثابتة يساعد في التواصل لكنه لا يحل مشكلة اختيار المشاركين.\n- تطوير ميثاق المشروع مهم لكنه لا يكفي لوحده.\n- مصفوفة المسؤوليات تنظم الأدوار لكنها لا تضمن الحضور الفعلي للاجتماعات.",
      "choices": [
        {
          "text": "إنشاء منصة اتصال ثابتة لتوفير التحديثات حول المشروع لجميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إدارة مشاركة أصحاب المصلحة من خلال إشراكهم في المراحل المناسبة من المشروع.",
          "correct": true
        },
        {
          "text": "تطوير ميثاق المشروع بما في ذلك أدوار ومسؤوليات جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إنشاء مصفوفة المسؤوليات لإخطار أصحاب المصلحة بالاجتماعات التي يتعين عليهم حضورها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع أسبوعي للفريق، استعرض مدير المشروع تقدم المهام ووجد أن أحد أعضاء الفريق الكبار لم يتبع الخطة. حيث قام بتنفيذ المهام وفقًا لتفضيلاته الشخصية، دون التواصل مع مدير المشروع. هذا العضو خبير ويُعتبر موردًا حاسمًا للمشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا؟",
      "explanation": "الإجابة الصحيحة: الاجتماع مع العضو لمناقشة سلوكه وتوضيح أهمية الالتزام بالخطة والتواصل مع الفريق.\n\n- الشرح:\nحتى لو كان العضو خبيرًا، فإن الالتزام بالخطة والتواصل ضروريان لضمان تنسيق العمل وتحقيق أهداف المشروع. يجب معالجة السلوك بشكل مباشر وودّي لضمان تعاون الفريق.\n- تجاهل الموقف قد يؤدي لمشاكل أكبر.\n- إبلاغ الإدارة العليا وطلب استبداله خطوة متطرفة وغير مبررة فوراً.\n- إصدار تحذير رسمي قد يكون إجراءً لاحقًا لكن البداية تكون بالحوار والتفاهم.",
      "choices": [
        {
          "text": "الاجتماع مع العضو لمناقشة سلوكه وتوضيح أهمية الالتزام بالخطة والتواصل مع الفريق.",
          "correct": true
        },
        {
          "text": "تجاهل الموقف لأن العضو خبير والعمل قد تم إنجازه بالفعل.",
          "correct": false
        },
        {
          "text": "إبلاغ الإدارة العليا مباشرة وطلب استبداله.",
          "correct": false
        },
        {
          "text": "إصدار تحذير رسمي مكتوب للعضو.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب مدير مشروع مبتدئ من مدير مشروع كبير ويطلب مساعدته في بدء عملية الإغلاق النهائي لمشروع. قبل تقديم الإرشاد، يطلب مدير المشروع الكبير مزيدًا من المعلومات.\n\nما الذي يجب أن يسأله مدير المشروع الكبير أولاً؟",
      "explanation": "الإجابة الصحيحة: السؤال عما إذا تم استيفاء معايير قبول جميع المخرجات.\n\n- الشرح:\nعملية الإغلاق النهائي للمشروع تركز على التأكد من أن جميع مخرجات المشروع قد تم تسليمها وقبولها من قبل العميل أو أصحاب المصلحة. لذلك، أول شيء يجب التحقق منه هو ما إذا كانت معايير القبول قد تحققت بالفعل، لأنه بدون هذا التأكيد لا يمكن إغلاق المشروع بشكل صحيح.\n- السؤال عن الانتهاء ضمن الميزانية أو الوقت هو مهم لكنه يأتي بعد التأكد من استكمال المخرجات.\n- معرفة ما إذا كان العميل قد دفع التكاليف ليست من الأولويات في الإغلاق الفني.\n- ضمان الجودة جزء من عمليات التنفيذ والتحقق، لكنه ليس أول ما يُسأل عنه في الإغلاق.",
      "choices": [
        {
          "text": "السؤال عما إذا تم استيفاء معايير قبول جميع المخرجات.",
          "correct": true
        },
        {
          "text": "السؤال عما إذا تم إنجاز المخرجات ضمن الميزانية وفي الوقت المحدد.",
          "correct": false
        },
        {
          "text": "السؤال عما إذا كان العميل قد دفع جميع نفقات تطوير المنتج.",
          "correct": false
        },
        {
          "text": "السؤال عما إذا تم تنفيذ أنشطة ضمان الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في شركة إنشاءات. المشروع الحالي هو مبادرة متعددة السنوات بقيمة عدة ملايين من الدولارات لإعادة بناء ملعب. تم الانتهاء من المرحلة الأولى من المشروع ضمن الإطار الزمني المحدد (ثلاثة أشهر) وضمن الميزانية.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: البدء بإغلاق العقدي للمرحلة.\n\n- الشرح:\nبعد الانتهاء من مرحلة المشروع، يجب البدء بإغلاق العقود المتعلقة بتلك المرحلة للتأكد من أن جميع الالتزامات المالية والقانونية تم الوفاء بها. هذا يشمل التحقق من أن الموردين أو المقاولين قد استوفوا متطلباتهم.\n- الانتقال إلى المرحلة التالية يحتاج إلى تأكيد إغلاق المرحلة السابقة.\n- الحصول على موافقة مدير البرنامج مهم لكنه يأتي عادة ضمن خطوات أخرى.\n- الإغلاق الإداري يتم بعد إغلاق العقود والتأكد من اكتمال جميع الأعمال الإدارية المتعلقة بالمرحلة.",
      "choices": [
        {
          "text": "الانتقال إلى المرحلة التالية.",
          "correct": false
        },
        {
          "text": "الحصول على الموافقة من مدير البرنامج.",
          "correct": false
        },
        {
          "text": "البدء بإغلاق العقدي للمرحلة.",
          "correct": true
        },
        {
          "text": "البدء بعملية الإغلاق الإداري.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع لجنة التوجيه، أثار أحد التنفيذيين الكبار قلقًا من أنه بالرغم من أن معايير التكلفة الرئيسية يتم الإبلاغ عنها بأنها على المسار، إلا أن المشروع قد لا يكون يُسلم الأعمال التي تم جدولتها في الأصل.\n\nما القياس الذي يجب أن يستخدمه مدير المشروع لمعالجة هذا القلق؟",
      "explanation": "الإجابة الصحيحة: فرق الجدول الزمني (Schedule Variance - SV).\n\n- الشرح:\nفرق الجدول الزمني (SV) هو مقياس يستخدم في إدارة القيمة المكتسبة (Earned Value Management - EVM) لتحديد ما إذا كان المشروع يتقدم وفق الجدول الزمني المحدد. إذا كان SV سلبيًا، فهذا يعني أن المشروع متأخر عن الجدول، بغض النظر عن حالة التكلفة.\n- فرق التكلفة (CV) يركز على الفرق بين الميزانية المخصصة والتكاليف الفعلية ولا يعكس تقدم الجدول الزمني.\n- القيمة المكتسبة (EV) تمثل القيمة الفعلية للعمل المُنجز ولكنها لا تعطي مؤشراً واضحًا على التوقيت وحده.\n- القيمة المخططة (PV) تشير إلى القيمة المخططة للعمل في نقطة زمنية معينة لكنها لا تظهر الفارق بين المخطط والفعل.",
      "choices": [
        {
          "text": "فرق التكلفة (CV)",
          "correct": false
        },
        {
          "text": "القيمة المكتسبة (EV)",
          "correct": false
        },
        {
          "text": "فرق الجدول الزمني (SV)",
          "correct": true
        },
        {
          "text": "القيمة المخططة (PV)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق يتغيب كثيرًا عن اجتماعات فريق المشروع. بدلاً من العمل على المشروع الحالي، كان هذا العضو يعمل على مهمة مخصصة له من قبل مديره الوظيفي.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: مناقشة تخصيص الموارد مع المدير الوظيفي لعضو الفريق.\n\n- الشرح:\nعندما يكون عضو الفريق يعمل تحت مدير وظيفي آخر ويعمل على مهام خارج نطاق المشروع، فإن مدير المشروع لا يملك صلاحية مباشرة لفصل العضو أو معاقبته.\n- الحل الأمثل هو التواصل مع المدير الوظيفي للعضو لمناقشة أولوية المهام وتخصيص الموارد بشكل واضح يضمن التزام العضو بالمشروع.\n- إزالة عضو الفريق أو تسجيل الغيابات دون التنسيق مع المدير الوظيفي قد يؤدي إلى مشاكل تنظيمية.\n- سؤال أعضاء الفريق الآخرين لا يحل المشكلة الحقيقية التي تتعلق بتخصيص الموارد.",
      "choices": [
        {
          "text": "مناقشة تخصيص الموارد مع المدير الوظيفي لعضو الفريق.",
          "correct": true
        },
        {
          "text": "إزالة عضو الفريق من المشروع بسبب غياباته المتكررة.",
          "correct": false
        },
        {
          "text": "تسجيل الغيابات في تقييم أداء عضو الفريق.",
          "correct": false
        },
        {
          "text": "طلب رأي عضو فريق آخر حول المشكلة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتصميم وتطوير استراتيجية لمؤسسة حكومية. يدرك مدير المشروع أن المشروع يحتوي على كمية محدودة من المعلومات التفصيلية لإعداد التقديرات، ولكن هناك عدة منظمات حكومية أخرى اعتمدت بالفعل نفس الاستراتيجية بنجاح.\n\nفي هذا السيناريو، أي نوع من طرق التقدير يجب على مدير المشروع اختياره؟",
      "explanation": "الإجابة الصحيحة: التقدير التشبيهي (Analogous estimation).\n\n- الشرح:\nعندما تكون المعلومات التفصيلية محدودة، يُفضل استخدام التقدير التشبيهي الذي يعتمد على مقارنات بمشاريع أو استراتيجيات سابقة مشابهة.\n- في هذه الحالة، بما أن هناك منظمات حكومية أخرى طبقت نفس الاستراتيجية، يمكن الاستفادة من نتائجها لتقدير الوقت والتكلفة.\n- النمذجة المعيارية تتطلب بيانات أكثر دقة وعلاقة رياضية بين المتغيرات.\n- التقدير بالنقاط الثلاث مفيد في الحالات التي يمكن فيها تقدير الحد الأدنى والأقصى والأرجح.\n- حكم الخبراء هو أسلوب داعم لكنه أقل تحديداً في حالة وجود بيانات تشبيهية.",
      "choices": [
        {
          "text": "النمذجة المعيارية (Parametric modeling)",
          "correct": false
        },
        {
          "text": "التقدير التشبيهي (Analogous estimation)",
          "correct": true
        },
        {
          "text": "التقدير بالنقاط الثلاث (Three-point estimating)",
          "correct": false
        },
        {
          "text": "حكم الخبراء (Expert judgment)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ لمشروع تكنولوجيا معلومات للرعاية الصحية، استقال مدير المشروع من جهة العميل ولم يتم تعيين بديل. يكتشف مدير المشروع الداخلي أن أصحاب المصلحة الرئيسيين لم يعودوا يتلقون التحديثات في الوقت المناسب.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تحديث خطة إدارة الاتصالات.\n\n- الشرح:\nبسبب استقالة مدير المشروع من جهة العميل وعدم وجود بديل، انقطعت قنوات التواصل مع أصحاب المصلحة الرئيسيين.\n- في هذه الحالة، يجب على مدير المشروع الداخلي تحديث خطة إدارة الاتصالات لتحديد كيفية التعامل مع التغييرات في أصحاب المصلحة ومسؤوليات الاتصال، والتأكد من أن الجميع يحصل على المعلومات في الوقت المناسب.\n- مجرد إبلاغ أصحاب المصلحة دون تعديل الخطة قد يؤدي إلى عدم استمرارية التواصل.\n- إبلاغ الرعاة مهم لكنه جزء من خطة الاتصالات وليس الحل الوحيد.\n- الاستمرار في إرسال المعلومات بدون خطة واضحة قد يؤدي إلى ارتباك أو معلومات غير فعالة.",
      "choices": [
        {
          "text": "تحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "إبلاغ أصحاب المصلحة الرئيسيين فورًا بشكل مباشر.",
          "correct": false
        },
        {
          "text": "إبلاغ الرعاة بالمستجدات.",
          "correct": false
        },
        {
          "text": "الاستمرار في إرسال المعلومات حتى يتم تلقي رد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع لفريق المشروع، حدد أعضاء الفريق قائمة بالمخاطر التي قد تحدث أثناء تنفيذ المشروع. يرغب راعي المشروع في الاجتماع بمدير المشروع لتقييم أهمية كل خطر.\n\nما نوع التحليل الذي يجب على مدير المشروع تنفيذه للتحضير للاجتماع؟",
      "explanation": "الإجابة الصحيحة: تحليل المخاطر النوعي (Qualitative risk analysis).\n\n- الشرح:\nعندما يتم تحديد قائمة بالمخاطر، الخطوة التالية هي تقييم أهمية وتأثير هذه المخاطر بطريقة سريعة وغير كمية لتحديد أولوياتها.\n- التحليل النوعي للمخاطر يركز على تقييم احتمالية حدوث الخطر وتأثيره باستخدام تصنيفات نسبية (مثل عالي، متوسط، منخفض).\n- التحليل الكمي للمخاطر يتم بعد التحليل النوعي ويشمل تقييمات رقمية مفصلة.\n- تحليل مونت كارلو هو تقنية كمية تستخدم محاكاة لإدارة المخاطر.\n- حكم الخبراء هو أسلوب لجمع آراء متخصصين وليس طريقة تحليل مستقلة.",
      "choices": [
        {
          "text": "تحليل المخاطر النوعي (Qualitative risk analysis)",
          "correct": true
        },
        {
          "text": "تحليل المخاطر الكمي (Quantitative risk analysis)",
          "correct": false
        },
        {
          "text": "تحليل مونت كارلو (Monte Carlo risk analysis)",
          "correct": false
        },
        {
          "text": "تحليل حكم الخبراء (Expert judgment analysis)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند بدء المشروع، تم طلب عرض سعر للخدمات المطلوبة من أحد الموردين، وتم تقدير العمل بمبلغ 100,000 دولار أمريكي. مع تقدم المشروع، تم تحديث المتطلبات واتباع عملية الشراء الخاصة بالشركة، وتم استلام عرض معدل يتجاوز 250,000 دولار. الأموال المخصصة للاحتياطي غير كافية لتغطية الفرق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إشراك لجنة التوجيه وتصعيد المشكلة.\n\n- الشرح:\nعندما يتجاوز العرض المعدل الميزانية المخصصة، خصوصاً إذا كانت الأموال الاحتياطية غير كافية، فإن الأمر يتطلب تصعيد المشكلة لأصحاب القرار الأعلى مثل لجنة التوجيه لاتخاذ قرار مناسب بشأن التمويل أو تعديل النطاق.\n- إعادة بدء عملية الشراء أو اختيار مورد جديد قد يكون غير عملي بدون موافقة عليا.\n- مراجعة نوع العقد مهم لكنه لا يحل المشكلة الحالية.\n- المضي قدمًا بأفضل عرض دون معالجة المشكلة قد يضر بالمشروع ماليًا.",
      "choices": [
        {
          "text": "إعادة بدء عملية الشراء واختيار مورد جديد.",
          "correct": false
        },
        {
          "text": "مراجعة نوع العقد الذي سيتم منحه للمورد.",
          "correct": false
        },
        {
          "text": "المضي قدمًا بأفضل عرض وفقًا لعملية الشراء.",
          "correct": false
        },
        {
          "text": "إشراك لجنة التوجيه وتصعيد المشكلة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أطلقت شركة مشروعًا استراتيجيًا جديدًا. تم تحديد الهدف ونطاق المشروع بشكل غير دقيق خلال اجتماع اللجنة التنفيذية، وتم تعيين أصحاب المصلحة. يحتاج مدير المشروع إلى عقد اجتماع بدء المشروع، ولكن معظم أصحاب المصلحة في مواقع مختلفة والبعض منهم في إجازة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تنظيم اجتماع افتراضي لبدء المشروع مع أصحاب المصلحة.\n\n- الشرح:\nفي حالة تواجد أصحاب المصلحة في مواقع جغرافية مختلفة وبعضهم في إجازة، استخدام التقنيات الافتراضية يتيح عقد الاجتماع بفعالية دون تأخير المشروع.\n- تأجيل الاجتماع أو عقد جلسات فردية قد يؤدي إلى تأخير وتشتت المعلومات.\n- عقد اجتماع مع المتاحين فقط قد يسبب نقصًا في المشاركة والتوافق من الجميع.\n- الاجتماعات الافتراضية تساعد على دمج جميع الأطراف بشكل متزامن وتسهيل التفاهم والتخطيط.",
      "choices": [
        {
          "text": "عقد اجتماع بدء المشروع مع أصحاب المصلحة المتاحين وتحديث الآخرين لاحقًا.",
          "correct": false
        },
        {
          "text": "تأجيل اجتماع بدء المشروع حتى عودة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة جلسات فردية مع أصحاب المصلحة قبل مغادرتهم.",
          "correct": false
        },
        {
          "text": "تنظيم اجتماع افتراضي لبدء المشروع مع أصحاب المصلحة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصميم فندق حضري يضم فريقًا دوليًا ومتعدد التخصصات والثقافات. مدير المشروع بصدد إعداد النسخة الأولى من خطة إدارة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: دمج الاعتبارات الثقافية ضمن خطة إدارة المشروع.\n\n- الشرح:\nعندما يعمل فريق المشروع في بيئة دولية ومتعددة الثقافات، من الضروري لمدير المشروع أن يأخذ في الاعتبار الفروقات الثقافية وتأثيرها على التواصل والتعاون وأسلوب العمل.\n- إدراج الاعتبارات الثقافية في خطة إدارة المشروع يساعد في تقليل النزاعات وتحسين الفهم المتبادل.\n- استخدام أسلوب الشلال قد لا يكون مناسبًا للمشاريع الديناميكية والمتعددة الثقافات.\n- تفويض المهام فقط لأعضاء في نفس المنطقة الزمنية يقلل من التعاون الفعّال بين الفريق.\n- استخدام قناة تواصل واحدة لجميع الأعضاء قد يكون غير كافٍ، خصوصًا مع فروقات زمنية وثقافية.",
      "choices": [
        {
          "text": "استخدام أسلوب الشلال في إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تفويض معظم المهام لأعضاء الفريق المتواجدين في نفس المنطقة الزمنية.",
          "correct": false
        },
        {
          "text": "استخدام قناة تواصل واحدة لجميع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "دمج الاعتبارات الثقافية ضمن خطة إدارة المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع مسؤول عن مشروع كبير يتضمن التعامل مع العديد من الموردين. مصدر قلق رئيسي يتعلق بجودة وتسليم المنتجات والخدمات المشتراة في الوقت المحدد كما التزم بها الموردون.\n\nما الذي يجب أن يفعله مدير المشروع لضمان تلبية المنتجات لمتطلبات الجودة وتسليمها في الوقت المحدد؟",
      "explanation": "الإجابة الصحيحة: إجراء مراجعات أداء الشراء بانتظام مع جميع الموردين المتعاقد معهم لضمان تسليم المنتجات والخدمات في الوقت المحدد ووفقًا للعقد المتفق عليه.\n\n- الشرح:\nلمتابعة جودة وتسليم المنتجات والخدمات من الموردين، يجب على مدير المشروع التواصل المنتظم مع الموردين من خلال مراجعات أداء الشراء.\n- هذا الإجراء يتيح الكشف المبكر عن المشاكل ويساعد على اتخاذ الإجراءات التصحيحية.\n- إدراج بند في سجل المخاطر لا يكفي بمفرده لضمان الجودة والتسليم.\n- تفويض إدارة المشتريات لقسم آخر يقلل من سيطرة مدير المشروع على جودة التسليم.\n- مراجعة خطة إدارة الموردين مهمة لكنها لا تضمن المراقبة الفعلية للأداء.",
      "choices": [
        {
          "text": "إدراج بند في سجل المخاطر لتوثيق التأثيرات المحتملة المتعلقة بتأخيرات التوريد، وتقليل خطر الجودة غير المثلى.",
          "correct": false
        },
        {
          "text": "إجراء مراجعات أداء الشراء بانتظام مع جميع الموردين المتعاقد معهم لضمان تسليم المنتجات والخدمات في الوقت المحدد ووفقًا للعقد المتفق عليه.",
          "correct": true
        },
        {
          "text": "تفويض إدارة عملية الشراء والتعامل مع الموردين إلى قسم المشتريات في المؤسسة لأنه يمتلك الأدوات والوسائل اللازمة للتعامل مع عدد كبير من الموردين.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الموردين مع جميع الموردين لضمان توافقهم مع الخطة وتقليل خطر عدم التسليم أو المنتجات منخفضة الجودة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتلقى مدير المشروع بريدًا إلكترونيًا بعد وقت قصير من بدء السبرينت. الرسالة من أحد أصحاب المصلحة الرئيسيين غير الملمين بمنهجيات الأجايل ويعبر فيها عن شكوى جدية بشأن العمل الذي بدأ للتو. يصر صاحب المصلحة على أن أحد المخرجات يجب تغييره.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: جدولة اجتماع مع صاحب المصلحة ومالك المنتج لمناقشة الطلب.\n\n- الشرح:\nفي حالات وجود طلب تغييرات من أصحاب المصلحة غير الملمين بمنهجيات أجايل، من المهم مناقشة الطلب مع الطرف المعني ومالك المنتج لتقييم الأثر وإدارة التوقعات.\n- معالجة الطلب مباشرة في الاجتماع اليومي قد لا يكون مناسبًا لأنه مخصص لمناقشة التقدم وليس لتغيير المتطلبات.\n- تعديل سجل الأعمال الخلفية بدون مناقشة قد يؤدي إلى تضارب وعدم وضوح.\n- إلغاء السبرينت الحالي خطوة متطرفة وغير مبررة بدون تقييم شامل للطلب.",
      "choices": [
        {
          "text": "معالجة الطلب خلال اجتماع السكوم اليومي وطلب رأي فريق المشروع.",
          "correct": false
        },
        {
          "text": "تعديل سجل الأعمال الخلفية لتنفيذ التغيير، وإخبار الفريق ببدء العمل على المخرج المطلوب فورًا.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع صاحب المصلحة ومالك المنتج لمناقشة الطلب.",
          "correct": true
        },
        {
          "text": "إلغاء السبرينت الحالي، وجدولة اجتماع مراجعة استثنائي ودعوة صاحب المصلحة لمناقشة الطلب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم التعاقد مع مورد أجنبي لإنتاج آلة محددة في مصنع. قبل تسليم آخر مكونين، يُبلغ المورد مدير المشروع بأنه بحاجة إلى إعادة التفاوض بشأن الأسعار وإلا فلن يتم تسليم المكونات.\n\nما الذي يجب أن يفعله مدير المشروع أولًا؟",
      "explanation": "الإجابة الصحيحة: تفعيل خطة الاستجابة لهذا الخطر بناءً على مؤشرات التفعيل.\n\n- الشرح:\nعندما تظهر مشكلة متعلقة بمورد أو خطر تم تحديده مسبقًا، يجب على مدير المشروع أولًا تفعيل خطة الاستجابة التي تم إعدادها لهذا النوع من المخاطر.\n- هذا يتيح التعامل المنظم مع المشكلة وتقليل تأثيرها.\n- رفع قضية قانونية أو البحث عن مورد بديل قد يكونان خطوات لاحقة إذا لم تنجح خطة الاستجابة.\n- التفاوض مع المورد بدون خطة قد يفاقم الوضع دون ضمان تحقيق أفضل النتائج.",
      "choices": [
        {
          "text": "رفع قضية قانونية ضد الشركة لخرق العقد.",
          "correct": false
        },
        {
          "text": "التوجه لموردين بديلين للحصول على المكونين المتبقيين.",
          "correct": false
        },
        {
          "text": "العمل مع المورد للاتفاق على أسعار جديدة لتقليل الأثر المالي.",
          "correct": false
        },
        {
          "text": "تفعيل خطة الاستجابة لهذا الخطر بناءً على مؤشرات التفعيل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مشروع تنبؤي، كان مدير المشروع بصدد الانتهاء من معايير الإغلاق لمشروع تطوير نظام مهم. في هذه المرحلة، أبلغ أحد أصحاب المصلحة المسؤولين عن المخاطر والامتثال مدير المشروع بأن هناك مخرجًا إضافيًا يجب إنجازه بسبب قانون جديد تم تمريره مؤخرًا من قبل الحكومة المحلية. من المتوقع أن يؤثر هذا التغيير على تاريخ إصدار المشروع المجدول.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: التعاون مع صاحب المصلحة وتقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).\n\n- الشرح:\nعند ظهور طلب لتغيير في مرحلة متأخرة من المشروع، خاصة نتيجة لتغير قانوني، يجب تقييم الأثر وإدارة التغيير عبر العملية الرسمية.\n- طلب التغيير إلى لجنة مراقبة التغيير يضمن مراجعة الطلب والموافقة عليه بشكل رسمي قبل التنفيذ.\n- رفض الطلب أو تصعيده مباشرة للراعي دون تقييم غير مناسب.\n- تسجيله كخطر فقط دون اتخاذ إجراء قد يؤدي إلى تأخيرات غير متوقعة.",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة وإبلاغهم أن الطلب لم يكن جزءًا من معايير الإغلاق.",
          "correct": false
        },
        {
          "text": "التعاون مع صاحب المصلحة وتقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى الراعي لتجنب تأخير موعد الإصدار.",
          "correct": false
        },
        {
          "text": "إضافة هذا الخطر الجديد إلى سجل المخاطر ومراقبته لأن التغييرات خارج نطاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إبلاغ مدير المشروع أن أول شحنة من عدة شحنات رئيسية قادمة من بلد آخر ستتأخر. هذه الشحنات تقع على المسار الحرج، وسيؤدي هذا التأخير إلى فوات أحد المعالم الرئيسية.\n\nما الذي يجب أن يفعله مدير المشروع أولًا؟",
      "explanation": "الإجابة الصحيحة: تسجيل التأخير في سجل المشكلات وتطوير خطة عمل فورية.\n\n- الشرح:\nعندما يحدث تأخير يؤثر على المسار الحرج، يجب على مدير المشروع التعامل معه كمسألة حرجة تتطلب توثيقًا وتحليلًا فوريًا.\n- تسجيل المشكلة في سجل المشكلات يوفر تتبعًا واضحًا.\n- تطوير خطة عمل فورية يسمح بالاستجابة السريعة للحد من التأثير.\n- تحديث الدروس المستفادة أو خطة المشروع يجب أن يتم بعد معالجة المشكلة.\n- إصدار غرامات قد يكون جزءًا من الإجراءات القانونية ولكن ليس الخطوة الأولى.",
      "choices": [
        {
          "text": "تحديث سجل الدروس المستفادة وخطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني للمشروع وإخطار أصحاب المصلحة بالتأخير.",
          "correct": false
        },
        {
          "text": "تسجيل التأخير في سجل المشكلات وتطوير خطة عمل فورية.",
          "correct": true
        },
        {
          "text": "تحديد الأطراف المسؤولة عن التأخير لإصدار غرامات مالية عليهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعرب أحد أصحاب المصلحة عن قلقه من أن المشروع يتأخر عن الجدول الزمني، بناءً على معلومات غير رسمية من فريق المشروع. على الرغم من أن بعض المهام قد تأخرت، إلا أن لديها هوامش زمنية حرة، والمشروع ما زال يسير وفقًا للخطة. تواصل مدير المشروع فورًا مع صاحب المصلحة لعرض وشرح أحدث تقارير حالة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة الاتصالات الخاصة بالمشروع مع الفريق وتحديثها إذا لزم الأمر.\n\n- الشرح:\nعندما يحدث تواصل غير رسمي قد يسبب قلقًا أو التباسًا بين أصحاب المصلحة، يجب على مدير المشروع مراجعة خطة الاتصالات لضمان وضوح القنوات وأساليب التواصل.\n- التحديث يساعد في منع تكرار المعلومات غير الرسمية التي قد تسبب سوء فهم.\n- إصدار مذكرات أو إدراج أصحاب المصلحة في قوائم البريد فقط قد لا يحل السبب الجذري.\n- تعديل تقارير الحالة قد يكون ضروريًا لاحقًا، لكن التركيز هنا على تحسين الاتصالات بشكل عام.",
      "choices": [
        {
          "text": "إصدار مذكرة تفيد بأن حالة المشروع لا تُشارك إلا من خلال القنوات المعتمدة.",
          "correct": false
        },
        {
          "text": "إدراج صاحب المصلحة في قائمة البريد الخاصة بتقارير الحالة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة الاتصالات الخاصة بالمشروع مع الفريق وتحديثها إذا لزم الأمر.",
          "correct": true
        },
        {
          "text": "تعديل تقارير الحالة لتحديد التأخيرات التي تستوجب اتخاذ إجراء بوضوح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الانتهاء من مرحلة التطوير لمنتج جديد. على وشك بدء اختبار التحقق، ولكن قائد الاختبار لا يتفق مع معايير الاختبار.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: فهم سبب الخلاف وتقديم طلب تغيير إلى لجنة التحكم بالتغيير إذا كان مناسبًا.\n\n- الشرح:\nفي حالة وجود اختلافات جوهرية في معايير الاختبار، يجب أولاً فهم الأسباب والحصول على توضيحات.\n- إذا كان التغيير مبررًا، فيجب اتباع العملية الرسمية لتقديم طلب التغيير لمراجعته والموافقة عليه.\n- تنفيذ التغيير دون مراجعة أو تجاهل الخلاف قد يؤدي إلى مشكلات في الجودة أو جدولة المشروع.\n- إقناع قائد الاختبار بالالتزام بمعايير قديمة دون استماع قد يضر الفريق.",
      "choices": [
        {
          "text": "فهم سبب الخلاف وتقديم طلب تغيير إلى لجنة التحكم بالتغيير إذا كان مناسبًا.",
          "correct": true
        },
        {
          "text": "تنفيذ خطة لتعديل معايير الاختبار لبدء اختبار التحقق كما هو مجدول.",
          "correct": false
        },
        {
          "text": "الإبقاء على معايير اختبار التحقق دون تغيير لأن التعديلات ستؤثر على جدول المشروع.",
          "correct": false
        },
        {
          "text": "شرح كيف أن التغييرات قد تؤثر على المشروع وإقناع قائد الاختبار بالالتزام بالمعايير الأصلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع مؤخرًا لمشروع متعدد الجنسيات موجود مسبقًا، ولا يعرف أصحاب المصلحة الرئيسيين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة وتحديث سجل أصحاب المصلحة.\n\n- الشرح:\nمراجعة سجل أصحاب المصلحة هو الخطوة الأولى لفهم من هم الأطراف الفاعلة في المشروع واحتياجاتهم وتأثيرهم.\n- يساعد ذلك في تحسين إدارة أصحاب المصلحة وتحديد من يجب إشراكه وكيف.\n- الاجتماع مع مدير الموارد أو طلب رأي الراعي قد يكون مفيدًا لاحقًا لكنه ليس الخطوة الأولى.\n- تحديد أدوات الاتصال وتحديث الخطط يعتمد على معرفة أصحاب المصلحة أولاً.",
      "choices": [
        {
          "text": "طلب اجتماع مع مدير الموارد.",
          "correct": false
        },
        {
          "text": "مراجعة وتحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "طلب رأي أو حكم الخبراء من الراعي.",
          "correct": false
        },
        {
          "text": "تحديد أداة الاتصال وتحديث الخطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تسير مؤسسة في منتصف مشروع مدته خمس سنوات، وكل شيء يسير حسب الجدول الزمني. تُشير التقييمات الأخيرة إلى أن المشروع لن يتوافق مع تنظيم دولي تم إصداره مؤخرًا.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: عقد ورشة عمل مع لجنة توجيه المشروع لمراجعة التنظيم الجديد وإيجاد حل.\n\n- الشرح:\nعندما يظهر تنظيم جديد قد يؤثر على المشروع، من المهم إشراك أصحاب القرار (لجنة التوجيه) لمناقشة التأثيرات المحتملة وتحديد الحلول.\n- هذا الإجراء يدعم اتخاذ قرارات واعية بشأن الامتثال والتنظيم.\n- المضي قدماً دون مراجعة التنظيم الجديد قد يعرض المشروع لمخاطر قانونية وتنظيمية.\n- الاعتماد فقط على الاحتياطي الاحترازي أو الاحتياطي الإداري قبل فهم التأثيرات ليست خطوات أولية صحيحة.",
      "choices": [
        {
          "text": "المضي في المشروع لأن التنظيم الجديد لم يكن جزءًا من متطلبات المشروع الأصلية.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل مع لجنة توجيه المشروع لمراجعة التنظيم الجديد وإيجاد حل.",
          "correct": true
        },
        {
          "text": "الاستفادة من الاحتياطي الاحترازي لتمويل المهام الإضافية المطلوبة للامتثال للتنظيم الجديد.",
          "correct": false
        },
        {
          "text": "طلب أموال من الاحتياطي الإداري لأن التنظيم الجديد يُعتبر خطرًا غير معروف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم نشر حل جديد في عدة دول. طلبت الدولة (أ) تغييرًا في الحل ليتوافق مع سوق عملائها المحلي. قبل مدير المشروع المسؤول عن الدولة (أ) هذا التغيير. وعندما استلم مدير المشروع في الدولة (ب) النسخة الجديدة من الحل، فشلت الاختبارات لأن النسخة لا تتوافق مع أنظمة الدولة (ب).\n\nما الذي كان يجب فعله لتجنب هذا الوضع؟",
      "explanation": "الإجابة الصحيحة: تحليل جميع طلبات التغيير خلال نشر الحل في كل دولة على مستوى عالمي قبل التنفيذ.\n\n- الشرح:\nعند التعامل مع حلول متعددة الدول، يجب تحليل تأثير كل طلب تغيير على المستوى العالمي لضمان التوافق وعدم التسبب في مشاكل لدول أخرى.\n- منع الموافقة على التغييرات بشكل عام ليس عملياً.\n- ضمان توافق جميع الدول مع متطلبات دولة واحدة غير ممكن بسبب اختلاف الأنظمة.\n- تحميل الدول المتغيرة التكاليف لا يحل المشكلة الجوهرية وهي التنسيق والتحليل الشامل.",
      "choices": [
        {
          "text": "منع الموافقة على التغييرات.",
          "correct": false
        },
        {
          "text": "ضمان توافق جميع الدول مع متطلبات الدولة (أ).",
          "correct": false
        },
        {
          "text": "تحليل جميع طلبات التغيير خلال نشر الحل في كل دولة على مستوى عالمي قبل التنفيذ.",
          "correct": true
        },
        {
          "text": "ضمان أن أي دولة تطلب تغييرات تتحمل تكلفة التغييرات المطلوبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يراجع مدير المشروع حالة المشروع مع الفريق ويلاحظ أن أحد الموارد التابعة لمورد خارجي يمكن الاستغناء عنها في وقت أبكر من المخطط له. بعد مراجعة الجدول الزمني وتأكيد التغيير، يُبلغ المدير المورد. يعترض المورد قائلاً إن المورد يجب أن يبقى لفترة محددة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة الشروط والأحكام في عقد المورد.\n\n- الشرح:\nعندما يكون هناك تعارض بين الجدول الزمني للمشروع ومتطلبات المورد، يجب مراجعة العقد لفهم الالتزامات القانونية والشروط المتعلقة بفترة عمل المورد.\n- الإبقاء على الجدول أو تأكيد التغييرات دون مراجعة العقد قد يسبب مشاكل قانونية أو مالية.\n- الاستعداد لتحرير المورد دون مراجعة العقد غير حكيم.\n- مراجعة الجدول مع أصحاب المصلحة مهمة لكنها ليست كافية دون فهم العقد.",
      "choices": [
        {
          "text": "الإبقاء على الجدول كما هو لأن المورد يجب أن يبقى.",
          "correct": false
        },
        {
          "text": "تأكيد التغييرات في الجدول الزمني ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "الاستعداد لتحرير المورد وإعادته إلى المورد الأصلي.",
          "correct": false
        },
        {
          "text": "مراجعة الشروط والأحكام في عقد المورد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انتهى مدير المشروع للتو من إعداد ميثاق المشروع وحصل على الموافقة من الراعي. خلال عرض الميثاق على أصحاب المصلحة، لاحظ أن بعضهم لم يشارك بنشاط في الاجتماع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: عقد اجتماعات فردية مع هؤلاء أصحاب المصلحة للتأكد من فهمهم للمخرجات الرئيسية ومسؤولياتهم.\n\n- الشرح:\nعندما لا يشارك بعض أصحاب المصلحة بفعالية في الاجتماعات، من الضروري التواصل معهم بشكل فردي لضمان وضوح فهمهم ودعمهم للمشروع.\n- إدراج الأمر في سجل المخاطر قد يكون مبكرًا بدون تحقق أولي.\n- إبلاغ الراعي أو مراقبة الفريق للمشاركة لا يحل المشكلة الأساسية، وهي نقص الفهم أو الاهتمام.",
      "choices": [
        {
          "text": "إدراج ذلك في سجل المخاطر لأن مدير المشروع غير متأكد من فهم أصحاب المصلحة لمسؤولياتهم.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات فردية مع هؤلاء أصحاب المصلحة للتأكد من فهمهم للمخرجات الرئيسية ومسؤولياتهم.",
          "correct": true
        },
        {
          "text": "إبلاغ الراعي بمخاوفه بشأن قلة مشاركة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "طلب من فريق المشروع مراقبة مشاركة هؤلاء أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تسليم برنامج جديد. تم إطلاق البرنامج في بيئة الإنتاج، ولكن أعضاء الفريق ما زالوا يتلقون اتصالات من المستخدمين للاستفسار عن كيفية استخدام البرنامج أو الإبلاغ عن مشاكل، رغم أن المشروع قد تم إغلاقه إداريًا.\n\nما الذي كان يجب أن يفعله مدير المشروع لتجنب هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: ضمان انتقال المنتج النهائي إلى جهة أو فريق آخر لتولي مسؤولية البرنامج خلال دورة حياته.\n\n- الشرح:\nبعد إغلاق المشروع، يجب أن يتولى فريق الدعم أو جهة مختصة مسؤولية متابعة المنتج ودعمه أثناء دورة حياته لضمان استمرارية الدعم.\n- تضمين نشاط دعم في نطاق المشروع ليس دائمًا الحل الأمثل لأنه قد يكون خارج نطاق المشروع.\n- مجرد إبلاغ المؤسسة بانتهاء المشروع لا يحل مسألة الدعم الفني أو استفسارات المستخدمين.\n- توجيه الفريق لعدم الرد على المستخدمين سيؤدي إلى تجربة مستخدم سيئة.",
      "choices": [
        {
          "text": "إدراج نشاط في نطاق المشروع يسمح للفريق بدعم الأداة بعد الإطلاق.",
          "correct": false
        },
        {
          "text": "إبلاغ المؤسسة بانتهاء المشروع رسميًا وفقًا لخطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "ضمان انتقال المنتج النهائي إلى جهة أو فريق آخر لتولي مسؤولية البرنامج خلال دورة حياته.",
          "correct": true
        },
        {
          "text": "الطلب من أعضاء الفريق التوقف عن الرد على الأسئلة وتشجيع المستخدمين على مراجعة الوثائق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "شركة اعتادت استخدام الأساليب التنبؤية بدأت باستخدام الأجايل في جزء من مشروع. نظرًا للنتائج الإيجابية، طلب الراعي تحويل المشروع بالكامل إلى أجايل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).\n\n- الشرح:\nتحويل أسلوب إدارة المشروع بالكامل من التنبؤي إلى أجايل يمثل تغييرًا كبيرًا يتطلب موافقة رسمية من لجنة التحكم بالتغيير لضمان موافقة جميع الأطراف.\n- اقتراح تطبيق الأجايل فقط في المشاريع الجديدة أو استشارة مالك المنتج وحده لا يعالج تغيير نطاق كبير مثل هذا.\n- تحويل المخرجات إلى قصص مستخدمين دون الموافقة الرسمية قد يؤدي إلى مشاكل تنفيذية.",
      "choices": [
        {
          "text": "اقتراح تطبيق التحول إلى أجايل في المشاريع الجديدة فقط.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
          "correct": true
        },
        {
          "text": "استشارة مالك المنتج لأنه قد تكون لديه أسباب للاستمرار بالأسلوب التنبؤي.",
          "correct": false
        },
        {
          "text": "تحويل المخرجات إلى قصص مستخدمين وإبلاغ الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم استبدال عضو أساسي في فريق أجايل بعضو أقل خبرة. أحد أصحاب المصلحة قلق من أن المشروع لن يتم تسليمه في الوقت المحدد بسبب هذا التغيير.\n\nما الذي يجب أن يفعله مدير المشروع لضمان نجاح تسليم المشروع؟",
      "explanation": "الإجابة الصحيحة: تقييم تأثير الاستبدال وإجراء تعديلات إضافية في الموارد إذا لزم الأمر.\n\n- الشرح:\nتغيير عضو رئيسي في الفريق يمكن أن يؤثر على الأداء، لذا من المهم تقييم هذا التأثير واتخاذ إجراءات تصحيحية لضمان تسليم المشروع في الوقت المحدد.\n- إضافة القلق كسجل خطر وتصعيده فقط دون اتخاذ إجراءات عملية قد لا يحل المشكلة.\n- الاجتماع مع المدير الوظيفي أو إعادة العضو السابق بدون تقييم شامل قد لا يكون الحل الأمثل.",
      "choices": [
        {
          "text": "إضافة هذا القلق كخطر في سجل المخاطر وتصعيده إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "الاجتماع مع مديره الوظيفي لتقييم الوضع والحصول على توجيهات.",
          "correct": false
        },
        {
          "text": "عكس قرار الاستبدال وإعادة العضو السابق إلى الفريق.",
          "correct": false
        },
        {
          "text": "تقييم تأثير الاستبدال وإجراء تعديلات إضافية في الموارد إذا لزم الأمر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة لوحة سكرم لمشروع هجين، اقترح أحد أعضاء الفريق إضافة مهمة خارج نطاق الأساس. يمكن أن تقلل هذه المهمة من خطر المشروع، وتم طرحها أثناء المراجعة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تقييم جدوى وتأثير إدراج المهمة وإدراجها في السبرنتات المستقبلية إذا كان ذلك مناسبًا.\n\n- الشرح:\nعند اقتراح مهمة جديدة خارج النطاق الأساسي، يجب تقييم فائدتها وتأثيرها قبل اتخاذ قرار بإضافتها، خصوصًا في بيئة أجايل حيث المرونة مطلوبة.\n- توجيه مالك المنتج فقط أو تأجيل المهمة دون تقييم قد يؤدي إلى تجاهل فرصة تحسين المشروع.",
      "choices": [
        {
          "text": "تقييم جدوى وتأثير إدراج المهمة وإدراجها في السبرنتات المستقبلية إذا كان ذلك مناسبًا.",
          "correct": true
        },
        {
          "text": "إعطاء التعليمات لمالك المنتج لتقييم فائدة النشاط فيما يتعلق بمتطلبات المشروع الأولية.",
          "correct": false
        },
        {
          "text": "توجيه الفريق نحو نشاط المسار الحرج ووضع المهمة في عمود المهام المؤجلة للمراجعة لاحقًا.",
          "correct": false
        },
        {
          "text": "توثيق المهمة ضمن وثائق المشروع، مع ملاحظة أنها قد تقلل المخاطر لكنها خارج النطاق المعتمد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم توسيع مشروع أجايل من مرحلة دراسة الجدوى إلى مرحلة التنفيذ. بسبب ضيق الوقت، تم تعيين نفس الفريق للمشروع باستثناء عضو واحد تم استبداله بعضو جديد. لا يتفق العديد من أعضاء الفريق مع العضو الجديد وهم غير مستعدين للعمل في المرحلة التالية.\n\nكيف يجب على مدير المشروع التأكد من أن الفريق مستعد للمرحلة القادمة؟",
      "explanation": "الإجابة الصحيحة: طلب التزام رسمي من الفريق.\n\n- الشرح:\nطلب التزام رسمي يساعد على ضمان توافق الفريق مع التغييرات والاستعداد للعمل مع الأعضاء الجدد، مما يعزز التعاون والنجاح في المرحلة القادمة.\n- تقييم التسليم التدريجي أو إجبار الفريق قد لا يعالج القلق الأساسي.\n- إزالة العضو الجديد قد تؤدي إلى مشاكل إضافية في الموارد.",
      "choices": [
        {
          "text": "إجراء تقييم للتسليم التدريجي.",
          "correct": false
        },
        {
          "text": "إجبار الفريق على البقاء معًا.",
          "correct": false
        },
        {
          "text": "طلب التزام رسمي من الفريق.",
          "correct": true
        },
        {
          "text": "إزالة العضو الجديد من الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير المشروع فريقًا لمشروع يهدف إلى تعزيز قدرة منتج في السوق.\n\nما الذي يجب أن يكون أهم اعتبار عند تحديد مؤشرات الأداء الرئيسية (KPIs) للفريق؟",
      "explanation": "الإجابة الصحيحة: الاتساق مع احتياجات العميل.\n\n- الشرح:\nمؤشرات الأداء الرئيسية يجب أن تعكس القيمة التي يحصل عليها العميل، لأن تحقيق رضا العميل وتحقيق أهدافه هو محور نجاح المشروع.\n- الاتساق مع نمو الفرد أو أهداف مدير المشروع أو الراعي قد لا يضمن تحقيق القيمة الحقيقية للعميل.",
      "choices": [
        {
          "text": "الاتساق مع نمو وتطور الفرد.",
          "correct": false
        },
        {
          "text": "الاتساق مع احتياجات العميل.",
          "correct": true
        },
        {
          "text": "الاتساق مع أهداف مدير المشروع.",
          "correct": false
        },
        {
          "text": "الاتساق مع أهداف العمل الخاصة بالراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع أجايل في مرحلته الثالثة. خلال هذه المرحلة، يتواصل العميل مع مدير المشروع لطلب ميزات إضافية. تُعتبر هذه الميزات مهمة ويمكن استيعابها دون الحاجة إلى موارد إضافية كبيرة. يطلب العميل تنفيذ التغييرات فورًا في السبرنت الحالي.\n\nكيف يجب أن يرد مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إعطاء أولوية للميزات الإضافية في بداية السبرنت القادم.\n\n- الشرح:\nفي أجايل، يجب احترام حدود السبرنت الجاري وعدم تعديل المهام أثناء تنفيذه، ولكن يمكن تضمين الميزات المهمة في السبرنت التالي لضمان استمرارية العمل دون تعريض جودة التكرار الجاري للخطر.\n- تعديل السبرنت الحالي فورًا دون تخطيط قد يسبب اضطراباً في الفريق.\n- رفض التغيير تماماً أو تأجيله بشكل غير واضح قد يقلل من رضا العميل.",
      "choices": [
        {
          "text": "تذكير العميل بأنه لا يُسمح بإجراء تغييرات وفقًا للعقد.",
          "correct": false
        },
        {
          "text": "تعديل السبرنت الحالي لإدراج الميزات الإضافية.",
          "correct": false
        },
        {
          "text": "إعطاء أولوية للميزات الإضافية في بداية السبرنت القادم.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بأنه سيتم إدراج الميزات الجديدة في مرحلة لاحقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في منتصف دورات التكرار العشر. خلال التكرار الأخير، اضطر الفريق للعمل لساعات إضافية لتحقيق الهدف. في مراجعة التكرار، اتفق الفريق على أنهم استغرقوا وقتًا أطول من المخطط لأنهم لم يمتلكوا الخبرة المطلوبة عند تنفيذ المهام المخصصة لأول مرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: طلب من الفريق إعادة تقييم تقديرات الجهد في جلسة تخطيط التكرار.\n\n- الشرح:\nإعادة تقييم التقديرات تساعد الفريق على تعديل التخطيط المستقبلي بناءً على الخبرة المكتسبة وتحسين دقة تقديرات الجهد، مما يؤدي إلى تحسين أداء الفريق وتجنب العمل الإضافي غير المخطط.\n- طلب تدريب أو تمديد الوقت أو إعادة ترتيب الأولويات قد تكون مفيدة، لكنها ليست الحل الفوري والمباشر لمشكلة التقدير الحالية.",
      "choices": [
        {
          "text": "طلب تدريب إضافي للفريق من الراعي.",
          "correct": false
        },
        {
          "text": "طلب من الراعي الموافقة على طلب تغيير للحصول على وقت إضافي في التكرارات المستقبلية.",
          "correct": false
        },
        {
          "text": "طلب من الفريق إعادة تقييم تقديرات الجهد في جلسة تخطيط التكرار.",
          "correct": true
        },
        {
          "text": "طلب من مالك المنتج إعادة ترتيب أولويات سجل المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "الفريق أ من المشروع يطلق برنامجًا معقدًا بالتعاون مع الفرق ب، ج، و د.\n\nما الذي يجب أن يكون أولوية مدير مشروع الفريق أ خلال المراحل الأولى من المشروع؟",
      "explanation": "الإجابة الصحيحة: طلب من الفرق أ، ب، ج، و د تحديد التبعيات الحرجة والمخاطر والمعالم الرئيسية.\n\nلماذا هذا الخيار صحيح:\n- تحديد التبعيات الحرجة والمخاطر والمعالم يساعد في التنسيق بين الفرق المختلفة ويضمن وضوح مسؤوليات كل فريق.\n\nلماذا الخيارات الأخرى خاطئة:\n- تنظيم حدث لبناء الفريق: مهم لكنه ليس أولوية أولية مقارنة بفهم التبعيات.\n- تضمين لوحة قياسات للفرق الأخرى: هذه خطوة لاحقة بعد تحديد الأهداف والتبعيات.\n- تحديد نفس الأولويات كما لدى الفرق الأخرى: قد لا يكون ممكنًا أو صحيحًا لأن لكل فريق أولوياته الخاصة التي يجب تنسيقها وليس نسخها.",
      "choices": [
        {
          "text": "تنظيم حدث لبناء الفريق يضم أعضاء من الفرق أ، ب، ج، و د.",
          "correct": false
        },
        {
          "text": "تضمين لوحة قياسات للفرق ب، ج، و د.",
          "correct": false
        },
        {
          "text": "تحديد نفس الأولويات كما لدى الفرق ب، ج، و د.",
          "correct": false
        },
        {
          "text": "طلب من الفرق أ، ب، ج، و د تحديد التبعيات الحرجة والمخاطر والمعالم الرئيسية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لكي يعمل الفريق بشكل أمثل، يجب أن يمتلك ميثاق مشروع يوضح الرؤية أو الهدف من المشروع ومجموعة واضحة من الاتفاقيات التشغيلية.\n\nلتحقيق ذلك، ما السؤال الذي يجب أن يجيب عنه ميثاق المشروع؟",
      "explanation": "الإجابة الصحيحة: لماذا يتم تنفيذ هذا المشروع؟\n\nلماذا هذا الخيار صحيح:\n- ميثاق المشروع يوضح الهدف الأساسي والسبب وراء تنفيذ المشروع.\n\nلماذا الخيارات الأخرى خاطئة:\n- لماذا أعطت المؤسسة الأولوية: هذا يتعلق بالأولويات المؤسسية وليس بالهدف المباشر للمشروع.\n- ما هي المخاطر وكيفية التخفيف منها: هذا جزء من خطة إدارة المخاطر وليس الميثاق.\n- من سيقوم بالعمل: هذه تفاصيل تخص تخطيط الموارد وليس الهدف العام للمشروع.",
      "choices": [
        {
          "text": "لماذا يتم تنفيذ هذا المشروع؟",
          "correct": true
        },
        {
          "text": "لماذا أعطت المؤسسة الأولوية لهذا المشروع؟",
          "correct": false
        },
        {
          "text": "ما هي المخاطر الرئيسية وكيفية التخفيف منها؟",
          "correct": false
        },
        {
          "text": "من سيقوم بالعمل؟",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل في أول دورة من عشر تكرارات. بعد مراجعة التكرار، تلقى الفريق ملاحظات من أصحاب المصلحة بأن أول مخرج لا يتماشى مع أهداف المشروع.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: طلب من مالك المنتج مراجعة سجل المنتج وأولوياته.\n\nلماذا هذا الخيار صحيح:\n- مالك المنتج هو المسؤول عن تحديد الأولويات في سجل المنتج والتأكد من توافق المخرجات مع أهداف المشروع.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب من الفريق الاجتماع مع أصحاب المصلحة: ليس من دور مدير المشروع ترتيب هذه الأولويات.\n- طلب من أصحاب المصلحة ترتيب أولويات احتياجاتهم: مالك المنتج هو المسؤول عن التنسيق.\n- طلب من الراعي تحديد أولويات أصحاب المصلحة: الراعي ليس مسؤولًا عن تفاصيل الأولويات اليومية للمشروع.",
      "choices": [
        {
          "text": "طلب من الفريق الاجتماع مع أصحاب المصلحة لفهم احتياجاتهم.",
          "correct": false
        },
        {
          "text": "طلب من مالك المنتج مراجعة سجل المنتج وأولوياته.",
          "correct": true
        },
        {
          "text": "طلب من أصحاب المصلحة ترتيب أولويات احتياجاتهم.",
          "correct": false
        },
        {
          "text": "طلب من الراعي تحديد أولويات أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنشأ فريق أجايل سجل مخاطر لمشروع. تم تحديد جميع المخاطر الأولية من خلال مقابلات أصحاب المصلحة وورش العمل ومعلومات من ميثاق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع لإدارة سجل المخاطر والمخاطر المرتبطة خلال بقية مدة المشروع؟",
      "explanation": "الإجابة الصحيحة: تحديث سجل المخاطر ومراجعة المخاطر مع الفريق بشكل منتظم.\n\nلماذا هذا الخيار صحيح:\n- تحديث سجل المخاطر بانتظام يضمن رصد المخاطر الجديدة والتغيرات في المخاطر الحالية.\n- مراجعة المخاطر مع الفريق تساعد في التخطيط للتعامل معها بشكل فعال وتوفير فرصة لمشاركة جميع أعضاء الفريق.\n\nلماذا الخيارات الأخرى خاطئة:\n- تقييم وتحديد أولويات المخاطر خلال كل اجتماع مراجعة تكرار: قد يكون مهمًا لكنه غير كافٍ بدون تحديث شامل ومنتظم للسجل.\n- تضمين المخاطر كموضوع في اجتماعات سكرم اليومية: الوقت المخصص للاجتماعات اليومية قصير ومخصص لحالة العمل الحالي، وليس لمناقشة المخاطر المفصلة.\n- القضاء على جميع مخاطر المشروع باستخدام إدارة المخاطر التكرارية: القضاء التام على جميع المخاطر غير ممكن وغالبًا ما يكون الهدف هو تقليلها أو إدارتها، وليس القضاء عليها بالكامل.",
      "choices": [
        {
          "text": "تقييم وتحديد أولويات المخاطر خلال كل اجتماع مراجعة تكرار.",
          "correct": false
        },
        {
          "text": "تضمين المخاطر كموضوع في اجتماعات سكرم اليومية.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر ومراجعة المخاطر مع الفريق بشكل منتظم.",
          "correct": true
        },
        {
          "text": "القضاء على جميع مخاطر المشروع باستخدام إدارة المخاطر التكرارية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اجتماعات التعاون اليومية، يشتكي العديد من أعضاء الفريق من أنهم لا يستطيعون التركيز بسبب بيئة العمل الصاخبة.\n\nمن المسؤول عن حل هذه المشكلة من خلال إنشاء بيئة عمل أكثر ملاءمة؟",
      "explanation": "الإجابة الصحيحة: مدير المشروع.\n\nلماذا هذا الخيار صحيح:\n- مدير المشروع مسؤول عن توفير بيئة عمل ملائمة لفريقه تمكنهم من التركيز والإنتاجية.\n\nلماذا الخيارات الأخرى خاطئة:\n- الراعي: دوره دعم المشروع ولا يتدخل عادة في تفاصيل بيئة العمل اليومية.\n- أعضاء الفريق: يمكنهم التعبير عن المشكلة، لكن حلها يقع على مدير المشروع.\n- مالك المنتج: مسؤول عن تحديد متطلبات المنتج وأولويات العمل، وليس إدارة بيئة العمل.",
      "choices": [
        {
          "text": "الراعي.",
          "correct": false
        },
        {
          "text": "أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "مالك المنتج.",
          "correct": false
        },
        {
          "text": "مدير المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق مشروع أجايل يقوم ببناء موقع إلكتروني لعميل. أبلغ العميل مالك المنتج أن شركته قررت إطلاق الموقع قبل شهر من الموعد المحدد، من أجل استغلال فرصة عمل.\n\nما الذي يجب أن يطلبه مدير المشروع من الفريق فعله؟",
      "explanation": "الإجابة الصحيحة: الاجتماع كمجموعة لتقييم ما يمكن إنجازه وفقًا للجدول الزمني الجديد.\n\nلماذا هذا الخيار صحيح:\n- تقييم الجدول الزمني الجديد مع الفريق يساعد على معرفة الإمكانيات والقيود ويضع خطة واقعية.\n\nلماذا الخيارات الأخرى خاطئة:\n- تخصيص موارد إضافية دون تقييم قد يسبب ضغطًا زائدًا أو استنزافًا للموارد.\n- إبلاغ العميل بعدم إمكانية الإطلاق مبكرًا دون تقييم يعوق التكيف مع متطلبات العميل.\n- عقد اجتماع استرجاعي لفهم كيفية التسريع مناسب بعد التنفيذ وليس في هذه المرحلة المبكرة من التغيير.",
      "choices": [
        {
          "text": "تخصيص موارد إضافية لإكمال العمل قبل شهر من الموعد.",
          "correct": false
        },
        {
          "text": "الاجتماع كمجموعة لتقييم ما يمكن إنجازه وفقًا للجدول الزمني الجديد.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بأنه من غير الممكن إطلاق الموقع في وقت مبكر.",
          "correct": false
        },
        {
          "text": "عقد اجتماع استرجاعي لفهم كيفية تسريع العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع جديد بتطبيق ممارسات أجايل لتحسين أداء الفريق.\n\nما هو الأسلوب الذي يجب أن يتبعه مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: ضمان إجراء اجتماعات استرجاعية للفريق بانتظام.\n\nلماذا هذا هو الخيار الصحيح:\nالاجتماعات الاسترجاعية (Retrospectives) تُعد من الممارسات الأساسية في الأجايل لتحسين الأداء باستمرار. تتيح للفريق مناقشة ما نجح وما يحتاج إلى تحسين.\n\nلماذا الخيارات الأخرى خاطئة:\n- استخدام تقنيات الاستماع النشط لتلبية احتياجات الفريق: الاستماع النشط مفيد لكنه ليس كافيًا لتحسين الأداء بشكل منهجي كما في الاجتماعات الاسترجاعية.\n- طلب ميزانية من قسم المالية لتدريب أعضاء الفريق: التدريب ضروري لكنه ليس الإجراء المباشر لتحسين الأداء بشكل مستمر.\n- تخصيص ميزانية لأنشطة الفريق خلال مرحلة التخطيط: الميزانية تدعم الأنشطة لكن لا تحقق تحسين الأداء بشكل دوري كما تفعل الاجتماعات الاسترجاعية.",
      "choices": [
        {
          "text": "استخدام تقنيات الاستماع النشط لتلبية احتياجات الفريق.",
          "correct": false
        },
        {
          "text": "طلب ميزانية من قسم المالية لتدريب أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تخصيص ميزانية لأنشطة الفريق خلال مرحلة التخطيط.",
          "correct": false
        },
        {
          "text": "ضمان إجراء اجتماعات استرجاعية للفريق بانتظام.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اعتمد فريق مشروع أجايل ممارسات مرنة لتلبية الحاجة إلى تطوير تطبيق. أحد أعضاء الفريق الكبار يحضر الاجتماعات بشكل غير منتظم، بما في ذلك اجتماعات الوقوف اليومية، ويطلب من الآخرين تقديم تحديثات الحالة نيابة عنه.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: تذكير العضو الكبير بالالتزام باتفاقية العمل الخاصة بالفريق.\n\nلماذا هذا هو الخيار الصحيح:\nفي أجايل، الالتزام بحضور الاجتماعات اليومية هو جزء من مسؤوليات كل عضو. تذكير العضو بالاتفاقيات هو أول خطوة لضمان الالتزام دون اللجوء لإجراءات تصعيدية مباشرة.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب إزالة العضو الكبير من الفريق بسبب مشاكل في المشاركة: قرار متسرع يجب أن يأتي فقط بعد فشل جميع محاولات التصحيح.\n- تصعيد مسألة مشاركة العضو الكبير إلى الإدارة العليا: تصعيد الأمور بهذا الشكل لا يتماشى مع روح الأجايل التي تعتمد على الحلول داخل الفريق أولاً.\n- طلب من أعضاء الفريق الآخرين تغطية مهام العضو الكبير: هذا يؤدي إلى زيادة الضغط على الفريق ويضر بثقافة الأجايل التي تعتمد على الشفافية والمسؤولية المشتركة.",
      "choices": [
        {
          "text": "طلب إزالة العضو الكبير من الفريق بسبب مشاكل في المشاركة.",
          "correct": false
        },
        {
          "text": "تذكير العضو الكبير بالالتزام باتفاقية العمل الخاصة بالفريق.",
          "correct": true
        },
        {
          "text": "تصعيد مسألة مشاركة العضو الكبير إلى الإدارة العليا.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق الآخرين تغطية مهام العضو الكبير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع أجايل لتطبيق عملية أتمتة جديدة في مصنع قيد التنفيذ. يحتاج مدير المشروع إلى مورد خارجي للمساعدة في التثبيت.\n\nماذا يجب أن يفعل مدير المشروع قبل أن يبدأ المورد في العمل مع الفريق؟",
      "explanation": "الإجابة الصحيحة: عقد جلسة تعريفية لضمان وجود فهم مشترك لأهداف المشروع ومتطلباته.\n\nلماذا هذا هو الخيار الصحيح:\nعقد جلسة تعريفية قبل بدء العمل يساعد في ضمان تنسيق العمل بين المورد والفريق ويقلل من سوء الفهم، مما ينعكس على جودة النتائج.\n\nلماذا الخيارات الأخرى خاطئة:\n- تفويض جميع القرارات الرئيسية إلى فريق المورد لتجنب تحمل المخاطر: يفقد مدير المشروع السيطرة على المشروع ويزيد من احتمالية الفشل.\n- تقديم مصفوفة الاتصال بحيث يكون جميع أعضاء الفريق والموردين معروفين: خطوة مهمة لكنها لا تكفي لضمان فهم الأهداف والمتطلبات.\n- تذكير الفريق بأن المورد يعمل لصالحهم وأن بإمكانهم اتخاذ القرارات النهائية: هذا يُضعف التعاون ويخالف مبدأ الشراكة في المشاريع.",
      "choices": [
        {
          "text": "تفويض جميع القرارات الرئيسية إلى فريق المورد لتجنب تحمل المخاطر.",
          "correct": false
        },
        {
          "text": "عقد جلسة تعريفية لضمان وجود فهم مشترك لأهداف المشروع ومتطلباته.",
          "correct": true
        },
        {
          "text": "تقديم مصفوفة الاتصال بحيث يكون جميع أعضاء الفريق والموردين معروفين.",
          "correct": false
        },
        {
          "text": "تذكير الفريق بأن المورد يعمل لصالحهم وأن بإمكانهم اتخاذ القرارات النهائية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن أحد أعضاء الفريق بدأ يفقد اهتمامه تدريجيًا بالمشروع الجاري.\n\nما الذي يجب أن يفعله مدير المشروع لضمان مشاركة هذا العضو؟",
      "explanation": "الإجابة الصحيحة: التحدث مع العضو، وفهم المشكلة، ومطالبته بوضع إجراءات تصحيحية.\n\nلماذا هذا هو الخيار الصحيح:\nمعالجة فقدان الاهتمام تتطلب أولًا فهم السبب الحقيقي وراء سلوك العضو. إجراء حوار مباشر هو الطريقة الأمثل لتحديد السبب وتحفيز العضو لوضع خطة تصحيحية.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب من عضو آخر في الفريق أن يكون مرشدًا: هذا قد يساعد لاحقًا لكن ليس الإجراء الأول، لأنه يتعامل مع العَرَض وليس السبب.\n- عقد اجتماع جماعي لمناقشة توقعات المشاركة: هذا قد يسبب إحراجًا للعضو ويقلل من فعالية النقاش.\n- طلب من العضو غير النشط حضور تدريب إضافي: هذا يفترض أن المشكلة مهارية بينما قد تكون نفسية أو متعلقة بالتحفيز.",
      "choices": [
        {
          "text": "التحدث مع العضو، وفهم المشكلة، ومطالبته بوضع إجراءات تصحيحية.",
          "correct": true
        },
        {
          "text": "طلب من عضو آخر في الفريق أن يكون مرشدًا للعضو غير المشارك.",
          "correct": false
        },
        {
          "text": "عقد اجتماع جماعي لمناقشة توقعات المشاركة.",
          "correct": false
        },
        {
          "text": "طلب من العضو غير النشط حضور تدريب إضافي لتحسين مهاراته التواصلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير المشروع بإنشاء قائمة أصحاب المصلحة ويقرر الآن كيفية توزيع المعلومات بفعالية على العميل.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: إجراء تحليل لأصحاب المصلحة وإعداد خطة إدارة الاتصالات.\n\nلماذا هذا هو الخيار الصحيح:\nلا يمكن افتراض أن كل أصحاب المصلحة يحتاجون نفس مستوى المعلومات. إعداد خطة اتصالات يحدد من يستلم ماذا، متى، وبأي وسيلة.\n\nلماذا الخيارات الأخرى خاطئة:\n- الاجتماع مع جميع أصحاب المصلحة وجهًا لوجه أسبوعيًا: مكلف وغير عملي خصوصًا في مشاريع كبيرة.\n- إرسال التحديثات إلى جميع أصحاب المصلحة: يؤدي إلى ازدحام معلومات وقد يتسبب في إرباك غير ضروري.\n- مراجعة البيانات السابقة المرسلة إلى عملاء آخرين واتباع نفس النهج: هذا يتجاهل احتياجات أصحاب المصلحة الحاليين، وقد تكون مختلفة تمامًا.",
      "choices": [
        {
          "text": "الاجتماع مع جميع أصحاب المصلحة وجهًا لوجه أسبوعيًا.",
          "correct": false
        },
        {
          "text": "إرسال التحديثات إلى جميع أصحاب المصلحة، بما في ذلك العميل.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لأصحاب المصلحة وإعداد خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "مراجعة البيانات السابقة المرسلة إلى عملاء آخرين واتباع نفس النهج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشعر مدير المشروع في منظمة هجينة سريعة النمو بالإحباط المتزايد بسبب الكم الهائل من التغيرات في العمليات اليومية. غادر العديد من الأعضاء الجدد الفريق أو تمت ترقيتهم إلى أدوار أخرى في المنظمة.\n\nماذا يجب أن يفعل مدير المشروع لضمان بقاء حوكمة المشروع مستقرة؟",
      "explanation": "الإجابة الصحيحة: العمل مع القيادة لتحديث الأصول التنظيمية للعمليات (OPAs).\n\nلماذا هذا هو الخيار الصحيح:\nالأصول التنظيمية تعكس الطريقة التي تُدار بها المشاريع داخل المنظمة. عندما تحدث تغييرات مستمرة، يجب تحديثها لضمان الاتساق والاستقرار.\n\nلماذا الخيارات الأخرى خاطئة:\n- تطوير عقد اجتماعي جديد لتمكين الفريق: يعالج جانب الفريق فقط وليس العمليات المؤسسية ككل.\n- تحديث ميثاق الفريق بأعضاء الفريق الجدد: خطوة ضرورية لكنها ليست كافية لضمان الحوكمة على مستوى المؤسسة.\n- تحديث خطة إدارة المشروع بانتظام: يعالج تفاصيل المشروع فقط لكن لا يضمن استقرار الحوكمة على مستوى المؤسسة.",
      "choices": [
        {
          "text": "العمل مع القيادة لتحديث الأصول التنظيمية للعمليات (OPAs).",
          "correct": true
        },
        {
          "text": "تطوير عقد اجتماعي جديد لتمكين الفريق.",
          "correct": false
        },
        {
          "text": "تحديث ميثاق الفريق بأعضاء الفريق الجدد.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المشروع بانتظام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأت الشركة في تنفيذ مشاريع أجايل. يشعر الراعي بالإحباط ولا يفهم عملية جمع المتطلبات الجديدة، والتي تبدو غير مكتملة وتتحرك بسرعة كبيرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: مساعدة الراعي على فهم الأدوات والتقنيات المختلفة المتاحة ولماذا تم اختيار هذه الطريقة.\n\n- لماذا هذا هو الخيار الصحيح: عندما لا يفهم الراعي طبيعة أجايل، يجب على مدير المشروع توعيته وتوضيح آلية العمل الجديدة وأسباب اعتمادها لضمان دعمه واستمرارية المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديث سجل أصحاب المصلحة لتحديد الراعي كمصدر محتمل للعوائق: هذا تصرف سلبي وغير فعال، ويزيد المشكلة بدلًا من حلها.\n- إبلاغ الفريق بعدم رضا الراعي والتحول من التخطيط التكراري إلى التخطيط التنبؤي: هذا يخالف مبادئ أجايل ويضر بمرونة المشروع.\n- إيقاف العمل في المشروع حتى يتمكن سكرم ماستر من مراجعة سجل المنتج بالكامل مع الراعي: هذا يؤدي إلى تعطيل المشروع دون ضمان حل المشكلة.",
      "choices": [
        {
          "text": "مساعدة الراعي على فهم الأدوات والتقنيات المختلفة المتاحة ولماذا تم اختيار هذه الطريقة.",
          "correct": true
        },
        {
          "text": "تحديث سجل أصحاب المصلحة لتحديد الراعي كمصدر محتمل للعوائق.",
          "correct": false
        },
        {
          "text": "إبلاغ الفريق بعدم رضا الراعي والتحول من التخطيط التكراري إلى التخطيط التنبؤي.",
          "correct": false
        },
        {
          "text": "إيقاف العمل في المشروع حتى يتمكن سكرم ماستر من مراجعة سجل المنتج بالكامل مع الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع في مرحلة بدء مشروع جديد ويستعد لتطوير ميثاق فريق المشروع. يتكون فريق المشروع من أعضاء من أقسام مختلفة داخل المنظمة، والتعاون أمر حيوي لنجاح المشروع. ماذا يجب أن يفعل مدير المشروع لإنشاء ميثاق فريق فعال؟",
      "explanation": "الإجابة الصحيحة: عقد اجتماع انطلاقة مع الفريق لتحديد الغرض والأدوار والمسؤوليات والأهداف بشكل تعاوني.\n\n- لماذا هذا هو الخيار الصحيح: إشراك الفريق منذ البداية في إعداد الميثاق يعزز التزامهم وفهمهم المشترك، مما يؤدي إلى تعاون أفضل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إنشاء ميثاق الفريق بشكل مستقل: لا يعكس روح التعاون المطلوبة.\n- تفويض مهمة إعداد الميثاق إلى عضو فريق كبير: يحرم الفريق من فرصة المشاركة.\n- مشاركة قالب عام لميثاق فريق المشروع مع الفريق ودعوتهم لتعديله: أقل فعالية لأنه لا يولد نفس مستوى النقاش والتفاهم الذي ينتج عن جلسة تعاونية مباشرة.",
      "choices": [
        {
          "text": "إنشاء ميثاق الفريق بشكل مستقل، وتحديد توقعاته وأهدافه للفريق.",
          "correct": false
        },
        {
          "text": "عقد اجتماع انطلاقة مع الفريق لتحديد الغرض والأدوار والمسؤوليات والأهداف بشكل تعاوني.",
          "correct": true
        },
        {
          "text": "تفويض مهمة إعداد الميثاق إلى عضو فريق كبير لديه خبرة في إدارة المشاريع.",
          "correct": false
        },
        {
          "text": "مشاركة قالب عام لميثاق فريق المشروع مع الفريق ودعوتهم لتعديله حسب الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بالتوسع، ويفكر مدير المشروع فيما إذا كان يجب توظيف موارد جديدة أو الاستعانة بموارد من فريق مورد معتمد. ما الذي يجب أن يركز عليه مدير المشروع بخصوص هذا القرار؟",
      "explanation": "الإجابة الصحيحة: تكلفة توظيف موارد جديدة مقابل الاستعانة بمصادر خارجية.\n\n- لماذا هذا هو الخيار الصحيح: القرار يتطلب تقييم منطق التكلفة والجدوى المالية، لتحديد الخيار الأكثر فعالية من حيث الكلفة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استراتيجية التوريد والمعايير الخاصة بالمؤسسة: مهمة لكنها ليست الأولوية الأولى في هذا السياق.\n- قوة الموارد الداخلية في المؤسسة مقابل موارد المورد: لا تعطي تقييمًا ماليًا مباشرًا.\n- تكلفة الموارد الداخلية مقابل تكلفة موارد المورد: تحليل جزئي؛ بينما السؤال يتطلب مقارنة بين توظيف داخلي كامل أو الاستعانة بمصادر خارجية كاملة.",
      "choices": [
        {
          "text": "استراتيجية التوريد والمعايير الخاصة بالمؤسسة.",
          "correct": false
        },
        {
          "text": "تكلفة توظيف موارد جديدة مقابل الاستعانة بمصادر خارجية.",
          "correct": true
        },
        {
          "text": "قوة الموارد الداخلية في المؤسسة مقابل موارد المورد.",
          "correct": false
        },
        {
          "text": "تكلفة الموارد الداخلية مقابل تكلفة موارد المورد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تحاول مؤسسة اعتماد أساليب أجايل لتنفيذ المشاريع لعملائها. خلال تخطيط المشروع، اقترح مالك المنتج أن أي إصدار للعميل يجب أن يحصل على موافقة من القسم القانوني قبل الإرسال. يشعر فريق التطوير بالإحباط لأن هذا قد يؤخر الإصدارات وجدول التسليم.\n\nنظرًا لأن الأقسام الأخرى في المنظمة لا تستخدم أجايل، ما هو دور مدير المشروع كقائد خادم؟",
      "explanation": "الإجابة الصحيحة: العمل مع القسم القانوني والأقسام الأخرى المعنية لمراجعة العمليات التي تدعم تسليم المشروع.\n\n- لماذا هذا هو الخيار الصحيح: كقائد خادم في بيئة أجايل، دور مدير المشروع هو إزالة العوائق والتنسيق بين الفرق المختلفة لضمان استمرار العمل دون تعطيل، مع احترام السياسات التنظيمية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- نصح الإدارة العليا بإدخال تقنيات أجايل إلى جميع الأقسام: ليس من دور مدير المشروع اتخاذ قرار بهذا الحجم في هذه المرحلة.\n- الاستمرار في استخدام الإجراءات التنظيمية الموحدة: هذا يعارض فلسفة أجايل التي تبحث دائمًا عن تحسين العملية.\n- إبلاغ العميل بالإجراءات التنظيمية وطلب مناقشة ذلك مع القيادة: لا يعالج المشكلة الداخلية ولا يليق بدور القائد الخادم.",
      "choices": [
        {
          "text": "نصح الإدارة العليا بإدخال تقنيات أجايل إلى جميع الأقسام لضمان تقديم خدمات سلسة للعملاء.",
          "correct": false
        },
        {
          "text": "الاستمرار في استخدام الإجراءات التنظيمية الموحدة لضمان الامتثال للسياسات وتجنب خلق مشاكل.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بالإجراءات التنظيمية وطلب مناقشة ذلك مع قيادة المنظمة.",
          "correct": false
        },
        {
          "text": "العمل مع القسم القانوني والأقسام الأخرى المعنية لمراجعة العمليات التي تدعم تسليم المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثار أحد أعضاء الفريق قلقًا من أن بعض التسليمات قد لا تكون متوافقة مع بعض اللوائح.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: ترتيب اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين للحصول على توضيح حول اللوائح التي قد تؤثر على تسليمات المشروع.\n\n- لماذا هذا هو الخيار الصحيح: الهدف هو معالجة القلق بشكل مباشر وتأكيد ما إذا كان هناك عدم توافق، من خلال الاعتماد على أصحاب المعرفة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- طلب رسالة رسمية من العميل: العميل ليس دائمًا المصدر المعتمد للتأكد من اللوائح.\n- سؤال مكتب إدارة المشاريع (PMO): قد يوفر معلومات عامة لكنه ليس المصدر المباشر.\n- الاتصال بمدير عضو الفريق: هذا غير فعال لأن مدير العضو ليس مسؤولًا عن الجوانب القانونية.",
      "choices": [
        {
          "text": "ترتيب اجتماع مع أصحاب المصلحة الرئيسيين والخبراء المتخصصين للحصول على توضيح حول اللوائح التي قد تؤثر على تسليمات المشروع.",
          "correct": true
        },
        {
          "text": "طلب رسالة رسمية من العميل لتأكيد ما إذا كانت اللوائح تنطبق على تسليمات المشروع.",
          "correct": false
        },
        {
          "text": "سؤال مكتب إدارة المشاريع (PMO) إذا كانت تسليمات المشروع خاضعة للوائح، وإذا كان الأمر كذلك، كيفية المتابعة لضمان الامتثال.",
          "correct": false
        },
        {
          "text": "الاتصال بمدير عضو الفريق الذي أثار القلق لتحديد المهام المطلوبة للحفاظ على الامتثال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على شركة إطلاق منتج عالمي استجابة لتهديد تنافسي. كجزء من نهج أجايل، يختار الفريق الإقليم X كأساس لاختبار التكرار الأول. بينما يفي المنتج بالمعايير والمتطلبات في الإقليم X، إلا أنه لا يفي بمعيارين في إقليمين آخرين.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: التأكد من أن المنتج يفي بالمعايير والمتطلبات في الإقليم X، والتخطيط للتكرارات المستقبلية لمعالجة عدم الامتثال في الأقاليم الأخرى.\n\n- لماذا هذا هو الخيار الصحيح: أجايل يعتمد على التكرار والتحسين التدريجي، لذلك لا يتطلب إيقاف العمل بل يُعالج تدريجيًا.\n\n- لماذا الخيارات الأخرى خاطئة:\n- توثيق ذلك كعدم امتثال في خطة إدارة الجودة وتصحيحه في التكرار التالي: هذا يصنفه كخطأ بينما هو جزء من خطة مرحلية.\n- إعادة تخطيط جميع التكرارات: يزيد التكاليف ويهدر وقت السوق.\n- الاتصال بالعملاء في كل إقليم: قد يؤدي لخلط في التوقعات وتعطيل الجدول الزمني.",
      "choices": [
        {
          "text": "التأكد من أن المنتج يفي بالمعايير والمتطلبات في الإقليم X، والتخطيط للتكرارات المستقبلية لمعالجة عدم الامتثال في الأقاليم الأخرى.",
          "correct": true
        },
        {
          "text": "توثيق ذلك كعدم امتثال في خطة إدارة الجودة وتصحيحه في التكرار التالي.",
          "correct": false
        },
        {
          "text": "إعادة تخطيط جميع التكرارات لتفي بمعايير الأقاليم الثلاثة ضمن نطاق العمل.",
          "correct": false
        },
        {
          "text": "الاتصال بالعملاء في كل إقليم للتوصل إلى اتفاق حول التصميم الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "فريق سكرم في منتصف الطريق نحو الإصدار. خلال عرض السبرينت، قام أحد المطورين باختيار برنامج جديد وعرضه على الفريق. لم يكن هذا العمل مخططًا له، لكنه يفي بتاريخ الإصدار. ومع ذلك، تم تعطيل عدة ميزات ذات أولوية في السبرينتين القادمتين.\n\nما الإجراءات التي يجب أن يتخذها الفريق لتقليل التعطيل؟",
      "explanation": "الإجابة الصحيحة هي: العمل مع مالك المنتج على قائمة الأعمال لإدخال البرنامج الجديد.\n- السبب: مالك المنتج مسؤول عن تحديد أولويات قائمة الأعمال (Product Backlog) وهو المخول بتقييم ما إذا كان البرنامج الجديد مهمًا بما يكفي ليأخذ أولوية.\n- لماذا الخيارات الأخرى خاطئة:\n1. يتخذ فريق سكرم القرارات بنفسه كفريق منظم ذاتيًا ويعرض التغيير خلال العرض: هذا يتعارض مع دور مالك المنتج كمسؤول عن الأولويات والتخطيط.\n2. يتواصل المطورون مع سكرم ماستر بخصوص التغيير لتحديد المكان والوقت المناسب لمناقشته: سكرم ماستر لا يحدد الأولويات بل يدعم العملية.\n3. يقيم فريق سكرم البرنامج الجديد ويبلغ العميل بتأثيره على خطة الإصدار: لا يمكن تغيير خطة الإصدار بدون المرور عبر مالك المنتج.",
      "choices": [
        {
          "text": "العمل مع مالك المنتج على قائمة الأعمال لإدخال البرنامج الجديد.",
          "correct": true
        },
        {
          "text": "يتخذ فريق سكرم القرارات بنفسه كفريق منظم ذاتيًا ويعرض التغيير خلال العرض.",
          "correct": false
        },
        {
          "text": "يتواصل المطورون مع سكرم ماستر بخصوص التغيير لتحديد المكان والوقت المناسب لمناقشته.",
          "correct": false
        },
        {
          "text": "يقيم فريق سكرم البرنامج الجديد ويبلغ العميل بتأثيره على خطة الإصدار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرب نهاية مشروع كبير، لم تكن بعض التقارير الفنية المتعلقة بالخدمة المقدمة جاهزة. طلب مدير المشروع من أعضاء الفريق المستندات المفقودة، لكن الفريق ادعى أنهم قد أنجزوا مهامهم المكلفة بالفعل.\n\nكيف يجب على مدير المشروع معالجة هذا القلق؟",
      "explanation": "الإجابة الصحيحة هي: الرجوع إلى مخطط RACI للتحقق من الأدوار والمسؤوليات المسندة.\n- السبب: مخطط RACI يوضح بشكل محدد من هو المسؤول (Responsible) ومن هو المعني (Accountable) ومن يجب إعلامه (Informed) ومن يجب استشارته (Consulted).\n- لماذا الخيارات الأخرى خاطئة:\n1. مراجعة الهيكل التنظيمي لتأكيد المناصب والعلاقات: لا يكفي لأن الهيكل لا يحدد تفاصيل المهام.\n2. مناقشة قائمة الأنشطة وضمان فهم الفريق للعمل المطلوب: هذا إجراء عام وليس مرتبطًا بتحديد المسؤول عن مشكلة معينة.\n3. إدخال جميع الافتراضات والقيود في سجل الافتراضات: هذا يتعلق بالتخطيط وليس بإدارة النزاعات أو تحديد المسؤوليات.",
      "choices": [
        {
          "text": "مراجعة الهيكل التنظيمي لتأكيد المناصب والعلاقات.",
          "correct": false
        },
        {
          "text": "الرجوع إلى مخطط RACI للتحقق من الأدوار والمسؤوليات المسندة.",
          "correct": true
        },
        {
          "text": "مناقشة قائمة الأنشطة وضمان فهم الفريق للعمل المطلوب.",
          "correct": false
        },
        {
          "text": "إدخال جميع الافتراضات والقيود في سجل الافتراضات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اشتكى مدير وظيفي مشارك في المشروع من تقارير مقاييس الجودة الأخيرة المتعلقة بجميع التكرارات السابقة. لا يعتقد الفريق أن هذه الشكوى صحيحة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "الإجابة الصحيحة هي: التحدث مع المدير الوظيفي لفهم مخاوفه المحددة.\n- السبب: في أي مشكلة مرتبطة بالاتصالات أو الشكاوى، الخطوة الأولى دائمًا هي جمع المعلومات بدقة قبل اتخاذ أي إجراء.\n- لماذا الخيارات الأخرى خاطئة:\n1. تصحيح التقارير لتلبية شكوى المدير الوظيفي: قد يؤدي إلى تعديل معلومات صحيحة بدون مبرر.\n2. مراجعة مصفوفة RACI لتحديد المسؤول عن مقاييس الجودة: هذا إجراء داخلي ولا يحل المشكلة مع المدير.\n3. إجراء تدقيق جودة للتحقق من صحة مقاييس الجودة المطبقة: خطوة متقدمة يمكن اتخاذها بعد التأكد أن هناك خطأ حقيقي.",
      "choices": [
        {
          "text": "تصحيح التقارير لتلبية شكوى المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "التحدث مع المدير الوظيفي لفهم مخاوفه المحددة.",
          "correct": true
        },
        {
          "text": "مراجعة مصفوفة RACI لتحديد المسؤول عن مقاييس الجودة.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق جودة للتحقق من صحة مقاييس الجودة المطبقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من المقرر أن يزور أحد أعضاء الفريق موقع عميل خارجي الأسبوع المقبل. ومع ذلك، سمع مدير المشروع هذا العضو يخبر منسق المشروع أن مديره الوظيفي رفض منحه إجازة تعويضية مقابل الزيارة. يحتاج مدير المشروع إلى ضمان أن يقوم العضو بالزيارة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: التأكد من عضو الفريق بأن الزيارة للعميل يمكن أن تتم.\n\nشرح الإجابة الصحيحة:\n- الأولوية لمدير المشروع هنا هي التأكد من أن الالتزام الخاص بالمشروع مع العميل سيتم كما هو مخطط.\n- بدلاً من الدخول مباشرة في خلاف مع المدير الوظيفي، الخطوة المهنية الأولى هي التواصل مع عضو الفريق نفسه والتأكد مما إذا كان بإمكانه القيام بالزيارة أم لا.\n- هذه الطريقة تسمح لمدير المشروع بتأكيد المعلومة أولاً قبل التصعيد أو اتخاذ أي إجراء رسمي.\n\nلماذا الخيارات الأخرى خاطئة:\n- الاجتماع مباشرة مع عضو الفريق لإبلاغه بما تم سماعه: هذا أسلوب غير فعال لأنه يعتمد على الشائعات بدلاً من التأكد أولًا من الوقائع.\n- مواجهة المدير الوظيفي بشأن إجازة عضو الفريق: قد يسبب توترًا غير ضروري إذا لم يتم التأكد أولًا من الوضع الحقيقي مع عضو الفريق.\n- تسجيل المشكلة كخطر في سجل المخاطر وتعيين عضو فريق آخر: هذا قرار متسرع قبل محاولة التأكد وإيجاد حل مباشر مع العضو المعني.",
      "choices": [
        {
          "text": "الاجتماع مباشرة مع عضو الفريق لإبلاغه بما تم سماعه.",
          "correct": false
        },
        {
          "text": "التأكد من عضو الفريق بأن الزيارة للعميل يمكن أن تتم.",
          "correct": true
        },
        {
          "text": "مواجهة المدير الوظيفي بشأن إجازة عضو الفريق.",
          "correct": false
        },
        {
          "text": "تسجيل المشكلة كخطر في سجل المخاطر وتعيين عضو فريق آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أطلق رائد أعمال مشروعًا لتطوير البرمجيات. تمت الموافقة على ميثاق المشروع، وتم تعيين مدير مشروع للإشراف على تنفيذ المشروع. أثناء التطوير، ظهرت مخاطر سياسية غير متوقعة، مما أدى إلى حاجة ملحة لتسريع المشروع. طلب الراعي تقريرًا حول أي تأخيرات متوقعة.\n\nأي أداة يجب أن يستخدمها مدير المشروع لإعداد التقرير عن التأخيرات المتوقعة؟",
      "explanation": "الإجابة الصحيحة: تحليل الاتجاهات.\n\nشرح الإجابة الصحيحة:\n- تحليل الاتجاهات يستخدم لفهم كيفية تطور أداء المشروع مع مرور الوقت.\n- يساعد في توقع التأخيرات بناءً على الأداء السابق ومقارنة الخطط الفعلية مع المخطط.\n- هذه الأداة مهمة جدًا عندما يكون هناك ضغط خارجي لتسريع المشروع مع وجود مخاطر جديدة.\n\nلماذا الخيارات الأخرى خاطئة:\n- تحليل السبب الجذري: يُستخدم لتحديد أسباب مشكلة حدثت بالفعل، وليس لتوقع تأخيرات مستقبلية.\n- تقارير الجودة: تركز على جودة المنتج أو الخدمة، ولا تقدم بالضرورة تحليلًا زمنيًا للتأخيرات.\n- قائمة الإنجازات المرحلية: توضح المعالم والإنجازات، لكن لا تُستخدم للتحليل أو التنبؤ بالأداء المستقبلي.",
      "choices": [
        {
          "text": "تحليل الاتجاهات",
          "correct": true
        },
        {
          "text": "تحليل السبب الجذري",
          "correct": false
        },
        {
          "text": "تقارير الجودة",
          "correct": false
        },
        {
          "text": "قائمة الإنجازات المرحلية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "كانت الشركة تقدم خدمات تقنية للعملاء باستخدام عمالة خارجية. عندما تولى مدير مشروع جديد، قام الفريق بتوظيف أفراد متخصصين لتقليل التكاليف عن طريق تقديم الخدمة داخليًا. بعض أصحاب المصلحة مستاؤون من أن الموارد تستغرق وقتًا طويلاً لتقديم الخدمة.\n\nماذا يجب أن يفعل مدير المشروع لمعالجة هذا القلق؟",
      "explanation": "الإجابة الصحيحة: زيادة فهم أصحاب المصلحة لنهج المشروع.\n\nشرح الإجابة الصحيحة:\n- تغيير طريقة تقديم الخدمة من مورد خارجي إلى فريق داخلي يتطلب توضيحًا لجميع الأطراف.\n- من الطبيعي أن يحتاج أصحاب المصلحة لفهم أسباب التغيير وكيف سيؤثر ذلك على الأداء والجودة.\n- الشفافية والتواصل هما الأداتان الأساسيتان هنا.\n\nلماذا الخيارات الأخرى خاطئة:\n- مراجعة خطة الاتصال مع أصحاب المصلحة المستائين: هذا جزء فرعي مما هو مطلوب، لكنه لا يعالج جوهر المشكلة وهو الفهم العام.\n- إعادة توظيف المتعاقد الخارجي: خطوة متسرعة وتتناقض مع هدف المشروع الذي هو تقليل التكاليف.\n- تطوير مسار تصاعدي: يُستخدم عند وجود صراع أو مشكلة تنظيمية، لكن ليس بالضرورة لمعالجة سوء الفهم حول التغيير.",
      "choices": [
        {
          "text": "مراجعة خطة الاتصال مع أصحاب المصلحة المستائين.",
          "correct": false
        },
        {
          "text": "زيادة فهم أصحاب المصلحة لنهج المشروع.",
          "correct": true
        },
        {
          "text": "إعادة توظيف المتعاقد الخارجي الذي قدم الخدمة سابقًا.",
          "correct": false
        },
        {
          "text": "تطوير مسار تصاعدي وإبلاغ أصحاب المصلحة بخطة التدرج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام بائع في مشروع كبير ومعقد بتنفيذ أعمال أكثر مما كان متوقعًا في عقد الوقت والمواد. أدى هذا النوع من العقود إلى تأخر المشروع عن الجدول وتجاوز الميزانية. العقد على وشك الانتهاء.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: التحول إلى اتفاقية خدمات رئيسية مع ملاحق للعمل الإضافي حسب الحاجة.\n\nشرح الإجابة الصحيحة:\n- عندما ينتهي عقد الوقت والمواد، والنتيجة كانت تأخير وتجاوز للميزانية، من الحكمة تغيير نوع العقد لضبط السيطرة.\n- اتفاقية خدمات رئيسية (Master Service Agreement) تعطي إطارًا عامًا للتعاون، بينما يتم تحديد العمل الإضافي عبر ملاحق منفصلة.\n- هذا الأسلوب يوفر مرونة أفضل مع تحكم مالي وزمني أفضل مقارنة بعقد الوقت والمواد.\n\nلماذا الخيارات الأخرى خاطئة:\n- إنشاء طلب عرض أسعار (RFQ): إجراء سابق لأوانه لأن المشكلة مع المورد الحالي ولم يتم بعد تقييم إمكانية التحسين.\n- استشارة مستودع الدروس المستفادة: ليس حلًا مباشرًا للمشكلة الحالية.\n- محاولة التفاوض على عقد بسعر ثابت: قد لا يكون مناسبًا إذا كانت طبيعة العمل معقدة ومتغيرة.",
      "choices": [
        {
          "text": "إنشاء طلب عرض أسعار (RFQ) لتكوين قائمة بموردين جدد.",
          "correct": false
        },
        {
          "text": "التحول إلى اتفاقية خدمات رئيسية مع ملاحق للعمل الإضافي حسب الحاجة.",
          "correct": true
        },
        {
          "text": "استشارة مستودع الدروس المستفادة لتكوين قائمة بموردين محتملين جدد.",
          "correct": false
        },
        {
          "text": "محاولة التفاوض على عقد بسعر ثابت مع البائع الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اعتمد الفريق مؤخرًا نهج أجايل ويتبع نموذج سكرم. هناك نزاع بين المطور الرئيسي وعضو فريق ضمان الجودة بخصوص الأساليب المتبعة، مما يؤثر على أهداف السبرينت.\n\nماذا يجب أن يفعل مدير المشروع لحل هذه النزاعات؟",
      "explanation": "الإجابة الصحيحة: مساعدة أعضاء الفريق على التعاون وحل المشكلة معًا.\n\nشرح الإجابة الصحيحة:\n- في بيئة أجايل، يتم تشجيع فرق العمل على التعاون الذاتي وحل المشاكل داخليًا.\n- دور مدير المشروع كقائد خادم هو تسهيل النقاش وخلق بيئة للحوار وليس فرض حلول.\n- مساعدة الفريق على التعاون يقلل النزاعات مستقبلًا ويعزز روح الفريق.\n\nلماذا الخيارات الأخرى خاطئة:\n- دعوة لاجتماعات منفصلة: قد يؤدي إلى تفاقم المشكلة بدل حلها.\n- تحليل الوضع ومساعدة الأعضاء على فهم تأثير النزاع: خطوة مساعدة ولكن ليست كافية بحد ذاتها.\n- مناقشة الوضع في جلسة الاسترجاع: يُفضل التدخل الفوري لحل النزاع بدل الانتظار.",
      "choices": [
        {
          "text": "دعوة لاجتماعات منفصلة مع كل عضو واقتراح أن يحلوا النزاع بأنفسهم.",
          "correct": false
        },
        {
          "text": "تحليل الوضع ومساعدة الأعضاء على فهم تأثير النزاع.",
          "correct": false
        },
        {
          "text": "مساعدة أعضاء الفريق على التعاون وحل المشكلة معًا.",
          "correct": true
        },
        {
          "text": "مناقشة الوضع في جلسة الاسترجاع وإنشاء بند عمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بداية مشروع، قرر الفريق اعتماد نهج أجايل لتنفيذه، باستخدام قصص المستخدم لتوثيق المتطلبات. كجزء من إطار الرقابة في المؤسسة، ستطلب إدارة الامتثال الداخلية نسخة من وثيقة المتطلبات المعتمدة.\n\nماذا يجب أن يتم لتلبية هذا الطلب؟",
      "explanation": "الإجابة الصحيحة: مراجعة نهج المشروع مع قسم الامتثال، وضمان فهمهم لكيفية تلبية أهداف الرقابة.\n\nشرح الإجابة الصحيحة:\n- في المشاريع الأجايل، قصص المستخدم تحل محل المتطلبات التقليدية، لذا من المهم توضيح ذلك لإدارة الامتثال.\n- التواصل المسبق مع الامتثال يساعد على تفادي التعارض لاحقًا.\n\nلماذا الخيارات الأخرى خاطئة:\n- طباعة وتجميع جميع قصص المستخدم: تصرف غير فعال وغير عملي.\n- تعيين مطلب الامتثال كمهمة على لوحة كانبان: خطوة تنظيمية فرعية وليست حلاً جذريًا.\n- مراجعة نهج المشروع مع الامتثال ورفض المتطلبات: تصرف غير مهني يعرض المشروع للمخاطر التنظيمية.",
      "choices": [
        {
          "text": "مراجعة نهج المشروع مع قسم الامتثال، وضمان فهمهم لكيفية تلبية أهداف الرقابة.",
          "correct": true
        },
        {
          "text": "طباعة وتجميع جميع قصص المستخدم في حزمة واحدة في نهاية المشروع والحصول على موافقة مالك المنتج.",
          "correct": false
        },
        {
          "text": "تعيين مطلب الامتثال كمهمة على لوحة كانبان الخاصة بالمشروع لمالك المنتج.",
          "correct": false
        },
        {
          "text": "مراجعة نهج المشروع مع الامتثال، موضحًا أن هدف الرقابة غير مطلوب لأن المشروع يستخدم أجايل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء المرحلة النهائية من المشروع، طلب أحد أصحاب المصلحة الرئيسيين من مدير المشروع تقديم إحاطة لمجلس الإدارة التنفيذي حول العائد على الاستثمار (ROI) وأي قيمة تجارية جديدة تم تحديدها خلال تنفيذ المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: عرض الفوائد المحققة.\n\nشرح الإجابة الصحيحة:\n- في المرحلة النهائية من المشروع، يهتم أصحاب المصلحة ومجلس الإدارة بالنتائج الفعلية التي تم تحقيقها، وليس الخطط أو التوقعات.\n- الفوائد المحققة (Benefits Realization) تعبر عن القيمة التي تمت إضافتها فعليًا بسبب المشروع، مثل زيادة الأرباح أو تحسين العمليات.\n\nلماذا الخيارات الأخرى خاطئة:\n- عرض تحليل التكلفة والفائدة: يستخدم عادةً في مرحلة التخطيط لاتخاذ القرار، وليس في النهاية.\n- عرض خطة إدارة التكاليف: يركز على التحكم في التكاليف، ولا يُظهر النتائج.\n- عرض عوامل النجاح المالية: قد تكون مفيدة لكن لا تعطي نظرة مباشرة على ROI والفوائد التجارية.",
      "choices": [
        {
          "text": "عرض تحليل التكلفة والفائدة.",
          "correct": false
        },
        {
          "text": "عرض الفوائد المحققة.",
          "correct": true
        },
        {
          "text": "عرض خطة إدارة التكاليف.",
          "correct": false
        },
        {
          "text": "عرض عوامل النجاح المالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "من أجل تحديد نهج هجين جديد للمشروع، قرر مدير المشروع أن من الضروري إجراء تقييم لثقافة المنظمة.\n\nما العنصران اللذان يجب على مدير المشروع موازنتهما؟",
      "explanation": "الإجابة الصحيحة: المرونة وقابلية التنبؤ.\n\nشرح الإجابة الصحيحة:\n- في البيئة الهجينة، يحتاج الفريق إلى الجمع بين مرونة الأجايل وقابلية التنبؤ الموجودة في المنهجيات التقليدية.\n- تقييم الثقافة التنظيمية يوضح مدى استعداد المؤسسة لقبول هذا التوازن.\n\nلماذا الخيارات الأخرى خاطئة:\n- الاستكشاف والاستقرار: ليست معايير رئيسية في تقييم الثقافة.\n- السرعة والنماذج التقليدية: مفهومان مرتبطان ولكن ليسا العنصرين الأساسيين هنا.\n- الاضطراب والامتثال: مرتبط أكثر بإدارة المخاطر وليس بتقييم ثقافة المنظمة.",
      "choices": [
        {
          "text": "الاستكشاف والاستقرار",
          "correct": false
        },
        {
          "text": "السرعة والنماذج التقليدية",
          "correct": false
        },
        {
          "text": "المرونة وقابلية التنبؤ",
          "correct": true
        },
        {
          "text": "الاضطراب والامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال إحدى التكرارات، قضى الفريق ضعف الوقت المتوقع على أحد عناصر قائمة المنتج المتراكمة بسبب تعقيده وعدم إمكانية تقسيمه إلى عناصر أصغر.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: الطلب من مالك المنتج إعادة ترتيب أولويات قائمة المنتج.\n\nشرح الإجابة الصحيحة:\n- إذا استغرق عنصر أكثر مما هو متوقع وأثر على باقي العمل، يصبح من الضروري إعادة ترتيب الأولويات.\n- مالك المنتج مسؤول عن ترتيب الأولويات بما يتوافق مع القيمة والأهمية.\n\nلماذا الخيارات الأخرى خاطئة:\n- دمج نهج تكيفي أو تنبؤي لبقية المشروع: لا يعالج المشكلة مباشرة ويغير منهجية المشروع بلا داعٍ.\n- تطوير خطة إدارة المخاطر: خطوة لاحقة أو موازية، لكن الأولوية هنا لتحديد ما الذي يتم العمل عليه أولًا.",
      "choices": [
        {
          "text": "دمج نهج تكيفي لبقية المشروع.",
          "correct": false
        },
        {
          "text": "دمج نهج تنبؤي لبقية المشروع.",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة المخاطر لهذه التكرار.",
          "correct": false
        },
        {
          "text": "الطلب من مالك المنتج إعادة ترتيب أولويات قائمة المنتج.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مالك منتج جديد ولا يعرف كيفية ترتيب أولويات مواصفات المنتج وذكر هذا التحدي لمدير المشروع.\n\nماذا يجب أن يفعل مدير المشروع لمساعدة مالك المنتج؟",
      "explanation": "الإجابة الصحيحة: توجيه مالك المنتج حول كيفية ترتيب أولويات مواصفات المنتج.\n\nشرح الإجابة الصحيحة:\n- دور مالك المنتج يتضمن مسؤولية ترتيب أولويات قائمة المنتج (Product Backlog).\n- عند مواجهة مالك منتج جديد صعوبة في هذا الدور، يجب على مدير المشروع دعمه وإرشاده، وليس أن يقوم بالدور مكانه.\n\nلماذا الخيارات الأخرى خاطئة:\n- ترتيب الأولويات نيابة عن مالك المنتج: يخالف مبادئ أجايل ويضعف دور مالك المنتج.\n- طلب تدريب: قد يكون مفيدًا لكنه ليس الحل الأول أو المباشر.\n- طلب من الفريق ترتيب الأولويات: هذه مسؤولية مالك المنتج وليس الفريق.",
      "choices": [
        {
          "text": "ترتيب أولويات قائمة المنتج المتراكم نيابة عن مالك المنتج.",
          "correct": false
        },
        {
          "text": "توجيه مالك المنتج حول كيفية ترتيب أولويات مواصفات المنتج.",
          "correct": true
        },
        {
          "text": "الطلب من مالك المنتج تلقي تدريب على الأساليب الرشيقة.",
          "correct": false
        },
        {
          "text": "الطلب من فريق المشروع ترتيب أولويات قائمة المنتج المتراكم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع لإنشاء وظيفة عمل جديدة في الشركة. بعد عدة أشهر من الانتهاء، لا يزال مدير المشروع يتولى العمليات التجارية للمشروع أثناء عمله على مشروع آخر.\n\nما الذي كان يجب على مدير المشروع فعله في بداية المشروع لتجنب ذلك؟",
      "explanation": "الإجابة الصحيحة: إدراج خطة الانتقال كمخرج في عملية إغلاق المشروع.\n\nشرح الإجابة الصحيحة:\n- خطة الانتقال (Transition Plan) تضمن نقل مسؤوليات المشروع إلى العمليات الدائمة بعد انتهاء المشروع.\n- هذا يمنع استمرار اعتماد المنظمة على مدير المشروع لمهام تشغيلية.\n\nلماذا الخيارات الأخرى خاطئة:\n- تعديل الهيكل التنظيمي: ليس بالضرورة جزء من المشروع.\n- توضيح مخطط RACI: مفيد لكنه لا يغطي عملية الانتقال بالكامل.\n- تضمين عملية التوظيف: غير مرتبط مباشرة بإنهاء دور مدير المشروع في العمليات.",
      "choices": [
        {
          "text": "ضمان أن يكون تعديل الهيكل التنظيمي أحد مخرجات المشروع.",
          "correct": false
        },
        {
          "text": "إدراج خطة الانتقال كمخرج في عملية إغلاق المشروع.",
          "correct": true
        },
        {
          "text": "توضيح مخطط RACI مع راعي المشروع في بداية المشروع.",
          "correct": false
        },
        {
          "text": "ضمان تضمين عملية التوظيف في خطة إدارة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بداية مشروع، يشعر أحد أصحاب المصلحة بالقلق من أن المبادرة قد لا تقدم قيمة للمنظمة.\n\nما الذي يجب على مدير المشروع فعله أولًا لزيادة فرص نجاح المشروع؟",
      "explanation": "الإجابة الصحيحة: مراجعة دراسة الجدوى وخطة إدارة الفوائد مع صاحب المصلحة.\n\nشرح الإجابة الصحيحة:\n- من المهم التأكد من أن أصحاب المصلحة على دراية بكيفية تحقيق المشروع للقيمة.\n- خطة إدارة الفوائد تحدد كيف سيتم تحقيق وقياس هذه الفوائد.\n\nلماذا الخيارات الأخرى خاطئة:\n- توفير تواصل مستمر: مهم لكنه ليس أول إجراء في هذه الحالة.\n- جدولة تدريب: ليس مرتبطًا مباشرة بمخاوف القيمة.\n- إجراء تدقيق: يتم لاحقًا وليس في البداية.",
      "choices": [
        {
          "text": "مراجعة دراسة الجدوى وخطة إدارة الفوائد مع صاحب المصلحة.",
          "correct": true
        },
        {
          "text": "توفير تواصل مستمر لحالة المشروع لأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "جدولة تدريب للجميع حول استخدام المنتج الجديد.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق للتأكد من تحقيق الفوائد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستفيد مشروع مبتكر من الذكاء الاصطناعي (AI) لتحديد المركبات الكيميائية لتطوير منتجات جديدة. يمكن أن تختلف مدة مرحلة المعالجة بالذكاء الاصطناعي من ثلاثة أيام إلى أسبوعين، وتكون النتائج غير متوقعة. الهدف الأساسي للمشروع هو تقديم مواصفات منتج واحدة على الأقل خلال فترة زمنية ثابتة مدتها شهران مع الالتزام بميزانية صارمة لا يمكن زيادتها.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لتحسين استخدام الميزانية الثابتة وتقديم أعلى قيمة تجارية ممكنة؟",
      "explanation": "الإجابة الصحيحة: تخطيط تكرار مباشرة بعد معالجة الذكاء الاصطناعي لتحليل أهداف التطوير وتحديد أولوياتها.\n\nشرح الإجابة الصحيحة:\n- في المشاريع الابتكارية مثل هذا المشروع، لا يمكن التحكم في مدة معالجة الذكاء الاصطناعي بدقة.\n- لذلك، من الأفضل تقسيم العمل إلى تكرارات (Iterations) بحيث يتم تحليل النتائج بعد كل معالجة واختيار الأفضل للاستمرار.\n- هذا يسمح بتحقيق أفضل قيمة بأقل تكلفة، وفقًا للميزانية المحددة.\n\nسبب خطأ باقي الاختيارات:\n- تقييد التكرارات أو معالجة الذكاء الاصطناعي بنسب معينة قد يضر بجودة المنتج أو لا يسمح بالمرونة.\n- العمل بطريقة تنبؤية لا يناسب طبيعة النتائج غير المتوقعة في هذا النوع من المشاريع.",
      "choices": [
        {
          "text": "ضمان أن تقتصر تكرارات المواصفات على 50٪ من إجمالي مدة المشروع.",
          "correct": false
        },
        {
          "text": "ضمان أن تقتصر معالجة الذكاء الاصطناعي على 25٪ من إجمالي ميزانية المشروع.",
          "correct": false
        },
        {
          "text": "تخطيط تكرار مباشرة بعد معالجة الذكاء الاصطناعي لتحليل أهداف التطوير وتحديد أولوياتها.",
          "correct": true
        },
        {
          "text": "تخطيط أعمال المواصفات كمهمة تنبؤية ذات مدة ثابتة لضمان القيمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق مشروع موزع جغرافيًا مشكلات في التطوير بين الفرق المتجاورة والفرق الافتراضية، مما أدى إلى انخفاض الإنتاجية.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه المشكلات؟",
      "explanation": "الإجابة الصحيحة: تطوير بروتوكولات لحل النزاعات بين أعضاء الفريق.\n\nشرح الإجابة الصحيحة:\n- الفرق الموزعة تحتاج إلى قواعد واضحة للتواصل وحل الخلافات.\n- البروتوكولات تضع أسس التعامل في حالات النزاع لضمان استمرارية العمل.\n\nسبب خطأ باقي الاختيارات:\n- إجبار الفرق على التواجد في مكان واحد يخالف المرونة المطلوبة.\n- طلب استشاري قد لا يحل المشكلة الداخلية المتعلقة بالتواصل.\n- الاجتماعات وجهاً لوجه غير عملية دائمًا مع فرق موزعة.",
      "choices": [
        {
          "text": "إجبار أعضاء الفريق على العمل من موقع واحد.",
          "correct": false
        },
        {
          "text": "الحصول على خبرة خاصة لتقديم المشورة لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تطوير بروتوكولات لحل النزاعات بين أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "تنظيم اجتماعات وجهًا لوجه مع أعضاء فريق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع المراجعة الرجعية، اشتكى أعضاء فريق المشروع من أن القضايا المفتوحة التي لم يتم حلها أثناء التكرار تؤثر على سرعتهم. ماذا يجب أن يفعل مدير المشروع لتحسين الإنتاجية؟",
      "explanation": "الإجابة الصحيحة: ضمان حضور أعضاء الفريق لاجتماعات الوقوف اليومية لمناقشة العوائق.\n\nشرح الإجابة الصحيحة:\n- الاجتماعات اليومية في أجايل تهدف خصيصًا لمشاركة العوائق والعمل على حلها أولًا بأول.\n- هذا يمنع تراكم المشاكل حتى نهاية التكرار.\n\nسبب خطأ باقي الاختيارات:\n- توثيق القضايا والانتظار يؤخر الحلول.\n- تمديد الاجتماعات يفقدها فعاليتها.\n- التصعيد المباشر للراعي يُستخدم فقط عند الضرورة القصوى، وليس كحل أولي.",
      "choices": [
        {
          "text": "ضمان حضور أعضاء الفريق لاجتماعات الوقوف اليومية لمناقشة العوائق.",
          "correct": true
        },
        {
          "text": "توثيق القضايا في سجل القضايا والانتظار لحلها لاحقًا.",
          "correct": false
        },
        {
          "text": "تمديد اجتماعات الوقوف اليومية لمناقشة القضايا بمزيد من التفصيل.",
          "correct": false
        },
        {
          "text": "تصعيد القضايا إلى راعي المشروع لحلها فورًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع لديه فريق تم تشكيله حديثًا ويضم أعضاء مبتدئين لم يسبق لهم العمل في مشاريع رشيقة من قبل. يرغب مالك المنتج في التأكد من أن الفريق يعمل كما هو متوقع خلال التكرار.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تخصيص وقت لتوجيه أعضاء الفريق حول العمليات الرشيقة.\n\nشرح الإجابة الصحيحة:\n- بما أن الفريق جديد وغير معتاد على منهجية أجايل، فإن أول خطوة ضرورية هي تزويدهم بتوجيه واضح وشامل حول كيفية تنفيذ العمل وفق هذه المنهجية.\n- هذا يشمل تعريفهم بدورة حياة التكرار (Sprint)، والاجتماعات الأساسية مثل اجتماع التخطيط، والاجتماع اليومي، والاجتماع الرجعي.\n- توجيه الفريق يساعد في تقليل الأخطاء وسوء الفهم، ويرفع من قدرتهم على العمل بانسجام وفعالية.\n- بدون هذا التوجيه، قد يجد الفريق صعوبة في ترتيب الأولويات وتنفيذ المهام وفقًا للمعايير المتبعة.\n\nسبب خطأ باقي الاختيارات:\n- التأكيد على أهمية ترتيب الأولويات: الفريق لن يتمكن من ترتيب الأولويات بشكل صحيح ما لم يفهم أولاً كيفية إدارة العمل ضمن إطار أجايل.\n- تحسين الإنتاجية باستخدام تقنيات سكرم: تحسين الإنتاجية مرحلة متقدمة تتطلب أولًا فهم الأساسيات.\n- التواصل بفعالية: التواصل مهم لكن لن يحل مشكلة الجهل بالعمليات والأساليب الرشيقة.",
      "choices": [
        {
          "text": "تخصيص وقت لتوجيه أعضاء الفريق حول العمليات الرشيقة.",
          "correct": true
        },
        {
          "text": "التأكيد على أهمية ترتيب أولويات الأعمال المتراكمة للتكرار.",
          "correct": false
        },
        {
          "text": "تحسين الإنتاجية باستخدام تقنيات سكرم.",
          "correct": false
        },
        {
          "text": "التواصل بفعالية بشأن معلومات المشروع والتحديثات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقترب المشروع من الاكتمال ويريد أحد أصحاب المصلحة معرفة كيف ستؤثر نتائج المشروع على المنظمة. ما الذي يجب أن يراجعه مدير المشروع مع صاحب المصلحة؟",
      "explanation": "الإجابة الصحيحة: خطة إدارة الفوائد.\n\nشرح الإجابة الصحيحة:\n- خطة إدارة الفوائد تُعد الوثيقة الأساسية التي تحدد كيف ستُحقق الفوائد الناتجة عن المشروع بعد انتهائه.\n- تحتوي على تفاصيل مثل: ما هي الفوائد المتوقعة، متى وكيف سيتم قياسها، ومن المسؤول عن تحقيقها.\n- مراجعة هذه الخطة مع أصحاب المصلحة تساعد على توضيح القيمة المضافة للمشروع وربط النتائج بأهداف العمل الاستراتيجية.\n\nسبب خطأ باقي الاختيارات:\n- دراسة الجدوى: يتم استخدامها لتقييم جدوى المشروع قبل إطلاقه وليس بعد اقتراب اكتماله.\n- ميثاق المشروع: يركز على تحديد نطاق المشروع وأهدافه بشكل عام، لكنه لا يحتوي على تفاصيل إدارة الفوائد.\n- سجل الافتراضات: يوثق الفرضيات التي بُني المشروع عليها، لكنه ليس المرجع الرئيسي للفوائد المتوقعة.",
      "choices": [
        {
          "text": "دراسة الجدوى",
          "correct": false
        },
        {
          "text": "خطة إدارة الفوائد",
          "correct": true
        },
        {
          "text": "ميثاق المشروع",
          "correct": false
        },
        {
          "text": "سجل الافتراضات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، حدد فريق التدقيق أن المتطلبات التنظيمية الحرجة لا يتم تلبيتها. ما الذي كان يجب أن يفعله مدير المشروع أولًا لتجنب هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: تقييم البيئات التنظيمية الداخلية والخارجية.\n\nشرح الإجابة الصحيحة:\n- البيئات التنظيمية تشمل القوانين واللوائح والسياسات الداخلية التي تؤثر على المشروع.\n- في بداية المشروع، على مدير المشروع تحليل هذه البيئات لتحديد جميع المتطلبات التنظيمية والقانونية التي يجب الالتزام بها.\n- هذا التحليل يندرج ضمن عملية تحديد المتطلبات ومهم جدًا في المشاريع ذات البعد التنظيمي أو القانوني.\n- تجاهل هذه الخطوة يؤدي غالبًا إلى مشاكل أثناء التدقيق أو عند تسليم المشروع.\n\nسبب خطأ باقي الاختيارات:\n- تحديث سجل القضايا: يتم بعد ظهور المشكلة، وليس استباقيًا.\n- جعل فريق التدقيق يراجع خطة إدارة المشروع: خطوة متأخرة ولا تعوض أهمية تحديد المتطلبات منذ البداية.\n- ضم عضو من فريق التدقيق: ليس حلاً كافيًا إذا لم يتم تحليل البيئة التنظيمية مسبقًا.",
      "choices": [
        {
          "text": "تحديث سجل القضايا بمتطلبات التنظيم.",
          "correct": false
        },
        {
          "text": "تقييم البيئات التنظيمية الداخلية والخارجية.",
          "correct": true
        },
        {
          "text": "جعل فريق التدقيق يراجع خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "ضم عضو من فريق التدقيق إلى المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير مشروع جديد مشروعًا بعد مغادرة المدير السابق للشركة. يعرف المدير الجديد أن المدير السابق كان يستخدم أسلوبًا سلطويًا للغاية ويتخذ جميع القرارات المتعلقة بالمشروع. لاحظ المدير الجديد أن معنويات مشرف كبير منخفضة.\n\nما الذي يجب أن يفعله مدير المشروع الجديد؟",
      "explanation": "الإجابة الصحيحة: تحديد سبب انخفاض المعنويات.\n\nشرح الإجابة الصحيحة:\n- يجب على مدير المشروع الجديد فهم الأسباب الحقيقية وراء انخفاض معنويات المشرف قبل اتخاذ أي إجراء.\n- قد تكون الأسباب متعلقة بأسلوب الإدارة السابق أو مشاكل في بيئة العمل أو توزيع المهام.\n- هذا الفهم يمكن المدير من اتخاذ قرار مدروس يساعد في تحسين معنويات الفريق ورفع الأداء.\n\nسبب خطأ باقي الاختيارات:\n- زيادة مستوى سلطة المشرف: قد تكون مفيدة لاحقًا، لكن بدون فهم السبب قد لا تحل المشكلة.\n- تعديل دور المشرف: تغيير الدور قد لا يعالج السبب الحقيقي لانخفاض المعنويات.\n- التحدث إلى المشرف وتحديث سجل القضايا: خطوة مهمة لكن بدون معرفة السبب لن تكون فعالة كافية.",
      "choices": [
        {
          "text": "زيادة مستوى سلطة المشرف.",
          "correct": false
        },
        {
          "text": "تحديد سبب انخفاض المعنويات.",
          "correct": true
        },
        {
          "text": "تعديل دور المشرف في المشروع.",
          "correct": false
        },
        {
          "text": "التحدث إلى المشرف وتحديث سجل القضايا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نشأ خلاف بين عضوين في الفريق حول كيفية المضي قدمًا قبل إصدار المنتج. يحتاج الفريق إلى العمل معًا لإكمال إصدار المنتج.\n\nما الذي يجب على مدير المشروع فعله أولًا لتهدئة الموقف؟",
      "explanation": "الإجابة الصحيحة: مراقبة تفاعلات أعضاء الفريق والتحدث معهم بشأن شكاواهم قبل تطبيق تقنية لحل النزاعات.\n\nشرح الإجابة الصحيحة:\n- يجب فهم طبيعة الخلاف وأسبابه قبل اتخاذ إجراءات أو تطبيق تقنيات لحل النزاع.\n- هذا يسمح لمدير المشروع بالتدخل بشكل مناسب وبناء.\n- التحدث المباشر يعزز التواصل ويساعد على إيجاد حل ودي.\n\nسبب خطأ باقي الاختيارات:\n- توظيف مدرب رشيق: قد يكون مفيدًا لاحقًا، لكنه ليس الخطوة الأولى.\n- تنظيم اجتماعات مع العضوين وإدارة الموارد البشرية: قد يزيد التوتر إذا لم تفهم المشكلة بوضوح.\n- شرح أنهم يهدرون الوقت: طريقة غير بناءة قد تزيد الصراع.",
      "choices": [
        {
          "text": "توظيف مدرب رشيق لتعليم أعضاء الفريق كيفية إدارة الخلاف دون الإضرار بالمشروع.",
          "correct": false
        },
        {
          "text": "مراقبة تفاعلات أعضاء الفريق والتحدث معهم بشأن شكاواهم قبل تطبيق تقنية لحل النزاعات.",
          "correct": true
        },
        {
          "text": "تنظيم اجتماعات مع كلا العضوين وإدارة الموارد البشرية لتذكيرهم بأهمية التسليم القادم للمنتج.",
          "correct": false
        },
        {
          "text": "شرح لأعضاء الفريق أنهم يهدرون الوقت في الخلاف بدلاً من تسليم وظائف المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتسليم برنامج جديد لطلاب الجامعة. في هذا المشروع، يتم تسليم البرنامج إلى شريحة محددة من الأشخاص. لفهم هذه الشريحة بشكل أفضل، يحتاج مدير المشروع إلى تطوير نموذج مستخدم نموذجي.\n\nكيف يجب أن يفعل مدير المشروع ذلك؟",
      "explanation": "الإجابة الصحيحة: إنشاء شخصية وهمية (شخصية المستخدم).\n\nشرح الإجابة الصحيحة:\n- شخصية المستخدم تمثل نموذجًا تخيليًا للمستخدم المثالي أو الفئة المستهدفة.\n- تساعد هذه الشخصية في فهم احتياجات وسلوكيات المستخدمين.\n- بناء هذه الشخصية يمكّن الفريق من تصميم منتج يلبي متطلبات المستخدمين بشكل أفضل.\n\nسبب خطأ باقي الاختيارات:\n- التعاقد مع شركة معمارية: غير مرتبط بتطوير نموذج المستخدم.\n- إرسال استبيان عام: قد يجمع بيانات عامة لكنه لا يوفر نموذجًا محددًا وواضحًا.\n- نشر خطة تسويق: لا يساعد في فهم المستخدم أو تطوير النموذج.",
      "choices": [
        {
          "text": "إنشاء شخصية وهمية (شخصية المستخدم).",
          "correct": true
        },
        {
          "text": "التعاقد مع شركة معمارية.",
          "correct": false
        },
        {
          "text": "إرسال استبيان عام للجمهور.",
          "correct": false
        },
        {
          "text": "نشر خطة تسويق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب مالك المنتج من مدير المشروع والفريق الرشيق عرض الوظائف المكتملة لأصحاب المصلحة الرئيسيين في المشروع. المشروع لا يزال في مراحله الأولى وقد أكمل ثلاث تكرارات فقط من الوظائف. هذه هي المرة الأولى التي يتعرض فيها أصحاب المصلحة لمشروع رشيق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: ضبط التوقعات مع أصحاب المصلحة بشأن ماهية الرشاقة والمنهج المتبع، وأنهم سيشاهدون كمية صغيرة فقط من الوظائف.\n\nشرح الإجابة الصحيحة:\n- من المهم تعليم أصحاب المصلحة الجدد عن طبيعة المشاريع الرشيقة وكيف تختلف عن المشاريع التقليدية.\n- ضبط التوقعات يمنع الإحباط ويعزز التواصل الفعال مع أصحاب المصلحة.\n- توضيح أن المشروع لا يزال في بداياته وأن كمية العمل المنجز ستكون محدودة.\n\nسبب خطأ باقي الاختيارات:\n- تعزيز دور مالك المنتج: بينما مهم، لكنه لا يعالج توقعات أصحاب المصلحة بشكل مباشر.\n- عرض الوظائف المكتملة مع متطلبات المستخدم والنماذج: قد يربك أصحاب المصلحة الجدد بسبب كمية التفاصيل.\n- حماية الفريق من المشتتات: منع أصحاب المصلحة من التفاعل المباشر قد يقلل من الشفافية والتواصل.",
      "choices": [
        {
          "text": "تعزيز دور مالك المنتج في التواصل وإدارة أصحاب المصلحة بشكل مباشر.",
          "correct": false
        },
        {
          "text": "ضبط التوقعات مع أصحاب المصلحة بشأن ماهية الرشاقة والمنهج المتبع، وأنهم سيشاهدون كمية صغيرة فقط من الوظائف.",
          "correct": true
        },
        {
          "text": "عرض الوظائف المكتملة على أصحاب المصلحة، جنبًا إلى جنب مع متطلبات المستخدم والنماذج الأولية للحل المتاحة.",
          "correct": false
        },
        {
          "text": "حماية الفريق من المشتتات من خلال توفير رابط إلى بيئة اختبار القبول حتى يتمكن أصحاب المصلحة من رؤية الوظائف مباشرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع فرقًا متعددة التخصصات. خلال اجتماع مراجعة المشروع الأخير، أدرك مدير المشروع أن هناك احتكاكًا بين بعض أعضاء الفريق.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تقييم المشكلة وتطبيق تقنيات حل النزاعات.\n\nشرح الإجابة الصحيحة:\n- يجب التعرف على طبيعة النزاع وأسبابه لتحليل المشكلة بشكل صحيح.\n- تطبيق تقنيات حل النزاعات يساهم في استعادة التعاون بين أعضاء الفريق.\n- هذا يعزز الأداء الجماعي ونجاح المشروع.\n\nسبب خطأ باقي الاختيارات:\n- تحديد أعضاء الفريق ومراجعة أدائهم: لا يعالج النزاع مباشرة.\n- التشاور مع الراعي للعثور على بدائل: حل متطرف قد يؤثر سلبًا على الفريق.\n- الإبلاغ في الملخص التنفيذي: لا يحل المشكلة بشكل فوري.",
      "choices": [
        {
          "text": "تحديد أعضاء الفريق ومراجعة أدائهم في المشروع.",
          "correct": false
        },
        {
          "text": "التشاور مع الراعي للعثور على بدائل لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تقييم المشكلة وتطبيق تقنيات حل النزاعات.",
          "correct": true
        },
        {
          "text": "الإبلاغ عن المشكلة في الملخص التنفيذي الشهري للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم شركة ما الأساليب التنبؤية منذ فترة طويلة جدًا وتحاول تنفيذ بعض المبادرات التكرارية ضمن إطار عمل المشروع. تم تعيين مدير مشروع لقيادة أول مشروع في هذا البيئة الهجينة.\n\nكيف يجب على مدير المشروع بناء الوعي بالنهج الهجين داخل المؤسسة؟",
      "explanation": "الإجابة الصحيحة: التوصية بتدريب كبار المدراء على المنهجية التكرارية.\n\nشرح الإجابة الصحيحة:\n- تدريب كبار المدراء يساعدهم على فهم الفوائد والتحديات في النهج الهجين.\n- الوعي والدعم من الإدارة العليا ضروريان لنجاح التحول إلى بيئة هجينة.\n- يضمن هذا التوافق بين استراتيجيات المؤسسة وطرق العمل الجديدة.\n\nسبب خطأ باقي الاختيارات:\n- الاجتماع مع فريق المشروع لتحديد الأدوار: مهم لكنه لا ينشر الوعي المؤسسي.\n- بناء جدول بجلسات تكرارية: تنفيذ عملي لكنه لا ينشر الوعي الإداري.\n- دعوة أصحاب المصلحة للاجتماعات اليومية: قد يكون غير فعال لإدارة التغيير على مستوى المؤسسة.",
      "choices": [
        {
          "text": "الاجتماع مع فريق المشروع من أجل تحديد الأدوار والمسؤوليات.",
          "correct": false
        },
        {
          "text": "بناء جدول المشروع بجلسات تكرارية وإبلاغ أصحاب المصلحة بذلك.",
          "correct": false
        },
        {
          "text": "دعوة أصحاب المصلحة الرئيسيين لحضور الاجتماعات اليومية واجتماعات مراجعة المشروع.",
          "correct": false
        },
        {
          "text": "التوصية بتدريب كبار المدراء على المنهجية التكرارية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينضم مدير مشروع جديد إلى فريق قائم. يتم إبلاغ مدير المشروع أن هناك شخصيات قوية في الفريق، مما أدى إلى تدخل الإدارة لحل مشاكل أداء الفريق.\n\nما الذي يجب أن يفعله مدير المشروع الجديد عند انضمامه إلى هذا الفريق؟",
      "explanation": "الإجابة الصحيحة: مراجعة سجلات سرعة الفريق ومراقبة الفريق والتفاعلات بين الأعضاء.\n\nشرح الإجابة الصحيحة:\n- فهم ديناميكية الفريق يتطلب مراجعة الأداء وسلوك الأعضاء بدقة.\n- مراجعة سجلات سرعة الفريق تعطي مؤشرات على الأداء والتقدم.\n- مراقبة التفاعلات تساعد على تحديد مصادر النزاع أو التعاون.\n\nسبب خطأ باقي الاختيارات:\n- تنفيذ خطة الإدارة العليا: بدون فهم كامل للوضع، قد تكون الخطة غير ملائمة.\n- اتباع نصيحة أكثر الأعضاء صوتًا: هذا قد يعزز هيمنة بعض الأعضاء ولا يحل المشكلة الأساسية.\n- مراقبة الفريق لتحديد من يجب إزالته: حل متسرع وغير بناء قد يضر الفريق أكثر.",
      "choices": [
        {
          "text": "تنفيذ الخطة التي وضعتها الإدارة العليا لحل النزاعات داخل الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة سجلات سرعة الفريق ومراقبة الفريق والتفاعلات بين الأعضاء.",
          "correct": true
        },
        {
          "text": "اتباع نصيحة أكثر أعضاء الفريق صوتًا بشأن كيفية تحسين ديناميكية الفريق.",
          "correct": false
        },
        {
          "text": "مراقبة الفريق وتحديد من يجب إزالته من الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخطط مدير المشروع للإصدار التالي لفريق تطوير البرمجيات. أكمل الفريق إصدارين حتى الآن، وتم تأكيد سجل المنتج للإصدار القادم.\n\nأي من الأدوات التالية يجب أن يستخدمها مدير المشروع لتخطيط مدة الإصدار القادم؟",
      "explanation": "الإجابة الصحيحة: هيكل تقسيم العمل (WBS).\n\nشرح الإجابة الصحيحة:\n- WBS يساعد في تقسيم العمل إلى مهام أصغر يمكن قياسها وتقديرها بدقة.\n- من خلال تفصيل المهام، يمكن لمدير المشروع تخطيط المدة الزمنية للإصدار بشكل أكثر فعالية.\n- يوفر WBS أساسًا واضحًا لتتبع التقدم والتكاليف.\n\nسبب خطأ باقي الاختيارات:\n- خريطة طريق المنتج: أداة استراتيجية لتوجيه المنتج وليس لتخطيط المدة.\n- تقويم الموارد: مفيد لتخصيص الموارد وليس لتخطيط مدة العمل.\n- مخطط التقدم (Burndown Chart): يستخدم لمتابعة التقدم وليس لتخطيط مدة الإصدار.",
      "choices": [
        {
          "text": "خريطة طريق المنتج",
          "correct": false
        },
        {
          "text": "تقويم الموارد",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS)",
          "correct": true
        },
        {
          "text": "مخطط التقدم (Burndown Chart)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "وصل فريق المشروع مؤخرًا إلى أحد المعالم الرئيسية بنجاح. لاحظ مدير المشروع أن أداء الفريق كان  ممتازًا.\n\nأي نهج يجب أن يستخدمه مدير المشروع للتواصل مع الفريق حول أدائهم؟",
      "explanation": "الإجابة الصحيحة: تقديم تغذية راجعة للفريق حول أدائهم الجيد في اجتماع المشروع القادم.\n\nشرح الإجابة الصحيحة:\n- التغذية الراجعة الإيجابية تعزز الدافع وتحافظ على معنويات الفريق.\n- مشاركة النجاحات أثناء المشروع تساعد على تعزيز ثقافة الفريق.\n- استخدام الاجتماعات الرسمية يضمن وصول الرسالة لجميع الأعضاء بشكل موحد.\n\nسبب خطأ باقي الاختيارات:\n- تجنب قول أي شيء: قد يقلل الحافز ويشعر الفريق بعدم التقدير.\n- الانتظار حتى نهاية المشروع: يفقد أثر التعزيز الفوري ويقلل فرص التحسين المستمر.\n- تجاهل الإنجازات وطلب التركيز فقط على القادم: يقلل من تقدير الفريق ويؤثر على الروح المعنوية.",
      "choices": [
        {
          "text": "تجنب قول أي شيء عن أدائهم لأن من المتوقع أن يحقق الفريق المعالم بنجاح.",
          "correct": false
        },
        {
          "text": "الانتظار حتى نهاية المشروع وإبلاغ الفريق بما تم تنفيذه جيدًا وما لم يتم بشكل جيد في كل مرحلة.",
          "correct": false
        },
        {
          "text": "تقديم تغذية راجعة للفريق حول أدائهم الجيد في اجتماع المشروع القادم.",
          "correct": true
        },
        {
          "text": "تجاهل ما تم إنجازه بالفعل في المشروع وطلب من الفريق التركيز على ما تبقى.",
          "correct": false
        }
      ]
    }
  ]
}
