{
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "يعمل اثنان من مديري المشاريع على تخصيص الموارد لمشاريعهما الخاصة. حدد كلا المديرين نفس خبير الموضوع (SME) كعنصر مفيد لمشروعهما.\n\nيستخدم المشروع A نهجًا تنبؤيًا، بينما يستخدم المشروع B نهجًا رشيقًا (Agile).\n\nلأي مشروع يجب تخصيص هذا الخبير؟",
      "explanation": "الحل الصحيح هو تخصيص الخبير للمشروع B لأن النهج الرشيق يعتمد على فرق ذاتية التنظيم تحتاج إلى دعم فني مباشر ومستمر لتحقيق أقصى قيمة عبر التكرارات القصيرة والتسليم التدريجي. وجود SME مع الفريق يعزز الجودة والمرونة. \n\nالخيارات الأخرى غير صحيحة لأن المشروع A (النهج التنبؤي) يعتمد على خطة مفصلة مسبقًا ولا يحتاج لنفس مستوى التفاعل اللحظي مع SME. أما تخصيص الخبير حسب خبرة مدير المشروع فهو ليس معيارًا معتمدًا لإدارة الموارد. وأيضًا إعطاء الأولوية للتخطيط المسبق في المشروع A يتعارض مع طبيعة Agile التي تعتمد على القيمة والمرونة.",
      "choices": [
        {
          "text": "يجب تخصيص الخبير للمشروع A لأن تخطيط المشروع استند إلى دعم هذا الخبير.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع B لأن النجاح في المشاريع الرشيقة يُحدد بالتميز الفني.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع الذي يديره مدير مشروع أقل خبرة لتحسين فرص النجاح.",
          "correct": false
        },
        {
          "text": "يجب تخصيص الخبير للمشروع B لأن النهج الرشيق يعطي الأولوية للمرونة والتكيف.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت دعوة أحد أصحاب المصلحة الكبار إلى اجتماع مراجعة Sprint وطلب من أحد أعضاء الفريق وصف المنتج النهائي الذي سيقوم المشروع بتسليمه.\n\nلم يتمكن عضو الفريق من الرد وأحال السؤال إلى عضو آخر أكثر خبرة في الفريق.\n\nما الذي كان يجب فعله بشكل مختلف في هذه الحالة؟",
      "explanation": "الحل الصحيح هو أن يوجه عضو الفريق صاحب المصلحة إلى سؤال مالك المنتج لأن مالك المنتج هو المسؤول عن توضيح تفاصيل المنتج النهائي وأهدافه حسب Scrum Guide وPMBOK. مالك المنتج يمتلك الرؤية والخطة ويملك سلطة القرار حول متطلبات المنتج.\n\nالخيارات الأخرى غير صحيحة: توجيه السؤال إلى Scrum Master غير مناسب لأنه ليس مسؤولًا عن تفاصيل المنتج بل عن العمليات. تأجيل السؤال ليس عمليًا لأن مراجعة Sprint تهدف للتواصل الفوري والشفاف. أما مدير المشروع فلا يعتبر جزءًا من أدوار Scrum الرسمية ولا يملك مسؤولية تحديد تفاصيل المنتج.",
      "choices": [
        {
          "text": "كان ينبغي على عضو الفريق أن يوجه صاحب المصلحة إلى سؤال Scrum Master.",
          "correct": false
        },
        {
          "text": "كان ينبغي على عضو الفريق أن يوجه صاحب المصلحة إلى سؤال مالك المنتج.",
          "correct": true
        },
        {
          "text": "كان ينبغي على صاحب المصلحة تأجيل سؤاله إلى اجتماع المراجعة التالي.",
          "correct": false
        },
        {
          "text": "كان ينبغي على صاحب المصلحة توجيه السؤال إلى مدير المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع لتطوير البرمجيات، يرغب أحد أصحاب المصلحة في إضافة متطلب رئيسي يشعر بأنه سيضيف فائدة كبيرة للمشروع.\n\nلكن هذا المتطلب لا يتماشى مع أهداف المشروع التي وثقها مالك العمل.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "الحل الصحيح هو ضمان أن يفهم صاحب المصلحة هدف المشروع لأن هذا يتماشى مع عملية إدارة أصحاب المصلحة حسب PMBOK. الهدف هو توعية أصحاب المصلحة حتى لا يتم اقتراح متطلبات خارج نطاق المشروع. أي تغيير يجب أن يتم فقط من خلال عمليات إدارة التغيير.\n\nالخيارات الأخرى غير صحيحة: تشجيع صاحب المصلحة لا يكفي بدون توضيح رسمي للأهداف. إدخال المتطلب دون مراجعة يناقض إدارة النطاق. تسريع المشروع مع اقتراح متطلبات جديدة غير منطقي ويهدد نجاح المشروع.",
      "choices": [
        {
          "text": "ضمان أن يفهم صاحب المصلحة هدف المشروع.",
          "correct": true
        },
        {
          "text": "تشجيع صاحب المصلحة على اتباع المتطلبات المكتوبة للأعمال.",
          "correct": false
        },
        {
          "text": "إدراج المتطلب الإضافي ضمن المشروع وإبلاغ مالك العمل بذلك.",
          "correct": false
        },
        {
          "text": "تسريع المشروع واقتراح المتطلب الجديد على مالك العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مشروع هجين، قام مدير المشروع بمراجعة أداء الفريق ولاحظ أن وتيرة الفريق ليست سريعة بما يكفي للوصول إلى هدف نقطة التقييم التالية.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "الإجابة الصحيحة هي: استخدام الاجتماعات اليومية لتقييم العوائق والمشكلات.\n\nالاجتماعات اليومية تساعد على تحديد العقبات التي تؤثر على أداء الفريق بشكل مستمر، وتسمح بمعالجة المشكلات قبل أن تتفاقم. هذا الإجراء يُعتبر الأنسب لتحسين الأداء دون الحاجة لتغيير نطاق المشروع أو مدته.\n\nالخيارات الأخرى غير صحيحة: إزالة عناصر من سجل المنتج يؤثر على النطاق ويجب أن يتم عبر إجراءات رسمية. زيادة مدة Sprint غير مقبولة لأن مدة Sprint ثابتة. تقديم طلب تغيير لتعديل الأهداف يُستخدم فقط عند تعذر تحقيقها بعد محاولة المعالجة الداخلية.",
      "choices": [
        {
          "text": "إعطاء الأولوية لمحتوى سجل المنتج وإزالة بعض القصص.",
          "correct": false
        },
        {
          "text": "زيادة مدة Sprint لإتاحة وقت أطول للفريق.",
          "correct": false
        },
        {
          "text": "استخدام الاجتماعات اليومية لتقييم العوائق والمشكلات.",
          "correct": true
        },
        {
          "text": "إنشاء طلب تغيير لتعديل أهداف نقطة التقييم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقوم مدير المشروع بتطوير خطة إدارة المشروع. تم تحديد مدة المشروع بثلاثة أشهر بسبب متطلبات تنظيمية واعتمادًا على كبار الموظفين.\n\nما الهدفان من أهداف المشروع اللذان يجب تحديدهما بشكل جيد بما يكفي لإدراجهما في خطة إدارة المشروع؟ (اختر اثنين)",
      "explanation": "الإجابات الصحيحة هي: تطوير خرائط عمليات مفصلة وتحديد الاحتياجات التدريبية وإنشاء خطة تطوير.\n\nيجب أن تتضمن خطة إدارة المشروع الأهداف التي ترتبط مباشرة بنطاق المشروع والتسليمات المطلوبة ضمن المدة الزمنية المحددة. الأهداف المتعلقة بخرائط العمليات والخطط التدريبية مرتبطة بتحقيق نتائج واضحة وقابلة للقياس.\n\nالخيارات الأخرى غير صحيحة لأنها لا ترتبط مباشرة بتسليمات المشروع أو تعتبر أهدافًا بعيدة المدى ولا تؤثر على نجاح المشروع في إطاره المحدد.",
      "choices": [
        {
          "text": "تحسين العمليات وتقليل إعادة العمل من خلال الحفاظ على معدل منخفض لتناوب كبار الموظفين.",
          "correct": false
        },
        {
          "text": "تطوير خرائط عمليات مفصلة لمواءمة الأنشطة التشغيلية مع نظام البرمجيات الجديد.",
          "correct": true
        },
        {
          "text": "تعزيز عملية التطوير من خلال تصميم نماذج جديدة لوثائق التصميم.",
          "correct": false
        },
        {
          "text": "تقليل البصمة البيئية للشركة باستخدام إرشادات مفصلة لإعادة التدوير لجميع الموظفين.",
          "correct": false
        },
        {
          "text": "تحديد الاحتياجات التدريبية وإنشاء خطة تطوير لإكمال التسليم خلال ثلاثة أشهر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في الاجتماع الأول لمشروع بناء طريق، يُذَكِّر مدير المشروع الفريق بأهمية الالتزام بجميع القواعد عند أداء مهامهم والتفاعل مع أصحاب المصلحة.\n\nلاحقًا في المشروع، يبدأ أعضاء الفريق في الحضور متأخرين للاجتماعات ولا يلتزمون بالقواعد المتفق عليها.\n\nلضمان عدم تأثر نتائج المشروع وجدوله الزمني، ما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "الإجابة الصحيحة هي: معالجة المسألة مع أعضاء الفريق المحددين الذين انتهكوا القواعد.\n\nمن مسؤوليات مدير المشروع التعامل مع مشكلات الأداء مباشرة مع الأعضاء المعنيين لتصحيح السلوك وضمان استمرار سير العمل بفعالية.\n\nالخيارات الأخرى غير صحيحة: إزالة الأعضاء خطوة تصعيدية وغير مناسبة إلا إذا فشلت محاولات الإصلاح. ترقية الأعضاء الملتزمين إجراء غير مرتبط بحل المشكلة. السماح للفريق بالتحقيق مع بعضهم يخلق بيئة غير صحية ويؤثر على الروح الجماعية.",
      "choices": [
        {
          "text": "معالجة المسألة مع أعضاء الفريق المحددين الذين انتهكوا القواعد.",
          "correct": true
        },
        {
          "text": "إزالة أعضاء الفريق الذين انتهكوا القواعد.",
          "correct": false
        },
        {
          "text": "ترقية جميع أعضاء الفريق الذين لم ينتهكوا أي قواعد.",
          "correct": false
        },
        {
          "text": "السماح للفريق بالتحقيق مع الأعضاء الذين ينتهكون القواعد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تطوير تطبيق جوال. يدرك مدير المشروع أن النهج الرشيق (Agile) هو الأنسب لهذا المشروع، لكن معظم أعضاء الفريق ليس لديهم خبرة في هذا النوع من النهج.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك إذا كانت المؤسسة منفتحة على استخدام النهج الرشيق؟",
      "explanation": "الإجابة الصحيحة: تنظيم تدريب حول مبادئ وعقلية النهج الرشيق لأعضاء الفريق الحالي.\n\nالسبب: عند تطبيق نهج جديد مثل Agile داخل فريق ليس لديه خبرة كافية، الخطوة الأولى هي تمكين الفريق عبر التدريب وبناء القدرات. هذا يتماشى مع إدارة تطوير الفريق، حيث يُعتبر التدريب وسيلة لزيادة مهارات الفريق وتحسين الأداء، دون الحاجة لتغيير الفريق أو استبداله.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب إعادة تعيين المشروع إلى فريق يمتلك خبرة: ليس خيارًا واقعيًا دائمًا ويعني التخلي عن الفريق الحالي بدلاً من تطويره.\n- طلب استبدال أعضاء الفريق: يتسبب في تعطيل المشروع ويفقد المؤسسة فرص تطوير مهارات موظفيها.\n- استخدام نهج تنبؤي: يناقض متطلبات المشروع، خاصة إذا كان Agile هو الأنسب تقنيًا وعمليًا.",
      "choices": [
        {
          "text": "طلب إعادة تعيين المشروع إلى فريق يمتلك خبرة في النهج الرشيق.",
          "correct": false
        },
        {
          "text": "طلب استبدال أعضاء الفريق الذين لم يستخدموا النهج الرشيق من قبل.",
          "correct": false
        },
        {
          "text": "تنظيم تدريب حول مبادئ وعقلية النهج الرشيق لأعضاء الفريق الحالي.",
          "correct": true
        },
        {
          "text": "استخدام نهج تنبؤي لأن الفريق معتاد عليه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "نظرًا لطبيعة المشروع التنبؤية المعقدة، قررت المؤسسة استخدام نهج رشيق في إحدى مراحل المشروع.\n\nأحد أعضاء الفريق لا يفهم نهج Agile ويستمر في تخصيص المهام لبقية الفريق. بعد فترة، لا يستطيع الفريق التكيف وينشأ صراع يؤخر التسليمات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: إعادة تأكيد مبادئ وأدوار Agile لإنشاء هيكل يمكن للفريق استخدامه.\n\nالسبب: عندما ينتقل الفريق من نهج تقليدي إلى Agile ويحدث سوء فهم للأدوار، أفضل إجراء هو العودة للمبادئ الأساسية وتوضيح كيفية تنظيم الفريق ذاتيًا، وتوضيح الفرق بين توزيع المهام من قبل الأفراد وبين آلية العمل في Agile.\n\nلماذا الخيارات الأخرى خاطئة:\n- استبدال عضو الفريق: حل متسرع، ويجب أولًا محاولة التوعية والتدريب.\n- الانتظار حتى يتمكن الفريق من حل النزاع: قد يؤدي ذلك إلى زيادة الصراع دون نتائج واضحة.\n- تولي التحكم في سجل Sprint: يناقض مبدأ تنظيم الفريق الذاتي ويحول مدير المشروع إلى ميكرو مانجر.",
      "choices": [
        {
          "text": "استبدال عضو الفريق بشخص لديه خبرة في Agile.",
          "correct": false
        },
        {
          "text": "الانتظار حتى يتمكن الفريق من حل النزاع وتنظيم نفسه.",
          "correct": false
        },
        {
          "text": "إعادة تأكيد مبادئ وأدوار Agile لإنشاء هيكل يمكن للفريق استخدامه.",
          "correct": true
        },
        {
          "text": "تولي التحكم في سجل Sprint وتوزيع المهام على أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مشروع يمتد لعدة سنوات، أعلن مورد رئيسي عن تقاعده.\n\nيشعر مدير المشروع بالقلق من تأثير ذلك على المشروع وقد حدد أن عدة مهام حرجة ستتأثر.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: التعاون مع مدير الموارد لتحديد وتدريب بديل مناسب.\n\nالسبب: عند فقدان مورد رئيسي، يجب على مدير المشروع اتخاذ خطوات استباقية لضمان استمرارية العمل. التعاون مع إدارة الموارد يسمح بإيجاد بديل مؤهل قبل مغادرة الشخص الحالي، بما يحفظ المعرفة داخل الفريق ويوفر نقل سلس للمهام.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب العمل لساعات إضافية: يرهق الفريق ولا يحل المشكلة على المدى البعيد.\n- إبلاغ أصحاب المصلحة مباشرة: هذا تصرف سلبي يُظهر فشل في إدارة المشكلة بدلاً من معالجتها.\n- تشجيع المورد على تأجيل تقاعده: حل غير عملي ولا يمكن الاعتماد عليه في خطط إدارة المخاطر.",
      "choices": [
        {
          "text": "طلب من أعضاء الفريق المتبقين العمل لساعات إضافية لإكمال المهام المتأثرة.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بأن مهام المورد لن تُنجز في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "التعاون مع مدير الموارد لتحديد وتدريب بديل مناسب.",
          "correct": true
        },
        {
          "text": "تشجيع عضو الفريق المتقاعد على تأجيل تقاعده لتجنب تعطيل المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع إدارة عدة مشاريع في خمس دول مختلفة، وقد تم إصدار توجيه جديد بشأن الزي الرسمي وترتيبات المكاتب.\n\nقوبل هذا التوجيه بمقاومة في ثلاث دول، مما أدى إلى سلسلة من سوء الفهم والاستياء ومشكلات قانونية محتملة.\n\nما الذي كان يجب على مدير المشروع فعله للتعامل بشكل أفضل مع هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: تقييم الخصائص الثقافية والشخصية في الدول المختلفة قبل إصدار توجيه عام.\n\nالتفسير: في المشاريع التي تنفذ عبر بيئات دولية متعددة، إدارة أصحاب المصلحة وإدارة الموارد تأخذ في الحسبان الاختلافات الثقافية والاجتماعية والقانونية بين البلدان. إصدار توجيهات موحدة دون تقييم الخصائص المحلية قد يؤدي إلى مقاومة داخلية ومشكلات قانونية كما حدث في هذا السيناريو. مدير المشروع كان ينبغي أن يقيّم مسبقًا تأثير السياسات على كل دولة لضمان ملاءمتها وقبولها.\n\nلماذا الخيارات الأخرى خاطئة:\n- طلب توضيح واستثناءات من الإدارة العليا: إجراء لاحق وليس استباقيًا، ويعني أن المشكلة وقعت بالفعل.\n- تحديد الحالة الاجتماعية والاقتصادية: ليست المعيار الرئيسي هنا، لأن الاعتراض كان ثقافيًا وقانونيًا.\n- الحصول على قائمة بالتفضيلات الشخصية: أمر غير عملي في بيئات معقدة متعددة الدول ويخرج عن إدارة المشروع إلى مستوى إداري تفصيلي لا يخص المشروع.",
      "choices": [
        {
          "text": "طلب توضيح واستثناءات من الإدارة العليا قبل إصدار توجيه عام لجميع الدول.",
          "correct": false
        },
        {
          "text": "تقييم الخصائص الثقافية والشخصية في الدول المختلفة قبل إصدار توجيه عام.",
          "correct": true
        },
        {
          "text": "تحديد الحالة الاجتماعية والاقتصادية لأعضاء الفريق قبل إصدار توجيه واسع.",
          "correct": false
        },
        {
          "text": "الحصول على قائمة بالتفضيلات الشخصية من أعضاء الفريق قبل إصدار التوجيه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تخطط شركة تنظيم فعاليات لحدث جديد لعميل يعقد مؤتمرات نصف سنوية.\n\nيقود المشروع مدير مشروع جديد قام بمراجعة سجل الدروس المستفادة من الحدث السابق، وهو قلق من احتمال تكرار مشكلة سابقة.\n\nكيف يجب أن يتصرف مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تحديد السبب الجذري للمشكلة والتشاور مع أصحاب المصلحة.\n\nالتفسير: مدير المشروع مسؤول عن التأكد من عدم تكرار نفس الأخطاء التي حدثت سابقًا. مراجعة سجل الدروس المستفادة بداية صحيحة، لكن للتعامل بشكل فعّال، يجب البحث عن السبب الجذري الذي أدى إلى تلك المشكلة سابقًا، ثم التشاور مع أصحاب المصلحة الرئيسيين لضمان تطبيق الحلول المناسبة والوقائية. هذا يتماشى مع إدارة المخاطر وإدارة المعرفة في المشروع.\n\nلماذا الخيارات الأخرى خاطئة:\n- معالجة المشكلة إذا ظهرت أثناء التخطيط: موقف تفاعلي وليس وقائي، ولا يمنع تكرارها.\n- اقتراح إعادة جدولة المؤتمر: تصرف مبالغ فيه قبل التأكد من وجود ضرورة حقيقية لذلك.\n- تنفيذ نفس الاستراتيجيات: هذا يعرض المشروع لنفس الأخطاء السابقة دون أي تحسين.",
      "choices": [
        {
          "text": "تحديد السبب الجذري للمشكلة والتشاور مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "معالجة المشكلة إذا ظهرت أثناء التخطيط للحدث.",
          "correct": false
        },
        {
          "text": "اقتراح إعادة جدولة المؤتمر القادم.",
          "correct": false
        },
        {
          "text": "تنفيذ نفس الاستراتيجيات المستخدمة في الحدث السابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التوقيع على مشروع استراتيجي أدى إلى تكاليف إضافية، لم يتمكن مدير المشروع من تبرير هذه النفقات الإضافية مقابل القيمة التجارية التي تم تحقيقها.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: قياس وتتبع الفوائد المحددة في دراسة الجدوى طوال دورة حياة المشروع.\n\nالتفسير: في إدارة القيمة المحققة (Benefits Realization Management)، من الضروري ألا يكتفي مدير المشروع بتقدير الفوائد في بداية المشروع، بل عليه تتبع تلك الفوائد وقياسها بشكل مستمر خلال التنفيذ وحتى بعد إغلاق المشروع. هذا يضمن وجود بيانات واضحة لدعم أي نفقات إضافية ويثبت القيمة المحققة فعليًا.\n\nلماذا الخيارات الأخرى خاطئة:\n- تقديم تقييم أولي فقط: لا يكفي لأنه يفقد المصداقية إذا لم يتم قياس النتائج الفعلية.\n- إجراء إعادة تقييم بعد التنفيذ: خطوة متأخرة جدًا وغير عملية، خاصة لو ظهرت اعتراضات أثناء التنفيذ.\n- مشاركة الفوائد غير الملموسة فقط: قد تكون هذه الفوائد حقيقية لكنها غير كافية لتبرير التكاليف الإضافية دون دعم بالأرقام.",
      "choices": [
        {
          "text": "تقديم تقييم للفوائد المحتملة المحددة في دراسة الجدوى الأولية كمبرر كافٍ للتكاليف الإضافية.",
          "correct": false
        },
        {
          "text": "قياس وتتبع الفوائد المحددة في دراسة الجدوى طوال دورة حياة المشروع.",
          "correct": true
        },
        {
          "text": "إجراء إعادة تقييم للحالة الحالية للمؤسسة بعد تنفيذ المشروع لإظهار الفوائد المحققة.",
          "correct": false
        },
        {
          "text": "مشاركة الفوائد غير المالية أو غير الملموسة مثل رضا العملاء والسمعة الجيدة كمؤشرات للقيمة المحققة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع جديد مشروع إنشاءات. بعد مراجعة خطة إدارة المشروع، يدرك مدير المشروع أن متطلبات الصحة والسلامة لم يتم التعامل معها بشكل كافٍ.\n\nمدير المشروع لديه مخاوف جدية ويريد معالجة هذا القصور.\n\nما هو القلق الأساسي في هذه الحالة؟",
      "explanation": "الإجابة الصحيحة: يجب أن يلتزم المشروع بجميع المتطلبات والمسؤوليات القانونية والتنظيمية.\n\nالشرح المفصل:\nفي مشاريع البناء، تُعتبر الصحة والسلامة من أهم العناصر التي لا يمكن التهاون فيها، لأن عدم الالتزام بالمعايير والقوانين الخاصة بها يعرض المشروع لمخاطر قانونية جسيمة تشمل الغرامات، وقف العمل، وحتى دعاوى قضائية. هذه المخاطر لا تقتصر فقط على التأثير المالي، بل تمتد إلى التأثير على سمعة المؤسسة والعلاقات مع أصحاب المصلحة.\n\nالتركيز الأساسي هو على الالتزام القانوني والتنظيمي، لأن هذا يشكل الأساس الذي يُبنى عليه أي إجراء يتعلق بالصحة والسلامة. أي تقصير في هذا الجانب يعرّض المشروع لمشكلات كبيرة، ويجعل باقي الأمور مثل الجدول الزمني أو جودة العمل أقل أهمية في المقارنة.\n\nتفصيل الخيارات:\n- عدم معالجة قضايا الصحة والسلامة يمكن أن يضر بثقة العميل وسمعة المشروع: صحيح جزئياً، ولكن هذا أثر ثانوي. الأهم هو الالتزام القانوني.\n- قد يتعرض الجدول الزمني للخطر عند تنفيذ تدابير السلامة الإضافية: قد يحصل هذا، لكنه أمر ثانوي ولا يجب أن يؤثر على الالتزام بمعايير السلامة.\n- يعلم مدير المشروع أنه من الضروري تحقيق مؤشرات الأداء المحددة: مؤشرات الأداء مهمة، لكنها لا تتجاوز أهمية الصحة والسلامة القانونية.",
      "choices": [
        {
          "text": "عدم معالجة قضايا الصحة والسلامة يمكن أن يضر بثقة العميل وسمعة المشروع.",
          "correct": false
        },
        {
          "text": "يجب أن يلتزم المشروع بجميع المتطلبات والمسؤوليات القانونية والتنظيمية.",
          "correct": true
        },
        {
          "text": "قد يتعرض الجدول الزمني للمشروع للخطر عند تنفيذ تدابير السلامة الإضافية.",
          "correct": false
        },
        {
          "text": "يعلم مدير المشروع أنه من الضروري تحقيق مؤشرات الأداء المحددة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استمر مشروع إنشاءات لمدة 18 شهرًا تقريبًا، وكان مؤشر أداء الجدول الزمني (SPI) هو 0.68.\n\nيرغب مدير المشروع في إكمال المشروع حسب الخطة دون تكاليف إضافية.\n\nما الذي يجب على مدير المشروع فعله لإكمال المشروع في الوقت المحدد؟",
      "explanation": "الإجابة الصحيحة: تسريع الجدول عن طريق تنفيذ المهام بالتوازي (Fast track).\n\nالشرح المفصل:\nمؤشر أداء الجدول الزمني (SPI) أقل من 1 يعني أن المشروع متأخر عن الجدول. لإعادة المشروع إلى الجدول، هناك عدة استراتيجيات:\n- Fast tracking: تنفيذ أنشطة كانت مخططة بالتتابع بالتوازي أو متداخلة. هذا يساعد على تقليل الوقت بدون زيادة كبيرة في التكاليف، لكنه يزيد من مخاطر تداخل المهام.\n- Crashing: زيادة الموارد لتسريع المهام، لكن هذا يؤدي عادة إلى زيادة في التكاليف.\n\nنظرًا لأن شرط السؤال هو عدم تحمل تكاليف إضافية، فإن Fast tracking هو الحل الأنسب.\n\nتفصيل الخيارات:\n- تسريع الجدول عن طريق زيادة الموارد (Crash): يؤدي إلى زيادة التكلفة، وهو غير مرغوب فيه.\n- تقليل نطاق المشروع: يتطلب مراجعة وإدارة تغيير رسمية، ولا يضمن إكمال المشروع في الوقت.\n- تقليل جودة المشروع: غير مقبول لأنه يؤثر على نتائج المشروع وقبوله.",
      "choices": [
        {
          "text": "تسريع الجدول عن طريق زيادة الموارد (Crash).",
          "correct": false
        },
        {
          "text": "تسريع الجدول عن طريق تنفيذ المهام بالتوازي (Fast track).",
          "correct": true
        },
        {
          "text": "تقليل نطاق المشروع.",
          "correct": false
        },
        {
          "text": "تقليل جودة المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "استدعى الراعي في مشروع بملايين الدولارات مدير المشروع لاجتماع طارئ.\n\nقدم العميل طلبًا رسميًا لتقليص الجدول الزمني بشكل كبير من أجل الامتثال لموعد قانوني نهائي.\n\nما الذي يجب على مدير المشروع فعله للتحضير لهذا الاجتماع؟",
      "explanation": "الإجابة الصحيحة: إعداد تقرير تقييم تأثير التغيير لمراجعته في الاجتماع.\n\nالشرح المفصل:\nطلب تقليص الجدول الزمني بشكل كبير يُعد طلب تغيير جوهري يحتاج إلى تقييم دقيق قبل اتخاذ أي إجراءات تنفيذية. مدير المشروع مسؤول عن:\n- تحليل تأثير هذا الطلب على نطاق المشروع، التكاليف، الجودة، الموارد، والمخاطر.\n- تقييم الجدول الزمني الحالي وكيف يمكن تعديله بأفضل الطرق (Fast tracking أو Crashing) مع فهم تداعيات كل خيار.\n- إعداد تقرير واضح وموضوعي لعرضه على الراعي وأصحاب المصلحة لمساعدتهم في اتخاذ القرار.\n\nتنفيذ أي تعديل بدون تقييم دقيق قد يؤدي إلى مشاكل غير متوقعة وفشل في تحقيق الهدف.\n\nتفصيل الخيارات:\n- بدء Fast tracking أو Crashing مباشرة: غير مناسب دون دراسة التأثير.\n- تنفيذ التغيير مباشرة: يفتقر إلى الإدارة المنهجية ويعرض المشروع لمخاطر.\n- تحليل أدوات تسريع المهام فقط: غير كافٍ بدون إعداد تقرير شامل لتأثير التغيير.",
      "choices": [
        {
          "text": "بدء إجراءات تسريع المشروع بالتوازي (Fast-tracking).",
          "correct": false
        },
        {
          "text": "تنفيذ التغييرات المطلوبة في الجدول الزمني للمشروع.",
          "correct": false
        },
        {
          "text": "تحليل أدوات تسريع المهام (Crash).",
          "correct": false
        },
        {
          "text": "إعداد تقرير تقييم تأثير التغيير لمراجعته في الاجتماع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المبيعات الرئيسي والفريق غير قادرين على تقديم تقرير حالة المشروع في الوقت المحدد لمشروع دمج تقارير المبيعات الجديدة.\n\nبالإضافة إلى ذلك، لا يلبي التقرير التوقعات التي تم تسليط الضوء عليها في اجتماعات المراجعة الجماعية. ما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "الإجابة الصحيحة: تقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.\n\nالشرح: في حالة عدم تقديم تقرير الحالة في الوقت المحدد وعدم تلبية التوقعات، فإن أول خطوة منطقية هي فهم ما إذا كان الفريق لديه فهم واضح لخطة العمل وأهداف التقرير. قد يكون هناك نقص في التفاهم أو التواصل مما يؤدي إلى أداء غير مرضي. بعد التقييم، يمكن لمدير المشروع تحديد إذا ما كان هناك حاجة لإعادة تدريب أو توضيح المسؤوليات.\n\nلماذا الخيارات الأخرى خاطئة:\n- التأكد من أن الخطة موثقة ومشتركة مهم، لكنه يأتي بعد التأكد من الفهم العملي للفريق.\n- زيادة اجتماعات الفريق قد تزيد الضغط بدون معالجة السبب الحقيقي.\n- منح مزيد من الوقت بدون معرفة المشكلة الحقيقية قد يؤدي إلى تكرار الفشل.",
      "choices": [
        {
          "text": "تقييم فهم الفريق لخطة العمل من خلال طلب ملاحظاتهم.",
          "correct": true
        },
        {
          "text": "التأكد من أن الخطة موثقة ومشتركة بين الفريق وأصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "زيادة وتيرة اجتماعات الفريق لتقديم تقرير الحالة.",
          "correct": false
        },
        {
          "text": "ضمان منح أعضاء الفريق المزيد من الوقت للتخطيط والمناقشة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مشارك في مشروع تتطور فيه المتطلبات باستمرار.\n\nما الذي يجب أن يفعله مدير المشروع لتحقيق النجاح؟",
      "explanation": "الإجابة الصحيحة: تقديم تحديثات منتظمة وطلب الموافقة على النتائج من مالك المنتج.\n\nالشرح: في بيئة تتغير فيها المتطلبات باستمرار، التواصل المستمر مع مالك المنتج مهم جداً لضمان توافق المشروع مع توقعات الأعمال. تقديم تحديثات منتظمة يضمن شفافية ويقلل من المفاجآت، كما يتيح فرصة للحصول على موافقات مستمرة تساعد في توجيه المشروع بشكل صحيح.\n\nلماذا الخيارات الأخرى خاطئة:\n- العمل مع الفريق على المسار الصحيح مهم، لكنه لا يكفي بدون تواصل مع مالك المنتج.\n- توفير جو مريح يساعد الفريق لكنه لا يعالج تغير المتطلبات.\n- توثيق العمليات مهم، لكن الموافقة من مالك المنتج ذات أولوية في هذا السياق.",
      "choices": [
        {
          "text": "تقديم تحديثات منتظمة وطلب الموافقة على النتائج من مالك المنتج.",
          "correct": true
        },
        {
          "text": "العمل مع الفريق للتأكد من أنهم على المسار الصحيح ويسلمون في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "الحفاظ على جو عمل مريح لتحسين التماسك داخل الفريق.",
          "correct": false
        },
        {
          "text": "ضمان توثيق العمليات وتحديث مالك المنتج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لإعادة تصميم نظام نقاط البيع لمتجر. الفريق يقوم حاليًا باختبار الوظائف الجديدة، وعندما يقترح أحد أصحاب المصلحة الرئيسيين تغييرًا من شأنه تحسين رضا العملاء بشكل كبير، يتبين أن التغيير يتطلب موارد إضافية.\n\nما الذي يجب أن يقوم به مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: توثيق التغييرات المقترحة وتقييم أثرها على الوقت والتكلفة والموارد.\n\nالشرح: التغييرات التي تتطلب موارد إضافية قد تؤثر بشكل كبير على نطاق المشروع، الجدول الزمني، والتكلفة. يجب على مدير المشروع أن يتبع إجراءات إدارة التغيير عبر توثيق التغيير المقترح، تحليل تأثيره الشامل، ثم تقديمه للمراجعة والموافقة من قبل أصحاب المصلحة قبل التنفيذ. هذا يحافظ على السيطرة على المشروع ويمنع التعديلات العشوائية التي قد تؤدي إلى تجاوز الميزانية أو التأخير.\n\nلماذا الخيارات الأخرى خاطئة:\n- إيقاف الاختبار فورًا قد يوقف التقدم بدون سبب واضح.\n- الاستمرار في الاختبار أثناء مناقشة التغيير قد يؤدي إلى تضارب في الأولويات.\n- تأجيل التغييرات وعدم مراجعتها قد يفوت فرصة لتحسين رضا العملاء وتطوير المشروع.",
      "choices": [
        {
          "text": "إيقاف الاختبار وجدولة اجتماع لمراجعة التغييرات المقترحة مع الموارد.",
          "correct": false
        },
        {
          "text": "استكمال الاختبارات بينما يجتمع مدير المشروع مع صاحب المصلحة لمراجعة التغييرات.",
          "correct": false
        },
        {
          "text": "توثيق التغييرات المقترحة وتقييم أثرها على الوقت والتكلفة والموارد.",
          "correct": true
        },
        {
          "text": "تأجيل التغييرات المقترحة والسماح للفريق بإكمال الاختبار والتنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتأخر المشروع حاليًا عن الجدول الزمني، وعند انضمام عضو جديد معروف بأدائه العالي، يلاحظ مدير المشروع أن العضو يفتقر للتدريب الخاص بالمشروع، لكنه يمتلك المهارات والخبرة ذات الصلة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: تعيين العضو الجديد لمهام غير حرجة دون مراقبة دقيقة مع تقديم التدريب.\n\nالشرح المفصل:\nفي حالة وجود عضو جديد يمتلك خبرة ومهارات عامة عالية لكنه يفتقر للتدريب الخاص بالمشروع، فإن تعيينه مباشرة في مهام حرجة قد يعرض المشروع لمخاطر كبيرة بسبب عدم إلمامه بالتفاصيل الخاصة. لذلك، يتم تعيينه في مهام أقل حساسية أولاً لضمان استقرار العمل وعدم تأثيره على الجدول الزمني.\nبالتوازي، يُوفر له التدريب اللازم ليكون مؤهلاً لتولي مهام أكثر أهمية لاحقاً.\n\nلماذا الخيارات الأخرى خاطئة:\n- ضمان حصول العضو على التدريب قبل الانضمام: هذا قد يسبب تأخير غير ضروري خصوصاً في مشروع متأخر.\n- تعيينه في مهام حرجة مع مراقبة دقيقة: رغم المراقبة، فإن المهام الحرجة تتطلب معرفة تامة وهذا قد يسبب أخطاء.\n- رفض إضافة العضو الجديد: غير عقلاني، لأن العضو يمتلك خبرة قيمة ويجب الاستفادة منها.",
      "choices": [
        {
          "text": "ضمان حصول العضو الجديد على التدريب قبل الانضمام للفريق.",
          "correct": false
        },
        {
          "text": "تعيين العضو الجديد لمهام حرجة تحت مراقبة دقيقة أثناء تلقي التدريب.",
          "correct": false
        },
        {
          "text": "تعيين العضو الجديد لمهام غير حرجة دون مراقبة دقيقة مع تقديم التدريب.",
          "correct": true
        },
        {
          "text": "رفض إضافة العضو الجديد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع مسؤول عن إطلاق منتج بمواعيد سوق عدوانية. يُقدّر مجموع النقاط بـ 600 نقطة مع سرعة 60 نقطة في كل دورة.\n\nوقد تم تعيين فريق يصل إلى 12 عضوًا لهذا المشروع. أي من العبارات التالية صحيحة؟",
      "explanation": "الإجابة الصحيحة: تمثل سرعة 60 نقطة في كل دورة الحد الأدنى من العمل، ويمثل 12 عضوًا الحد الأقصى لحجم الفريق.\n\nالشرح المفصل:\nفي سياق مشاريع Agile، السرعة تشير إلى كمية العمل التي يمكن للفريق إنجازها في دورة (Sprint) واحدة. سرعة 60 نقطة تعني أن الفريق يُنجز على الأقل 60 نقطة عمل في كل دورة.\nأما حجم الفريق فعدد 12 هو عادة الحد الأعلى الموصى به لأعضاء الفريق لضمان التواصل الفعّال والتنسيق الجيد. فرق أكبر من ذلك قد تعاني من تعقيدات في التواصل وتراجع في الإنتاجية.\n\nلماذا الخيارات الأخرى خاطئة:\n- اعتبار أن سرعة 60 نقطة تعني أن المشروع تحت السيطرة، فهذا غير كافٍ بدون مقارنة مع حجم العمل ومتطلبات المشروع.\n- عدم اعتبار 12 عضوًا الحد الأقصى الصحيح لحجم الفريق في السياق Agile.\n- ربط حجم الفريق بمفهوم السيطرة على المشروع بشكل مباشر هو تبسيط خاطئ.",
      "choices": [
        {
          "text": "تمثل سرعة 60 نقطة في كل دورة الحد الأدنى من العمل، ويمثل 12 عضوًا الحد الأقصى لحجم الفريق.",
          "correct": true
        },
        {
          "text": "تمثل سرعة 60 نقطة أن المشروع تحت السيطرة، ويمثل 12 عضوًا أن المشروع خارج السيطرة.",
          "correct": false
        },
        {
          "text": "تمثل سرعة 60 نقطة أن المشروع تحت السيطرة، ويمثل 12 عضوًا الحد الأقصى لحجم الفريق.",
          "correct": false
        },
        {
          "text": "تمثل سرعة 60 نقطة الحد الأدنى من العمل، ويمثل 12 عضوًا أن المشروع تحت السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء حضور اجتماع حوكمة مع الإدارة العليا، تم إعلام مدير المشروع شفهيًا بتدقيق خارجي وشيك لمشاريع مختارة.\n\nسيسمح هذا التدقيق للمؤسسة بالحفاظ على شهادة الجودة الخاصة بها. ما الذي يجب على مدير المشروع فعله أولًا للتحضير للتدقيق؟",
      "explanation": "الإجابة الصحيحة: الاتصال بالمدققين لفهم نطاق التدقيق ومتطلباته.\n\nالشرح المفصل:\nالخطوة الأولى للتحضير لأي تدقيق خارجي هي فهم طبيعة التدقيق، نطاقه، والأدلة أو المستندات التي سيطلبها المدققون. التواصل المبكر مع المدققين يمكن مدير المشروع من تحديد نقاط الضعف المحتملة، تجهيز الفريق، وتوجيه الجهود نحو الجوانب المطلوبة.\n\nالتصرف بسرعة ووضوح في هذه المرحلة يساعد على تقليل المفاجآت وضمان التزام المشروع بالمعايير المطلوبة.\n\nلماذا الخيارات الأخرى خاطئة:\n- تحديث كافة الوثائق مهم لكنه خطوة لاحقة بعد فهم متطلبات التدقيق.\n- إيقاف المشروع غير ضروري وقد يسبب تعطيلات غير مبررة.\n- عقد اجتماع مع الفريق لإبلاغهم مفيد، لكنه يجب أن يتم بعد تحديد نطاق التدقيق ومتطلباته بدقة.",
      "choices": [
        {
          "text": "تحديث كافة الوثائق المتعلقة بالمشروع لتعكس الحالة الحالية.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع لضمان الامتثال الكامل لعملية التدقيق.",
          "correct": false
        },
        {
          "text": "الاتصال بالمدققين لفهم نطاق التدقيق ومتطلباته.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع الفريق لإبلاغهم بنطاق ومتطلبات التدقيق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لتقنية المعلومات (IT) لفريق جديد في مشروع تطوير برمجيات في بيئة رشيقة.\n\nيقوم مدير المشروع بتقدير مدة المشروع بناءً على خبرته السابقة في مؤسسة أخرى. كيف ينبغي لمدير المشروع التحقق من صحة هذا الافتراض والتخطيط بشكل صحيح وإدارة الجدول الزمني للمشروع؟",
      "explanation": "في بيئة رشيقة، لا يُعتمد فقط على خبرة مدير المشروع، بل يجب إشراك الفريق بالكامل لتقدير مدة المشروع.\n\n- لماذا الخيار الصحيح؟\nاستخدام تقديرات الفريق عبر نقاط القصة ومراقبة سرعة الإنجاز يعطي تقديرًا واقعيًا يعكس قدرات الفريق الحالي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إجراء استطلاع داخلي: يعطي بيانات عامة لكنها غير مخصصة للفريق الجديد.\n- التقدير بناءً على مراجعة السبرنت: يعتمد على أداء فعلي وليس على التخطيط المسبق.\n- دراسة الاجتماعات السابقة والسياق الثقافي: لا يعطي صورة دقيقة للقدرات الحالية للفريق.",
      "choices": [
        {
          "text": "إجراء استطلاع داخل المؤسسة وجمع بيانات لتأكيد الادعاءات.",
          "correct": false
        },
        {
          "text": "التقدير بناءً على اجتماعات مراجعة السبرنت ومدخلات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "دراسة اجتماعات التخطيط السابقة والسياق الثقافي للمشاريع في المؤسسة.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق تقدير عدد نقاط القصة ومراقبة سرعة الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تشكيل فريق عالمي متعدد الوظائف لتنفيذ مبادرة متعددة الجنسيات.\n\nما الذي يجب أن يفعله مدير المشروع لضمان المشاركة الكاملة للفريق طوال المشروع؟",
      "explanation": "عند إدارة فرق عالمية، التحدي الرئيسي هو اختلاف المناطق الزمنية والثقافات.\n\n- لماذا الخيار الصحيح؟\nتنسيق المناطق الزمنية والاتفاق على أوقات الاجتماعات يضمن حضور الجميع ويعزز التواصل، خاصة عند وجود اختلافات في الجغرافيا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ضمان توفير البرنامج بلغات متعددة: قد يكون مفيدًا لكن لا يضمن مشاركة الجميع في الاجتماعات.\n- ترجمة وثائق المشروع: إجراء داعم لكنه لا يعالج مشكلة الحضور المباشر.\n- تقديم إرشادات حول الأدوات والممارسات: مهم للتنظيم، لكن التواصل المباشر يظل العنصر الحاسم لضمان المشاركة الفعلية والمتابعة اليومية.",
      "choices": [
        {
          "text": "تنسيق معلومات المناطق الزمنية والاتفاق على أوقات الاجتماعات.",
          "correct": true
        },
        {
          "text": "ضمان توفير البرنامج بلغات متعددة.",
          "correct": false
        },
        {
          "text": "ترجمة وثائق المشروع.",
          "correct": false
        },
        {
          "text": "تقديم إرشادات حول الأدوات والممارسات المشتركة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتواصل مدير المشروع مع أحد أصحاب المصلحة الرئيسيين فقط من خلال المكالمات الهاتفية، كما هو موضح في خطة إدارة الاتصالات.\n\nبعد ثلاثة أسابيع من تنفيذ المشروع، يبدأ مدير المشروع في تلقي عدد متزايد من طلبات الاتصال غير الرسمية المتكررة من هذا الطرف. كيف يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "تغير نمط التواصل يشير عادةً إلى عدم تلبية احتياجات صاحب المصلحة حسب الاتفاق الأصلي.\n\n- لماذا الخيار الصحيح؟\nالاجتماع المباشر مع صاحب المصلحة يتيح فهم أسبابه واحتياجاته الحقيقية وتحديث خطة الاتصال بما يتناسب مع الوضع الجديد، مما يحافظ على الثقة والوضوح.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاستمرار في الاتصال الهاتفي فقط: قد يؤدي إلى فقدان ثقة صاحب المصلحة أو تفويت معلومات مهمة.\n- إرسال بريد إلكتروني: لا يعطي مرونة للنقاش والتفاهم حول التفاصيل.\n- تعيين عضو من الفريق كوسيط: يقلل من الشفافية ويعقد خطوط الاتصال بدل تبسيطها.",
      "choices": [
        {
          "text": "الاستمرار في الاتصال الهاتفي لأنه كان فعالًا حتى الآن.",
          "correct": false
        },
        {
          "text": "الاجتماع مع صاحب المصلحة لمناقشة احتياجاته وتوقعاته في التواصل.",
          "correct": true
        },
        {
          "text": "إرسال بريد إلكتروني لصاحب المصلحة يطلب تغيير نهج الاتصال.",
          "correct": false
        },
        {
          "text": "تعيين أحد أعضاء الفريق كحلقة وصل بين مدير المشروع وصاحب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على مشروع عالي الأولوية قائم على التغيير وقد فشل مرارًا في الوفاء بالمواعيد النهائية للإصدار.\n\nيتعرف مدير المشروع على أن السبب هو أن أحد أعضاء الفريق ذوي الخبرة مخصص لعدة مشاريع ولديه سعة محدودة. ما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عندما يفشل الفريق في الالتزام بالمواعيد النهائية، يجب أولًا تحليل السبب الأساسي.\n\n- لماذا الخيار الصحيح؟\nتقييم عبء العمل لعضو الفريق يساعد على فهم السعة الحقيقية المتاحة له وتحديد ما إذا كان توزيع العمل يحتاج إلى تعديل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ الراعي مباشرة: خطوة متسرعة دون جمع بيانات واضحة.\n- تعديل الجدول وتقديم طلب تغيير: يعتمد على الافتراضات وليس على تحليل فعلي.\n- مناقشة المشكلة مع الفريق فورًا: قد يؤدي إلى استنتاجات غير دقيقة دون تقييم موضوعي لعبء العمل.",
      "choices": [
        {
          "text": "إبلاغ الراعي بالمشكلة.",
          "correct": false
        },
        {
          "text": "تعديل الجدول الزمني وتقديم طلب تغيير.",
          "correct": false
        },
        {
          "text": "مناقشة المشكلة على الفور مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "تقييم عبء العمل لعضو الفريق ذو الخبرة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار قبول المنتج لمشروع برمجي، أبلغ الراعي مدير المشروع أن البرنامج لن يتم قبوله إلا إذا تم تغيير لون السمة من الأحمر إلى الأزرق.\n\nراجع مدير المشروع وثائق التخطيط وتأكد من أن اللون يجب أن يكون أحمر، لكن الراعي أصر على اللون الأزرق. ما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "في مثل هذه الحالات، يتوجب التعامل مع التغييرات عبر القنوات الرسمية.\n\n- لماذا الخيار الصحيح؟\nطلب تغيير رسمي يحفظ حقوق الطرفين ويضمن توثيق القرار ومراجعته من الأطراف المعنية حسب العملية المتفق عليها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ الراعي بقبول اللون كما هو: قد يؤدي إلى خلافات مستقبلية ويضعف العلاقة.\n- الموافقة مباشرة على تغيير اللون: يضر بالتحكم في نطاق المشروع.\n- طلب من قسم المشتريات تغيير اللون: تجاوز لسلطة مدير المشروع بدون إجراءات رسمية.",
      "choices": [
        {
          "text": "اقتراح أن يقدم الراعي طلب تغيير رسمي لتعديل متطلب لون السمة.",
          "correct": true
        },
        {
          "text": "إبلاغ الراعي بأن عليه قبول اللون لأن العقد يوضح بوضوح أنه يجب أن يكون أحمر.",
          "correct": false
        },
        {
          "text": "الموافقة على تغيير اللون لتجنب الخلاف المحتمل.",
          "correct": false
        },
        {
          "text": "طلب من قسم المشتريات تغيير اللون لتلبية توقعات الراعي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يلاحظ مدير المشروع أن أعضاء الفريق لا يتعاونون أو يتصرفون بشكل استباقي.\n\nما الذي كان يجب على مدير المشروع القيام به في بداية المشروع لتحقيق بيئة عمل أفضل؟",
      "explanation": "ضعف التعاون داخل الفريق يعود غالبًا إلى تجاهل تقييم ديناميكيات الفريق منذ البداية.\n\n- لماذا الخيار الصحيح؟\nإجراء تقييم لديناميكيات الفريق يساعد على تحديد أسلوب العمل والتواصل وتوزيع الأدوار بناءً على الشخصيات والكفاءات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تخصيص المهام مباشرة: قد يؤدي إلى توزيع غير متوازن.\n- تيسير اجتماعات إضافية: إجراء لاحق وليس وقائي.\n- تقسيم المشروع إلى جولات إضافية: لا يحل المشكلة السلوكية بين الأعضاء.",
      "choices": [
        {
          "text": "إجراء تقييم لديناميكيات الفريق.",
          "correct": true
        },
        {
          "text": "تخصيص جميع المهام في بداية المشروع.",
          "correct": false
        },
        {
          "text": "تيسير اجتماعات إضافية للفريق.",
          "correct": false
        },
        {
          "text": "تقسيم المشروع إلى مزيد من الجولات (iterations).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في نهاية المرحلة الأولى من مشروع توسيع ملعب، يدرك مدير المشروع أنه سيتأخر عن الجدول الزمني في المرحلة التالية من المشروع.\n\nيعود التأخير إلى متطلبات السلامة الجديدة التي يجب الالتزام بها. يشعر أصحاب المصلحة بالإحباط لأنهم لم يكونوا على علم بالتغييرات المحتملة في متطلبات السلامة. ما الذي كان يجب فعله لتجنب هذا الموقف وضمان وعي أصحاب المصلحة بالاضطرابات المحتملة؟",
      "explanation": "عند إدارة مشروع طويل ومعقد مثل توسيع ملعب، من المهم توقع المخاطر التي قد تؤثر على الجدول الزمني.\n\n- لماذا الخيار الصحيح؟\nتنفيذ عملية تقييم للمخاطر في بداية المشروع يسمح بتحديد التأخيرات المحتملة، مثل متطلبات السلامة، ووضع خطة استباقية للتعامل معها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- زيادة الاحتياطي المالي: يساعد في تغطية التكاليف لكنه لا يضمن وعي أصحاب المصلحة.\n- عقد اجتماعات منتظمة فقط: أسلوب تفاعلي وليس وقائي.\n- طلب موارد إضافية عند ظهور المشكلة: رد فعل متأخر، ولا يمنع وقوع المشكلة أساسًا.",
      "choices": [
        {
          "text": "زيادة الاحتياطي الاحتياطي للمشروع لاستيعاب المشكلات غير المتوقعة المتعلقة بالسلامة.",
          "correct": false
        },
        {
          "text": "عقد اجتماعات اتصال منتظمة مع مشرف الموقع للبقاء على اطلاع بمتطلبات السلامة.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية تقييم للمخاطر بشكل استباقي خلال بدء المشروع لتحديد التأخيرات المحتملة المتعلقة بالسلامة.",
          "correct": true
        },
        {
          "text": "طلب موارد وأفراد إضافيين لمعالجة مخاوف السلامة عند ظهورها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدرك مدير المشروع أن الفريق بحاجة إلى تدريب على تقنية معينة مطلوبة في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذا الخطر؟",
      "explanation": "التدريب يمثل مخاطرة في المشاريع التقنية إذا لم يتم التعامل معه منذ البداية.\n\n- لماذا الخيار الصحيح؟\nتقييم معرفة الفريق والبحث عن خيارات تدريب مناسبة هو الحل الاستباقي لضمان جاهزية الفريق وعدم تأخير المشروع لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التعاقد مع مزود خبير: حل مكلف وقد لا يبني قدرات الفريق.\n- إنشاء بند في سجل المخاطر: خطوة إدارية فقط ولا تعالج الخطر فعليًا.\n- معالجة الفجوات عند ظهورها: أسلوب رد فعل متأخر، يؤدي إلى تأخير وربما زيادة التكلفة.",
      "choices": [
        {
          "text": "تقييم معرفة الفريق بالتقنية والبحث عن خيارات التدريب الموصى بها.",
          "correct": true
        },
        {
          "text": "التعاقد مع مزود خبير لتنفيذ الجزء من العمل الذي يستخدم هذه التقنية المحددة.",
          "correct": false
        },
        {
          "text": "إنشاء بند في سجل المخاطر وإبلاغ الراعي.",
          "correct": false
        },
        {
          "text": "معالجة أي فجوات تدريبية عند ظهورها خلال المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع طويل الأمد مدته ثلاث سنوات.\n\nما النهج الذي يجب على مدير المشروع اتباعه لمعالجة الأنشطة القريبة الأجل، بينما يتم التخطيط للأعمال طويلة الأجل على مستوى عالٍ وتفصيلها لاحقًا؟",
      "explanation": "في المشاريع طويلة الأجل، يصعب التخطيط الكامل منذ البداية بسبب التغيرات المحتملة.\n\n- لماذا الخيار الصحيح؟\nالتخطيط الموجي التدريجي (rolling wave planning) يسمح بالتركيز على الأنشطة القريبة بتفصيل أكبر، بينما تظل الأعمال البعيدة مخططة بشكل عام وتفصيلها يتم لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التركيز على الفريق والتسليم السريع: لا يعالج الاحتياجات طويلة الأجل.\n- إشراك الراعي فقط: خطوة مهمة لكنها ليست خطة شاملة.\n- عقد ورش عمل لتحديد تواريخ: يحدد مواعيد لكن لا يوفر خطة تفصيلية مرنة.",
      "choices": [
        {
          "text": "التركيز على جمع الفريق والتسليم في أقرب وقت ممكن.",
          "correct": false
        },
        {
          "text": "إشراك الراعي في عمليات التحقق من صحة المتطلبات وتحديد الأولويات.",
          "correct": false
        },
        {
          "text": "عقد ورش عمل مع العميل لتحديد تواريخ التسليم.",
          "correct": false
        },
        {
          "text": "التحقق من صحة المتطلبات وتنفيذ التخطيط الموجي التدريجي (rolling wave planning).",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع بدء المشروع، أبلغ الراعي فريق المشروع بأنه لا يمكنه حضور أي اجتماعات خلال النصف الأول من المشروع.\n\nيرغب الراعي في تعيين بديل. ما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "عندما يكون الراعي غير متاح، من الضروري ضمان استمرارية الدعم وصنع القرار للمشروع.\n\n- لماذا الخيار الصحيح؟\nتحليل تأثير غياب الراعي يساعد على فهم حجم التأثير على المشروع، والعمل مع الراعي لتحديد بديل مناسب يضمن استمرارية اتخاذ القرارات بطريقة رسمية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب أن يكون البديل صاحب سلطة: هذا جزء من الحل لكنه ليس الخطوة الأولى.\n- تحديد اجتماع مباشرة مع البديل: يجب أولًا التأكد أن البديل هو الشخص الأنسب.\n- تصعيد الأمر: خطوة مبالغ فيها طالما أن الراعي مستعد لتعيين بديل.",
      "choices": [
        {
          "text": "طلب أن يكون البديل يتمتع بنفوذ كبير وسلطة في اتخاذ القرار.",
          "correct": false
        },
        {
          "text": "تحديد اجتماع مع الراعي البديل في أقرب وقت ممكن لمناقشة الأجندة القادمة.",
          "correct": false
        },
        {
          "text": "طلب الاهتمام الكامل من الراعي وتصعيد هذه المسألة إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "تحليل تأثير التغيير والعمل مع الراعي لتحديد بديل مناسب.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة في قطاع المالية مشروعًا جديدًا هجينًا للامتثال للوائح حكومية جديدة. حدد الفريق سرعة موثوقة تبلغ 65 نقطة قصة في كل تكرار. كل تكرار يستغرق أسبوعين.\n\nيرغب الراعي في معرفة متى سينتهي المشروع إذا تبقى 1040 نقطة قصة. كم عدد الأشهر المطلوبة لإكمال المشروع؟",
      "explanation": "لحساب مدة المشروع، يتم قسمة مجموع نقاط القصة المتبقية على السرعة.\n\n- لماذا الخيار الصحيح؟\n1040 ÷ 65 = 16 تكرار. بما أن كل تكرار أسبوعين، فالمجموع 32 أسبوعًا أي تقريبًا 8 أشهر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- شهرين، 4 أشهر، 16 شهرًا: إما أقل أو أكثر من المدة الحقيقية بناءً على الحساب الرياضي الواضح أعلاه.",
      "choices": [
        {
          "text": "شهرين",
          "correct": false
        },
        {
          "text": "4 أشهر",
          "correct": false
        },
        {
          "text": "8 أشهر",
          "correct": true
        },
        {
          "text": "16 شهرًا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تولى مدير مشروع جديد مسؤولية مشروع جارٍ بعد استقالة المدير السابق. أثناء مراجعة الوثائق، يكتشف المدير الجديد انحرافات كبيرة في عملية الشراء التي استخدمها المدير السابق للتعاقد مع مقدمي الخدمات الحاليين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "عند اكتشاف مخالفة إدارية أو انحراف كبير في العمليات، يجب التصرف بشكل مهني وشفاف.\n\n- لماذا الخيار الصحيح؟\nوضع علامة على المشكلة وعرضها على الإدارة العليا يسمح بمعالجتها عبر القنوات الرسمية دون إحداث توتر غير ضروري مع الأطراف المعنية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاتصال بالمدير السابق: قد لا يكون متاحًا أو لا يعطي الحل المناسب.\n- الاتصال بمقدمي الخدمة مباشرة: ليس من اختصاص مدير المشروع وحده.\n- الإبلاغ للجنة الأخلاقيات: تصعيد كبير قد يكون غير ضروري قبل تقييم الإدارة العليا.",
      "choices": [
        {
          "text": "الاتصال بالمدير السابق لفهم سبب اتباع نهج شراء غير اعتيادي.",
          "correct": false
        },
        {
          "text": "الاتصال بمقدمي الخدمة لمناقشة الانحراف ومطالبتهم بحل المشكلة.",
          "correct": false
        },
        {
          "text": "الإبلاغ عن مقدمي الخدمة والمدير السابق للجنة الأخلاقيات في المؤسسة.",
          "correct": false
        },
        {
          "text": "وضع علامة على عملية الشراء غير المعتادة كمشكلة حرجة لعرضها على الإدارة العليا.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مدير مشروع بمعالجة مخاوف مالك المنتج بشأن تسليم المنتج القابل للإصدار (MVP) في السبرنت الرابع.\n\nأي من المقاييس التالية يجب على مدير المشروع استخدامها؟",
      "explanation": "في بيئة المشاريع الرشيقة، يتم استخدام مقاييس محددة لمتابعة التقدم.\n\n- لماذا الخيار الصحيح؟\nمعدل التناقص (Burndown Rate) يعكس تقدم الفريق في استكمال العمل المتبقي مقارنة بالوقت المتبقي، ما يساعد على تقييم احتمالية إكمال المنتج القابل للإصدار (MVP) في الإطار الزمني المحدد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مؤشر الأداء المجدول (SPI) ومؤشر تكلفة الجدول الزمني (SCI): يستخدمان في منهجية القيمة المكتسبة (EVM) أكثر من المشاريع الرشيقة.\n- تحليل المخاطر النوعي: أداة تحليل وليست مقياسًا مباشرًا لسرعة الإنجاز.",
      "choices": [
        {
          "text": "مؤشر الأداء المجدول (SPI)",
          "correct": false
        },
        {
          "text": "مؤشر تكلفة الجدول الزمني (SCI)",
          "correct": false
        },
        {
          "text": "معدل التناقص (Burndown Rate)",
          "correct": true
        },
        {
          "text": "تحليل المخاطر النوعي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم إعلام مدير مشروع في شركة تصنيع بفشل المعدات التي تم تسليمها خلال الاختبارات الأولية.\n\nفشلت الآلة في الامتثال لمواصفات التصميم القياسية، مما أدى إلى أعطال ومخاوف تتعلق بالسلامة.\n\nما الذي يجب على مدير المشروع فعله أولاً لمعالجة هذه المشكلة؟",
      "explanation": "عند مواجهة فشل في المعدات أثناء الاختبارات، يجب تحليل الأسباب بشكل منهجي.\n\n- لماذا الخيار الصحيح؟\nمراجعة إجراءات الاختبار الأولي والتنفيذ تساعد على التأكد مما إذا كان هناك خلل في طريقة الاختبار أو إذا كانت النتائج حقيقية وتعكس مشكلة في المنتج.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقييم العوامل البيئية والفردية: يتم لاحقًا إذا لم يُكتشف سبب مباشر.\n- تقييم الوثائق الفنية: خطوة مهمة لكنها تأتي بعد التأكد من صحة إجراءات الاختبار.\n- التحقق من الاتصالات: ليس الإجراء الأول عند وجود مشكلة فنية ملموسة.",
      "choices": [
        {
          "text": "مراجعة إجراءات الاختبار الأولي والتنفيذ.",
          "correct": true
        },
        {
          "text": "تقييم العوامل البيئية والفردية.",
          "correct": false
        },
        {
          "text": "تقييم الوثائق الفنية للآلة.",
          "correct": false
        },
        {
          "text": "التحقق من الاتصالات بين أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة مشروعًا هجينًا جديدًا للامتثال للوائح الحكومية. حدد الفريق سرعة قدرها 50 نقطة قصة لكل تكرار. يستغرق كل تكرار أسبوعًا واحدًا.\n\nيريد الراعي معرفة متى سينتهي المشروع إذا بقي 1500 نقطة قصة.",
      "explanation": "لحساب مدة المشروع، يتم قسمة نقاط القصة المتبقية على السرعة.\n\n- لماذا الخيار الصحيح؟\n1500 ÷ 50 = 30 تكرار. وبما أن كل تكرار أسبوع واحد، فهذا يعادل 30 أسبوعًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 15 أسبوعًا، 4 أسابيع، أسبوع واحد: حسابات غير صحيحة ولا تتطابق مع معطيات السرعة والعدد الكلي للنقاط.",
      "choices": [
        {
          "text": "30 أسبوعًا",
          "correct": true
        },
        {
          "text": "15 أسبوعًا",
          "correct": false
        },
        {
          "text": "4 أسابيع",
          "correct": false
        },
        {
          "text": "أسبوع واحد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستخدم فريق سكرم نهجًا هجينًا بتكرارات مدتها أسبوعين. من المقرر إصدار المنتج القابل للإصدار (MVP) في نهاية التكرار الحالي، وقد أكمل الفريق الميزات الأساسية والميزات ذات الأولوية المتوسطة؛ ومع ذلك، لا تزال بعض الميزات ذات الأولوية الأخرى قيد التطوير.\n\nيستعد مدير المشروع لتقرير شهري للجنة التوجيهية.\n\nما الذي يجب على مدير المشروع أن يوصي به؟",
      "explanation": "في مشاريع تطوير البرمجيات الرشيقة، خاصة باستخدام إطار سكرم، من المهم فهم أن الحد الأدنى للمنتج القابل للإصدار (MVP) يركز على تقديم القيمة الأساسية التي تلبي الحد الأدنى من متطلبات العملاء. يتم إصدار المنتج حتى لو لم تُكمل جميع الميزات الثانوية أو الأقل أولوية بعد، وذلك لضمان تسريع الحصول على ملاحظات العملاء وتحسينات مستمرة في النسخ التالية.\n\n- لماذا الخيار الصحيح؟\nإكمال مراجعة التكرار وإصدار المنتج القابل للإصدار بالميزات المكتملة يسمح للفريق بالتركيز على تسليم القيمة الحالية ويعطي فرصة لأصحاب المصلحة لتقييم المنتج بناءً على ما تم إنجازه بالفعل. هذا يعزز مبدأ التسليم المستمر في المشاريع الرشيقة ويقلل من التأخيرات غير الضرورية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعادة جدولة مراجعة الإصدار حتى اكتمال جميع الميزات المتفق عليها يؤدي إلى تأخير تسليم القيمة ويخالف مبادئ الرشاقة.\n- تحديث خطة إدارة المشروع لتضمين فقط الميزات المكتملة قد يؤدي إلى تغييرات غير مبررة في نطاق المشروع وفقدان التوثيق الصحيح.\n- طلب موارد إضافية قد يكون غير ضروري في هذه المرحلة وقد يسبب زيادة في التكاليف دون ضمان فائدة مباشرة.",
      "choices": [
        {
          "text": "إعادة جدولة مراجعة إصدار المنتج القابل للإصدار حتى تكتمل جميع الميزات المتفق عليها.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة المشروع لتضمين فقط الميزات المكتملة في الإصدار.",
          "correct": false
        },
        {
          "text": "إكمال مراجعة التكرار وإصدار المنتج القابل للإصدار بالميزات المكتملة.",
          "correct": true
        },
        {
          "text": "تقدير الجهد المطلوب وتقديم طلب تغيير لإضافة المزيد من الموارد إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء التحقق من التسليمات، يدرك مدير المشروع أن أحد أعضاء الفريق استخدم إصدارًا أقدم من وثيقة تعريف النطاق، مما تسبب في أخطاء كبيرة.\n\nما الذي يجب على مدير المشروع فعله لإدارة هذا الموقف؟",
      "explanation": "عندما يتم استخدام إصدار قديم من وثيقة تعريف النطاق، يحدث تداخل وعدم توافق يؤدي إلى أخطاء في التنفيذ يمكن أن تؤثر سلبًا على جودة التسليمات ورضا العملاء.\n\n- لماذا الخيار الصحيح؟\nتنفيذ عملية التحكم في التغيير يُعد الخطوة الرسمية والمهيكلة لمعالجة المشكلة. من خلال هذه العملية، يمكن توثيق الأخطاء، تصحيحها، والحصول على موافقات رسمية على التعديلات المطلوبة، مما يحافظ على تكامل المشروع ويمنع تكرار الأخطاء.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مناقشة التسليمات خلال الاجتماع القادم غير كافية لمعالجة الخطأ بفعالية ولا توفر تعقبًا رسميًا.\n- تحديث سجل الوثائق فقط دون تنفيذ عملية رسمية قد يترك الثغرات ويزيد من خطر الأخطاء المستقبلية.\n- مشاركة النسخة المحدثة مع الفريق إجراء وقائي ولكنه لا يعالج الخطأ الحاصل في التسليمات الحالية ولا يمنع تكراره.",
      "choices": [
        {
          "text": "مناقشة التسليمات الأخيرة خلال الاجتماع القادم.",
          "correct": false
        },
        {
          "text": "تحديث سجل وثائق المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية التحكم في التغيير.",
          "correct": true
        },
        {
          "text": "مشاركة النسخة المحدثة من وثيقة تعريف النطاق مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع الوقوف اليومي، أبلغ أحد أعضاء الفريق أن قصة المستخدم التي كانت جزءًا من تخطيط السبرنت أصبحت غير صالحة بسبب تغيير في السياسة تم الإعلان عنه مؤخرًا.\n\nما الذي يجب أن يفعله مدير المشروع استجابةً لهذا الموقف؟",
      "explanation": "في بيئة العمل الرشيقة، التكيف مع التغيير هو مبدأ أساسي لضمان نجاح المشروع وتقديم قيمة مستمرة. عندما تتغير المتطلبات أو الظروف مثل تعديل سياسة تؤثر على قصة مستخدم ما، يجب التعامل مع ذلك بمرونة وفعالية.\n\n- لماذا الخيار الصحيح؟\nإغلاق قصة المستخدم التي لم تعد صالحة بسبب تغيير السياسة يمنع إضاعة الوقت والموارد على عمل غير ذي قيمة أو غير متوافق مع متطلبات المشروع الجديدة. كما أنه يوضح التغيير لجميع أعضاء الفريق ويتيح لهم التركيز على المهام ذات الأولوية الحالية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إزالة قصة المستخدم من السبرنت وجدولتها للسبرنت التالي قد يسبب تنفيذ عمل غير ضروري إذا كانت القصة لم تعد ذات معنى.\n- إبلاغ أصحاب المصلحة بعدم تعديل القصص المتعهد بها يتعارض مع مبدأ التكيف المرن مع المتغيرات.\n- إزالة القصة وطلب تسريع السبرنت الحالي لا يعالج السبب الجذري للمشكلة وقد يؤدي إلى ضغط غير مبرر على الفريق.",
      "choices": [
        {
          "text": "إغلاق قصة المستخدم المتعلقة بتغيير السياسة وشرح أنها لم تعد صالحة.",
          "correct": true
        },
        {
          "text": "إزالة قصة المستخدم من السبرنت الحالي وجدولتها للسبرنت التالي.",
          "correct": false
        },
        {
          "text": "إبلاغ أصحاب المصلحة بأن قصص المستخدم المتعهد بها في السبرنت لا يمكن تعديلها.",
          "correct": false
        },
        {
          "text": "إزالة قصة المستخدم من السبرنت وطلب من الفريق تسريع إكمال السبرنت الحالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع جديد. يختلف اثنان من الموارد الرئيسية في المشروع حول أحد المتطلبات.\n\nيرغب مدير المشروع في فهم وجهتي النظر، لكن أحد الموارد غير راغب في الاجتماع معه.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "في إدارة المشاريع، النزاعات بين الأعضاء أمر شائع، ويتطلب حلها الرجوع إلى القواعد المتفق عليها لضمان النزاهة والشفافية.\n\n- لماذا الخيار الصحيح؟\nالرجوع إلى قواعد الفريق ورؤية المشروع يساعد مدير المشروع على التعامل مع النزاع بطريقة موضوعية ومنظمة، ويشجع على حل الخلافات ضمن الأطر المتفق عليها، مما يعزز التعاون والثقة داخل الفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد المشكلة إلى راعي المشروع يمكن أن يظهر ضعفًا في مهارات إدارة النزاعات لدى مدير المشروع.\n- قبول موقف المورد الأعلى رتبة قد يسبب شعورًا بالظلم أو تحيزًا بين الأعضاء.\n- مراجعة الأصول التنظيمية للعمليات (OPA) غير مناسبة هنا لأنها لا تحل النزاعات الشخصية أو الخلافات بين الموارد.",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى راعي المشروع.",
          "correct": false
        },
        {
          "text": "قبول موقف المورد الأعلى رتبة.",
          "correct": false
        },
        {
          "text": "مراجعة الأصول التنظيمية للعمليات (OPA).",
          "correct": false
        },
        {
          "text": "الرجوع إلى قواعد الفريق ورؤية المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد في مشروع في مرحلة التنفيذ. انتهى المشروع للتو من تسليمات المرحلة الأولى.\n\nخلال ورشة عمل لمراجعة نطاق المرحلة الثانية من المشروع، اشتكى بعض أصحاب المصلحة من أنهم لم يتم إبلاغهم بالفوائد التي تم تحقيقها.\n\nما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
      "explanation": "تواصل أصحاب المصلحة الفعال ضروري لنجاح المشروع ورضا الأطراف المعنية.\n\n- لماذا الخيار الصحيح؟\nتسجيل المشكلة في سجل القضايا، مناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات يضمن معالجة المشكلة بشكل منهجي ومنسق مع الفريق المعني، مع تحسين التواصل المستقبلي لتلبية توقعات أصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد المشكلة إلى اللجنة التوجيهية أو الراعي دون محاولة حلها داخليًا قد يؤدي إلى تأخير أو تعقيد الإدارة.\n- تحديث خطة إدارة المخاطر لا يعالج مشكلة التواصل بشكل مباشر.",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى اللجنة التوجيهية لأن الراعي كان يجب أن يبلغ أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الراعي لأن السؤال جاء من بعض كبار أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تسجيل المشكلة في سجل القضايا، مناقشتها مع مدير التغيير، وتحديث خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "تسجيل المشكلة في السجل، مراجعة مصفوفة أصحاب المصلحة، وتحديث خطة إدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع لمشروع بناء تم إبلاغه أن تصريحًا مطلوبًا من الحكومة المحلية لم يتم الحصول عليه بعد.\n\nالتقدم للحصول على التصريح سيؤخر تسليم المشروع 21 يومًا بتكلفة 40,000 دولار أمريكي. الغرامة لعدم وجود التصريح هي 1,900 دولار يوميًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "في إدارة المخاطر، يجب تقييم الخيارات بناءً على التكلفة والفائدة القانونية والامتثال.\n\n- لماذا الخيار الصحيح؟\nالتقدم للحصول على التصريح وتأخير تسليم المشروع 21 يومًا هو الخيار الأفضل لأن الغرامة اليومية ستتراكم وتصبح أكثر تكلفة من التأخير، بالإضافة إلى أن عدم الامتثال قد يؤدي إلى مشاكل قانونية أكبر تؤثر على المشروع ومستقبله.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تجاهل متطلبات التصريح يعرض المشروع لمخاطر قانونية ومالية كبيرة.\n- محاولة التفاوض للحصول على إعفاء قد لا تكون ممكنة أو فعالة، وقد تؤخر المشروع أكثر.\n- تخصيص مبلغ الغرامة كنفقات إضافية يستهين بالمخاطر القانونية ولا يعالج السبب الأساسي للمشكلة.",
      "choices": [
        {
          "text": "التقدم للحصول على التصريح وتأخير تسليم المشروع 21 يومًا.",
          "correct": true
        },
        {
          "text": "تجاهل متطلبات التصريح والمتابعة في تنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "محاولة التفاوض مع الحكومة المحلية للحصول على إعفاء.",
          "correct": false
        },
        {
          "text": "تخصيص مبلغ الغرامة كنفقات إضافية للمشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في صناعة منظمة، والفريق يعمل على مشروع يتم فيه ترتيب المتطلبات في سجل المنتج (Backlog).\n\nتم تحديد الحد الأدنى من المنتج القابل للإصدار (MVP). يعلم مدير المشروع أن الجهة التنظيمية للمشروع تطلب نموذجًا أوليًا للتفتيش قبل إطلاق المنتج، ولم يتم تضمين النموذج الأولي في تعريف MVP.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "في المشاريع التي تتطلب الامتثال التنظيمي، من الضروري تضمين الأنشطة التنظيمية في خطة العمل لضمان تلبية المتطلبات القانونية وعدم تأخير إطلاق المنتج.\n\n- لماذا الخيار الصحيح؟\nالتحدث مع مالك المنتج لإعطاء أولوية لأنشطة الامتثال في سجل المنتج (Backlog) يساعد على ضمان أن النموذج الأولي المطلوب يتم أخذه بعين الاعتبار ضمن خطة التسليم، دون إحداث تغييرات جذرية على تعريف MVP، مع المحافظة على أولويات العمل والتركيز على القيمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد المتطلبات المفقودة وإدراج العمل مباشرة وتعيين الفريق قد يؤدي إلى تغييرات غير منظمة وغير متفق عليها ضمن الفريق.\n- إعادة جدولة إطلاق المنتج قد تسبب تأخيرات غير ضرورية إذا تم التعامل مع الأولويات بشكل صحيح.\n- إنشاء تعريف جديد لـ MVP يعد تغييرًا كبيرًا قد يسبب تعقيدات في التخطيط والتواصل مع الفريق.",
      "choices": [
        {
          "text": "التحدث مع مالك المنتج لإعطاء أولوية لأنشطة الامتثال في سجل المنتج لتقديم النموذج الأولي إلى الجهة التنظيمية.",
          "correct": true
        },
        {
          "text": "تحديد المتطلبات المفقودة، وإدراج العمل التنظيمي مباشرة في سجل المنتج، وتعيين العمل للفريق.",
          "correct": false
        },
        {
          "text": "إعادة جدولة إطلاق المنتج حتى يتمكن الفريق من إنتاج نموذج أولي للتفتيش كما هو مطلوب.",
          "correct": false
        },
        {
          "text": "إنشاء تعريف جديد لـ MVP يتضمن متطلبات النموذج الأولي المطلوب وترتيب أولوياته مع الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع على وشك الانتهاء، ويريد العميل الاحتفال بالنجاح من خلال مشاركة دراسة حالة توضح الفوائد التي أنشأها المشروع. يشعر مدير المشروع والفريق بعدم الارتياح بشأن مشاركة دراسة حالة في هذه المرحلة.\n\nما هو الإجراء الأنسب الذي يجب على مدير المشروع اتخاذه؟",
      "explanation": "إدارة توقعات العملاء مهمة للحفاظ على علاقة مهنية وفعالة.\n\n- لماذا الخيار الصحيح؟\nالاعتراف بطلب العميل مع التأكيد على محدودية دراسة الحالة في هذه المرحلة يظهر الاحترام لرغبات العميل مع توضيح أن الوقت أو المعلومات المتاحة قد لا تكون كافية لإنشاء دراسة حالة متكاملة، مما يحافظ على الشفافية ويمنع التوقعات غير الواقعية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التعاون لإنشاء دراسة حالة دون الاستعداد المناسب قد يؤدي إلى نتائج ضعيفة تؤثر سلبًا على سمعة المشروع.\n- إحالة العميل إلى فريق المشروع قد يسبب التباسًا في المسؤوليات ويظهر نقصًا في التواصل من مدير المشروع.\n- إبلاغ العميل بأن إعداد دراسة الحالة يحتاج موارد إضافية قد يُفهم على أنه رفض أو تعقيد غير ضروري.",
      "choices": [
        {
          "text": "التعاون مع العميل لإنشاء دراسة حالة تسلط الضوء على فوائد المشروع.",
          "correct": false
        },
        {
          "text": "الاعتراف بالطلب ولكن التأكيد على محدودية دراسة الحالة في هذه المرحلة.",
          "correct": true
        },
        {
          "text": "إحالة العميل إلى فريق المشروع للحصول على تفاصيل الفوائد التي حققها المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بأن إعداد دراسة حالة سيتطلب عملاً وموارد إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع داخلي لمكتب إدارة المشاريع (PMO) في المؤسسة. تم رعاية المشروع في البداية من قبل قائد مكتب إدارة المشاريع السابق الذي تم استبداله لاحقًا. القائد الجديد لا يرى قيمة كبيرة في المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الحفاظ على رعاية ودعم القيادة أمر حاسم لنجاح المشروع.\n\n- لماذا الخيار الصحيح؟\nاستخدام الفوائد التي تم تتبعها طوال المشروع لإثبات قيمة المشروع يوفر أدلة ملموسة للقائد الجديد حول أهمية المشروع ويعزز فرص استمرار الدعم والرعاية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تنظيم اجتماع انطلاق جديد قد لا يكون كافيًا لإقناع القائد الجديد إذا لم يتم تقديم بيانات واضحة.\n- الاعتماد فقط على البيانات السابقة قد لا يكون كافيًا إذا لم يتم توصيلها بشكل فعال.\n- مواصلة المشروع دون معالجة موقف القائد الجديد قد يؤدي إلى فقدان الدعم أو إلغاء المشروع لاحقًا.",
      "choices": [
        {
          "text": "تنظيم اجتماع انطلاق جديد للمشروع مع القائد الجديد لمكتب إدارة المشاريع وفريق المشروع.",
          "correct": false
        },
        {
          "text": "استخدام البيانات السابقة للحصول على رعاية المشروع من القائد الجديد نظرًا لأن المشروع كان فعالًا.",
          "correct": false
        },
        {
          "text": "استخدام الفوائد التي تم تتبعها طوال المشروع لإثبات قيمة المشروع.",
          "correct": true
        },
        {
          "text": "مواصلة المشروع كما هو مخطط له لأنه تم اعتماده بالفعل وهو قيد التنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع قيد التنفيذ حاليًا. تم إبلاغ مدير المشروع بوجود عملية جديدة قد تكون مفيدة إذا تم دمجها في المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عند استلام فكرة أو عملية جديدة أثناء تنفيذ المشروع، من المهم تقييم القيمة التي تضيفها هذه العملية قبل اتخاذ أي إجراء.\n\n- لماذا الخيار الصحيح؟\nتحديد فائدة التغيير أولًا يساعد مدير المشروع على فهم مدى تأثير العملية الجديدة على أهداف المشروع ونتائجه قبل تنفيذها، مما يمنع إدخال تغييرات غير ضرورية أو تسبب تعقيدات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقييم كيفية دمج العملية بدون فهم فائدتها قد يهدر الوقت والجهد.\n- إصدار أمر أولوية لإجراء التغيير قبل التقييم قد يسبب اضطرابات ويزيد المخاطر.\n- تعديل وثيقة المتطلبات بدون تحديد الفائدة قد يؤدي إلى تغييرات غير مبررة.",
      "choices": [
        {
          "text": "تقييم كيفية دمج العملية الجديدة.",
          "correct": false
        },
        {
          "text": "إصدار أمر أولوية لإجراء التغيير.",
          "correct": false
        },
        {
          "text": "تحديد فائدة التغيير.",
          "correct": true
        },
        {
          "text": "تعديل وثيقة المتطلبات للتغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء ورشة عمل لتصميم روبوت جديد، سأل المهندسون مدير المشروع عن بروتوكولات السلامة والبيئة لإجراءات تشغيله.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "توفير المعلومات الدقيقة والموثوقة للفريق أمر ضروري لنجاح المشروع وضمان الامتثال للمعايير.\n\n- لماذا الخيار الصحيح؟\nتزويد الفريق بأصول العمليات التنظيمية وميثاق المشروع يضمن حصول المهندسين على الإرشادات الرسمية والمعايير المعتمدة التي يجب الالتزام بها في التصميم والتشغيل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- توظيف مهندس متخصص قد يكون مكلفًا وغير ضروري إذا كانت الأصول التنظيمية متوفرة.\n- الرجوع إلى وثائق الدروس المستفادة قد لا يغطي المتطلبات الحالية بشكل كامل.\n- إجراء مقارنة معيارية قد يستغرق وقتًا أطول ولا يقدم المعلومات الفورية المطلوبة.",
      "choices": [
        {
          "text": "توظيف مهندس متخصص لدعم فريق التصميم.",
          "correct": false
        },
        {
          "text": "تزويد الفريق بأصول العمليات التنظيمية وميثاق المشروع.",
          "correct": true
        },
        {
          "text": "الرجوع إلى وثائق الدروس المستفادة من مشاريع مشابهة.",
          "correct": false
        },
        {
          "text": "إجراء مقارنة معيارية مع مصانع مماثلة لجمع قيود الامتثال الخاصة بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء جلسة تخطيط المشروع، يحاول مدير المشروع تحديد خطة إصدار لتحقيق تقديم قيمة متسقة وكسب رضا العميل. اقترح أحد أصحاب المصلحة الكبار إصدار المنتج في نهاية المشروع حتى يرى العميل جميع الميزات دفعة واحدة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "تسليم المنتج تدريجيًا عبر إصدارات متكررة يسمح بجمع ملاحظات العملاء وتحسين المنتج بشكل مستمر.\n\n- لماذا الخيار الصحيح؟\nاقتراح تسليم المنتج على مدار عدة تكرارات يعزز من رضا العميل من خلال تلبية احتياجاته بشكل مستمر وتجنب المخاطر المرتبطة بتأخير التسليم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب اقتراح جدول إصدار حسب تعقيد الميزات قد يكون غير كافٍ بدون التركيز على القيمة والتغذية الراجعة.\n- اقتراح إصدارات محددة دون مرونة قد لا يلبي تطورات المشروع.\n- إنشاء خطط إصدار لكل ميزة بشكل منفصل قد يسبب تعقيدات إدارية ويعطل سير العمل.",
      "choices": [
        {
          "text": "طلب من فريق المشروع اقتراح جدول إصدار بناءً على تعقيد الميزات المحددة.",
          "correct": false
        },
        {
          "text": "اقتراح ثلاث إصدارات: واحدة في البداية، وأخرى في المنتصف، وأخرى في نهاية المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء خطط إصدار لكل مرة يتم فيها تسليم ميزة منتج لإجراء اختبارات الجودة والمراجعات.",
          "correct": false
        },
        {
          "text": "اقتراح تسليم المنتج على مدار عدة تكرارات لجمع ملاحظات العملاء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد تسعة أشهر، تنتهي المرحلة الأولى من المشروع بإطلاق منتج جديد للعميل. يشعر العميل بعدم الرضا ويذكر أن العديد من الميزات الأساسية مفقودة.\n\nما الذي يجب أن يفعله مدير المشروع أولاً لمعالجة هذه المشكلة؟",
      "explanation": "في حالة عدم رضا العميل بسبب ميزات مفقودة، يجب على مدير المشروع أولاً مراجعة خطة المشروع والنطاق لتحديد ما إذا كانت الميزات المفقودة قد تم تضمينها ضمن النطاق الأصلي أم لا.\n\n- لماذا الخيار الصحيح؟\nمراجعة خطة المشروع تساعد على فهم ما إذا كانت الميزات المفقودة قد تم الاتفاق عليها مسبقًا أو أُضيفت لاحقًا، مما يحدد الخطوات التالية المناسبة للتعامل مع المشكلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقييم الميزات مع العميل ووضع خطة إدراجها بدون فهم النطاق الدقيق قد يؤدي إلى سوء تفاهم.\n- طلب تمويل إضافي أو إعادة بدء المشروع قد يكون مبكرًا وغير مبرر قبل فهم المشكلة بدقة.",
      "choices": [
        {
          "text": "تقييم الميزات المفقودة مع العميل وتطوير خطة لإدراجها في المرحلة التالية التي تستمر تسعة أشهر.",
          "correct": false
        },
        {
          "text": "مراجعة خطة المشروع لتحديد ما إذا كانت الميزات المفقودة جزءًا من النطاق الأصلي أو تمت إضافتها لاحقًا.",
          "correct": true
        },
        {
          "text": "طلب تمويل إضافي لتقليل دورة الإصدار الحالية حتى يتمكن الفريق من تقديم القيمة في وقت أقرب.",
          "correct": false
        },
        {
          "text": "إعادة بدء المشروع باستخدام دورة حياة رشيقة ودمج إنشاء منتج قابل للإصدار (MVP).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في مؤسسة مصفوفية ويدير مشروعًا من المقرر إكماله خلال شهر واحد. في اجتماع المشروع اليوم، أُبلغ مدير المشروع أن الأخطاء في كود البرنامج تتزايد باستمرار. وأثناء مناقشة الأمر مع قائد فريق التطوير، قيل له إن ذلك أمر طبيعي عند محاولة الالتزام بالجدول الزمني. يضغط فريق التطوير للمضي قدمًا حتى لا يفوّت الموعد النهائي، لكن مدير المشروع قلق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "عندما تظهر مشاكل في جودة المنتج، من المهم أن يتحقق مدير المشروع من أن المشروع لا يتنازل عن معايير الجودة.\n\n- لماذا الخيار الصحيح؟\nفحص مقاييس الجودة يساعد مدير المشروع على تقييم ما إذا كان المشروع يفي بمعايير الجودة الموثقة، ومن ثم اتخاذ الإجراءات المناسبة إذا كانت هناك انحرافات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث هيكل تقسيم العمل وتمديد الجدول الزمني بدون تقييم الجودة قد يؤدي إلى تأخير غير مبرر.\n- دفع الفريق للاستمرار قد يزيد من الأخطاء ويؤثر سلبًا على المنتج.\n- طلب تغيير لتمديد الموعد النهائي قد يكون ضروريًا لاحقًا، لكن يجب أولًا تقييم الوضع بدقة.",
      "choices": [
        {
          "text": "تحديث هيكل تقسيم العمل (WBS) وتمديد الفترات الزمنية في جدول المشروع للسماح بمزيد من الوقت للتطوير.",
          "correct": false
        },
        {
          "text": "توجيه الفريق لمواصلة التطوير لتجنب تفويت الموعد النهائي، مع ملاحظة أن الخطر قد تم التخفيف منه.",
          "correct": false
        },
        {
          "text": "فحص مقاييس الجودة لتحديد ما إذا كان المشروع يمتثل لمتطلبات الجودة الموثقة.",
          "correct": true
        },
        {
          "text": "تقديم طلب تغيير من خلال عملية التحكم بالتغييرات لتمديد الموعد النهائي، مما يسمح بمزيد من الوقت للتطوير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمتلك المؤسسة سياسة تتطلب من جميع مديري المشاريع إجراء تدقيق موحد شهريًا على مشروع لمدير مشروع آخر. بعد مراجعة أحد التدقيقات، اشتكى أعضاء الفريق من أن المراجع لم يراجع تسليماتهم بعدالة. راجع مدير المشروع نتائج التدقيق ووافق على النتائج.\n\nما الذي يجب أن يفعله مدير المشروع لمعالجة هذا الوضع؟",
      "explanation": "من المهم توضيح سبب التدقيقات وكيفية إجرائها للحفاظ على الشفافية والعدالة.\n\n- لماذا الخيار الصحيح؟\nتوضيح أن التدقيقات تُجرى بناءً على معايير موحدة يعزز الثقة بين أعضاء الفريق ويبرر الإجراءات المتبعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقليل تواتر التدقيقات أو استخدام اجتماعات حالة بدلاً منها قد يقلل من الرقابة الضرورية.\n- الإبلاغ عن المراجع دون أدلة كافية قد يسبب مشاكل إدارية غير مبررة.",
      "choices": [
        {
          "text": "طلب أن تُجرى التدقيقات الإلزامية بتواتر أقل.",
          "correct": false
        },
        {
          "text": "استخدام اجتماعات الحالة لمراجعة التسليمات بدلاً من التدقيقات الرسمية.",
          "correct": false
        },
        {
          "text": "توضيح أن التدقيقات تُجرى بناءً على مقاييس معيارية موحدة.",
          "correct": true
        },
        {
          "text": "الإبلاغ عن مدير المشروع الذي أجرى التدقيق غير العادل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقع المقر الرئيسي لشركة متعددة الجنسيات في أوروبا، مع العديد من المكاتب الإقليمية في دول أخرى حول العالم. قرر مدير العمليات في أحد المكاتب الإقليمية إنشاء مكتب إدارة مشاريع (PMO). تم اختيار مدير مشروع لإدارة المشروع، والذي لا يزال في مراحله الأولى. يحتاج مدير المشروع إلى مواءمة توقعات أصحاب المصلحة مع فوائد عملية المشروع والاستراتيجية التجارية.\n\nأي وثيقة يجب أن يطورها مدير المشروع لهذا الغرض؟",
      "explanation": "وثيقة ميثاق المشروع هي التي توضح بشكل رسمي أهداف المشروع، نطاقه، وأصحاب المصلحة الرئيسيين، بالإضافة إلى ارتباط المشروع بأهداف واستراتيجية المنظمة.\n\n- لماذا الخيار الصحيح؟\nالميثاق هو الوثيقة الأساسية التي تخلق توافقًا بين أصحاب المصلحة وتوضح الفوائد المتوقعة من المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل الجدوى يدرس إمكانية المشروع لكنه لا يحقق المواءمة بين التوقعات الحالية.\n- خطة إدارة الفوائد تركز على تتبع الفوائد بعد الموافقة على المشروع.\n- خطة إدارة المشروع تفصيلية للتنفيذ ولا تُستخدم كوثيقة تأسيسية أولية.",
      "choices": [
        {
          "text": "تحليل الجدوى التجارية (Business Case)",
          "correct": false
        },
        {
          "text": "خطة إدارة الفوائد (Benefits Management Plan)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": true
        },
        {
          "text": "خطة إدارة المشروع (Project Management Plan)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم مؤخرًا بيع الجزء الأكبر من شركة محلية إلى شركة دولية. وتفرض الشركة الأم الجديدة استخدام لوائح الصحة والسلامة والبيئة (HSE) على جميع المشاريع في الشركة المحلية.\n\nما الذي يجب أن يفعله مديرو المشاريع للبقاء ممتثلين؟",
      "explanation": "في هذا السيناريو، يجب على مدير المشروع أن يتواصل بشكل مباشر مع فريق HSE لفهم تأثير اللوائح الجديدة على المشاريع. هذا يضمن:\n- فهم دقيق للمتطلبات التنظيمية الجديدة.\n- التعاون المبكر لتعديل خطط المشروع بما يتوافق مع اللوائح.\n- تقليل مخاطر عدم الامتثال التي قد تسبب غرامات أو تأخيرات.\n\nالخيارات الأخرى غير مناسبة لأن:\n- الانتظار لتلقي المعلومات من الإدارة الوظيفية يعني تأخير وعدم استجابة سريعة.\n- طلب تعيين عضو جديد بدون فهم متعمق قد لا يعالج المشكلة.\n- التحدث مع الراعي للحصول على توضيح فقط لا يكفي لمعالجة التأثيرات العملية لللوائح الجديدة.",
      "choices": [
        {
          "text": "الانتظار حتى تقوم الإدارة الوظيفية المسؤولة عن اللوائح بإبلاغهم بتغيير العملية.",
          "correct": false
        },
        {
          "text": "طلب من الإدارة المسؤولة عن لوائح HSE تعيين عضو جديد في الفريق.",
          "correct": false
        },
        {
          "text": "التحدث مع راعي المشروع للحصول على توضيح بشأن اللوائح الجديدة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق HSE لفهم تأثير اللوائح الجديدة على المشاريع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع بإنهاء أحد المشاريع، ويطلب الراعي رؤى حول تحقيق الفوائد. كيف يمكن لمدير المشروع حساب قيمة نتائج المشروع؟",
      "explanation": "لحساب قيمة نتائج المشروع بشكل صحيح، يجب على مدير المشروع تقييم الفوائد النوعية والكمية للمشروع، وهذا يشمل:\n- الفوائد النوعية مثل تحسين رضا العملاء، أو تعزيز صورة الشركة.\n- الفوائد الكمية مثل زيادة الأرباح أو تقليل التكاليف.\n\nالخيارات الأخرى أقل دقة لأن:\n- تسعير الفوائد الملموسة فقط لا يأخذ في الاعتبار الفوائد غير الملموسة.\n- التقييم المالي الاستعادي فقط يحلل الماضي دون النظر إلى القيمة الشاملة.\n- مقارنة النتائج بالميزانية لا تعكس قيمة الفوائد المحققة.",
      "choices": [
        {
          "text": "تقييم الفوائد النوعية والكمية للمشروع.",
          "correct": true
        },
        {
          "text": "تسعير الفوائد الملموسة وتقسيمها على النفقات.",
          "correct": false
        },
        {
          "text": "إجراء تقييم مالي استعادي.",
          "correct": false
        },
        {
          "text": "تقييم النتائج ومقارنتها بالميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت شركة تشكيل فرق رشيقة (Agile) داخل المؤسسة لتحسين نتائج المشاريع والاستفادة من الفرص الجديدة في السوق. تم توظيف مدير مشروع يتمتع بخبرة واسعة في المنهجيات الرشيقة للإشراف على العملية.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "عندما تبدأ الشركة بتطبيق فرق رشيقة جديدة، الخطوة الأولى التي يجب على مدير المشروع القيام بها هي تحديد المعايير اللازمة لإطلاق المشاريع الرشيقة. هذا يشمل:\n- وضع إطار عمل واضح ومحدد للفرق الرشيقة يتناسب مع ثقافة الشركة وأهدافها.\n- تحديد السياسات، المعايير، والإجراءات التي ستساعد الفرق على العمل بفعالية داخل بيئة رشيقة.\n- توفير توجيه واضح للفرق حول كيفية تنفيذ الممارسات الرشيقة، مع تحديد الأهداف والقيم المتوقعة.\n\nالخيارات الأخرى ليست البداية الصحيحة لأن:\n- توظيف وتقييم الممارسين الرشيقين يحتاج إلى وجود معايير واضحة أولاً لضمان جودة الاختيار.\n- تنفيذ مكتب إدارة مشاريع رشيقة (Agile PMO) هو خطوة متقدمة بعد تحديد المعايير والعمليات الأساسية.\n- إجراء تحليل استعادي لتجارب المشاريع السابقة قد يفيد، لكنه ليس الأولوية قبل تحديد إطار العمل الحالي.",
      "choices": [
        {
          "text": "توظيف وتعيين وتقييم ممارسي المشاريع الرشيقة الجدد.",
          "correct": false
        },
        {
          "text": "تنفيذ مكتب إدارة مشاريع رشيقة (Agile PMO).",
          "correct": false
        },
        {
          "text": "تحديد المعايير اللازمة لإطلاق المشاريع الرشيقة.",
          "correct": true
        },
        {
          "text": "إجراء تحليل استعادي لتجارب المشاريع السابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريقان A و B على مشروعين رشيقين مختلفين لنفس العميل. يستخدم الفريقان نفس الطريقة لحساب وحدات العمل، وكل تكرار مدته أسبوعان. في أول تكرارين، أكمل الفريق A 150 وحدة عمل وأكمل الفريق B 200 وحدة عمل. يتم إنجاز مهام كلا الفريقين حسب الخطة. أبلغ العميل عن 5 أخطاء لكل وحدة عمل للفريق A و10 أخطاء لكل وحدة عمل للفريق B.\n\nما هو الاستنتاج الذي يجب أن يصل إليه مدير المشروع بخصوص أداء الفريقين؟",
      "explanation": "على الرغم من أن الفريق B أنجز عددًا أكبر من وحدات العمل في نفس الفترة، إلا أن معدل الأخطاء لكل وحدة عمل أعلى بكثير من الفريق A. هذا يشير إلى:\n- جودة العمل التي يقدمها الفريق A أعلى من الفريق B، إذ أن الأخطاء الأقل تعني منتجًا أكثر استقرارًا وموثوقية.\n- الأداء لا يُقاس فقط بكمية العمل المنجز، بل بجودته أيضًا.\n\nالخيارات الأخرى خاطئة لأن:\n- اعتبار الفريق B أفضل بناءً على الإنتاجية فقط يتجاهل جودة العمل وتأثير الأخطاء.\n- القول بأن الأداء متساوٍ يتجاهل اختلاف الجودة الملحوظ.\n- تقييم الأداء بعد تكرارين فقط قد يكون مبكرًا لكنه لا يلغي أهمية جودة النتائج في هذا التقييم الأولي.",
      "choices": [
        {
          "text": "الفريق B يؤدي بشكل أفضل من الفريق A لأنه أكمل عددًا أكبر من وحدات العمل في نفس المدة.",
          "correct": false
        },
        {
          "text": "أنجز الفريقان مهامهما حسب الخطة؛ وبالتالي، فإن أداءهما متساوٍ.",
          "correct": false
        },
        {
          "text": "الفريق A يؤدي بشكل أفضل من الفريق B لأنه يحتوي على عدد أقل من الأخطاء لكل وحدة عمل.",
          "correct": true
        },
        {
          "text": "أنهى الفريقان تكرارين فقط؛ لذا من المبكر تقييم أدائهما.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تكنولوجي معقد في مرحلة التنفيذ. تتم إضافة تقنيات جديدة إلى سجل المنتج استنادًا إلى متطلبات العميل، وهو ما سيؤدي إلى تغييرات كبيرة في المنتج النهائي.\n\nما الذي يجب على مدير المشروع فعله لتلبية توقعات العميل؟",
      "explanation": "عندما يطلب العميل تغييرات كبيرة تؤثر على المنتج النهائي، يجب على مدير المشروع إدارة توقعات العميل بشكل فعال. هذا يشمل:\n- التواصل الواضح مع العميل حول تأثير هذه التغييرات على الجدول الزمني والتكلفة وجودة المنتج.\n- توضيح حدود المشروع ومواءمة توقعات العميل مع احتياجات العمل الفعلية للمؤسسة.\n- توفير بدائل أو حلول وسط عند الحاجة للحفاظ على التوازن بين متطلبات العميل وإمكانيات المشروع.\n\nالخيارات الأخرى غير مناسبة لأن:\n- إعادة تخطيط كل التكرارات والإصدارات قد تكون غير عملية أو تؤدي إلى تأخيرات كبيرة.\n- قبول كل المتطلبات الجديدة بدون إدارة التوقعات يمكن أن يؤدي إلى تجاوز نطاق المشروع بشكل غير مرغوب.\n- دفع الفريق لقبول التحدي فقط قد يجهد الفريق ويؤثر على جودة العمل ورضا العميل.",
      "choices": [
        {
          "text": "إعادة تخطيط التكرارات والإصدارات لتلبية كل توقعات العميل.",
          "correct": false
        },
        {
          "text": "إدارة توقعات العميل بناءً على احتياجات العمل الخاصة بالمؤسسة.",
          "correct": true
        },
        {
          "text": "قبول المتطلبات الجديدة، وجدولة اجتماعات لتخطيط جدول إصدار جديد.",
          "correct": false
        },
        {
          "text": "دفع الفريق إلى زيادة المرونة وقبول التحدي الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعلنت الشركة الأم عن مشروع تكامل لجميع الشركات التابعة لها. يغطي مشروع التكامل أقسام الشؤون القانونية والموارد البشرية والمالية في الشركات التابعة. تستثمر الإدارة العليا في هذا المشروع كأول مشروع رشيق لها وتم تعيين مدير مشروع جديد.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
      "explanation": "في مشروع تكامل معقد يشمل عدة أقسام وشركات، يجب على مدير المشروع تطوير استراتيجية انتقالية (Transition Strategy) أولاً لضمان:\n- تحديد كيفية تنفيذ التغييرات الانتقالية والتكامل بين الأنظمة والعمليات.\n- ضمان استمرارية الأعمال وتقليل المخاطر المرتبطة بالتغيير.\n- تنسيق جهود الفرق المختلفة والمراحل المختلفة للمشروع بشكل متسق.\n\nالخيارات الأخرى أقل أولوية في هذه المرحلة لأن:\n- الاجتماع مع أصحاب المصلحة لمناقشة المخاطر مهم لكنه يأتي بعد وضع استراتيجية واضحة.\n- تطوير ميثاق الفريق يكون بعد فهم الخطة والاستراتيجية العامة.\n- تعزيز نضج الفريق في المنهجيات الرشيقة يأتي مع تقدم المشروع وتنفيذه.",
      "choices": [
        {
          "text": "الاجتماع مع أصحاب المصلحة لمناقشة المخاطر.",
          "correct": false
        },
        {
          "text": "تطوير ميثاق الفريق.",
          "correct": false
        },
        {
          "text": "وضع خطة لتعزيز مستوى نضج الفريق في المنهجيات الرشيقة.",
          "correct": false
        },
        {
          "text": "تطوير استراتيجية انتقالية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا هجينًا بعقد ذو وقت وسعر ثابت. يجد مدير المشروع صعوبة في إقناع الفريق بتقديم جداولهم الزمنية. أبلغ الفريق أن العمل سيتم تسليمه كل أسبوعين، لذا لا حاجة للجداول الزمنية. لكن مدير المشروع يحتاج إلى الجداول الزمنية لإجراء تقييم لتكاليف المشروع.\n\nما الذي يجب على مدير المشروع فعله لضمان تقديم الجداول الزمنية من جميع أعضاء الفريق؟",
      "explanation": "لضمان تعاون الفريق في تقديم الجداول الزمنية، يجب على مدير المشروع شرح تأثير عدم تقديم هذه الجداول على تقييم تكاليف المشروع بشكل واضح. هذا الأسلوب:\n- يعزز وعي الفريق بأهمية تقديم المعلومات في الوقت المناسب.\n- يوضح العلاقة بين الجداول الزمنية وتقييم الأداء والتكلفة، مما قد يحفزهم على الالتزام.\n\nالخيارات الأخرى أقل فعالية لأن:\n- طلب التدخل من مكتب إدارة المشاريع قد لا يكون عمليًا أو فعالًا.\n- إرسال تذكيرات فقط دون توضيح أهمية الجداول الزمنية قد لا يغير سلوك الفريق.\n- تغيير تكرار تقديم الجداول الزمنية دون قبول الفريق قد يثير مقاومة أكبر.",
      "choices": [
        {
          "text": "طلب من مكتب إدارة المشاريع (PMO) التأكد من تقديم الفريق للجداول الزمنية.",
          "correct": false
        },
        {
          "text": "إرسال تذكير أسبوعي لكل عضو في الفريق يطلب فيه تقديم الجداول الزمنية.",
          "correct": false
        },
        {
          "text": "شرح تأثير عدم تقديم الجداول الزمنية على تقييم تكاليف المشروع.",
          "correct": true
        },
        {
          "text": "تغيير تكرار تقديم الجداول الزمنية من كل أسبوعين إلى أسبوعياً.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع لتحسين سجل المنتج، يختلف أحد أصحاب المصلحة من قسم الشؤون القانونية مع مالك المنتج حول أولوية عنصر معين. يقول مالك المنتج إن الأولوية الحالية تضيف أقصى قيمة للمشروع، بينما يقول صاحب المصلحة إن هذا العنصر يجب أن يكون أولوية لأنه مطلب قانوني تنظيمي.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
      "explanation": "في حالة الخلاف بين مالك المنتج وصاحب المصلحة، يجب على مدير المشروع تيسير مناقشة بناءة بين الطرفين لمناقشة وجهات النظر والمخاوف. هذا يساعد على:\n- الوصول إلى فهم مشترك وأولوية متوازنة بين القيمة التجارية والامتثال القانوني.\n- تقليل الصراعات وضمان تعاون فعال.\n- تحسين اتخاذ القرار من خلال الحوار والتفاوض.\n\nالخيارات الأخرى خاطئة لأن:\n- الانصياع لسلطة مالك المنتج فقط قد يؤدي إلى تجاهل مخاوف قانونية مهمة.\n- فحص مواقف سابقة قد لا يعكس الحالة الحالية بدقة.\n- محاولة إقناع مالك المنتج بتغيير الأولوية بدون حوار قد تؤدي إلى مقاومة.",
      "choices": [
        {
          "text": "الانصياع لسلطة مالك المنتج في تحديد الأولويات وتذكير صاحب المصلحة بأن هذه ليست مسؤوليته.",
          "correct": false
        },
        {
          "text": "فحص مواقف سابقة مماثلة في سجل الدروس المستفادة وتحديد الأولوية بناءً على ذلك.",
          "correct": false
        },
        {
          "text": "استخدام تقنيات التفاوض لإقناع مالك المنتج بتغيير الأولوية كما اقترح صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "تيسير مناقشة بين مالك المنتج وصاحب المصلحة لمناقشة وجهات نظرهم ومخاوفهم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "سلسلة متاجر كبيرة في مرحلة تنفيذ مشروع لاستبدال أنظمة الدفع في جميع متاجرها في عدة دول. تم اتباع نهج تنبؤي في تخطيط المشروع، ويتم التنفيذ عبر عدة دورات لكل دولة. توقف التنفيذ في الدولة C بسبب قوانين جديدة تنظم أمان تنفيذ الحل الجديد للدفع.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما لتجنب تأخير كبير في المشروع؟ (اختر اثنين)",
      "explanation": "في حالة وجود قوانين جديدة تؤثر على تنفيذ المشروع في دولة معينة، يجب على مدير المشروع اتخاذ إجراءات استباقية لتقليل التأثير على الجدول الزمني العام:\n\n1. مراقبة الامتثال للقوانين في كل دولة بشكل مستمر لضمان أن أي تغييرات تنظيمية يتم رصدها مبكرًا مما يسمح بالتكيف السريع.\n\n2. توثيق مخاطر الامتثال القانوني في خطة إدارة المشروع للدولة المتأثرة خلال مرحلة التنفيذ والدورات، حتى يكون هناك تخطيط لإدارة هذه المخاطر بشكل رسمي.\n\nالإجراءات الأخرى مثل نشر أنظمة بديلة أو إيقاف المشروع قد تؤدي إلى تعقيدات أو تأخيرات أكبر دون ضمان النجاح.",
      "choices": [
        {
          "text": "مراقبة الامتثال للقوانين في كل دولة بشكل مستمر أثناء التخطيط وبعد التنفيذ في كل دولة.",
          "correct": true
        },
        {
          "text": "توثيق مخاطر الامتثال القانوني في خطة إدارة المشروع للدولة C خلال مرحلة التنفيذ والدورات.",
          "correct": true
        },
        {
          "text": "نشر أنظمة بديلة متوافقة مع معايير الأمان والإطار القانوني للدولة C.",
          "correct": false
        },
        {
          "text": "تنفيذ مرحلة التنفيذ في دولة أخرى بعد التحقق من معايير الامتثال، أثناء التحضير لحل خاص بالدولة C.",
          "correct": false
        },
        {
          "text": "إبلاغ اللجنة التوجيهية بالتأخير، وإيقاف المشروع حتى يتم اتخاذ قرار.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا يتطلب موافقة من جهة حكومية. الجهة تقوم حاليًا بصياغة تشريع سيؤثر على عملية الموافقة، لكن من غير الواضح متى سيصبح القانون ساريًا. يشعر مدير المشروع بالقلق من أن التشريع قد يؤخر المعالم الرئيسية للمشروع أو يحد من خيارات التطوير.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "في حالة وجود تشريع قيد الصياغة يمكن أن يؤثر على المشروع، يجب على مدير المشروع:\n\n- تقييم التعرض للمخاطر بشكل مستمر لتحديد مدى تأثير التشريع المحتمل على المشروع.\n- اتخاذ إجراءات تخفيف مناسبة لتقليل التأثيرات السلبية على الجدول الزمني ونتائج المشروع.\n\nتجاهل التشريع أو افتراض تمريره بدون تأخير قد يؤدي إلى مفاجآت سلبية. أما طلب استبعاد الأنشطة أو طلب احتياطي إضافي مبكرًا بدون معلومات واضحة فقد يكون غير مناسب.",
      "choices": [
        {
          "text": "التقدم بطلب لاحتياطي إضافي تحضيرًا للتأخير المتوقع في معالم المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة نطاق المشروع وتقديم طلب لاستبعاد الأنشطة المرتبطة بالتشريع.",
          "correct": false
        },
        {
          "text": "تقييم التعرض للمخاطر بشكل مستمر لتقليل التأثيرات السلبية على المشروع ونتائجه.",
          "correct": true
        },
        {
          "text": "المضي قدمًا في المشروع بناءً على افتراض أن التشريع سيُمرَّر دون تأخير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة دولية بتنفيذ تقنية مبتكرة في أحد مصانع الإنتاج التابعة لها. وقد أثبتت هذه التقنية بالفعل عوائد إيجابية في موقع آخر.\n\nما الذي يجب أن يعتبره مدير المشروع جانبًا أساسيًا في التنفيذ الناجح لهذه التقنية؟",
      "explanation": "عند نقل تقنية مبتكرة إلى موقع جديد، من المهم:\n\n- عقد ورشة عمل لمشاركة المعلومات مع أصحاب المصلحة والفريق في الموقع الجديد لتوضيح مزايا التقنية وكيفية عملها.\n- هذا يعزز فهم الجميع ويقلل مقاومة التغيير ويشجع الدعم.\n\nالخيارات الأخرى مثل تقييم حالة العمل، التشاور مع مدير التقنية، أو تطوير ميثاق المشروع مهمة ولكنها لا تغطي الجانب الأساسي للتواصل والقبول المحلي كما تفعل الورشة.",
      "choices": [
        {
          "text": "تقييم حالة العمل لضمان أن العائد على الاستثمار يفي أو يتجاوز مؤشرات الأداء في الموقع الأول.",
          "correct": false
        },
        {
          "text": "التشاور مع مدير التقنية لضمان ملاءمة التقنية للموقع الجديد.",
          "correct": false
        },
        {
          "text": "عقد ورشة عمل لمشاركة المعلومات لعرض التقنية الجديدة وفوائدها على أصحاب المصلحة في الموقع الجديد.",
          "correct": true
        },
        {
          "text": "تطوير ميثاق المشروع للتنفيذ في الموقع الجديد باستخدام الدروس المستفادة من الموقع الأول.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء الفحص النهائي لأحد المخرجات، لاحظ فريق الجودة وجود انحراف في أحد المكونات. ومع ذلك، لم يذكر العميل أي شيء يتعلق بذلك في مواصفاته.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "في هذه الحالة، على مدير المشروع أن يتخذ إجراءً منهجيًا لضمان جودة المنتج النهائي وعدم تجاوز المواصفات المتفق عليها:\n\n- **إجراء تدقيق لضمان الجودة** هو الخيار الأنسب لأنه يسمح بالتحقق من وجود الانحراف وأسبابه، بالإضافة إلى تقييم تأثيره على جودة المنتج والمخرجات النهائية.\n- الموافقة مباشرةً على المخرج رغم الانحراف قد تؤدي إلى مشاكل لاحقة.\n- رفض المخرج دون تقييم دقيق قد يسبب تأخيرات غير ضرورية.\n- إحالة الأمر لخبير تقني قد تكون ضرورية لاحقًا، لكنها ليست الخطوة الأولى دون تدقيق جودة منظم.",
      "choices": [
        {
          "text": "إحالة الأمر إلى خبير تقني.",
          "correct": false
        },
        {
          "text": "إجراء تدقيق لضمان الجودة.",
          "correct": true
        },
        {
          "text": "الموافقة على المخرج لأنه لا ينحرف عن مواصفات العميل.",
          "correct": false
        },
        {
          "text": "رفض المخرج بسبب الانحراف عن مواصفات المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مشروع لتكنولوجيا جديدة، ظهرت حالة من الارتباك بسبب عدم وجود حالة مستقبلية واضحة ومُبلغة بخصوص المنتج.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "عندما لا تكون هناك رؤية أو حالة مستقبلية واضحة للمنتج، يجب على مدير المشروع التركيز على توضيح الفوائد والمخرجات التي يجب تحقيقها:\n\n- **إنشاء خطة إدارة الفوائد والحصول على الموافقة عليها** أمر حيوي لأنه يوضح القيمة التي سيقدمها المشروع وأهدافه طويلة الأمد.\n- هذا يساعد في توجيه الفريق وأصحاب المصلحة نحو نفس الأهداف ويقلل الالتباس.\n- الخيارات الأخرى مثل سؤال راعي المشروع أو مناقشة النطاق مهمة، لكنها لا توفر وثيقة رسمية متفق عليها لإدارة الفوائد.",
      "choices": [
        {
          "text": "إنشاء خطة إدارة الفوائد والحصول على الموافقة عليها.",
          "correct": true
        },
        {
          "text": "سؤال راعي المشروع عن النتيجة المتوقعة للمشروع.",
          "correct": false
        },
        {
          "text": "مناقشة النطاق والأهداف مع المالك الوظيفي.",
          "correct": false
        },
        {
          "text": "مراجعة حالة العمل للمشروع لتحديد البدائل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت الموافقة على لائحة جديدة ستؤثر على المخرجات في المرحلة الرابعة من المشروع. يتم التسليم باتباع نهج تكراري ويتم حاليًا إكمال المرحلة الثانية.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "عندما يتم الموافقة على لائحة جديدة تؤثر على مراحل لاحقة من المشروع، يجب على مدير المشروع أن:\n\n- **الاجتماع مع الخبراء المتخصصين لتقييم الأثر على الأهداف** يساعد في فهم كيف ستؤثر اللائحة الجديدة على المخرجات، التكلفة، والجدول الزمني.\n- هذا التقييم ضروري لاتخاذ قرارات مستنيرة بخصوص الميزانية، الجدول، والتخطيط المستقبلي.\n- الخيارات الأخرى مثل تصعيد التكاليف أو طلب استثناء بدون تقييم دقيق قد تؤدي إلى مخاطر غير محسوبة أو تأخيرات.\n",
      "choices": [
        {
          "text": "التشاور مع راعي المشروع لمناقشة زيادة التكاليف.",
          "correct": false
        },
        {
          "text": "الحصول على موافقة اللجنة التوجيهية على الميزانية الإضافية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الخبراء المتخصصين لتقييم الأثر على الأهداف.",
          "correct": true
        },
        {
          "text": "الحصول على موافقة على استثناء من تنفيذ اللائحة الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا حاسمًا لتسليم حل جديد. المدير التنفيذي مهتم جدًا بالمشروع، والمدير المالي هو مالك المنتج. أثناء مرحلة الاختبار، يطلب المدير المالي متطلبًا غير وظيفي إضافيًا لتقليل وقت معالجة المعاملات. سيتسبب هذا المطلب الجديد في تأخير تاريخ الإطلاق، ويصر المدير المالي على تنفيذه.\n\nما الذي يجب على مدير المشروع فعله لتقليل أثر المطلب الجديد على تاريخ الإطلاق وإدارة توقعات المدير التنفيذي والمدير المالي؟",
      "explanation": "عندما يطلب مالك المنتج متطلبًا جديدًا غير وظيفي قد يؤثر على الجدول الزمني للمشروع، فإن التقييم الدقيق لتأثير هذا المطلب هو الإجراء الصحيح.\n\n- لماذا الخيار الصحيح؟\nتقييم نطاق المطلب الجديد يساعد في فهم التأثير الدقيق على الجدول الزمني، الموارد، والتكاليف، مما يمكن الفريق من اتخاذ قرارات مستنيرة وإدارة توقعات أصحاب المصلحة بشكل فعال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تأجيل التنفيذ: قد يؤدي إلى فقدان فرص تحسين القيمة ولكنه لا يعالج تأثير المطلب الحالي.\n- طلب تدخل المدير التنفيذي: قد يسبب تصعيدًا غير ضروري ويؤثر على العلاقة بين الفريق وأصحاب المصلحة.\n- إخبار الفريق بتحديث سجل المنتج دون تقييم: يفتقد إلى تحليل تأثير المطلب على الجدول الزمني، ما قد يؤدي لمشكلات لاحقة.",
      "choices": [
        {
          "text": "الاجتماع مع المدير المالي واقتراح تأجيل تنفيذ المطلب الجديد إلى ما بعد الإطلاق.",
          "correct": false
        },
        {
          "text": "طلب تدخل المدير التنفيذي لإيقاف تنفيذ المطلب الجديد لأن التطوير قد اكتمل.",
          "correct": false
        },
        {
          "text": "إخبار فريق المشروع بتحديث سجل المنتج بالمطلب الجديد وتعديل خطط المشروع.",
          "correct": false
        },
        {
          "text": "تقييم نطاق المطلب غير الوظيفي الجديد لتحديد تأثيره المحدد على تاريخ الإطلاق المخطط.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اقترح أحد أعضاء الفريق استخدام منتج جديد لتسريع تطوير الميزات، لكن ذلك سيزيد من ميزانية المشروع. يتبع الفريق نهجًا تدريجيًا في تطوير المنتج، ويكون مالك المنتج مسؤولًا عن تحديد الأولويات وإدارة سجل المنتج.\n\nما الذي يجب على مدير المشروع فعله أولًا؟",
      "explanation": "في حالة اقتراح منتج جديد قد يؤثر على الميزانية، من المهم التشاور مع مالك المنتج الذي يتحكم في الأولويات وإدارة سجل المنتج.\n\n- لماذا الخيار الصحيح؟\nالتشاور مع مالك المنتج يضمن مناقشة الفوائد والسلبيات المتعلقة باستخدام المنتج الجديد، ما يساعد على اتخاذ قرار مستنير بشأن إدراجه أو تأجيله.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة خطة التكاليف أو طلب تمويل إضافي دون التحقق من أولوية المنتج والآثار قد يسبب تضارباً في الأولويات.\n- تعديل معايير القبول مباشرةً دون تنسيق مع مالك المنتج قد يؤدي إلى تعقيدات في إدارة المشروع.",
      "choices": [
        {
          "text": "التشاور مع مالك المنتج وعرض الفوائد والسلبيات المتعلقة باستخدام المنتج الجديد.",
          "correct": true
        },
        {
          "text": "مراجعة وتحديث خطة إدارة التكاليف لاستيعاب الأثر المحتمل على الميزانية.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي لتنفيذ المنتج الجديد من راعي المشروع.",
          "correct": false
        },
        {
          "text": "تعديل معايير القبول لقصص المستخدم لدمج المنتج الجديد بفعالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير مشروع حاليًا على مشروع منذ بدايته ويعلم أن هناك العديد من الافتراضات والاعتماديات الأساسية لنجاح المشروع.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع في هذه الحالة؟",
      "explanation": "توثيق جميع الافتراضات والاعتماديات ومتابعتها بانتظام ضروري لإدارة المخاطر وضمان نجاح المشروع.\n\n- لماذا الخيار الصحيح؟\nتوجيه الفريق لتوثيق وتتبع هذه الافتراضات يساعد في مراقبة التغييرات، معالجة المخاطر بشكل استباقي، وضمان تواصل واضح مع أصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب دعم من راعي المشروع لمورد خاص قد يكون مبكرًا قبل التوثيق والمتابعة.\n- جلسة عصف ذهني وحدها غير كافية دون توثيق رسمي.\n- طلب تنفيذ نظام قياس الفوائد من PMO قد يكون إجراءً إضافيًا غير مباشر لمشكلة الافتراضات.",
      "choices": [
        {
          "text": "طلب دعم من راعي المشروع لتخصيص مورد مخصص لمتابعة وتحقيق الفوائد.",
          "correct": false
        },
        {
          "text": "توجيه فريق المشروع لتوثيق جميع الافتراضات وتتبع جميع التغييرات.",
          "correct": true
        },
        {
          "text": "تيسير جلسة عصف ذهني مع الفريق لصياغة خطة شاملة لتخفيف المخاطر.",
          "correct": false
        },
        {
          "text": "طلب من مكتب إدارة المشاريع (PMO) تنفيذ نظام قياس الفوائد للتحقق من مقاييس الفائدة والمخاطر المرتبطة بها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تطوير نظام جديد لاستبدال عملية يدوية حالية. أثناء عرض نتائج دورة Sprint، عبّر أصحاب المصلحة التجاريون عن قلقهم من أنهم لن يحصلوا على أي قيمة من استخدام هذا النظام.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "عندما يعبر أصحاب المصلحة عن قلقهم بشأن القيمة المتوقعة من النظام، يجب على مدير المشروع أولًا التحقق مما إذا كانت مقاييس الأداء المتفق عليها قد تم تحقيقها.\n\n- لماذا الخيار الصحيح؟\nمراجعة مقاييس الأداء مع أصحاب المصلحة يتيح التأكد من أن النظام يلبي المتطلبات المتفق عليها ويحقق النتائج المطلوبة. هذا يساعد في تقديم توضيحات موضوعية وإعادة التأكيد على الفوائد التي تم التخطيط لها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مناقشة قصص جديدة مع مدير المنتج: قد يؤدي إلى إضافة متطلبات جديدة دون التأكد أولًا من تحقيق المقاييس الحالية.\n- عقد اجتماع للجنة التوجيه: خطوة متقدمة جدًا قبل التحقق من المقاييس القائمة.\n- إنشاء خطة إدارة الفوائد: خطوة أساسية لكن يجب أن تتم خلال التخطيط، وليس كرد فعل مباشر على قلق أثناء عرض Sprint.",
      "choices": [
        {
          "text": "مناقشة الأمر مع مدير المنتج وتحديد قصص مستخدم جديدة لمعالجة مخاوف العمل.",
          "correct": false
        },
        {
          "text": "عقد اجتماع للجنة التوجيه لتحديد عوامل النجاح الحرجة للمشروع.",
          "correct": false
        },
        {
          "text": "إنشاء خطة إدارة الفوائد ومراجعتها مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مراجعة مقاييس الأداء مع أصحاب المصلحة لضمان أن النظام حقق المقاييس المتفق عليها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد عدة مقابلات مع أصحاب المصلحة الرئيسيين ومراجعة ميثاق المشروع، وجد مدير المشروع أن الهيكل التنظيمي الحالي للمشروع لم يعد مناسبًا للأهداف الاستراتيجية للمشروع.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "عندما يكتشف مدير المشروع أن الهيكل التنظيمي لم يعد يخدم أهداف المشروع، يجب أولاً تحليل الفجوات التنظيمية.\n\n- لماذا الخيار الصحيح؟\nتقييم الفجوات بين الهيكل التنظيمي الحالي والفوائد المتوقعة يساعد على معرفة ما إذا كان هناك خلل في توزيع المسؤوليات أو الصلاحيات، أو في هيكلة الفرق أو خطوط الاتصال. هذا التحليل يعطي مدير المشروع أساسًا لاتخاذ قرارات واقعية وعملية بشأن ما يجب تغييره لتحقيق التوافق مع الأهداف الاستراتيجية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقييم وثائق الدروس المستفادة: يفيد لاحقًا كمرجع ولكنه لا يعالج الوضع الحالي بشكل مباشر أو فوري.\n- طلب توثيق الخطر: تسجيل الخطر في سجل المخاطر لا يعالج المشكلة الأساسية ولا يقدم خطة فورية لتغيير الهيكل.\n- مراجعة ميثاق المشروع: تمت بالفعل مراجعته حسب السؤال. الميثاق هو مستند عالي المستوى ولا يغطي التفاصيل التنظيمية بالشكل المطلوب.",
      "choices": [
        {
          "text": "تقييم وثائق الدروس المستفادة والتحقق من أي هيكل تنظيمي تم استخدامه في مشاريع مماثلة سابقًا.",
          "correct": false
        },
        {
          "text": "طلب من الفريق توثيق الخطر في سجل مخاطر المشروع وتطوير خطة استجابة للمخاطر وفقًا لذلك.",
          "correct": false
        },
        {
          "text": "تقييم الفجوات بين الهيكل التنظيمي الحالي والفوائد المتوقعة للمشروع لتحديد الإجراءات المطلوبة.",
          "correct": true
        },
        {
          "text": "طلب من الفريق مراجعة ميثاق المشروع وتقييم مدى ملاءمة أهداف المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع هجين (تنبؤي - رشيق). أثناء اجتماع وقوف، ذكر أحد أعضاء الفريق أنه استنادًا إلى تجربة في مشروع سابق، يعتقد أن أحد المخرجات القادمة قد يحتاج إلى الامتثال للوائح الحكومية.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "في حالة ظهور موضوع مرتبط بالامتثال القانوني أو التنظيمي خلال العمل، لا يُفضل التصعيد المباشر أو إيقاف المشروع قبل التأكد. أول خطوة ذكية وفعالة هي الاستفادة من المعرفة السابقة.\n\n- لماذا الخيار الصحيح؟\nمراجعة الدروس المستفادة من المشروع السابق يسمح لمدير المشروع بالحصول على دليل عملي حقيقي حول ما إذا كانت هناك حاجة فعلية للامتثال. هذه الطريقة توفر الوقت والجهد بدلاً من اتخاذ قرارات مبنية على التخمين.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد المشكلة إلى PMO: غير فعال ومبكر جدًا، خاصة إذا كانت المعلومات غير مؤكدة.\n- إيقاف المشروع: يسبب تعطيلًا كبيرًا للمشروع بدون أساس واضح.\n- إزالة المهمة من المسار الحرج: إجراء خاطئ لأن المهمة قد تكون أساسية، ويجب أولاً التحقق من متطلبات الامتثال بدلاً من إزالتها بدون تقييم.",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى مكتب إدارة المشاريع (PMO) حتى يحددوا ما إذا كان هناك امتثال مطلوب.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع حتى يتم التأكد من أن المخرج يخضع لأي لوائح.",
          "correct": false
        },
        {
          "text": "مراجعة الدروس المستفادة من المشروع السابق لتحديد ما إذا كان هناك أي امتثال مطلوب.",
          "correct": true
        },
        {
          "text": "إزالة المهمة من المسار الحرج وتكليف المورد بالعمل على مطلب آخر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حصل نظام حسابات القبض الذي تم إطلاقه مؤخرًا على غرامة من هيئة تنظيمية لأنه لم يمتثل للوائح المحلية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الوضع؟",
      "explanation": "الغرامة بسبب عدم الامتثال تعني أن المخرجات النهائية لم تكن مطابقة للوائح. هذا يعود عادةً إلى غياب عملية مراقبة الجودة الصحيحة خلال مراحل المشروع.\n\n- لماذا الخيار الصحيح؟\nتحديد عملية التحكم في الجودة (Quality Control Process) هو المسؤول عن فحص المخرجات بانتظام للتأكد من توافقها مع المتطلبات والمعايير القانونية والتنظيمية، مما يمنع مثل هذه الأخطاء قبل أن تصل للجهة التنظيمية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد إدارة التحكم بالمخاطر: يركّز على التوقع والتخطيط، وليس على اكتشاف العيوب بعد تنفيذ العمل.\n- تنفيذ سجل للتحكم في القضايا: يتعامل مع المشكلات بعد حدوثها، وليس كإجراء وقائي.\n- إشراك قسم التدقيق: يمكن أن يكون مفيدًا، لكن إدارة الجودة هي الأساس الذي يضمن التوافق أثناء تنفيذ العمل وليس عبر مراجعة خارجية فقط.",
      "choices": [
        {
          "text": "تحديد إدارة التحكم بالمخاطر.",
          "correct": false
        },
        {
          "text": "تحديد عملية التحكم في الجودة.",
          "correct": true
        },
        {
          "text": "تنفيذ سجل للتحكم في القضايا.",
          "correct": false
        },
        {
          "text": "إشراك قسم التدقيق في تخطيط المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمر شركة بتغيير تنظيمي. تم تغيير معظم الإدارة العليا، بما في ذلك المشرف المباشر على مدير المشروع. يتمتع المشرف بأسلوب عمل هجومي، وقد وجه تعليقات نقدية إلى مدير المشروع بشأن المشروع الجاري دون فهم الوضع بشكل كافٍ. يشعر مدير المشروع بعدم الارتياح للعمل مع المشرف الجديد.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "في حالات التغيير التنظيمي، أول خطوة صحيحة لمدير المشروع هي تقييم تأثير هذا التغيير على المشروع.\n\n- لماذا الخيار الصحيح؟\nتقييم تأثير التغيير التنظيمي يضمن أن مدير المشروع يأخذ بعين الاعتبار تأثير الأشخاص الجدد (كمشرفين أو أصحاب قرار) على سير المشروع، مثل تغيرات في الأولويات أو السياسة أو الدعم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- عقد اجتماع مراجعة للمشروع: خطوة مفيدة لكنها لا تكفي إذا لم يتم أولًا تقييم التأثير الأشمل للتغيير.\n- تطبيق توصيات المشرف الجديد مباشرة: قد تؤدي إلى مخاطر دون تقييم حقيقي لوضع المشروع.\n- إبلاغ الفريق بضرورة الاستعداد للتغيير: تصرف متسرع، لأنه يجب أولًا معرفة ما إذا كان هناك تأثير فعلي مهم أم لا.",
      "choices": [
        {
          "text": "عقد اجتماع مراجعة للمشروع لشرح النقاط الرئيسية للمشروع للمشرف الجديد.",
          "correct": false
        },
        {
          "text": "تطبيق توصيات المشرف الجديد على المشروع.",
          "correct": false
        },
        {
          "text": "تقييم تأثير التغيير التنظيمي على المشروع.",
          "correct": true
        },
        {
          "text": "إبلاغ فريق المشروع بأن عليهم الاستعداد لتقبل التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء آخر دورة تخطيط في مشروع رشيق، اكتشف الفريق أنه لم يتم تضمين اللوائح الإلزامية في الحد الأدنى من المنتج القابل للتطبيق (MVP).\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عند اكتشاف أن اللوائح الإلزامية لم تُضمَّن في الحد الأدنى من المنتج القابل للتطبيق (MVP)، يجب مراجعة أولويات العمل لضمان الامتثال. مالك المنتج هو المسؤول عن تحديد أولويات سجل المنتج، بما في ذلك المتطلبات القانونية والتنظيمية.\n\n- لماذا الخيار الصحيح؟\nطلب من مالك المنتج مراجعة أولوية هذا المطلب التنظيمي هو التصرف الصحيح لأن مالك المنتج مسؤول عن الأولويات وفقًا لقيمة العمل والمخاطر. هذا يضمن تضمين المتطلبات القانونية ضمن أولويات العمل القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب من الفريق مباشرة: لا يتخذ الفريق قرارات الأولويات، بل ينفذ بناءً على سجل المنتج.\n- طلب من أصحاب المصلحة: ليس من دورهم إعادة ترتيب الأولويات، بل دورهم تقديم مدخلات.\n- طلب من الراعي: الراعي ليس المعني بإدارة سجل المنتج بالتفصيل بل بالدعم الإستراتيجي.",
      "choices": [
        {
          "text": "طلب من الفريق تضمين هذا المطلب التنظيمي في قائمة مهام الدورة.",
          "correct": false
        },
        {
          "text": "طلب من مالك المنتج مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": true
        },
        {
          "text": "طلب من أصحاب المصلحة مراجعة أولوية هذا المطلب التنظيمي.",
          "correct": false
        },
        {
          "text": "طلب موافقة الراعي على تضمين هذا المطلب التنظيمي في قائمة مهام الدورة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قام مدير مشروع حديثًا ببدء مشروع طويل الأجل عندما أقرّت الحكومة تشريعًا جديدًا يُلزم جميع المهندسين العاملين في الولاية بالتسجيل. يعتمد التسجيل على مجال العمل، والخبرة، والتطوير المهني المُنجز خلال السنوات الثلاث الماضية. ونظرًا لقيود الميزانية في الشركة خلال السنوات الثلاث الماضية، كانت الفرص المتاحة للمهندسين لتلقي تدريب مهني رسمي محدودة.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
      "explanation": "عند حدوث تغييرات تنظيمية تؤثر على متطلبات الفريق، يجب على مدير المشروع التأكد من أن موارد المشروع تفي بهذه المتطلبات.\n\n- لماذا الخيار الصحيح؟\nمراجعة مصفوفة مهارات الفريق وتحديث خطة إدارة الموارد تسمح بتحديد ما إذا كان أعضاء الفريق يمتلكون المؤهلات والتراخيص المطلوبة واستكمال الفجوات إن وجدت.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال طلب للجنة إدارة التغيير: ليس ضروريًا في هذه المرحلة، لأن الأمر يتعلق بإدارة الموارد.\n- إرسال الجميع إلى التدريب مباشرة: قد يكون مكلفًا وغير ضروري إن كان بعض الأعضاء مسجلين بالفعل.\n- إبلاغ المهندسين فقط: تصرف سلبي ولا يعالج إدارة المشروع بشكل احترافي.",
      "choices": [
        {
          "text": "إرسال طلب إلى لجنة إدارة التغيير لتقييم الوضع.",
          "correct": false
        },
        {
          "text": "مراجعة مصفوفة مهارات الفريق وتحديث خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "إرسال جميع المهندسين إلى تدريب مهني لتلبية المتطلبات.",
          "correct": false
        },
        {
          "text": "إبلاغ المهندسين بأنهم بحاجة إلى التسجيل للاستمرار في العمل بالشركة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو النهج الذي يجب أن يستخدمه مدير المشروع لتعزيز التعاون بين المطورين في نموذج تطوير رشيق؟",
      "explanation": "في بيئات التطوير الرشيق، هناك تقنيات معينة مصممة خصيصًا لتعزيز التعاون بين الفريق وتحسين جودة العمل.\n\n- لماذا الخيار الصحيح؟\nتطوير قائم على السلوك (Behavior-Driven Development - BDD) يشجع على التعاون بين المطورين والمحللين وأصحاب المصلحة عن طريق كتابة سيناريوهات قابلة للاختبار بلغات مفهومة للجميع. هذا يعزز الفهم المشترك وتقليل سوء الفهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- اختبار القبول: خطوة مهمة لكنها تأتي بعد التطوير.\n- تطوير التطبيقات المشترك: مفهوم مختلف وليس مرتبطًا مباشرة بالتعاون داخل فرق رشيقة.\n- تطوير التطبيقات السريع: يهتم بالسرعة وليس بالضرورة بتعزيز التعاون الداخلي.",
      "choices": [
        {
          "text": "اختبار القبول",
          "correct": false
        },
        {
          "text": "تطوير قائم على السلوك",
          "correct": true
        },
        {
          "text": "تطوير التطبيقات المشترك",
          "correct": false
        },
        {
          "text": "تطوير التطبيقات السريع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع حالة العمل، أقرّ مدير المشروع بأن العديد من ظروف السوق قد تغيرت بشكل كبير مؤخرًا. نتيجة لذلك، قد تكون القيمة المتوقعة من المشروع الجاري مهددة.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "عندما تتغير ظروف السوق بشكل كبير، يجب على مدير المشروع التأكد مما إذا كانت المؤسسة لا تزال ترى قيمة في الاستمرار بالمشروع. لهذا السبب، الخيار الصحيح هو الاجتماع مع راعي المشروع.\n\n- لماذا الخيار الصحيح؟\nيُعتبر راعي المشروع هو المرجع الرسمي لتوجيه المشروع والتأكد من توافقه مع الأهداف الاستراتيجية. لذلك يجب مناقشة الوضع معه لاتخاذ قرار مبني على معلومات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إيقاف المشروع فورًا: إجراء متسرع دون التحقق الرسمي من دعم المؤسسة.\n- الاستمرار في المشروع: قد يؤدي إلى هدر الموارد إذا لم يعد هناك قيمة.\n- مطالبة الفريق بالتحقيق: هذا لن يعطي قرارًا نهائيًا حول جدوى المشروع.",
      "choices": [
        {
          "text": "إيقاف المشروع فورًا بسبب الشك في أن المشروع سيحقق القيمة المتوقعة.",
          "correct": false
        },
        {
          "text": "الاستمرار في المشروع لأن مدير المشروع لم يتلق إخطارًا رسميًا بأي تغيير في ظروف السوق.",
          "correct": false
        },
        {
          "text": "مطالبة فريق المشروع بالتحقيق في تطور ظروف السوق خلال الأشهر الستة الماضية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع لمناقشة المعلومات وسؤاله عمّا إذا كانت المؤسسة لا تزال تدعم تسليم المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصدرت الجهة التنظيمية الحكومية المحلية إخطارًا لجميع الشركات بشأن مشروع جديد يهدف إلى تسهيل الإبلاغ عن المعلومات إلى جهة تنظيمية دولية. ومع ذلك، وبسبب الطبيعة الديناميكية للمشروع، هناك احتمال لتغيير المتطلبات في حين أن تاريخ التسليم يبقى ثابتًا. يشعر مدير المشروع المعيّن لهذا المشروع بالقلق إزاء عدم اليقين والإطار الزمني القصير للتسليم.\n\nكيف يجب على مدير المشروع الاستعداد بشكل أفضل لمواجهة هذا الوضع؟",
      "explanation": "بما أن المتطلبات قد تتغير باستمرار، فإن الأنسب هو اتباع نهج تدريجي ومتزايد.\n\n- لماذا الخيار الصحيح؟\nالنهج التدريجي (Incremental) يسمح بتسليم أجزاء من المشروع مع إمكانية تعديلها بناءً على تغييرات لاحقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- جدول زمني تفصيلي: لا يناسب المشاريع ذات المتطلبات المتغيرة.\n- خطة طوارئ: تنطبق على المخاطر المحددة مسبقًا، لكن هنا التغير متوقع ومستمر.\n- استراتيجيات الاتصال: مهمة، لكنها لا تعالج المشكلة التقنية وإدارة التغييرات.",
      "choices": [
        {
          "text": "تنفيذ أساليب تدريجية ومتزايدة في المجالات المناسبة من المشروع للتكيف مع المتطلبات المتغيرة.",
          "correct": true
        },
        {
          "text": "الاجتماع مع الراعي لتحديد جدول زمني تفصيلي لضمان الانتهاء من المشروع في الوقت المحدد.",
          "correct": false
        },
        {
          "text": "تطوير خطة طوارئ تفصيلية باستخدام تقنية التسريع لتسريع أنشطة المشروع حسب الحاجة.",
          "correct": false
        },
        {
          "text": "تعزيز استراتيجيات الاتصال والمشاركة مع الحكومة المحلية لضمان التوافق والتحديثات في الوقت المناسب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تحديث نظام قديم. تم تثبيت خطة إدارة المشروع وتم تسليم المتطلبات إلى قسم تكنولوجيا المعلومات للتطوير. ومع ذلك، أعلن الرئيس التنفيذي للشركة عن التوجه الاستراتيجي الجديد وخطط قادمة لتنفيذ نظام تخطيط موارد المؤسسات (ERP).\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "عندما يتم إعلان توجه استراتيجي جديد، على مدير المشروع التأكد من توافق المشروع الحالي مع هذا التوجه.\n\n- لماذا الخيار الصحيح؟\nفهم كيف يتماشى المشروع مع الرؤية الجديدة يمنع العمل على مشروع غير متوافق مع أهداف المؤسسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب توصيات: يعتمد على الآخرين بدل تحليل الوضع.\n- اجتماع الفريق: ليس له قيمة بدون وضوح التوجه الاستراتيجي.\n- مراجعة الجدول الزمني: ليس مفيدًا إذا كان المشروع نفسه قد يصبح غير ذي جدوى.",
      "choices": [
        {
          "text": "طلب توصيات من راعي المشروع للحفاظ على سير المشروع.",
          "correct": false
        },
        {
          "text": "فهم وتوضيح كيف يتماشى المشروع الحالي مع الرؤية العامة للمؤسسة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع لفريق المشروع للتخطيط وتأكيد توزيع الموارد للمشروع الجديد.",
          "correct": false
        },
        {
          "text": "مراجعة الجدول الزمني للمشروع لضمان اكتماله في الوقت المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين ممارس رشيق (Agile Practitioner) لقيادة مشروع تطوير برنامج في صناعة جديدة نسبيًا حيث لم يتم بعد تحديد معايير الامتثال الخارجية بشكل واضح.\n\nما الذي يجب أن يفعله الممارس الرشيق لضمان نجاح المشروع؟",
      "explanation": "في بيئة غير واضحة المعايير، يجب على الممارس الرشيق الاعتماد على أفضل الممارسات العالمية لضمان اتباع أساليب مجرّبة وفي نفس الوقت مراقبة التحديثات الخاصة بالامتثال.\n\n- لماذا الخيار الصحيح؟\nاستخدام أفضل الممارسات العالمية يوفر إطار عمل موثوق، مع مرونة لتحديثه عند صدور معايير رسمية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التحدث إلى مديري مشاريع آخرين: قد يعطي معلومات، لكنه ليس كافيًا كإجراء رسمي.\n- تطوير معايير خاصة: قد يؤدي إلى تضارب مع المعايير المستقبلية.\n- الرجوع إلى بيانات صناعات مرتبطة: لا يعطي حلول دقيقة للصناعة الجديدة.",
      "choices": [
        {
          "text": "التحدث إلى مديري مشاريع رشيقة في منظمات أخرى تواجه نفس التحديات لمعرفة كيف يعالجون المشكلات.",
          "correct": false
        },
        {
          "text": "تطوير مجموعة من المعايير التي تناسب الدور ودعم الفريق في تنفيذها.",
          "correct": false
        },
        {
          "text": "استخدام أفضل الممارسات العالمية كدليل لتنفيذ المشروع مع دمج أحدث الاتجاهات التكنولوجية ومراقبة معايير الامتثال.",
          "correct": true
        },
        {
          "text": "الرجوع إلى بيانات سابقة من صناعات مرتبطة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصبح بيئة العمل غير مستقرة لأن أحد أصحاب المصلحة قام بتغيير نتائج المشروع ومخرجاته في منتصف مرحلة التنفيذ. مع مراعاة هذا الطرف المعني، كيف يجب على مدير المشروع ضمان تسليم فوائد المشروع؟",
      "explanation": "التعامل مع تغييرات أصحاب المصلحة يتطلب إدارة تغيير منظمة تضمن التقاط المتطلبات رسميًا وفقًا للإجراءات.\n\n- لماذا الخيار الصحيح؟\nضمان إشراك صاحب المصلحة بما يتناسب مع تأثيره ومتابعة المتطلبات من خلال عملية إدارة التغيير تحافظ على استقرار المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ضمان موافقة الفريق فقط: لا يضمن أخذ متطلبات أصحاب المصلحة في الحسبان.\n- دمج الأساليب: غير كافٍ إذا لم يتم التعامل مع التغيير رسميًا.\n- الالتزام بالمتطلبات الأولية: قد يتجاهل متطلبات حيوية طرأت لاحقًا.",
      "choices": [
        {
          "text": "ضمان أن فريق المشروع يوافق على خطة إدارة المشروع وتقديم تحديثات مستمرة لصاحب المصلحة.",
          "correct": false
        },
        {
          "text": "دمج كل من الأساليب الرشيقة والتنبؤية وإدارة التغييرات في نطاق المشروع بأقل انحراف ممكن.",
          "correct": false
        },
        {
          "text": "ضمان أن تسليمات المشروع وأهدافه مصممة وفقًا للمتطلبات الأولية.",
          "correct": false
        },
        {
          "text": "إشراك صاحب المصلحة بناءً على مستوى التأثير وضمان التقاط متطلباته بشكل كافٍ وفقًا لعملية إدارة التغيير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مدير مشروع بوضع خطة لمشروع جديد. خلال أول اجتماع للتخطيط، يسأل أصحاب المصلحة عن قيمة المشروع وكيفية ارتباطه بأهداف المنظمة.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "عندما يُسأل مدير المشروع عن أهداف المشروع وقيمته، المرجع الأول يكون ميثاق المشروع.\n\n- لماذا الخيار الصحيح؟\nميثاق المشروع يحتوي على تعريف المشروع، أهدافه، الفوائد المتوقعة، وعلاقته باستراتيجية المؤسسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة النطاق: تركز على ما يتم إنجازه وليس على السبب والقيمة.\n- دعوة الراعي: ليست الطريقة الفعالة دائمًا، بل يجب أن يكون لدى المدير الإجابة.\n- طلب وثائق من PMO: غير ضروري إذا كانت المعلومات موجودة في ميثاق المشروع.",
      "choices": [
        {
          "text": "إحالة أصحاب المصلحة إلى خطة إدارة النطاق.",
          "correct": false
        },
        {
          "text": "إحالة أصحاب المصلحة إلى ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "دعوة راعي المشروع لحضور الاجتماع للإجابة على الأسئلة.",
          "correct": false
        },
        {
          "text": "طلب الوثائق اللازمة من مكتب إدارة المشاريع (PMO).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على تطبيق تنظيمي لديه مدة محددة للتسليم. يستخدم الفريق نهجًا هجينًا وقد قسم التطوير إلى ثلاث دورات. لم تنتج أول دورتين النتائج المطلوبة بسبب التأخيرات من الوحدات الوظيفية. يشعر مدير المالية بالقلق بسبب العقوبات الوشيكة إذا لم يتم الانتهاء من التطبيق، والفريق demoralized.\n\nمن المسؤول عن تحفيز فريق المشروع؟",
      "explanation": "من مسؤوليات مدير المشروع الرئيسية إدارة فريق المشروع بما في ذلك تحفيزه وتعزيز روح الفريق لضمان الإنتاجية والجودة.\n\n- لماذا الخيار الصحيح؟\nمدير المشروع مسؤول عن تحفيز الفريق من خلال أدوات القيادة، بناء الثقة، ومعالجة القضايا التي تؤثر على الأداء.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مالك المنتج: يركز على إدارة الأولويات وسجل المنتج.\n- مدير المالية: يهتم بالجوانب المالية وليس تحفيز الفريق.\n- المدير الوظيفي: مسؤول عن الموارد وليس عن التحفيز المباشر داخل المشروع.",
      "choices": [
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "مدير المالية",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مدير المشروع",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب العميل تغييرًا كبيرًا في النطاق نتيجة لتغيرات في بيئة السوق، مما سيضيف تكلفة كبيرة على المشروع. تم اعتماد هذا التغيير من خلال عملية التحكم في التغيير.\n\nما الذي يجب أن يفعله مدير المشروع لإعادة المشروع إلى المسار الصحيح؟",
      "explanation": "عند اعتماد تغيير كبير، يجب على مدير المشروع التعامل مع تأثيره على الوقت والتكاليف باستخدام أدوات مثل الاحتياطي الإداري.\n\n- لماذا الخيار الصحيح؟\nالاحتياطي الإداري يُستخدم لتغطية حالات عدم اليقين غير المتوقعة التي تمت الموافقة عليها رسميًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعادة تقييم خط الأساس للنطاق: يحدث لاحقًا بعد اتخاذ إجراء مباشر.\n- مراقبة المخاطر: ضروري لكنه ليس الإجراء الأول.\n- إعادة تقييم خطة التكاليف: أيضًا خطوة لاحقة بعد معالجة الجدول الزمني.",
      "choices": [
        {
          "text": "إعادة تقييم خط الأساس للنطاق وتأثيره على أهداف المشروع.",
          "correct": false
        },
        {
          "text": "استخدام الاحتياطي الإداري لمراعاة عدم اليقين في الجدول الزمني.",
          "correct": true
        },
        {
          "text": "مراقبة المخاطر لضمان فعالية عملية إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "إعادة تقييم خطة إدارة التكاليف لمعالجة تأثير التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقود مدير مشروع مشروعًا تلقى طلبًا لنطاق إضافي بسبب تغييرات في طلب السوق. يطلب التغيير أيضًا إطارًا زمنيًا أسرع للتسليم.\n\nما الإجراءان اللذان يجب على مدير المشروع اتخاذهما؟ (اختر اثنين)",
      "explanation": "عند تلقي طلب لنطاق إضافي وإطار زمني أسرع، يجب التأكد من أن التغيير يستحق الاستثمار وأن مخاطره مفهومة.\n\n- لماذا الخيارات الصحيحة؟\n- جمع البيانات وتحليل بيئة العمل: للتحقق من جدوى التغيير وفوائده.\n- تنظيم ورشة عمل للمخاطر: لضبط خطة المخاطر وضمان أن التغيير لن يؤثر سلبًا على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقييم أداء الشركة: لا يرتبط مباشرة بإدارة التغيير الحالي.\n- تنظيم ورشة مع الرعاة: خطوة لاحقة بعد التأكد من جدوى وفوائد التغيير.\n- تقييم التقنيات الجديدة: ليس الإجراء الأول المطلوب لضبط النطاق والجدول.",
      "choices": [
        {
          "text": "تقييم أداء الشركة ونطاق المشاريع الأخرى لضمان الحد الأدنى من التأثير.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل مع الرعاة وطلب زيادة ميزانية المشروع.",
          "correct": false
        },
        {
          "text": "جمع البيانات وتحليل بيئة العمل للتحقق من فوائد العمل.",
          "correct": true
        },
        {
          "text": "تقييم التقنيات الجديدة والمنافسين، ثم مقارنة التغيير بها.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل للمخاطر، ثم تحديث خطة إدارة المخاطر وسجل المخاطر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقود مدير مشروع تنفيذ مكاتب منزلية عن بُعد. تفاجأ مدير المشروع بعلامات مبكرة من المقاومة من أصحاب مصلحة رئيسيين في المؤسسة. يعارض هؤلاء أصحاب المصلحة التغيير بشدة وسيتطلب الأمر المزيد من الإقناع أكثر مما كان يتوقعه مدير المشروع.\n\nما الأداتان أو التقنيتان اللتان يجب استخدامهما لتحديد تأثير أصحاب المصلحة على مستوى المؤسسة والمشروع؟ (اختر اثنين)",
      "explanation": "لتحديد مدى تأثير أصحاب المصلحة وتخطيط استراتيجيات التعامل معهم، يستخدم مدير المشروع أدوات تحليل أصحاب المصلحة.\n\n- لماذا الخيارات الصحيحة؟\n- تحليل أصحاب المصلحة: لتحديد احتياجاتهم وتوقعاتهم وتأثيرهم على المشروع.\n- خريطة أصحاب المصلحة: توضح موقع وتأثير كل صاحب مصلحة بصريًا حسب القوة والاهتمام.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مصفوفة أصحاب المصلحة: تُستخدم لاحقًا لتنظيم الأدوار، وليست أداة تحليل أولية.\n- مخطط RACI: لتوضيح المسؤوليات، لا علاقة مباشرة له بتحديد التأثير.\n- خريطة المشاركة: تركّز على مستويات المشاركة، وليس التأثير الفعلي.",
      "choices": [
        {
          "text": "مصفوفة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "مخطط RACI",
          "correct": false
        },
        {
          "text": "تحليل أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "خريطة أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "خريطة المشاركة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تراجع في بيئة الأعمال، لا يستطيع العميل دفع المبلغ الكامل الشهري للمشروع، بل فقط جزء منه.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "في المشاريع الرشيقة أو الهجينة، عندما تقل الميزانية، يتم التركيز على تسليم أعلى قيمة ممكنة.\n\n- لماذا الخيار الصحيح؟\nتسليم الميزات ذات القيمة الأعلى يسمح بتحقيق الفوائد المرجوة ضمن الميزانية المتاحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إيقاف المشروع مباشرة قرار متسرع.\n- تسليم مكونات مستقلة صغيرة: قد لا تحقق الفائدة المطلوبة.\n- المتابعة حسب الخطة دون تسليم: يعارض مبادئ المرونة والقيمة المتدرجة.",
      "choices": [
        {
          "text": "مناقشة الأمر مع الإدارة وإيقاف المشروع بسبب قيود ميزانية العميل.",
          "correct": false
        },
        {
          "text": "تسليم الميزات ذات القيمة الأعلى للعمل استنادًا إلى الميزانية المتاحة.",
          "correct": true
        },
        {
          "text": "تسليم الميزات التي تحتوي على مكونات مستقلة صغيرة حسب الميزانية المتوفرة.",
          "correct": false
        },
        {
          "text": "المتابعة في التطوير حسب الخطة وعدم التسليم إلا عند دفع المبلغ الكامل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "تم تكليف مدير مشروع جديد في مؤسسة بإدارة أول مشروع باستخدام النهج الرشيق (Agile). قرر مدير المشروع البدء بتقييم قدرة المؤسسة على التكيف مع مشروع رشيق.\n\nما الخصائص الثلاث التي ستساعد في ضمان نجاح المشروع؟ (اختر ثلاثًا)",
      "explanation": "نجاح المشاريع الرشيقة يعتمد على بيئة العمل وثقافة المؤسسة.\n\n- لماذا الخيارات الصحيحة؟\n- بيئة عمل آمنة: تسمح للأعضاء بالتعبير عن آرائهم وتجربة أشياء جديدة دون خوف.\n- الاستعداد للتجريب: ضروري لأن الرشاقة تعتمد على التكيف والتعلم المستمر.\n- السرعة للوصول إلى السوق: مؤشر على مرونة المؤسسة وقدرتها على تحقيق الفوائد بسرعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مؤشرات الأداء الرئيسية: أدوات قياس، ليست شرطًا لنجاح المشروع الرشيق.\n- إمكانية التنبؤ: ليست أولوية في البيئة الرشيقة مقارنة بالمرونة والتكيف.",
      "choices": [
        {
          "text": "بيئة عمل آمنة",
          "correct": true
        },
        {
          "text": "مؤشرات الأداء الرئيسية (KPIs)",
          "correct": false
        },
        {
          "text": "الاستعداد للتجريب",
          "correct": true
        },
        {
          "text": "السرعة للوصول إلى السوق",
          "correct": true
        },
        {
          "text": "إمكانية التنبؤ",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتابع مدير مشروع تنفيذ بنية تحتية تعتمد على مزود خدمة. أبلغ مزود الخدمة مدير المشروع أن بعض المكونات من جهة خارجية لن يتم تصنيعها أو دعمها بعد الآن. ووفقًا للمراجعة الأولية، فإن هذا سيؤدي إلى تأخير كبير في الجدول وزيادة في الميزانية.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "عندما تواجه مشكلة تؤثر بشكل كبير على الجدول والميزانية، من الضروري تصعيد الأمر إلى راعي المشروع ليتم اتخاذ القرار المناسب على المستوى الاستراتيجي.\n\n- لماذا الخيار الصحيح؟\nتصعيد المسألة إلى راعي المشروع يضمن إشراك أصحاب القرار الذين يمكنهم تخصيص الموارد أو تعديل نطاق المشروع أو اتخاذ قرارات استراتيجية أخرى.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث سجل المخاطر: خطوة مهمة لكنها ليست كافية لوحدها بدون اتخاذ قرار من قبل الإدارة العليا.\n- عقد اجتماع مراجعة مع الفريق: قد يكون ضروريًا لكن ليس كحل أول قبل تصعيد المشكلة.\n- تحديث حالة المشروع: يعكس المشكلة لكنه لا يحلها أو يوجه كيفية التعامل معها.",
      "choices": [
        {
          "text": "تصعيد هذه المسألة إلى راعي المشروع.",
          "correct": true
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مراجعة مع الفريق.",
          "correct": false
        },
        {
          "text": "تحديث حالة المشروع لتعكس هذه النتائج.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يخضع مشروع ما للتدقيق بسبب كمية استهلاك المياه. فرع تراخيص المياه التابع للحكومة يقوم بتغيير سياساته ليكون أكثر تقييدًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "عندما يتغير إطار تنظيمي مهم يؤثر على المشروع، يجب تقييم تأثير هذا التغيير على نطاق المشروع وخططه.\n\n- لماذا الخيار الصحيح؟\nتقييم التأثير يساعد في فهم مدى تأثير السياسة الجديدة على أهداف ومخرجات المشروع وبالتالي تخطيط الرد المناسب.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- توجيه موارد المشروع لمعارضة السياسة: غير واقعي وقد يؤدي إلى خسائر.\n- إلغاء المشروع: قرار مبكر دون تقييم التأثير.\n- إنشاء جدول زمني جديد بدون تقييم التأثير قد يؤدي إلى تخطيط غير واقعي.",
      "choices": [
        {
          "text": "توجيه موارد المشروع لمعارضة المعيار الجديد لترخيص المياه.",
          "correct": false
        },
        {
          "text": "إلغاء المشروع بسبب حالة عدم اليقين الناتجة عن التغيير في السياسة.",
          "correct": false
        },
        {
          "text": "تقييم تأثير تغيير السياسة على نطاق المشروع.",
          "correct": true
        },
        {
          "text": "إنشاء جدول زمني جديد للمشروع بناءً على التغييرات المحتملة في سياسة المياه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قامت شركة بتنفيذ مشروع تحول كبير للاستعداد للاقتصاد المتغير. أثناء تنفيذ مشروع التحول، ظهرت تقنية جديدة لم تكن متوقعة في خطة إدارة المخاطر.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "عند ظهور خطر جديد أو عنصر غير متوقع، يجب مراجعة خطة إدارة المخاطر وتطبيق عملية تخطيط المخاطر بما يتناسب مع الظروف الجديدة.\n\n- لماذا الخيار الصحيح؟\nمراجعة وتحديث خطة المخاطر يضمن التعامل المناسب مع التقنية الجديدة وتخفيف تأثيرها المحتمل على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد الأمر لقسم تكنولوجيا المعلومات وتنظيم تدريب: قد يكون لاحقًا، لكن التخطيط للمخاطر هو الأولوية.\n- مراجعة خطة المشتريات: غير مرتبط مباشرة بالمخاطر التقنية.\n- تصعيد المشكلة للجنة التوجيه وجلسة عصف ذهني: تأخير في اتخاذ إجراء تخطيطي مباشر.",
      "choices": [
        {
          "text": "تصعيد هذا الأمر إلى قسم تكنولوجيا المعلومات وتنظيم تدريب للأعضاء المتأثرين في الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المشتريات وتحديد العقود المتأثرة بعمليات الشراء القادمة.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة المخاطر وتطبيق عملية تخطيط المخاطر للمشروع.",
          "correct": true
        },
        {
          "text": "تصعيد المشكلة إلى لجنة التوجيه التالية وتنظيم جلسة عصف ذهني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع تطوير برمجيات حرج على مدار ست دورات سابقة. قبل يومين من الدورة الأخيرة، عُقد عرض توضيحي لأصحاب المصلحة، حيث أعرب صاحب مصلحة جديد عن أن المنتج لن يلبي توقعات السوق.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "في هذه الحالة، ظهور صاحب مصلحة جديد يعبر عن قلقه من توقعات السوق قبل إتمام الدورة الأخيرة يشير إلى ضرورة مراجعة نطاق المشروع وخطته بشكل دقيق لضمان تلبية متطلبات السوق وأصحاب المصلحة.\n\n- لماذا الخيار الصحيح؟\nمراجعة نطاق المشروع مع صاحب المصلحة الجديد يسمح لفهم توقعاته بشكل واضح وإجراء التعديلات اللازمة أو توضيح حدود المشروع، وهذا يعزز فرص نجاح المنتج.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مناقشة الأمر مع راعي المشروع وطلب حل المشكلة: قد يؤدي إلى تأخير غير ضروري ويترك مسؤولية حل المشكلة بعيدًا عن الفريق المباشر.\n- مراجعة قائمة المهام مع فريق التطوير وصاحب المصلحة: تركيز مبكر جدًا على التفاصيل دون فهم النطاق الكامل قد يضيع الوقت.\n- اتباع خطة إدارة التغيير وتعديل النطاق: قبل اتخاذ أي تعديل يجب أولًا فهم التوقعات وإجراء مراجعة شاملة.",
      "choices": [
        {
          "text": "مناقشة الأمر مع راعي المشروع وصاحب المصلحة الجديد وطلب منهما حل مشكلة التوقعات.",
          "correct": false
        },
        {
          "text": "مراجعة نطاق المشروع وخطته مع صاحب المصلحة الجديد.",
          "correct": true
        },
        {
          "text": "مراجعة قائمة المهام المطلوبة مع فريق التطوير وصاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "اتباع خطة إدارة التغيير وتعديل النطاق والخطة بناءً على طلب أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع رشيق في مرحلته الأخيرة. خلال اجتماع الوقوف اليومي، أدرك الفريق أنهم لن يتمكنوا من إكمال جميع الأنشطة المخطط لها للدورة. أنشأ أعضاء الفريق خطة طوارئ.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "عندما يواجه الفريق احتمال عدم إكمال العمل المخطط، من المهم إبلاغ مالك المنتج لأنه المسؤول عن الأولويات واتخاذ قرارات بشأن المحتوى المتبقي للدورة.\n\n- لماذا الخيار الصحيح؟\nمناقشة خطة الطوارئ مع مالك المنتج تمكنه من تقييم التأثير واتخاذ القرارات المناسبة حول إعادة ترتيب الأولويات أو تعديل نطاق العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مناقشة خطة الطوارئ مع أصحاب المصلحة: قد يكون متأخرًا أو غير ضروري إشراك الجميع في هذه المرحلة.\n- مناقشة مع راعي المشروع: راعي المشروع لا يتدخل عادةً في التفاصيل اليومية لخطط الطوارئ.\n- تنفيذ خطة الطوارئ فورًا: بدون موافقة مالك المنتج، قد يؤدي إلى تنفيذ إجراءات غير مرغوبة أو غير ملائمة.",
      "choices": [
        {
          "text": "مناقشة خطة الطوارئ مع مالك المنتج.",
          "correct": true
        },
        {
          "text": "مناقشة خطة الطوارئ مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "مناقشة خطة الطوارئ مع راعي المشروع.",
          "correct": false
        },
        {
          "text": "تنفيذ خطة الطوارئ فورًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ مرحلة تكرارية حرجة من المشروع، أصبحت مشكلة سبق تحديدها كمخاطر، مؤكدة وتسببت في توقف التقدم. بعد إدخال العنصر الجديد في سجل القضايا، ما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "عندما تحدث مشكلة فعلية تم تحديدها سابقًا كمخاطرة وتؤثر على التقدم، يجب تعزيز التواصل مع أصحاب المصلحة المعنيين وإشراكهم في الحل لضمان الاستجابة السريعة والفعالة.\n\n- لماذا الخيار الصحيح؟\nتعزيز الاتصالات يضمن الشفافية ويشرك أصحاب المصلحة المناسبين، ما يزيد فرص الحل السريع ويدعم اتخاذ قرارات مستنيرة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تغيير خطة إدارة الاتصالات وتعيين مالك للمشكلة: قد يكون جزءًا من الحل لكنه خطوة غير كافية بمفردها.\n- تصعيد المشكلة في اجتماع استعراض المشروع: تأخير في التعامل مع المشكلة.\n- إضافة المشكلة لسجل المنتج: غير ملائم لأن المشكلة تؤثر على التقدم وتحتاج لإجراءات فورية، وليس فقط تسجيلها للعرض.",
      "choices": [
        {
          "text": "تعزيز الاتصالات وإشراك أصحاب المصلحة في الحل عند الضرورة.",
          "correct": true
        },
        {
          "text": "تغيير خطة إدارة الاتصالات وتعيين مالك للمشكلة.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة داخل الفريق خلال اجتماع الاستعراض القادم للمشروع.",
          "correct": false
        },
        {
          "text": "إضافة المشكلة إلى سجل المنتج لعرضها في الدورة الحالية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ من مشروع، تم تعيين مدير مشروع جديد ليحل محل المدير السابق. عند بدء إدارة المشروع، اكتشف المدير الجديد أن أداء الفريق قد انخفض بشكل كبير، مما أثر على مؤشرات الأداء الرئيسية (KPIs) للمشروع. وقد أظهر هذا الفريق أداءً جيدًا في مشاريع مماثلة سابقًا.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك لتحسين الوضع؟",
      "explanation": "عندما يلاحظ مدير المشروع تدهورًا في أداء الفريق مقارنة بأدائه السابق، يجب أولًا فهم الأسباب الجذرية لهذا التغيير قبل اتخاذ أي إجراءات.\n\n- لماذا الخيار الصحيح؟\nعقد اجتماع مع الفريق لتحديد السبب الجذري يساعد على كشف المشاكل الحقيقية التي تؤثر على الأداء، مثل مشاكل تواصل، موارد، أو حوافز.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة خطة إدارة الموارد والأصول التنظيمية: خطوة مهمة ولكنها ليست أولية قبل فهم السبب الجذري.\n- تطبيق تقنيات الضغط الزمني: قد يؤدي إلى زيادة الضغط على الفريق وتدهور الأداء أكثر.\n- تقدير تأثيرات خط الأساس وتقديم طلب تغيير: لا يمكن التقييم بدقة دون معرفة السبب الجذري.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة الموارد والأصول التنظيمية.",
          "correct": false
        },
        {
          "text": "تطبيق تقنيات الضغط الزمني لإعادة المشروع إلى المسار.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مع الفريق لتحديد السبب الجذري لتدهور الأداء.",
          "correct": true
        },
        {
          "text": "تقدير تأثيرات خط الأساس وتقديم طلب تغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى فريق المشروع مؤخرًا دورة تطوير لميزتين في نظام إدارة الأسطول. على الرغم من تسليم الميزات المطلوبة، واجه الفريق عدة مشاكل وصراعات خلال الدورة. شعر أعضاء الفريق بالإحباط من هذه التجربة وهم الآن يفتقرون إلى الحافز بسبب ما حدث.\n\nما الذي يمكن لمدير المشروع فعله لزيادة تحفيز الفريق ومشاركته في المشروع؟",
      "explanation": "عندما يعاني الفريق من الإحباط وقلة الحافز بسبب صراعات وتجارب سلبية، من المهم توفير مساحة للمناقشة المفتوحة وتحليل المشاكل لتحسين الأداء في المستقبل.\n\n- لماذا الخيار الصحيح؟\nإجراء مراجعة استعادية للدورة (Retrospective) يتيح للفريق التعبير عن آرائه، مناقشة المشاكل، واستخلاص الدروس لتحسين التعاون والعمل في الدورات القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ترتيب اجتماعات فردية: قد لا تعالج المشاكل الجماعية أو الديناميكية بالفريق.\n- مراجعة تقدم الدورة: تركز على النتائج أكثر من معالجة المشاكل بين أعضاء الفريق.\n- مراجعة إجراءات التخطيط: ليست كافية لمعالجة المشاكل السلوكية أو الحافزية.",
      "choices": [
        {
          "text": "ترتيب اجتماعات فردية مع أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة تقدم الدورة مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "مراجعة إجراءات التخطيط للدورة مع الفريق.",
          "correct": false
        },
        {
          "text": "إجراء مراجعة استعادية للدورة مع الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أظهر أحد أصحاب المصلحة الرئيسيين اهتمامًا في بداية مشروع رشيق معقد، لكنه أصبح أقل مشاركة مع تقدم الدورات بسبب مسؤوليات إضافية. بعد عدة دورات، رفض هذا صاحب المصلحة ميزة تم تسليمها. يعيد الفريق العمل على الميزة المرفوضة للدورة التالية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "التواصل المستمر وإشراك أصحاب المصلحة الرئيسيين بشكل منتظم يضمن فهمهم ودعمهم للمخرجات، ويقلل من فرص رفض العمل في المراحل المتقدمة.\n\n- لماذا الخيار الصحيح؟\nإشراك أصحاب المصلحة في عملية اتخاذ القرار يضمن توافقهم مع المتطلبات والتسليمات ويقلل من المفاجآت أو الرفض لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- توثيق رؤية المشروع وأهدافه: مهمة لكنها غير كافية بدون تفاعل مباشر مع أصحاب المصلحة.\n- تحليل التغيرات في خصائص أصحاب المصلحة: خطوة تحليلية متأخرة بعد المشكلة.\n- تخصيص الاتصالات حسب الاحتياجات: مهم لكنه أقل تأثيرًا من إشراكهم في القرار.",
      "choices": [
        {
          "text": "توثيق رؤية المشروع وأهدافه.",
          "correct": false
        },
        {
          "text": "تحليل التغيرات في خصائص أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة الرئيسيين في عملية اتخاذ القرار.",
          "correct": true
        },
        {
          "text": "تخصيص الاتصالات مع أصحاب المصلحة حسب احتياجاتهم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لقيادة مشروع رشيق. يريد مدير المشروع استخدام التحفيز لتشجيع الفريق على الأداء الجيد طوال فترة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "التحفيز المستمر مهم للحفاظ على حماس الفريق وتحقيق أداء جيد.\n\n- لماذا الخيار الصحيح؟\nتنفيذ نظام مكافآت يساعد في تعزيز الحافز عند أعضاء الفريق ويجعلهم يشعرون بالتقدير والمشاركة الفعالة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- استخدام الاحتياطيات الإدارية لتمويل أنشطة بناء الفريق: مهمة لكنها ليست وسيلة مباشرة للتحفيز.\n- تضخيم تقديرات المشروع لتوفير هامش مالي: هذا قد يؤثر سلبًا على مصداقية التخطيط.\n- طلب تمويل إضافي من راعي المشروع: قد يكون ضروريًا لكنه ليس الطريقة الأساسية للتحفيز.",
      "choices": [
        {
          "text": "تنفيذ نظام مكافآت بهدف إبقاء الفريق متحمسًا ومشاركًا.",
          "correct": true
        },
        {
          "text": "استخدام الاحتياطيات الإدارية لتمويل أنشطة بناء الفريق.",
          "correct": false
        },
        {
          "text": "تضخيم تقديرات المشروع لتوفير هامش مالي لأنشطة الفريق.",
          "correct": false
        },
        {
          "text": "طلب تمويل إضافي من راعي المشروع لأنشطة بناء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "قررت قيادة الشركة الاستثمار في منتج جديد باستخدام نهج رشيق. بدأت الفرق التجارية وفِرَق المنتج في نشاط التخطيط لهذا المشروع  الجديد.\n\nما هي العوامل الثلاثة الأساسية التي يحتاجها مدير المشروع لتسليم هذا المنتج؟ (اختر 3)",
      "explanation": "هذه العوامل تساعد على وضوح الرؤية وتوجيه الفريق لتحقيق أهداف المنتج.\n\n- لماذا الخيارات الصحيحة؟\n- رؤية المنتج: توفر الهدف والرؤية الشاملة للمنتج.\n- خارطة طريق المنتج: خطة مراحل العمل والتطوير.\n- قائمة المنتج عالية المستوى: تفاصيل الميزات والمتطلبات.\n\n- لماذا الخيارات الخاطئة؟\n- مؤشرات الأداء الرئيسية (KPIs): مهمة لكن ليست من أساسيات التخطيط الأولي.\n- مؤشرات أداء الجدول الزمني (SPIs): تتعلق بقياس الجدول الزمني، ليست من العوامل الأساسية.",
      "choices": [
        {
          "text": "رؤية المنتج",
          "correct": true
        },
        {
          "text": "خارطة طريق المنتج",
          "correct": true
        },
        {
          "text": "قائمة المنتج عالية المستوى",
          "correct": true
        },
        {
          "text": "مؤشرات الأداء الرئيسية (KPIs)",
          "correct": false
        },
        {
          "text": "مؤشرات أداء الجدول الزمني (SPIs)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تشكيل فريق جديد لمشروع سيستخدم نهجًا تنبؤيًا في جمع المتطلبات ونهجًا رشيقًا في التطوير والاختبار. ليس كل أعضاء الفريق لديهم خبرة في العمل ضمن بيئة رشيقة. بدأ الجدول الزمني في الانزلاق بسبب الهيكل غير الواضح لنهج التطوير الرشيق.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "الاجتماعات اليومية (وقوف) تساعد على المتابعة المستمرة وحل المشاكل بسرعة.\n\n- لماذا الخيار الصحيح؟\nإنشاء اجتماعات وقوف يومية يسمح بتتبع التقدم والتعرف المبكر على التأخيرات، مما يساعد في اتخاذ إجراءات سريعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعداد اجتماعات حالة أسبوعية: قليلة التكرار لتتبع التأخيرات اليومية.\n- الاجتماع مع الفريق للسماح باتخاذ القرارات: جيد لكنه لا يغطي متابعة يومية.\n- اجتماعات دورية لتحديد الأداء المنخفض: يركز على المشكلة بدون متابعة يومية مستمرة.",
      "choices": [
        {
          "text": "إعداد اجتماعات حالة أسبوعية لمراجعة تقدم الفريق وتصعيد التأخيرات بانتظام.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الفريق والسماح للأعضاء باتخاذ القرارات وتحديد أهداف الأداء.",
          "correct": false
        },
        {
          "text": "إنشاء اجتماعات وقوف يومية لتتبع التقدم وتصعيد التأخيرات لأصحاب المصلحة حسب الحاجة.",
          "correct": true
        },
        {
          "text": "إجراء اجتماعات دورية وتحديد الأعضاء ذوي الأداء المنخفض.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد أصحاب المصلحة الكبار في الأعمال وذو خبرة طويلة يمارس ضغطًا على فريق رشيق لتسليم معظم الوظائف الموعودة للعميل بعد 18 شهرًا بدلًا من تسليمات تدريجية متعددة خلال تلك الفترة.\n\nما الذي يجب أن يفعله قائد المشروع بعد ذلك؟",
      "explanation": "التعامل مع أصحاب المصلحة بحكمة وشرح الفوائد يساعد في بناء الثقة وتحقيق نجاح المشروع.\n\n- لماذا الخيار الصحيح؟\nالعمل مع صاحب المصلحة لفهم مخاوفه وشرح فوائد التسليمات التدريجية يدعم تحقيق قيمة مستمرة ويقلل المخاطر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- العمل مع الفريق لجدولة التسليمات التزايدية: لا يعالج ضغط صاحب المصلحة أو مخاوفه.\n- جدولة اجتماعات مع العميل لتحديد دعمه: لا يركز على مخاوف صاحب المصلحة.\n- تقديم تفاصيل القلق وضبط الأهداف: قد يؤدي لتلبية طلبات غير مناسبة ويزيد من المخاطر.",
      "choices": [
        {
          "text": "العمل مع الفريق الرشيق لجدولة التسليمات التزايدية لتمكين تسليم القيمة التجارية في وقت أقرب للعميل.",
          "correct": false
        },
        {
          "text": "جدولة اجتماعات مع العميل لتحديد قدرته على دعم التسليمات التزايدية المتعددة.",
          "correct": false
        },
        {
          "text": "تقديم تفاصيل القلق للفريق الرشيق وضبط أهدافهم وخطط الإطلاق لتتوافق مع طلب صاحب المصلحة.",
          "correct": false
        },
        {
          "text": "العمل مع صاحب المصلحة لفهم المخاوف مع توضيح فوائد التسليمات التزايدية في الوقت نفسه.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع استثماري لمعالجة المياه. أصدرت الحكومة المحلية مؤخرًا قانونًا يتطلب الامتثال لمعايير المياه النظيفة وفقًا للمعايير العالمية. هذه لائحة جديدة بدأت في الشهر الماضي وتم تمريرها بسرعة.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "التعامل مع التغييرات القانونية بسرعة مهم لتجنب التأخيرات والمخاطر.\n\n- لماذا الخيار الصحيح؟\nإجراء تحليل تأثير اللوائح الجديدة يساعد على تقييم تأثيرها على المشروع وإبلاغ أصحاب المصلحة لاتخاذ قرارات مستنيرة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاستمرار في المشروع بدون تعديل: قد يعرض المشروع لمخاطر عدم الامتثال.\n- التوصية بالاستمرار فقط: قد يكون غير واقعي بدون فهم كامل للتأثير.\n- التوصية بإيقاف المشروع فورًا: قد تكون خطوة متسرعة دون تحليل كافٍ.",
      "choices": [
        {
          "text": "إبلاغ أصحاب المصلحة والاستمرار في المشروع وفقًا للخطط الأصلية لأن القانون صدر بعد بدء المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع والتوصية بالاستمرار لأن المتطلبات القانونية الجديدة يمكن تحقيقها.",
          "correct": false
        },
        {
          "text": "إجراء تحليل لتأثير اللوائح على المشروع والأعمال التجارية وإبلاغ أصحاب المصلحة بها.",
          "correct": true
        },
        {
          "text": "التوصية بإيقاف جميع أعمال المشروع فورًا حتى يتم فهم تأثير اللوائح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الاستحواذ على شركة ناشئة في مراحلها المبكرة من قبل شركة كبرى. في ظل هذا السيناريو الجديد، طُلب من مدير المشروع مراجعة خارطة طريق المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "تحديد تعريف القيمة مع أصحاب المصلحة يساعد في إعادة ترتيب الأولويات بما يتماشى مع أهداف الشركة الجديدة.\n\n- لماذا الخيار الصحيح؟\nفهم القيمة وأولويات أصحاب المصلحة يضمن أن خارطة الطريق تعكس الأهداف الاستراتيجية الجديدة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعادة ترتيب الأولويات بناءً فقط على ROI: قد يكون ضيق النطاق ويهمل الأهداف الأخرى.\n- التركيز على الفوائد طويلة الأمد وتقليل الدين التقني: جيد لكنه لا يضمن توافق مع أصحاب المصلحة الجدد.\n- إطلاق استطلاع للعملاء: قد يكون متأخرًا وغير عملي في هذه المرحلة المبكرة.",
      "choices": [
        {
          "text": "تحديد تعريف القيمة مع أصحاب المصلحة وإعادة ترتيب أولويات قائمة المشروع وفقًا لذلك.",
          "correct": true
        },
        {
          "text": "إعادة ترتيب أولويات قائمة المشروع من خلال إعطاء الأولوية للميزات التي تزيد من العائد على الاستثمار (ROI).",
          "correct": false
        },
        {
          "text": "إعادة ترتيب خارطة الطريق من خلال التركيز على الفوائد طويلة الأمد وتقليل الدين التقني.",
          "correct": false
        },
        {
          "text": "إطلاق استطلاع للعملاء لتقييم الميزات الرئيسية للمشروع قبل إعادة ترتيب خارطة الطريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع تنفيذ نظام لإدارة صحة الأصول. أشار راعي الأعمال التنفيذي إلى أن النظام من المتوقع أن يُحسّن جودة العمليات ويطيل عمر الأصول.\n\nما الذي يجب على مدير المشروع فعله لإثبات القيمة التجارية بمجرد أن يكون النظام قيد التشغيل؟",
      "explanation": "لتأكيد القيمة التجارية، يجب على مدير المشروع تحديد معايير نجاح واضحة وقابلة للقياس ترتبط مباشرة بالأهداف التجارية، مثل تقليل التكاليف وتحسين الأداء.\n\n- لماذا الخيار الصحيح؟\nتحديد معايير النجاح الحرجة ووفورات التكاليف ومقاييس الأداء المستمرة يوفر دليلًا عمليًا على تحقيق القيمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- كتابة حالات اختبار مهمة لكنها تركز على الجودة التقنية وليس إثبات القيمة.\n- التحقق من المطابقة للمتطلبات ضروري لكنه لا يكفي لقياس القيمة التجارية.\n- مراجعة العائد على الاستثمار والبيانات المرجعية جيدة ولكنها غير كافية دون تحديد معايير النجاح الواضحة.",
      "choices": [
        {
          "text": "تحديد معايير النجاح الحرجة، وتحديد وفورات التكاليف المحتملة، ومقاييس الأداء المستمرة للمشروع.",
          "correct": true
        },
        {
          "text": "كتابة حالات اختبار تتماشى مع القيم التجارية وضمان وضوح معايير القبول أثناء اختبار قبول المستخدم (UAT).",
          "correct": false
        },
        {
          "text": "التحقق من أن جميع المتطلبات ومعايير القبول تتماشى مع القيمة والتوقعات التجارية.",
          "correct": false
        },
        {
          "text": "التحقق من العائد على الاستثمار (ROI) ومراجعة أداء الأصول الحالي واستخدامه كنقطة مرجعية للقياسات المستقبلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع لتسليم حل في الدولة (أ). ونظرًا لاحتمالية حدوث خرق أمني، فإن حكومة الدولة (أ) تحظر التكنولوجيا التي سيتم استخدامها في الحل، مما يؤثر سلبًا على المشروع. مدير المشروع يقترب من إتمام التثبيت بعد أن اشترى بالفعل المواد والتكنولوجيا المحظورة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "التعامل مع التغييرات التنظيمية المفاجئة يجب أن يتم عبر عملية رسمية لإدارة التغيير لضمان توافق الحل مع القوانين.\n\n- لماذا الخيار الصحيح؟\nمراجعة خطة إدارة المشروع واتباع عملية التحكم في التغيير يساعد على تقييم التأثير الرسمي والتخطيط للاستجابة المناسبة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة قانونية مهمة لكنها ليست الخطوة الأولى.\n- الاجتماع مع راعي المشروع ضروري لكنه لا يعالج الخطوة الإجرائية الأولية.\n- إبلاغ العميل بعدم إمكانية التسليم خطوة سلبية وغير احترافية دون محاولة التكيف.",
      "choices": [
        {
          "text": "مراجعة خطة إدارة المشروع واتباع عملية التحكم في التغيير.",
          "correct": true
        },
        {
          "text": "طلب من الفريق القانوني مراجعة التغيير وتحديد الاستجابة المناسبة.",
          "correct": false
        },
        {
          "text": "الاجتماع مع راعي المشروع بشأن المشكلة وطلب التوجيه بشأن الخطوات التالية.",
          "correct": false
        },
        {
          "text": "إبلاغ العميل بأن المشروع لا يمكنه تسليم النطاق المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يُطوّر مشروع منتجًا يكون فيه الوقت إلى السوق أمرًا حاسمًا. خلال مرحلة التنفيذ، قدم العميل طلب تغيير لتضمين أحدث التقنيات التي ستُحسن ميزات المنتج وتوفر ميزة تنافسية. سيؤثر التغيير على قيود المشروع، لكن الفوائد تفوق التكلفة والجهد.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "في حالات الطلبات التي تحسن القيمة التنافسية، من الأفضل استخدام نهج تسليم تزايدي يسرّع وصول الميزات الأساسية للسوق.\n\n- لماذا الخيار الصحيح؟\nاعتماد التسليم التزايدي يمكّن المشروع من تقديم القيمة بشكل أسرع مع إمكانية دمج التحسينات لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- بدء مشروع منفصل قد يسبب تكرارًا ويؤخر التسليم.\n- تنفيذ عملية تغيير متكاملة قد يؤدي إلى تأخير دون ضمان سرعة التسليم.\n- إغلاق المشروع الحالي وإعادة البدء خطوة مكلفة وغير ضرورية.",
      "choices": [
        {
          "text": "اعتماد نهج تسليم تزايدي وإطلاق الميزات الأساسية للمنتج إلى السوق أولًا لمواجهة المنافسة.",
          "correct": true
        },
        {
          "text": "بدء مشروع منفصل لتبني التكنولوجيا الجديدة تدريجيًا بهدف تحسين ميزات المنتج مع نضج التكنولوجيا.",
          "correct": false
        },
        {
          "text": "تنفيذ عملية تغيير متكاملة ومراجعة قيود المشروع لإدارة النطاق المعزز بشكل فعال.",
          "correct": false
        },
        {
          "text": "إغلاق المشروع الحالي وبدء مشروع جديد باستخدام نهج تسليم تزايدي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طُلب من مدير مشروع إدارة مشروع سيمكن الشركة من الامتثال لتنظيم جديد قادم. بعد انطلاق المشروع مباشرة، تم تعديل النطاق ليعمل فريق المشروع الآن على مهام محددة، بينما يدير فريق عالمي البرنامج لعدة دول بالتوازي. لم تتم مشاركة خطة إدارة المشروع بعد، والمشروع له موعد نهائي ثابت.\n\nما الذي يجب على مدير المشروع فعله للتعامل مع النطاق والتغييرات؟",
      "explanation": "في حالة وجود نطاق غير واضح أو متغير مع موعد نهائي ثابت، يُفضل البدء بقائمة مهام أولية (Backlog) والعمل على المهام الأكثر وضوحًا مع تحسين النطاق تدريجيًا وفقاً لمبادئ العمل الرشيق.\n\n- لماذا الخيار الصحيح؟\nتحديد قائمة أولية وبدء العمل يسمح بتسريع الانطلاق مع استيعاب التغييرات تدريجياً دون تأخير.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إنشاء إدخال خطر مهم لكنه لا يحل المشكلة العملية في إدارة النطاق.\n- إضفاء الطابع الرسمي على التغيير مهم لكنه متأخر دون خطة واضحة.\n- مراجعة الأصول التنظيمية مفيدة لكنها لا تعالج المشكلة الحالية بشكل مباشر.",
      "choices": [
        {
          "text": "تحديد قائمة أولية (Backlog) وبدء العمل على المهام الأكثر وضوحًا، ثم تحسين النطاق تدريجيًا.",
          "correct": true
        },
        {
          "text": "إنشاء إدخال خطر في خطة إدارة المخاطر بسبب غياب خطة إدارة المشروع العالمية.",
          "correct": false
        },
        {
          "text": "إضفاء الطابع الرسمي على التغيير في النطاق مع راعي المشروع لتحديد المسؤولية على المهام المحددة.",
          "correct": false
        },
        {
          "text": "مراجعة الأصول التنظيمية للعمل (OPA) من مواقف مماثلة والنهج التي تم تنفيذها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تتزامن مرحلة تنفيذ المشروع مع عطلة في الدولة التي يقيم بها غالبية أعضاء الفريق. هذه المرحلة حرجة، ويُطلب من جميع أعضاء الفريق العمل خلال العطلة، مما يؤثر سلبًا على معنويات الفريق.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب ذلك؟",
      "explanation": "تخطيط الموارد بشكل جيد يشمل التعرف على العطلات والتخطيط المسبق لتوزيع العمل لتجنب تأثير سلبي على معنويات الفريق.\n\n- لماذا الخيار الصحيح؟\nتطوير خطة إدارة الموارد الجيدة يسمح بالتخطيط المناسب وتوزيع المهام بشكل يحترم ظروف الأعضاء.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب المساعدة من فرق أخرى قد لا يكون متاحاً أو مناسباً.\n- تأجيل الأنشطة قد يؤدي إلى تأخير المشروع.\n- خطة مشاركة أصحاب المصلحة مهمة لكنها لا تعالج إدارة الموارد.",
      "choices": [
        {
          "text": "تطوير خطة إدارة الموارد بشكل أفضل.",
          "correct": true
        },
        {
          "text": "طلب المساعدة من فرق أخرى في دول أخرى.",
          "correct": false
        },
        {
          "text": "تأجيل أنشطة المشروع.",
          "correct": false
        },
        {
          "text": "إعداد خطة مشاركة أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع أن المشروع متأخر عن الجدول الزمني بسبب تأخر تسليم المواد. أبلغ فريق المشتريات مدير المشروع بأن القواعد الجديدة التي فرضتها الحكومة لشراء هذه المواد تسببت في هذا التأخير.\n\nفي أي خطة يجب توثيق هذه القواعد الجديدة؟",
      "explanation": "قواعد الشراء والتغييرات فيها يجب أن توثق في خطة إدارة المشتريات لأنها تتعلق بسياسات وإجراءات الشراء التي تؤثر على المشروع.\n\n- لماذا الخيار الصحيح؟\nخطة إدارة المشتريات تتضمن جميع اللوائح والسياسات المتعلقة بعمليات الشراء، مما يجعلها المكان الأنسب لتوثيق هذه القواعد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة الاتصالات تتعلق بتبادل المعلومات وليس بالسياسات.\n- خطة مشاركة أصحاب المصلحة تعنى بالتواصل مع أصحاب المصلحة.\n- خطة إدارة الجدول الزمني تتعلق بمواعيد التسليم وليس بالتشريعات أو القواعد.",
      "choices": [
        {
          "text": "خطة إدارة المشتريات.",
          "correct": true
        },
        {
          "text": "خطة إدارة الاتصالات.",
          "correct": false
        },
        {
          "text": "خطة مشاركة أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "خطة إدارة الجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تنفيذ المشروع، أعرب العديد من أصحاب المصلحة عن مخاوف بشأن أداء الفريق والتسليم. يعتقد مدير المشروع أن المشروع يتقدم حسب النطاق والميزانية والجدول الزمني المعتمدين.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "عندما يشعر أصحاب المصلحة بالقلق رغم أن المشروع يسير كما هو مخطط، فإن الرجوع إلى خطة إدارة الاتصالات هو الخطوة الصحيحة لإدارة توقعاتهم وتوضيح الوضع الحالي.\n\n- لماذا الخيار الصحيح؟\nخطة إدارة الاتصالات تساعد مدير المشروع على تحديد كيف ومتى يتم التواصل مع أصحاب المصلحة لطمأنتهم وتحديثهم بما يزيل المخاوف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال بريد إلكتروني دون خطة قد لا يكون فعالاً أو قد يُساء فهمه.\n- طلب تدخل راعي المشروع غير ضروري إذا كان المشروع يسير بشكل جيد.\n- مطالبة أصحاب المصلحة بتصعيد مخاوفهم ليست إدارة فعالة للموقف.",
      "choices": [
        {
          "text": "الرجوع إلى خطة إدارة الاتصالات لإدارة توقعات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "إرسال بريد إلكتروني لأصحاب المصلحة لطمأنتهم بالإجراءات.",
          "correct": false
        },
        {
          "text": "طلب تدخل راعي المشروع.",
          "correct": false
        },
        {
          "text": "مطالبة أصحاب المصلحة بتصعيد مخاوفهم إلى المدير التنفيذي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تنفيذ متطلب عمل لمشروع تكنولوجيا معلومات يؤثر على عدة تطبيقات. يلاحظ مالك التطبيق أن التغييرات في وظيفة في التطبيق (X) يمكن أن تبدأ فقط عند الانتهاء من تطوير ميزة جديدة في التطبيق (Y).\n\nما نوع التبعية التي يمثلها هذا المثال؟",
      "explanation": "التبعية 'انتهاء إلى بداية (Finish-to-Start, FS)' تعني أن نشاطاً لا يمكن أن يبدأ إلا بعد انتهاء النشاط السابق.\n\n- لماذا الخيار الصحيح؟\nالتغييرات في التطبيق (X) تبدأ فقط بعد الانتهاء من تطوير ميزة في التطبيق (Y)، وهذا نموذج كلاسيكي لتبعية FS.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- بداية إلى بداية (SS) تعني أن النشاطين يبدأان في نفس الوقت.\n- بداية إلى انتهاء (SF) تعني أن بداية نشاط تعتمد على انتهاء نشاط آخر وهو عكس الحالة.\n- انتهاء إلى انتهاء (FF) تعني أن النشاطين ينتهيان في نفس الوقت وليس البداية بعد الانتهاء.",
      "choices": [
        {
          "text": "انتهاء إلى بداية (FS).",
          "correct": true
        },
        {
          "text": "بداية إلى بداية (SS).",
          "correct": false
        },
        {
          "text": "بداية إلى انتهاء (SF).",
          "correct": false
        },
        {
          "text": "انتهاء إلى انتهاء (FF).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تسببت مشكلة غير متوقعة في الحاجة إلى شراء آلة جديدة ضرورية لتلبية المواصفات المطلوبة للجودة.\n\nمن أين يمكن الحصول على الأموال اللازمة؟",
      "explanation": "في حالات الحاجة إلى تمويل غير مخطط له بسبب مشكلات غير متوقعة، يستخدم مدير المشروع عادةً الاحتياطي الإداري الذي يُخصص لإدارة المخاطر غير المتوقعة.\n\n- لماذا الخيار الصحيح؟\nالاحتياطي الإداري يُستخدم لتغطية التكاليف الإضافية التي تظهر خلال المشروع والتي لم تكن مغطاة في الميزانية الأصلية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- أصحاب المصلحة الرئيسيين ليسوا مصدر تمويل مباشر.\n- الاحتياطي المخصص للطوارئ يستخدم للمخاطر المحددة مسبقًا وليس للحالات غير المتوقعة.\n- راعي المشروع قد يشارك في اتخاذ القرار ولكنه ليس مصدر التمويل الفعلي.",
      "choices": [
        {
          "text": "الاحتياطي الإداري",
          "correct": true
        },
        {
          "text": "أصحاب المصلحة الرئيسيين",
          "correct": false
        },
        {
          "text": "الاحتياطي المخصص للطوارئ",
          "correct": false
        },
        {
          "text": "راعي المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير مشروع إنشاء بقيمة 15 مليون دولار أمريكي تحقيق معلم محدد في المشروع في وقت أقرب من المخطط له لأن نمطًا موسميًا من الطقس القاسي متوقع قريبًا. المشروع يعاني بالفعل من تجاوز في الميزانية، وراعي المشروع غير مستعد لتوفير تمويل إضافي.\n\nما الأداة أو التقنية التي يجب أن يستخدمها مدير المشروع لتحقيق هذا المعلم قبل بدء الطقس القاسي؟",
      "explanation": "التنفيذ المتوازي (Fast Tracking) يُستخدم لتقليل مدة المشروع عبر تنفيذ بعض الأنشطة بالتوازي بدلاً من ترتيبها بالتسلسل.\n\n- لماذا الخيار الصحيح؟\nالتنفيذ المتوازي لا يتطلب موارد إضافية وهو مناسب في حالة الميزانية المحدودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المحاكاة أداة تحليل وليست أداة ضغط زمن.\n- تسوية الموارد قد تؤدي إلى تأخيرات إضافية.\n- الضغط (Crashing) يتطلب تمويل إضافي غير متاح هنا.",
      "choices": [
        {
          "text": "المحاكاة",
          "correct": false
        },
        {
          "text": "التنفيذ المتوازي (Fast Tracking)",
          "correct": true
        },
        {
          "text": "تسوية الموارد",
          "correct": false
        },
        {
          "text": "الضغط على الجدول الزمني (Crashing)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب تغييرات تنظيمية، تم استبدال أحد أصحاب المصلحة الرئيسيين بموظف جديد. الاجتماع التالي لمراجعة حالة المشروع لن يحدث حتى الشهر القادم.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "التواصل المبكر مع أصحاب المصلحة الجدد ضروري لبناء فهم مشترك وتجنب المفاجآت.\n\n- لماذا الخيار الصحيح؟\nجدولة اجتماع مباشر يوفر تواصل شخصي وفرصة للإجابة على الاستفسارات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال تقرير قد لا يكون كافيًا لبناء الثقة.\n- طلب مشورة الراعي خطوة غير فعالة مباشرة.\n- الانتظار حتى الاجتماع التالي يزيد من مخاطر سوء الفهم.",
      "choices": [
        {
          "text": "جدولة اجتماع منفصل مع صاحب المصلحة الجديد لإطلاعه على حالة المشروع.",
          "correct": true
        },
        {
          "text": "إعداد وإرسال تقرير حالة المشروع لصاحب المصلحة الجديد للمراجعة.",
          "correct": false
        },
        {
          "text": "طلب المشورة من راعي المشروع حول كيفية الحصول على دعم صاحب المصلحة الجديد.",
          "correct": false
        },
        {
          "text": "الانتظار حتى نافذة الاتصال التالية لمشاركة المعلومات مع صاحب المصلحة الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتشف فريق المشروع فرصة لتحسين البرنامج دون التأثير على الميزانية أو الجدول الزمني. نفذ الفريق التحسين دون التوثيق المناسب، مما تسبب لاحقًا في مشاكل في الإنتاج.\n\nما العملية التي كان يجب تنفيذها لمنع ذلك؟",
      "explanation": "التحكم المتكامل في التغيير يضمن تقييم جميع التغييرات من خلال لجنة رسمية قبل تنفيذها.\n\n- لماذا الخيار الصحيح؟\nهذه العملية تمنع تنفيذ تغييرات غير مصرح بها أو غير مدروسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التحكم في الجدول يتعلق بالتوقيت فقط.\n- تحليل نوعي للمخاطر يركز على تقييم المخاطر وليس الموافقة على التغييرات.\n- تخطيط إدارة النطاق يضع الخطوط العامة ولا يعالج التغييرات أثناء التنفيذ.",
      "choices": [
        {
          "text": "التحكم في الجدول الزمني",
          "correct": false
        },
        {
          "text": "إجراء تحليل نوعي للمخاطر",
          "correct": false
        },
        {
          "text": "تخطيط إدارة النطاق",
          "correct": false
        },
        {
          "text": "إجراء التحكم المتكامل في التغيير",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تجريبي جاهز للإغلاق ويرغب فريق المشروع في توثيق التحديات التي تم التغلب عليها والفرص المستقبلية.\n\nأين سيتم توثيق هذه المعلومات؟",
      "explanation": "سجل الدروس المستفادة هو المكان المخصص لتوثيق الخبرات المكتسبة أثناء المشروع بما في ذلك التحديات والفرص والتحسينات.\n\n- لماذا الخيار الصحيح؟\nسجل الدروس المستفادة يساعد في تحسين أداء المشاريع المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديثات أصول العمليات التنظيمية: تشمل السياسات والإجراءات العامة.\n- تقرير أداء العمل: يعكس الوضع الحالي ولا يوثق الخبرات.\n- خطة إدارة المشروع: وثيقة للتخطيط وليس للتوثيق بعد الإغلاق.",
      "choices": [
        {
          "text": "تحديثات أصول العمليات التنظيمية",
          "correct": false
        },
        {
          "text": "تقرير أداء العمل",
          "correct": false
        },
        {
          "text": "خطة إدارة المشروع",
          "correct": false
        },
        {
          "text": "سجل الدروس المستفادة",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق المشروع تحديد متطلبات المشروع والمنتج.\n\nما الأدوات أو التقنيات التي تم استخدامها لإنجاز ذلك؟",
      "explanation": "العصف الذهني ومخططات التقارب والخرائط الذهنية من الأدوات المستخدمة لتحديد وتجميع وتحليل المتطلبات بشكل إبداعي ومنظم.\n\n- لماذا الخيار الصحيح؟\nهذه الأدوات تساعد على تجميع الأفكار وتحليلها بطريقة مرئية وفعالة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المقارنة المعيارية ومخطط الشبكة ليست أدوات رئيسية لتحديد المتطلبات.\n- WBS يستخدم لاحقًا بعد تحديد المتطلبات.\n- الملاحظة والمحادثة قد تدعم لكن ليست الوسيلة الرئيسية.",
      "choices": [
        {
          "text": "المقارنة المعيارية، مخطط الشبكة، وتحليل الاتجاهات",
          "correct": false
        },
        {
          "text": "هيكل تقسيم العمل (WBS)، تحليل الاتجاهات، والملاحظة/المحادثة",
          "correct": false
        },
        {
          "text": "العصف الذهني، مخططات التقارب، والخرائط الذهنية",
          "correct": true
        },
        {
          "text": "مخططات التقارب، المقارنة المعيارية، والملاحظة/المحادثة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم حساب الميزانية الأصلية عند الإنجاز (BAC) لمشروع بقيمة 100,000 دولار أمريكي، لكن التقدير عند الإنجاز (EAC) هو 120,000 دولار. إذا كان مؤشر الأداء الزمني (SPI) يساوي 1، فما هو مؤشر الأداء التكلفة (CPI)؟",
      "explanation": "عندما يكون EAC أكبر من BAC فهذا يعني أن الكفاءة أقل من المخطط له.\n\n- لماذا الخيار الصحيح؟\nCPI = BAC / EAC = 100,000 / 120,000 < 1.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إذا كان CPI = 1 فهذا يعني أن التكاليف تتماشى مع الخطة وهذا ليس الوضع هنا.\n- أكبر من 1 تعني أداء أفضل من المتوقع.\n- 1.2 غير منطقية هنا لأن EAC أكبر من BAC.",
      "choices": [
        {
          "text": "يساوي 1.2",
          "correct": false
        },
        {
          "text": "أقل من 1",
          "correct": true
        },
        {
          "text": "يساوي 1",
          "correct": false
        },
        {
          "text": "أكبر من 1",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اختبار أحد مكونات المشروع، يكتشف مختبر كبير ميزة وظيفية تضمن أداء الحل المستقبلي للمشروع. سيؤدي ذلك إلى تغيير في نطاق العمل.\n\nما نوع طلب التغيير الذي يجب تقديمه لتضمين هذه الوظيفة؟",
      "explanation": "الإجراء الوقائي يُستخدم لإضافة ميزات أو خطوات تهدف إلى منع مشاكل مستقبلية قبل وقوعها. في هذا السياق، الميزة التي اكتشفها المختبر ستساهم في تحسين الأداء لاحقًا، لذلك يتم تقديم طلب تغيير من نوع إجراء وقائي.\n\n- لماذا الخيار الصحيح؟\nالإجراء الوقائي يعالج تحسينات مستقبلية قبل ظهور المشكلات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الإجراء التصحيحي: لحل مشكلة حالية وليس لتحسين مستقبلي.\n- إصلاح عيب: مخصص لتصحيح خلل تم اكتشافه.\n- تحديث النطاق: نتيجة لتغيير وليس نوعه.",
      "choices": [
        {
          "text": "إجراء وقائي",
          "correct": true
        },
        {
          "text": "إجراء تصحيحي",
          "correct": false
        },
        {
          "text": "إصلاح عيب",
          "correct": false
        },
        {
          "text": "تحديث النطاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة وثائق المشروع، اكتشف مدير المشروع أنه تم إجراء تعديلات بدون الموافقات اللازمة.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "في هذه الحالة يجب على مدير المشروع الرجوع إلى خطة إدارة التغيير لتحديد كيفية التعامل مع التعديلات غير المصرح بها. هذه الخطة توضح الإجراءات التي يجب اتخاذها لتصحيح الوضع وضمان توثيق جميع التغييرات بالشكل المناسب.\n\n- لماذا الخيار الصحيح؟\nخطة إدارة التغيير تحتوي على العمليات اللازمة للتحكم في التعديلات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد الأمر مباشرة ليس خطوة أولى.\n- مراجعة خطة إدارة المتطلبات غير مناسبة لهذه الحالة.\n- تصعيد الأمر إلى الراعي يتم بعد استنفاد الوسائل الداخلية.",
      "choices": [
        {
          "text": "تصعيد الأمر إلى مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة التغيير.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة المتطلبات.",
          "correct": false
        },
        {
          "text": "تصعيد الأمر إلى راعي المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب التزامات تجاه مشروع آخر، لم يقم محاسب بتسليم تقرير مهم إلى مدير المشروع في الوقت المحدد. لم يكن مدير المشروع يتوقع التأخير ولم يكن على علم بأن المحاسب لديه أولويات متضاربة.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "خطة تخصيص الموارد تُظهر التزامات كل عضو في الفريق بما في ذلك المشاركات في مشاريع أخرى. بالرجوع إليها، يمكن لمدير المشروع تنسيق الجهود وتفادي التعارض بين المهام.\n\n- لماذا الخيار الصحيح؟\nخطة تخصيص الموارد ضرورية لفهم توزيع العمل والالتزامات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مصفوفة RACI تحدد من المسؤول لكنها لا تبين مدى توفر الأشخاص.\n- الجداول الزمنية وتقويم الموارد يعتمدان على معلومات يتم إدخالها مسبقًا وقد لا تعكس تضارب الالتزامات.",
      "choices": [
        {
          "text": "الرجوع إلى مصفوفة RACI.",
          "correct": false
        },
        {
          "text": "الرجوع إلى الجداول الزمنية.",
          "correct": false
        },
        {
          "text": "الرجوع إلى خطة تخصيص الموارد.",
          "correct": true
        },
        {
          "text": "الرجوع إلى تقويم الموارد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الذي يجب أن يفعله مدير المشروع للحصول على موافقة أصحاب المصلحة؟",
      "explanation": "لضمان موافقة أصحاب المصلحة، يجب على مدير المشروع تنفيذ عملية إدارة مشاركة أصحاب المصلحة. هذه العملية تشمل تحديد توقعاتهم وتلبية احتياجاتهم وتعزيز مشاركتهم طوال دورة حياة المشروع.\n\n- لماذا الخيار الصحيح؟\nإدارة مشاركة أصحاب المصلحة تهدف بشكل مباشر إلى تحقيق رضاهم وموافقتهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث خطة إدارة الموارد لا يتعلق مباشرة بموافقة أصحاب المصلحة.\n- مراقبة والتحكم في عمل المشروع يركز على الأداء وليس الموافقات.\n- جدولة اجتماع قد تكون وسيلة، لكنها ليست عملية معتمدة لهذا الهدف.",
      "choices": [
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": false
        },
        {
          "text": "إدارة مشاركة أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "مراقبة والتحكم في عمل المشروع.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع بين الراعي وأصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع تصميم جاهز للانتقال إلى الإنتاج.\n\nما النشاط المطلوب لإغلاق المرحلة؟",
      "explanation": "قبل الانتقال إلى الإنتاج، يجب توثيق تأثيرات أي تخصيصات تمت على العمليات. هذا الأمر ضروري لضمان وضوح الأثر على العمل المستقبلي وعدم تكرار التعديلات غير المسجلة.\n\n- لماذا الخيار الصحيح؟\nتسجيل تأثيرات التخصيص يساعد في الحفاظ على معايير العمليات وتحسينها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد الميزانية الموجزة يتم في مراحل التخطيط.\n- إدارة الجودة مرتبطة بالمراقبة وليست بالإغلاق.\n- الإجراءات الوقائية تتعلق بالمخاطر وليست بإغلاق المرحلة.",
      "choices": [
        {
          "text": "تحديد الميزانية الموجزة.",
          "correct": false
        },
        {
          "text": "إدارة الجودة.",
          "correct": false
        },
        {
          "text": "ضمان إتمام الإجراءات الوقائية.",
          "correct": false
        },
        {
          "text": "تسجيل تأثيرات التخصيص على أي عملية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق موزع جغرافيًا مشروعًا بنجاح.\n\nيرغب مدير المشروع في الحصول بسرعة على ملاحظات الفريق لأغراض التحليل الإحصائي.\n\nما الطريقة التي يجب أن يستخدمها مدير المشروع؟",
      "explanation": "الاستبيانات تعتبر وسيلة فعالة لجمع البيانات والملاحظات من فرق موزعة جغرافيًا، وتسمح بتحليل النتائج إحصائيًا بسهولة.\n\n- لماذا الخيار الصحيح؟\nالاستبيانات توفر جمع بيانات كمية قابلة للتحليل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مؤتمر الفيديو وجلسات التركيز صعب تنظيمها مع فرق موزعة.\n- البريد الإلكتروني أقل تنظيمًا وأصعب في التحليل الإحصائي.",
      "choices": [
        {
          "text": "مؤتمر فيديو.",
          "correct": false
        },
        {
          "text": "مجموعة تركيز.",
          "correct": false
        },
        {
          "text": "استبيانات.",
          "correct": true
        },
        {
          "text": "بريد إلكتروني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتولى مدير مشروع جديد مسؤولية مشروع تمت الموافقة عليه مؤخرًا.\n\nما العامل الأساسي الذي سيلعب دورًا في تحديد طريقة الاتصال؟",
      "explanation": "العامل الأساسي هو متطلبات أصحاب المصلحة، لأنهم يحددون كيف يريدون تلقي المعلومات ونوعها وتواترها لضمان تلبية توقعاتهم.\n\n- لماذا الخيار الصحيح؟\nمتطلبات أصحاب المصلحة تحدد الشكل والمحتوى والتكرار وطريقة الاتصال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تكرار التوزيع جزء من خطة الاتصال لكن ليس هو العامل الأساسي.\n- نموذج المرسل-المستقبل إطار نظري وليس محددًا عمليًا.\n- أساليب إدارة الاجتماعات مرتبطة بتنفيذ الاجتماعات وليس بتحديد طريقة الاتصال.",
      "choices": [
        {
          "text": "متطلبات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تكرار التوزيع.",
          "correct": false
        },
        {
          "text": "نموذج المرسل-المستقبل.",
          "correct": false
        },
        {
          "text": "أساليب إدارة الاجتماعات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء مراجعة تقرير الحالة، يلاحظ مدير المشروع أنه على مدار ستة أشهر، كانت جودة الترميز لمطور معين أقل إحصائيًا من مطور آخر مكلف بنفس المهمة.\n\nما الأداة التي يجب أن يستخدمها مدير المشروع لتتبع مصدر المشكلة والعودة إلى السبب الجذري القابل للتنفيذ؟",
      "explanation": "مخطط عظمة السمكة (Ishikawa) هو الأنسب لتحليل الأسباب الجذرية للمشكلات المعقدة مثل انخفاض جودة الترميز.\n\n- لماذا الخيار الصحيح؟\nمخطط عظمة السمكة يساعد على تصنيف الأسباب الممكنة بطريقة منظمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المخطط البياني يظهر توزيع البيانات فقط.\n- مخطط التحكم يراقب الاستقرار وليس السبب.\n- مخطط التشتت يبين العلاقة بين متغيرين لكنه لا يكشف الأسباب الجذرية.",
      "choices": [
        {
          "text": "المخطط البياني (Histogram)",
          "correct": false
        },
        {
          "text": "مخطط التحكم (Control chart)",
          "correct": false
        },
        {
          "text": "مخطط التشتت (Scatter diagram)",
          "correct": false
        },
        {
          "text": "مخطط عظمة السمكة (Ishikawa diagram)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "عند الانتهاء من المشروع، لا يمكن التوصل إلى اتفاق مع العميل من خلال المفاوضات.\n\nما الذي يجب على مدير المشروع القيام به بعد ذلك؟",
      "explanation": "عند فشل المفاوضات، يُعتبر التحكيم الوسيلة التالية لتسوية النزاع بطريقة قانونية بدون اللجوء مباشرةً إلى المحاكم.\n\n- لماذا الخيار الصحيح؟\nالتحكيم يوفر حلاً رسميًا وملزمًا للطرفين بدون اللجوء إلى دعوى قضائية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ أعضاء الفريق ليس هو الإجراء المباشر المناسب.\n- الدعوى القانونية تأتي بعد التحكيم غالبًا.\n- بدء مرحلة الإغلاق غير مناسب قبل حل النزاع.",
      "choices": [
        {
          "text": "إبلاغ أعضاء فريق المشروع.",
          "correct": false
        },
        {
          "text": "بدء دعوى قانونية بما أن كل الأعمال قد أُنجزت.",
          "correct": false
        },
        {
          "text": "بدء مرحلة الإغلاق.",
          "correct": false
        },
        {
          "text": "استكشاف خيار التحكيم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، يطلب أحد أصحاب المصلحة غير المحددين مسبقًا داخل مؤسسة العميل تغييرًا قد يؤثر على نطاق المشروع. ويملك هذا الطرف تأثيرًا قويًا داخل مؤسسته.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
      "explanation": "عند ظهور صاحب مصلحة جديد له تأثير، فإن أول خطوة ضرورية هي تحديده رسميًا وتحديث سجل أصحاب المصلحة قبل اتخاذ أي إجراء مرتبط بطلبه.\n\n- لماذا الخيار الصحيح؟\nلأن تسجيل صاحب المصلحة الجديد يضمن إدراجه ضمن خطة إدارة أصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد اجتماع أو إصدار طلب تغيير يتطلب أولاً تعريف هذا الشخص رسميًا.\n- الاجتماع مع الجميع خطوة متأخرة قبل التحقق من هويته وتقييم تأثيره.",
      "choices": [
        {
          "text": "تحديد موعد اجتماع، وبناءً على نتائجه، تحديث خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير إلى مجلس مراقبة التغيير (CCB).",
          "correct": false
        },
        {
          "text": "تحديد صاحب المصلحة الجديد وتحديث سجل أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع جميع أصحاب المصلحة لمناقشة التغيير.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب مشكلة في الميزانية، قرر فريق المشروع استخدام معدات منخفضة التكلفة بدرجة أعلى من عدم اليقين في الاختبار لتقليل التكاليف. ومع ذلك، فإن نتائج الاختبار غير مستقرة وتخلق تناقضات. أحد أعضاء الفريق يقترح استخدام معدات عالية الدقة بدرجة أقل من عدم اليقين في الاختبار لتحسين جودة الاختبار.\n\nكيف يجب على مدير المشروع الرد على هذا الاقتراح؟",
      "explanation": "التصرف الصحيح هو تقييم الاقتراح وليس قبوله أو رفضه مباشرةً. قرار كهذا يتطلب تحليلًا لتوازن الكلفة والجودة.\n\n- لماذا الخيار الصحيح؟\nلأن تقييم الاقتراح يسمح لمدير المشروع باتخاذ قرار مبني على بيانات وليس على افتراضات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الرفض المباشر قد يهدر فرصة تحسين.\n- القبول المباشر قد يخلق مشاكل مالية.\n- التركيز فقط على الجودة دون اعتبار الميزانية ليس متوازنًا.",
      "choices": [
        {
          "text": "رفض الاقتراح بسبب القيود المالية والالتزام بخطة إدارة الجودة.",
          "correct": false
        },
        {
          "text": "قبول الاقتراح لأن المعدات عالية الدقة تنتج نتائج دقيقة باحتمال أقل للخطأ.",
          "correct": false
        },
        {
          "text": "تقييم الاقتراح لتحديد ما إذا كانت المعدات عالية الدقة تنتج نتائج دقيقة بدرجة أقل من عدم اليقين.",
          "correct": true
        },
        {
          "text": "قبول الاقتراح لأن الجودة أهم من الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ تحليل نوعي لمخاطر المشروع، يكتشف مدير المشروع أن المنتج يفتقر إلى تعريف الإنجاز (Definition of Done).\n\nما نوع هذا الخطر؟",
      "explanation": "غياب تعريف الإنجاز يمثل خطرًا تقنيًا لأنه مرتبط مباشرة بمعايير قبول المنتج الفني.\n\n- لماذا الخيار الصحيح؟\nلأن تعريف الإنجاز يخص الجانب الفني والتقني لضمان أن المنتج يفي بالمتطلبات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطر تجاري يتعلق بالعائد أو السوق.\n- خطر خارجي يرتبط بأطراف خارج المشروع.\n- خطر إداري يتعلق بالعمليات والإدارة وليس بالجانب الفني.",
      "choices": [
        {
          "text": "خطر تجاري",
          "correct": false
        },
        {
          "text": "خطر خارجي",
          "correct": false
        },
        {
          "text": "خطر إداري",
          "correct": false
        },
        {
          "text": "خطر تقني",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل الفريق للعمل على مشروع عالمي بتسليمات متكررة، شارك قائد المشروع خطة قياس الأداء مع الفريق. لم يُعجب أعضاء الفريق بالخطة المقترحة، حيث عبروا عن أنها غير واقعية.\n\nما الذي يجب أن يفعله قائد المشروع لضمان مشاركة أعضاء الفريق في تنفيذ خطة إدارة الأداء؟",
      "explanation": "الإدراج المباشر للفريق في تقييم أدائهم عبر التقييم الذاتي يعزز شعورهم بالمسؤولية والمشاركة ويقلل مقاومة الخطة.\n\n- لماذا الخيار الصحيح؟ لأنه يعزز استقلالية الفريق ويجعل أعضاءه جزءًا من مراقبة أدائهم.\n- لماذا الخيارات الأخرى خاطئة؟\n- إجبار الفريق يخلق مقاومة أكبر.\n- عرض من الموارد البشرية لا يعالج الشعور بعدم الواقعية.\n- الحديث الفردي ليس فعالًا مقارنةً بحل منهجي يشمل الجميع.",
      "choices": [
        {
          "text": "مطالبة أعضاء الفريق بالالتزام بالخطة، وإلا فلن يتم تقييمهم بشكل صحيح.",
          "correct": false
        },
        {
          "text": "إدراج التقييم الذاتي في بداية ومنتصف ونهاية المشروع لتعزيز استقلالية الفريق.",
          "correct": true
        },
        {
          "text": "طلب من فريق الموارد البشرية تقديم عرض حول مقاييس الأداء في الشركة.",
          "correct": false
        },
        {
          "text": "التحدث مع أعضاء الفريق بشكل فردي لإقناعهم بفوائد الخطة المقترحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء اجتماع التغذية الراجعة، أبلغ أعضاء الفريق مدير المشروع أن التحقق من التسليمات صعب لأن متطلبات التكنولوجيا تستمر في التغيير قبل مواعيد التسليم، مما يتسبب في إعادة العمل. اقترح مدير المشروع اعتماد منهجية إدارة مشروع أكثر ملاءمة لمعالجة هذا الأمر في المشاريع القادمة.\n\nما هي منهجية إدارة المشروع التي ستكون مناسبة لهذا الفريق؟",
      "explanation": "Agile مرنة وقابلة للتكيف مع التغييرات المستمرة في المتطلبات، مما يقلل من إعادة العمل ويوفر نتائج أسرع.\n\n- لماذا الخيار الصحيح؟ لأنه يتماشى مع بيئات ديناميكية حيث تتغير المتطلبات باستمرار.\n- لماذا الخيارات الأخرى خاطئة؟\n- التنبؤية والشلال تعتمد على خطط ثابتة.\n- التزايدية لا توفر نفس درجة التكيف مثل Agile.",
      "choices": [
        {
          "text": "أجايل (Agile)",
          "correct": true
        },
        {
          "text": "التنبؤية (Predictive)",
          "correct": false
        },
        {
          "text": "الشلال (Waterfall)",
          "correct": false
        },
        {
          "text": "التزايدية (Incremental)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي المخرجات الرئيسية لعملية تحديد المخاطر؟",
      "explanation": "تحديد المخاطر ينتج سجل المخاطر بشكل أساسي، بالإضافة إلى تقرير المخاطر وتحديث مستندات المشروع لضمان شمول كل التفاصيل الجديدة.\n\n- لماذا الخيار الصحيح؟ لأنه يجمع كل المخرجات الحقيقية لهذه العملية حسب الدليل المعتمد.\n- لماذا الخيارات الأخرى خاطئة؟\n- بعضها ناقص مثل غياب تحديث المستندات.\n- خطة إدارة المخاطر ليست ناتجًا لهذه العملية بل تُعد في مرحلة التخطيط.",
      "choices": [
        {
          "text": "تقرير المخاطر وسجل المخاطر",
          "correct": false
        },
        {
          "text": "تقرير المخاطر، سجل المخاطر، وتحديث مستندات المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة المخاطر، سجل المخاطر، واستجابات المخاطر",
          "correct": false
        },
        {
          "text": "تقرير المخاطر، مصفوفة الاحتمالية والأثر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء عقد اجتماع مراجعة ختامية (Retrospective)، فوجئ أعضاء الفريق بنتائج الأداء التي شاركها قائد المشروع. أعرب الفريق بأكمله عن جهلهم بقياسات الأداء وأدوات القياس المتوفرة.\n\nما الذي كان يجب على قائد المشروع فعله لتجنب هذا الموقف؟",
      "explanation": "الإجابة الصحيحة: التخطيط ووضع إطار واضح لقياس الأداء.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن وضع إطار واضح ومُتفق عليه مسبقًا لقياس الأداء يضمن شفافية ووعي جميع أعضاء الفريق بأدوات القياس والمعايير المتبعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n إعادة تعيين المهمة قد يخلق عبئًا جديدًا ويؤثر على التوازن\n تسجيل المحلل في برنامج تدريبي قد لا يكون عمليًا في مشروع قصير المدة\n نقل العمل بعد بدء التنفيذ يسبب فقدان الاستمرارية ويؤثر على الجودة",
      "choices": [
        {
          "text": "طلب من الموارد البشرية شرح أدوات قياس الأداء المختلفة.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق بضرورة تعبئة ملاحظاتهم بانتظام.",
          "correct": false
        },
        {
          "text": "تقديم تغذية راجعة مستمرة لأعضاء الفريق حول أدائهم.",
          "correct": false
        },
        {
          "text": "التخطيط ووضع إطار واضح لقياس الأداء.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تشكيل فريق للعمل على مشروع عالمي، دعا قائد المشروع إلى اجتماع تعارف بين أعضاء الفريق المتنوعين.\n\nما الذي يجب أن يفعله مدير المشروع لتحفيز الفريق على التعبير عن توقعاتهم؟",
      "explanation": "الإجابة الصحيحة: البدء بإجراء تقييم ذاتي للفريق لزيادة استقلالية الفريق.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nلأن التقييم الذاتي يعزز المشاركة الفعالة ويحفز الأعضاء على التعبير عن توقعاتهم بحرية ومسؤولية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n مطالبة الفريق بكتابة التوقعات قد تشعرهم بالإجبار وعدم العفوية\n طرح أسئلة مباشرة قد يخلق توتراً ويحد من الانفتاح\n التركيز على المكافآت لا يحفز التعبير عن التوقعات بعمق وصدق",
      "choices": [
        {
          "text": "مطالبة أعضاء الفريق بكتابة توقعاتهم على أوراق ملاحظات لاصقة.",
          "correct": false
        },
        {
          "text": "طرح أسئلة مباشرة لكل عضو في الفريق والانتظار لإجاباتهم.",
          "correct": false
        },
        {
          "text": "إبلاغ أعضاء الفريق بالمكافآت المرتبطة بنجاح المشروع.",
          "correct": false
        },
        {
          "text": "البدء بإجراء تقييم ذاتي للفريق لزيادة استقلالية الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتكون فريق مشروع افتراضي من أعضاء من بلدان مختلفة باختلافات ثقافية. يشعر مدير المشروع بالقلق من أن هذه الاختلافات قد تؤدي إلى سوء تواصل وصراعات.\n\nما الذي يجب أن يفعله مدير المشروع لتقليل احتمالية حدوث صراعات بفعالية؟",
      "explanation": "الإجابة الصحيحة: تحديد قواعد العمل الخاصة بالمشروع بشكل تعاوني والتواصل بها بوضوح.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتحديد القواعد بشكل تعاوني يخلق التزاماً مشتركاً ويقلل من سوء الفهم الناتج عن الاختلافات الثقافية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n إجبار الفريق على استخدام الاتصالات الكتابية فقط قد يحد من فعالية التواصل\n تعيين حكم من أعلى المرتبة قد يثير مشاكل سلطة ويقلل من التعاون\n اتخاذ قرارات وحيدة لحل النزاعات دون مشاركة الفريق قد يزيد من التوتر وعدم الرضا",
      "choices": [
        {
          "text": "تحديد قواعد العمل الخاصة بالمشروع بشكل تعاوني والتواصل بها بوضوح.",
          "correct": true
        },
        {
          "text": "مطالبة الفريق باستخدام الاتصالات الكتابية فقط.",
          "correct": false
        },
        {
          "text": "تعيين العضو الأعلى مرتبة في أحد الفرق ليكون الحكم عند نشوء نزاع.",
          "correct": false
        },
        {
          "text": "اتخاذ قرارات حل النزاعات وإبلاغ الفريق بها لاحقًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يوجد نزاع بين عضوين من الفريق بشأن مهمة في المشروع.\n\nما هي طريقة حل النزاع التي يجب أن يستخدمها مدير المشروع لتحقيق نتيجة رابحة للطرفين؟",
      "explanation": "الإجابة الصحيحة التعاون/حل المشكلة\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتعاون يعني أن يعمل الطرفان معًا لإيجاد حل يحقق مصالح الجميع مما يؤدي إلى علاقة عمل صحية واستمرارية في الفريق\n\n- لماذا الخيارات الأخرى خاطئة؟\nالإجبار يحل النزاع مؤقتًا لكنه قد يخلق استياءً وخلافات مستقبلية\nالتهدئة تؤجل المشكلة دون حلها فعليًا\nالتسوية تعني تقديم تنازلات لكنها قد لا ترضي الطرفين بشكل كامل",
      "choices": [
        {
          "text": "التعاون/حل المشكلة",
          "correct": true
        },
        {
          "text": "الإجبار/التوجيه",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "التسوية/المصالحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير المشروع غير قادر على إكمال قائمة أهداف المشروع بسبب التوجيهات المتضاربة من مديري قسمين مختلفين.\n\nما هو الأسلوب الذي سيسمح للمديرين بتعديل توجيهاتهم وتحقيق نتيجة رابحة للطرفين؟",
      "explanation": "الإجابة الصحيحة التعاون/حل المشكلة\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتعاون يمكّن المديرين من الحوار ومشاركة وجهات النظر المختلفة لإيجاد حل مشترك يحقق رضا الجميع ويدعم أهداف المشروع\n\n- لماذا الخيارات الأخرى خاطئة؟\nالانسحاب يتجنب المشكلة ولا يحلها\nالتهدئة تؤجل النزاع ولا تحله\nالإجبار قد يؤدي إلى توترات وزيادة النزاع",
      "choices": [
        {
          "text": "التعاون/حل المشكلة",
          "correct": true
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "الإجبار/التوجيه",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب مدير المشروع من كل عضو من أعضاء الفريق المشاركين في نزاع تقديم تنازل لحل الموقف.\n\nأي أسلوب من أساليب حل النزاعات يتوافق مع هذا النهج؟",
      "explanation": "الإجابة الصحيحة التسوية/المصالحة\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتسوية تعني أن يقدم كل طرف تنازلات متبادلة بهدف التوصل إلى حل وسط يرضي الجميع جزئيًا\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتعاون يتطلب مشاركة وحل مشترك وليس تنازلات فقط\nالتهدئة تؤجل النزاع ولا تعالجه\nالانسحاب يتجنب النزاع دون حله",
      "choices": [
        {
          "text": "التسوية/المصالحة",
          "correct": true
        },
        {
          "text": "التعاون/حل المشكلة",
          "correct": false
        },
        {
          "text": "التهدئة/المسايرة",
          "correct": false
        },
        {
          "text": "الانسحاب/التجنب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ قائد المشروع أن عضوًا جديدًا في الفريق يشعر بعدم الحماس ويصل متأخرًا إلى العمل دائمًا، مما يتسبب في تأخير التسليمات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "الإجابة الصحيحة التحدث مع العضو بشكل فردي مع التأكيد على أهمية العمل الجماعي وقيمة مساهمة كل عضو\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتواصل المباشر يساعد على فهم أسباب ضعف الحماس أو التأخر ويشجع العضو على تحسين أدائه بدعم المدير\n\n- لماذا الخيارات الأخرى خاطئة؟\nإحالة الأمر للموارد البشرية قد تؤدي إلى شعور العضو بعدم الراحة\nالطلب من عضو أقدم قد لا يحل المشكلة بطريقة مناسبة\nالحديث الجماعي عن الحضور قد لا يعالج مشكلة العضو الجديد خصوصًا",
      "choices": [
        {
          "text": "طلب من قسم الموارد البشرية التعامل مع الحضور، ونصح العضو بالوصول في الوقت المحدد، وتذكيره بالحوافز في نهاية المشروع.",
          "correct": false
        },
        {
          "text": "طلب من عضو أقدم في الفريق التحدث إلى العضو الجديد، ومشاركة تجاربه الشخصية، ومعرفة أسباب ضعف الأداء.",
          "correct": false
        },
        {
          "text": "خلال الاجتماع اليومي، الطلب من جميع الأعضاء الوصول في الوقت المناسب، وتخطيط لفعالية بعد العمل للاحتفال بتقدم المشروع.",
          "correct": false
        },
        {
          "text": "التحدث مع العضو بشكل فردي، مع التأكيد على أهمية العمل الجماعي وقيمة مساهمة كل عضو.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من العبارات التالية تميز بشكل صحيح بين الإدارة والقيادة؟",
      "explanation": "الإجابة الصحيحة المديرون يسألون كيف ومتى القادة يسألون ماذا ولماذا\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالمدير يركز على التخطيط والتنفيذ بأسئلة محددة بينما القائد يركز على الرؤية والتوجيه عبر أسئلة تفتح التفكير\n\n- لماذا الخيارات الأخرى خاطئة؟\nالعكس غير صحيح القادة يركزون على الرؤية طويلة المدى والمديرون على التنفيذ\nالمديرون لا يتحدون الوضع القائم والقادة يسعون للتغيير\nالقادة يلهمون الثقة والمديرون يستخدمون التحكم وليس فقط السيطرة",
      "choices": [
        {
          "text": "المديرون يسألون كيف ومتى؛ القادة يسألون ماذا ولماذا.",
          "correct": true
        },
        {
          "text": "المديرون يركزون على الأهداف طويلة المدى؛ القادة يركزون على الأهداف قصيرة المدى.",
          "correct": false
        },
        {
          "text": "المديرون يتحدون الوضع القائم؛ القادة يقبلون الوضع القائم.",
          "correct": false
        },
        {
          "text": "المديرون يلهمون الثقة؛ القادة يعتمدون على السيطرة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أحد المشاريع، يوجد صاحب مصلحة لا يرى أي فائدة من المشروع. أحيانًا يستخدم السياسة لوضع عراقيل لمنع إتمام المشروع بنجاح.\n\nما هي شخصية هذا النوع من أصحاب المصلحة؟",
      "explanation": "الإجابة الصحيحة المعارض (Antagonist)\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالمعارض هو صاحب مصلحة سلبي يحاول إعاقة المشروع باستخدام السياسات والعراقيل\n\n- لماذا الخيارات الأخرى خاطئة؟\nالهادئ لا يتدخل لكنه غير متفاعل\nالمحايد ليس له موقف واضح\nالداعم يعمل على دعم المشروع",
      "choices": [
        {
          "text": "الهادئ (Stoic)",
          "correct": false
        },
        {
          "text": "المحايد",
          "correct": false
        },
        {
          "text": "الداعم (Champion)",
          "correct": false
        },
        {
          "text": "المعارض (Antagonist)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع في شركة صغيرة لمشروع معقد وجديد. أوصى مدير البرنامج بتكوين فريق يضم أفرادًا بخبرات تكمل بعضها البعض.\n\nما هي خصائص الشبكة التي يجب بناؤها؟",
      "explanation": "الإجابة الصحيحة: منظمة ذاتيًا، أعضاء الفريق مع أصحاب مصلحة داخليين وخارجيين، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالشبكة المنظمة ذاتيًا تسمح بمرونة أكبر وتكامل أفضل بين أعضاء الفريق وأصحاب المصلحة من داخل وخارج المنظمة، مع وضوح في القواعد والتزامات العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتنسيق المركزي قد يقلل من المرونة ويعيق الابتكار\nاستبعاد أصحاب المصلحة الخارجيين يقلل من الفعالية والتواصل",
      "choices": [
        {
          "text": "تنسيق مركزي، أعضاء الفريق مع أصحاب مصلحة داخليين وخارجيين، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        },
        {
          "text": "منظمة ذاتيًا، أعضاء الفريق مع أصحاب مصلحة داخليين وخارجيين، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": true
        },
        {
          "text": "منظمة ذاتيًا، أعضاء الفريق مع أصحاب مصلحة داخليين فقط، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        },
        {
          "text": "تنسيق مركزي، أعضاء الفريق مع أصحاب مصلحة داخليين فقط، جميع المشاركين ملتزمين باتفاق العمل ومجموعة القواعد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "اختار مدير مشروع في منظمة منهجية أجايل لتنفيذ مشروع تقني متقدم. قام المدير ببناء شبكة مهنية ويريد أن ينضم مالك المنتج إليها.\n\nما هما الفائدتان اللتان سيستخدمهما مدير المشروع لتشجيع مالك المنتج على الانضمام والمشاركة في الشبكة؟ (اختر اثنين)",
      "explanation": "الإجابات الصحيحة: الوصول إلى المعرفة والقوى العاملة العالمية، وفرصة للتفاعل مع الموارد.\n\n- لماذا هذه هي الإجابات الصحيحة؟\nالشبكة المهنية تمنح مالك المنتج إمكانية الاستفادة من خبرات ومعارف متنوعة كما تتيح له التفاعل المباشر مع الموارد المختلفة لدعم المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمخاطر وتكاليف أقل ليست فائدة مباشرة للشبكة المهنية\nالشبكة المهنية الرسمية ليست ميزة تحفيزية بنفس قوة الوصول إلى المعرفة والموارد",
      "choices": [
        {
          "text": "الوصول إلى المعرفة والقوى العاملة العالمية",
          "correct": true
        },
        {
          "text": "مخاطر وتكاليف أقل",
          "correct": false
        },
        {
          "text": "فرصة للتفاعل مع الموارد",
          "correct": true
        },
        {
          "text": "شبكة مهنية رسمية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير مشروع في بيئة أجايل على مشروع سيمتد لعدة سنوات. طلب المستخدم النهائي تنفيذ مشروع تجريبي خلال الربع الأول من المشروع.\n\nما هي الأوقات المثلى لإجراء مراجعة جاهزية رسمية؟ (اختر اثنين)",
      "explanation": "الإجابات الصحيحة: في بداية المشروع التجريبي، وفي نهاية المشروع التجريبي.\n\n- لماذا هذه هي الإجابات الصحيحة؟\nمراجعة الجاهزية في بداية المشروع التجريبي تضمن الاستعداد والتنفيذ الصحيح، والمراجعة في النهاية تقيم النتائج وتحدد الخطوات القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالمراجعات الدورية مثل كل شهر أو كل ربع سنة قد لا تكون مرتبطة بنقاط تسليم واضحة\nنقاط التسليم الرئيسية قد لا تغطي تفاصيل المشروع التجريبي بشكل كافٍ",
      "choices": [
        {
          "text": "كل ربع سنة",
          "correct": false
        },
        {
          "text": "كل شهر",
          "correct": false
        },
        {
          "text": "عند نقاط التسليم الرئيسية",
          "correct": false
        },
        {
          "text": "في بداية المشروع التجريبي",
          "correct": true
        },
        {
          "text": "في نهاية المشروع التجريبي",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يضم العديد من أصحاب المصلحة الذين لديهم أولويات متعارضة.\n\nما الذي يجب على مدير المشروع فعله لتقليل النزاعات؟",
      "explanation": "الإجابة الصحيحة: توثيق وتسليم كافة المخرجات بعد موافقة الجميع عليها.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتوثيق المخرجات وموافقة جميع الأطراف يضمن وضوح التوقعات ويقلل سوء الفهم والصراعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتولي القيادة في كل جانب قد يثير مقاومة ويقلل التعاون\nالتفاوض بمساعدة مكتب إدارة المشاريع قد لا يكون دائماً فعالاً في تقليل النزاعات\nاستخدام أجايل لتسهيل التسليمات لا يضمن بالضرورة تقليل النزاعات بين أصحاب المصلحة",
      "choices": [
        {
          "text": "توثيق وتسليم كافة المخرجات بعد موافقة الجميع عليها.",
          "correct": true
        },
        {
          "text": "تولي القيادة في جميع جوانب المفاوضات.",
          "correct": false
        },
        {
          "text": "التفاوض على جميع الجوانب بمساعدة مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "التفاوض على جميع الجوانب باستخدام أجايل لتسهيل التسليمات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد يضم العديد من أصحاب المصلحة وأولويات متضاربة. طلبت الإدارة العليا من مدير المشروع تجنب الضجيج، خاصة في المشاريع ذات الطابع السياسي.\n\nعلى الرغم من صعوبة العثور على الموارد، ماذا يجب على مدير المشروع فعله لضمان سير المشروع بسلاسة؟",
      "explanation": "الإجابة الصحيحة: توزيع الموارد النادرة بكفاءة لتلبية احتياجات المشروع.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتوزيع الكفء للموارد يساعد في تقليل الصراعات ويركز على تحقيق أهداف المشروع رغم القيود.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمبدأ المقايضة قد يسبب تعقيدات ويؤدي إلى مواقف غير متوقعة\nالثبات بين الأقوال والأفعال لا يكفي دون إدارة الموارد بفعالية\nاستخدام المجاملات قد لا يكون دائمًا استراتيجية مستدامة",
      "choices": [
        {
          "text": "تطبيق مبدأ إذا قدمت لي خدمة، سأقدم لك خدمة بالمقابل.",
          "correct": false
        },
        {
          "text": "التحلي بالثبات بين الأقوال والأفعال لتجنب الصراعات مع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "استخدام المجاملات للحصول على الموارد والتعاون نحو أهداف مشتركة.",
          "correct": false
        },
        {
          "text": "توزيع الموارد النادرة بكفاءة لتلبية احتياجات المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الذي يجب أن يفعله مدير المشروع أولاً عندما لا يلتزم الأشخاص بعملية الامتثال للمشروع؟",
      "explanation": "الإجابة الصحيحة: فهم أسباب عدم الامتثال.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nمعرفة الأسباب يساعد في معالجة المشكلة بفعالية وتحديد الحلول المناسبة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتصعيد المبكر قد يزيد التوتر دون فهم المشكلة\nبدء تدقيق قد يكون خطوة لاحقة بعد الفهم\nتسجيل الحالة فقط دون تحليل لا يحل المشكلة",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا أو الراعي.",
          "correct": false
        },
        {
          "text": "بدء عملية تدقيق.",
          "correct": false
        },
        {
          "text": "تسجيل حالة عدم الامتثال ومراقبة التقدم.",
          "correct": false
        },
        {
          "text": "فهم أسباب عدم الامتثال.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل فريق المشروع على تحديد التبعيات لحوالي 350 نشاطًا في مشروع جارٍ.\n\nما الإجراءات التي يجب أن يتخذها الفريق لإدارة التبعيات بنجاح؟ (اختر اثنين)",
      "explanation": "الإجابات الصحيحة: تقييم التبعيات وتوثيقها، وضمان مراقبة التبعيات.\n\n- لماذا هذه هي الإجابات الصحيحة؟\nتقييم وتوثيق التبعيات يوضح العلاقات بين الأنشطة، والمراقبة المستمرة تضمن التعامل مع أي تغييرات أو مشاكل بسرعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nإبلاغ الراعي أو العميل فقط لا يكفي لإدارة التبعيات بشكل فعال\nاستخدام نوع تبعية واحد فقط (نهاية إلى بداية) قد يحد من المرونة",
      "choices": [
        {
          "text": "إبلاغ الراعي بالتبعيات.",
          "correct": false
        },
        {
          "text": "تقييم التبعيات وتوثيقها.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بالتبعيات.",
          "correct": false
        },
        {
          "text": "ضمان مراقبة التبعيات.",
          "correct": true
        },
        {
          "text": "استخدام تبعيات من نوع نهاية إلى بداية فقط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب العميل تغييرًا في وظيفة منتج سيتم تسليمه في العدوة القادمة. الأخصائي المسؤول عن هذا التغيير مكلّف أيضًا بتسليم مهمة في مشروع آخر. يحتاج مدير المشروع إلى التفاوض على توفر الأخصائي.\n\nمن المسؤول عن تأكيد توفر هذا الأخصائي؟",
      "explanation": "الإجابة الصحيحة: المدير الوظيفي.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالمدير الوظيفي مسؤول عن تخصيص موارد الفريق وتأكيد توفر الأخصائي بين المشاريع المختلفة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nراعي المشروع لا يدير الموارد بشكل مباشر\nمالك المنتج يحدد متطلبات المنتج وليس توافر الموارد\nقسم الموارد البشرية مسؤول عن التوظيف وليس التخصيص اليومي للمهام",
      "choices": [
        {
          "text": "راعي المشروع",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": true
        },
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "قسم الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تلقى مدير المشروع بريدًا إلكترونيًا من المصنع يفيد بعدم تسليم معدات أساسية كما هو مخطط. يجب على مدير المشروع الترتيب مع موردين آخرين لتطبيق حل مؤقت.\n\nمن المسؤول عن تأكيد توفر الموارد لهذا الحل؟",
      "explanation": "الإجابة الصحيحة: مالك المنتج.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nمالك المنتج مسؤول عن تحديد الموارد المطلوبة وضمان توفرها لتلبية احتياجات المنتج والحلول البديلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمزود الخدمة هو المورد الفعلي وليس مسؤول التأكيد\nالمدير الوظيفي قد لا يكون له سلطة مباشرة على الموارد الخاصة بالمنتج\nقسم الموارد البشرية غير مسؤول عن توفر المعدات",
      "choices": [
        {
          "text": "مزود الخدمة",
          "correct": false
        },
        {
          "text": "المدير الوظيفي",
          "correct": false
        },
        {
          "text": "مالك المنتج",
          "correct": true
        },
        {
          "text": "قسم الموارد البشرية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قررت فريق المشروع في منتصف مشروع تسليم تدريجي أنهم بحاجة إلى مساعدة خبير في المجال (SME) يعمل في قسم مختلف. طلب الفريق من الخبير الانضمام إليهم والمساعدة في مهمة محددة، وأبلغوا قائد المشروع بذلك.\n\nماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "الإجابة الصحيحة: تسهيل تنسيق الموارد مع الموارد المطلوبة بناءً على اتفاقية عمل الفريق.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nمدير المشروع يجب أن ينسق الموارد بطريقة منظمة وفقًا لسياسات العمل والاتفاقيات، لضمان أن انضمام الخبير لا يؤثر سلبًا على باقي المشاريع أو فرق العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتحقق من الميزانية وتقييم التأثير مهم لكنه ليس الخطوة الأولى دائماً\nالحصول على موافقة الراعي مهم لكنه يأتي بعد تنسيق الموارد الأولي\nالتحدث إلى المدير الوظيفي مهم ولكن يجب أن يكون ضمن إطار التنسيق وليس خطوة منفصلة",
      "choices": [
        {
          "text": "التحقق من ميزانية المشروع وتقييم التأثير وإمكانية إضافة مورد إضافي.",
          "correct": false
        },
        {
          "text": "التحدث مع راعي المشروع والحصول على الموافقة، مع شرح أن هذا المورد مهم وحاسم.",
          "correct": false
        },
        {
          "text": "التحدث إلى المدير الوظيفي لهذا المورد المطلوب والتحقق من مدى توافره وقدرته.",
          "correct": false
        },
        {
          "text": "تسهيل تنسيق الموارد مع الموارد المطلوبة بناءً على اتفاقية عمل الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد بدأ منذ ثمانية أشهر. لدى المدير فريق جودة يعمل بجد، ومتحفز، وناجح.\n\nما نوع الإدارة والقيادة التي يجب على مدير المشروع استخدامها في هذه المرحلة؟",
      "explanation": "الإجابة الصحيحة: تمكين الفريق لتحسين النتائج.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالفريق الناضج والمتحفز يحتاج إلى تمكين للاستفادة من خبراتهم ومهاراتهم لتعزيز الأداء بدلاً من الإدارة المكثفة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالدعم من خلال التكرارات والتغذية الراجعة مفيد لكنه أقل فاعلية مع فريق ناضج\nالمساعدة في حل النزاعات قد لا تكون مطلوبة إذا لم تكن هناك مشاكل\nتقديم الملاحظات أو التدريب فقط عند الطلب قد يقلل من فرص التطوير المستمر",
      "choices": [
        {
          "text": "تمكين الفريق لتحسين النتائج.",
          "correct": true
        },
        {
          "text": "تقديم الدعم من خلال التكرارات والتغذية الراجعة الدورية.",
          "correct": false
        },
        {
          "text": "المساعدة في حل النزاعات.",
          "correct": false
        },
        {
          "text": "تقديم الملاحظات أو التدريب أو المساعدة فقط عند طلبها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم عضو جديد إلى المشروع خلال مرحلة التنفيذ. يتطلب العمل تعاونًا قويًا مع بقية أعضاء الفريق.\n\nما الذي يجب على مدير المشروع فعله لتعزيز بيئة تعاونية؟",
      "explanation": "الإجابة الصحيحة: تنظيم ورشة عمل ليوم واحد مع الفريق بأكمله لتعريف العضو الجديد بالمشروع.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nورشة العمل تساعد على دمج العضو الجديد بسرعة في الفريق وتوفير فهم شامل للمشروع، مما يعزز التعاون.\n\n- لماذا الخيارات الأخرى خاطئة؟\nإرسال بريد إلكتروني ليس فعالًا لتعزيز التعاون\nمشاركة المعلومات فقط دون تفاعل قد لا تكون كافية\nطلب وصف الاهتمامات في اجتماع قد لا يكون فعالًا لدمج العضو الجديد بسرعة",
      "choices": [
        {
          "text": "إرسال بريد إلكتروني للفريق يطلب منهم التعاون مع العضو الجديد.",
          "correct": false
        },
        {
          "text": "مشاركة جميع المعلومات المتاحة وتخصيص وقت لشرح تفاصيل العمل الجاري.",
          "correct": false
        },
        {
          "text": "طلب من كل عضو أن يصف اهتماماته وخبراته في الاجتماع القادم.",
          "correct": false
        },
        {
          "text": "تنظيم ورشة عمل ليوم واحد مع الفريق بأكمله لتعريف العضو الجديد بالمشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشارك فريق المشروع بنشاط في التحضير للتسليم الأخير قبل إطلاق المنتج النهائي في بيئة الإنتاج. \n\nما الذي يجب على مدير المشروع فعله لضمان تزامن الفريق بالكامل؟",
      "explanation": "الإجابة الصحيحة: ضمان حضور الفريق للاجتماعات اليومية ومشاركتهم الفعالة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالاجتماعات اليومية تضمن تواصل مستمر وتنسيق فوري بين أعضاء الفريق، مما يساعد على حل المشاكل بسرعة وضمان تزامن الجميع.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتوفر المعلومات مهم ولكنه لا يضمن التزام الجميع أو التفاعل\nعرض العمل على لوحة بيضاء مفيد لكنه ليس كافياً للتنسيق الكامل\nتوفر مكان للمحادثات مهم لكن الاجتماعات المنظمة أكثر فاعلية",
      "choices": [
        {
          "text": "ضمان حضور الفريق للاجتماعات اليومية ومشاركتهم الفعالة.",
          "correct": true
        },
        {
          "text": "ضمان توفر المعلومات اللازمة وسهولة وصول كل عضو إليها.",
          "correct": false
        },
        {
          "text": "ضمان عرض العمل المطلوب على لوحة بيضاء مرئية ومتاحة للجميع.",
          "correct": false
        },
        {
          "text": "ضمان توفر مكان للفريق لإجراء المحادثات المنتظمة عند الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "إدارة الجودة عنصر حيوي في أي مشروع.\n\nأي من الجوانب التالية لمراقبة الجودة يُعد من مكونات نظام قياس عالي الأداء؟",
      "explanation": "الإجابة الصحيحة: الدقة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالدقة تعني أن نظام القياس يقدم نتائج صحيحة وموثوقة، وهو أساسي لأي نظام قياس فعال.\n\n- لماذا الخيارات الأخرى خاطئة؟\nعدم الدقة تعني نتائج خاطئة\nعدم التكرار يشير إلى ضعف في الاتساق\nالمدة الزمنية ليست من مكونات جودة القياس بل عامل زمني",
      "choices": [
        {
          "text": "الدقة",
          "correct": true
        },
        {
          "text": "عدم الدقة",
          "correct": false
        },
        {
          "text": "عدم التكرار",
          "correct": false
        },
        {
          "text": "المدة الزمنية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "الإصدار الأول الذي تم تسليمه إلى فريق مراقبة الجودة يعاني من أداء ضعيف، ويشتكي المختبرون من أنهم لا يستطيعون إكمال جميع حالات الاختبار كما هو مخطط.\n\nما هي الأداة التي تساعد على مراقبة الأداء؟",
      "explanation": "الإجابة الصحيحة: مخطط التشغيل (Run Chart).\n\n- لماذا هذه هي الإجابة الصحيحة؟\nمخطط التشغيل يُستخدم لمراقبة الأداء بمرور الوقت ويساعد في تحديد الاتجاهات والمشاكل أثناء الاختبار.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمخطط تدفق البيانات يصف تدفق المعلومات وليس الأداء\nمخطط الانسياب يوضح العمليات لكنه لا يرصد الأداء بمرور الوقت\nمخطط غير مراقب غير فعال لمراقبة الأداء",
      "choices": [
        {
          "text": "مخطط التشغيل (Run Chart)",
          "correct": true
        },
        {
          "text": "مخطط تدفق البيانات (Data Flow Diagram)",
          "correct": false
        },
        {
          "text": "مخطط الانسياب (Flow Chart)",
          "correct": false
        },
        {
          "text": "مخطط غير مراقب (Non-Control Chart)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تطوير المشروع، لاحظ مدير المشروع أن النتائج ليست بالجودة المتوقعة.\n\nما هي الأداة أو الوثيقة التي تُظهر العناصر التي تؤثر على المقاييس الرئيسية؟",
      "explanation": "الإجابة الصحيحة: مخطط باريتو (Pareto Chart).\n\n- لماذا هذه هي الإجابة الصحيحة؟\nمخطط باريتو يساعد في تحديد أهم العوامل التي تؤثر على جودة النتائج من خلال التركيز على العناصر الرئيسية التي تسبب معظم المشاكل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمخطط التشغيل يستخدم لمراقبة الأداء عبر الزمن وليس لتحديد العوامل المؤثرة\nميثاق المشروع يحدد الأهداف ولا يركز على تحليل الجودة\nسجل المخاطر يتعامل مع المخاطر وليس تحليل العوامل المؤثرة على الجودة",
      "choices": [
        {
          "text": "مخطط باريتو (Pareto Chart)",
          "correct": true
        },
        {
          "text": "مخطط التشغيل (Run Chart)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": false
        },
        {
          "text": "سجل المخاطر (Risk Register)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مدير المشروع اتخاذ قرارات يوميًا، بغض النظر عن أهمية القرار أو مدى حرجِه.\n\nما الذي يجب أن يفعله مدير المشروع لضمان أن تكون قراراته غير متحيزة وعقلانية؟",
      "explanation": "الإجابة الصحيحة: فهم أنه لا يمكن تحقيق كل شيء.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالاعتراف بالقيود يساعد المدير على اتخاذ قرارات واقعية ومتزنة دون تحيز أو توقع نتائج غير ممكنة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nاستخدام البيانات دون تحقق قد يؤدي إلى قرارات خاطئة\nاتخاذ القرارات بسرعة قد يكون متهوراً وغير محسوب\nانتظار نتائج مؤكدة قد يعيق التقدم ويتسبب في تأخير القرارات",
      "choices": [
        {
          "text": "استخدام البيانات دون التحقق من دقتها.",
          "correct": false
        },
        {
          "text": "فهم أنه لا يمكن تحقيق كل شيء.",
          "correct": true
        },
        {
          "text": "اتخاذ القرارات بسرعة.",
          "correct": false
        },
        {
          "text": "اتخاذ القرارات فقط عندما تكون النتائج مؤكدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع لمشروع جديد، وكانت أول مهمة له هي المساعدة في إنشاء هيكل تقسيم العمل (WBS).\n\nما هي الأداة أو التقنية أو الوثيقة التي تُستخدم كنقطة انطلاق لإنشاء WBS فعال؟",
      "explanation": "الإجابة الصحيحة: ميثاق المشروع (Project Charter).\n\n- لماذا هذه هي الإجابة الصحيحة؟\nميثاق المشروع يحتوي على نطاق المشروع والأهداف الأساسية، وهو الأساس الذي يُبنى عليه هيكل تقسيم العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nخط الأساس للنطاق يُستخدم بعد تحديد WBS وليس كبداية\nقائمة الأنشطة تأتي بعد إنشاء WBS\nقاموس WBS هو توثيق تفصيلي بعد بناء الهيكل الأساسي",
      "choices": [
        {
          "text": "خط الأساس للنطاق (Scope Baseline)",
          "correct": false
        },
        {
          "text": "قائمة الأنشطة (Activity List)",
          "correct": false
        },
        {
          "text": "ميثاق المشروع (Project Charter)",
          "correct": true
        },
        {
          "text": "قاموس WBS",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في برنامج يمتد لخمس سنوات، انضم العديد من أعضاء الفريق إلى المشاريع الفرعية وغادروها.\n\nبسبب ذلك، غالبًا ما تنشأ صراعات بين أعضاء الفريق.\n\nما هي التقنية التي يجب أن يستخدمها مدير المشروع لحل هذه الصراعات على المدى الطويل؟",
      "explanation": "الإجابة الصحيحة: حل المشكلات (Problem-solving).\n\n- لماذا هذه هي الإجابة الصحيحة؟\nحل المشكلات تقنية تركز على معالجة جذور الصراع وتحقيق نتيجة رابحة لجميع الأطراف.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالإجبار ينتج عنه حل قصير الأجل مع احتمال عودة الصراع\nالتهدئة تتجاهل المشكلة ولا تعالج السبب الجذري\nالتسوية قد تترك بعض الأطراف غير راضين",
      "choices": [
        {
          "text": "الإجبار (Forcing)",
          "correct": false
        },
        {
          "text": "التهدئة (Smoothing)",
          "correct": false
        },
        {
          "text": "التسوية (Compromise)",
          "correct": false
        },
        {
          "text": "حل المشكلات (Problem-solving)",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ الفريق قائد المشروع أنهم غير متأكدين من احتياجات أصحاب المصلحة، على الرغم من جهود جمع المتطلبات المتعددة والمشاركة في اجتماعات الحالة.\n\nكيف يجب على مدير المشروع التعامل مع هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: توثيق ما يعتقد الفريق أنه احتياجات أصحاب المصلحة، وعرضه عليهم، وطلب تعليقاتهم لمشاركتها مع الفريق.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nيتيح هذا النهج لأصحاب المصلحة تصحيح أو تأكيد المتطلبات بشكل مباشر.\n\n- لماذا الخيارات الأخرى خاطئة؟\nإجبار الفريق على العمل مع أصحاب المصلحة دون وضوح قد يزيد الغموض\nإلغاء المشروع خطوة متطرفة\nكتابة قصص المستخدم دون تأكيد الاحتياجات قد ينتج عنها نتائج غير مناسبة",
      "choices": [
        {
          "text": "مطالبة الفريق بالعمل مع أصحاب المصلحة لتحليل متطلباتهم التفصيلية والموافقة على المواصفات.",
          "correct": false
        },
        {
          "text": "مناقشة خيار إلغاء المشروع مع الفريق لأن المخاطر كبيرة جدًا للاستمرار.",
          "correct": false
        },
        {
          "text": "مطالبة الفريق بكتابة مجموعة من قصص المستخدم لتوثيق الاحتياجات، وترتيبها حسب الأولوية وإدارتها.",
          "correct": false
        },
        {
          "text": "توثيق ما يعتقد الفريق أنه احتياجات أصحاب المصلحة، وعرضه عليهم، وطلب تعليقاتهم لمشاركتها مع الفريق.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع استرجاعي، أبدى أعضاء الفريق عدم تفاعلهم، مشيرين إلى أنهم يكررون نفس الأفكار مرارًا وتكرارًا.\n\nكيف يمكن لمدير المشروع التعامل مع هذا الوضع بأفضل طريقة؟",
      "explanation": "الإجابة الصحيحة: تشجيع الفريق على تقديم أفكار لتحسين العمليات ودعم التغييرات بناءً على الملاحظات المستلمة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nيشجع هذا الأسلوب المشاركة الفعالة ويمنح الفريق شعورًا بالمسؤولية تجاه تحسين العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nإجبار الفريق على تكرار نفس النقاط أو ملاحظات غير مفيدة يقلل من قيمة الاجتماعات ولا يعالج المشكلة الحقيقية.",
      "choices": [
        {
          "text": "طلب من أعضاء الفريق الانتباه أكثر للجلسة حتى لو كانوا يظنون أنهم يعرفون ما سيُقال.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق تقديم ملاحظاتهم حتى لو كانت مماثلة لملاحظات الآخرين لتأكيد النقاط.",
          "correct": false
        },
        {
          "text": "تشجيع الفريق على تقديم ملاحظات أفضل لأنهم يعرفون الأسئلة مسبقًا.",
          "correct": false
        },
        {
          "text": "تشجيع الفريق على تقديم أفكار لتحسين العمليات ودعم التغييرات بناءً على الملاحظات المستلمة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يساعد مدير مشروع مؤسسته في الانتقال من استخدام الأساليب التنبؤية إلى الأساليب الرشيقة. سأل أحد أعضاء الفريق متى يجب القيام بتعريف المتطلبات عالية المستوى وتصميم الحل في المنهجية الرشيقة.\n\nكيف يجب أن يرد مدير المشروع؟",
      "explanation": "الإجابة الصحيحة: في الرشيقة، يجب على الفريق التخطيط لأداء بعض هذه الأنشطة كجزء من السبرينت صفر قبل بدء التطوير.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالسبرينت صفر يُستخدم للتحضير ويشمل إعداد البنية الأساسية، وتحديد المتطلبات الأولية، وتصميم الحل.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالقيام بهذه الأنشطة داخل السبرينت الأول يؤثر على سرعة البدء.\nتجنب هذه الأنشطة بالكامل لا يناسب المشاريع المعقدة.\nتأجيل هذه الأنشطة قدر الإمكان قد يؤدي إلى مشكلات في التخطيط والتنفيذ.",
      "choices": [
        {
          "text": "في الرشيقة، يجب أن تبدأ هذه الأنشطة بمجرد تجميع الفريق، ويفضل في السبرينت الأول.",
          "correct": false
        },
        {
          "text": "في الرشيقة، يجب على الفريق التخطيط لأداء بعض هذه الأنشطة كجزء من السبرينت صفر قبل بدء التطوير.",
          "correct": true
        },
        {
          "text": "في الرشيقة، يجب على الفريق تجنب الهدر، لذا يجب أن تتم هذه الأنشطة كجزء من التطوير.",
          "correct": false
        },
        {
          "text": "في الرشيقة، يتبع الفريق استراتيجية اللحظة الأخيرة المسؤولة ويجب تأجيل هذه الأنشطة قدر الإمكان.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا رشيقًا في مرحلة التنفيذ. بعد عدة سبرينتات، يدرك مدير المشروع أن تقديرات الفريق غير واقعية.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لإزالة هذا العائق؟",
      "explanation": "الإجابة الصحيحة: تنظيم جلسات تحسين قائمة المنتج لفهم النطاق بشكل أفضل ومراجعة التقديرات.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتحسين قائمة المنتج (Backlog Refinement) يسمح بتحديث التقديرات بناءً على معلومات جديدة وتغيرات النطاق.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمناقشة المشكلة في الاسترجاع أو الاجتماعات اليومية قد لا يكون كافيًا دون مراجعة النطاق.\nإضافة هامش احتياطي دون مراجعة السبب الفعلي قد يؤدي لإدارة غير فعالة.",
      "choices": [
        {
          "text": "طلب من الفريق مناقشة هذه المشكلة في الاجتماع الاسترجاعي القادم لتجنب التأثير على السبرينت الحالي.",
          "correct": false
        },
        {
          "text": "الحصول على موافقة من راعي المشروع لإضافة هامش احتياطي للسبرينت، وتغيير تاريخ الانتهاء.",
          "correct": false
        },
        {
          "text": "طلب من الفريق مناقشة هذه المشكلة في الاجتماع اليومي، مع الالتزام بإكمال السبرينت الحالي.",
          "correct": false
        },
        {
          "text": "تنظيم جلسات تحسين قائمة المنتج لفهم النطاق بشكل أفضل ومراجعة التقديرات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع يومي، أثار فريق المشروع عائقًا يتمثل في أن أحد الخبراء من أصحاب المعرفة في المجال يغير تعريف الإنجاز النهائي بشكل متكرر، وأعربوا عن خوفهم من أن هذا يعكس انعدام الثقة.\n\nما الذي يجب على مدير المشروع فعله؟",
      "explanation": "الإجابة الصحيحة: تذكير الفريق بأن التغذية الراجعة المستمرة ضرورية للنجاح.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالرشيقة تعتمد على التكيف مع التغيرات، والتغذية الراجعة المستمرة جزء أساسي من ضمان تحقيق القيمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتركيز فقط على العمل الحالي دون التعامل مع التغذية الراجعة يضعف الجودة.\nنقل المسؤولية لمالك المنتج أو فرض تعريف ثابت يقلل من مرونة العمل ويخالف مبادئ الرشيقة.",
      "choices": [
        {
          "text": "تذكير الفريق بالتركيز على عملهم، والالتزام بالتحدث مع الخبير.",
          "correct": false
        },
        {
          "text": "تذكير مالك المنتج بدعم الفريق والتحدث مع الخبير.",
          "correct": false
        },
        {
          "text": "تذكير الخبير بالالتزام بتعريف الإنجاز النهائي المتفق عليه مبدئيًا.",
          "correct": false
        },
        {
          "text": "تذكير الفريق بأن التغذية الراجعة المستمرة ضرورية للنجاح.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا، وقد طلب الراعي معرفة سبب تطوير بعض مكونات المشروع داخليًا. أين يمكن العثور على هذه المعلومات؟",
      "explanation": "الإجابة الصحيحة: في خطة إدارة المشتريات، تحت قرارات البناء مقابل الشراء.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nخطة إدارة المشتريات تحتوي على تفاصيل حول قرارات البناء مقابل الشراء التي توضح ما يتم تنفيذه داخليًا وما يتم شراؤه من الخارج.\n\n- لماذا الخيارات الأخرى خاطئة؟\nميثاق المشروع يتضمن أهداف المشروع وليس تفاصيل الشراء.\nالهيكلية التقنية ووثيقة الحلول تركز على الجانب الفني وليس على قرارات الشراء.",
      "choices": [
        {
          "text": "في خطة إدارة المشتريات، تحت قرارات البناء مقابل الشراء",
          "correct": true
        },
        {
          "text": "في ميثاق المشروع، تحت قسم الافتراضات والقيود",
          "correct": false
        },
        {
          "text": "في وثيقة الهيكلية التقنية، تحت حدود الحل",
          "correct": false
        },
        {
          "text": "في وثيقة الهيكلية الحلول، تحت الغرض والتبرير من المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "المشروع في مرحلة الاختبار، وأبلغ فريق مراقبة الجودة مدير المشروع بأن جودة التسليمات من أحد الموردين ضعيفة. وقد أظهرت التحقيقات أن الموظفين المعينين لا يحملون الشهادات المطلوبة.\n\nكيف نشأت هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: لم تتضمن خطة إدارة المشتريات الشهادات المطلوبة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالتأكد من مؤهلات الموردين جزء أساسي من خطة إدارة المشتريات.\n\n- لماذا الخيارات الأخرى خاطئة؟\nعدم طلب المراجع أو تحديد الأفراد المشاركين ليس السبب الرئيسي في هذه الحالة.\nمعايير الجودة المرتفعة ليست المشكلة إذا كانت الشهادات مطلوبة أساسًا.",
      "choices": [
        {
          "text": "لم تتضمن مقترحات الموردين قائمة الأشخاص المعينين في المشروع.",
          "correct": false
        },
        {
          "text": "لم يطلب راعي المشروع ثلاث مراجع من عملاء سابقين.",
          "correct": false
        },
        {
          "text": "لم تتضمن خطة إدارة المشتريات الشهادات المطلوبة.",
          "correct": true
        },
        {
          "text": "كانت معايير فريق مراقبة الجودة مرتفعة جدًا واختبروا بشكل مفرط.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا ذو جدول تسليم صارم وتاريخ إنجاز محدد. يتطلب المشروع مكونات باهظة وهشة عرضة لإعادة العمل والرفض. يقوم مدير المشروع بوضع معايير اختيار الموردين.\n\nما هي الإستراتيجية التي يجب اتباعها لاختيار المورد؟",
      "explanation": "الإجابة الصحيحة: سعر مقبول إذا كان المورد أقرب إلى موقع المشروع.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالقرب الجغرافي يقلل من مخاطر النقل ويزيد من سرعة التوريد، وهو أمر مهم مع جدول صارم ومكونات حساسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nاختيار المورد بناءً فقط على السعر قد يؤدي لمشاكل في الجودة.\nتوصيات الراعي أو الفريق لا تكفي دون معايير واضحة تخص الموقع والجدول.",
      "choices": [
        {
          "text": "أقل سعر بغض النظر عن موقع مستودع المورد.",
          "correct": false
        },
        {
          "text": "سعر مقبول إذا كان المورد أقرب إلى موقع المشروع.",
          "correct": true
        },
        {
          "text": "توصية راعي المشروع بناءً على خبرة سابقة.",
          "correct": false
        },
        {
          "text": "توصيات أعضاء الفريق بناءً على تجارب سابقة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشرف مدير المشروع على مشروع معقد يكون فيه المورد مسؤولًا عن تسليم عدة مكونات أساسية. مدير المشروع وفريق الموردين في مناطق زمنية مختلفة، وأصبح هذا الفرق الزمني يمثل تحديًا كبيرًا، مما أدى إلى مشكلات في الإنتاجية. يواجه أعضاء الفريق من كلا الطرفين صعوبة في تنسيق الاجتماعات، وتبادل التحديثات، والتواصل بفعالية بسبب الفروقات الزمنية.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
      "explanation": "الإجابة الصحيحة: طلب من كلا الفريقين تغيير ساعات عملهم إلى منطقة زمنية مشتركة.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتنسيق ساعات العمل بين الفرق في مناطق زمنية مختلفة يعزز سهولة الاجتماعات اليومية وتبادل المعلومات لحل مشكلات الإنتاجية. هذا حل عملي يحافظ على العقود الحالية ويقلل التكاليف.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمراقبة الجدول وحدها لن تعالج السبب الجذري وهو ضعف التواصل.\nنقل فريق المورد مكلف وغير عملي خاصة في المشاريع الطويلة.\nإنهاء العقد والبحث عن مورد جديد قد يؤدي إلى تأخير المشروع وارتفاع التكاليف.",
      "choices": [
        {
          "text": "مراقبة جدول المشروع عن كثب واتخاذ الإجراءات إذا تم تجاوز المعالم الرئيسية.",
          "correct": false
        },
        {
          "text": "طلب من كلا الفريقين تغيير ساعات عملهم إلى منطقة زمنية مشتركة.",
          "correct": true
        },
        {
          "text": "البحث عن مساحة عمل مشتركة ونقل فريق المورد إلى جانب فريق المشروع.",
          "correct": false
        },
        {
          "text": "إنهاء العقد والبحث عن مورد جديد في نفس المنطقة الزمنية المحلية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى مدير مشروع للتو مشروعًا في مؤسسة تقدّر الدروس المستفادة. يشجع القادة جميع أصحاب المصلحة في المشاريع على استخدام العمليات والأدوات والنتائج من مستودع الدروس المستفادة في المشاريع المستقبلية. أثناء الاستعداد لتحديث مستودع الدروس المستفادة، جمع مدير المشروع بيانات المشروع ذات الصلة وردود الفعل.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "الإجابة الصحيحة: تحليل وتنظيم النتائج مع أصحاب المصلحة لاستخلاص الأفكار.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتحليل وتنظيم الدروس المستفادة خطوة مهمة لضمان تحويل البيانات الخام إلى أفكار قابلة للتطبيق تساعد المشاريع المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتخزين التعليقات دون تحليل يجعلها غير مفيدة.\nتوثيق النتائج قبل التحليل قد يؤدي إلى نقل معلومات غير دقيقة.\nاسترجاع تعليقات سابقة ليس له علاقة بتحديث المستودع الحالي.",
      "choices": [
        {
          "text": "تخزين جميع التعليقات والتوصيات المستلمة للرجوع إليها مستقبلًا.",
          "correct": false
        },
        {
          "text": "تحليل وتنظيم النتائج مع أصحاب المصلحة لاستخلاص الأفكار.",
          "correct": true
        },
        {
          "text": "توثيق النتائج ومشاركتها مع أصحاب المصلحة للمراجعة والتعليق.",
          "correct": false
        },
        {
          "text": "استرجاع جميع التعليقات والتوصيات التي تم استلامها في السابق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو الهدف الرئيسي من أسلوب القيادة الرؤيوية؟",
      "explanation": "الإجابة الصحيحة: توفير التوجيه طويل الأجل وتحفيز الفريق لتحقيقه.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالقيادة الرؤيوية تركز على رسم صورة مستقبلية ملهمة وواضحة للفريق، مما يعزز الدافعية والالتزام.\n\n- لماذا الخيارات الأخرى خاطئة؟\nدعم الفريق لتحديد رؤية مشتركة جزء من القيادة التحويلية وليس الرؤيوية.\nقيادة تبني التقنيات تخص أساليب قيادية أخرى مثل القيادة التقنية.\nتحديد الأولويات مهمة تكتيكية ضمن أساليب القيادة لكنها ليست الهدف الأساسي للرؤيوية.",
      "choices": [
        {
          "text": "دعم الفريق لتنظيم نفسه وتحديد رؤية مشتركة.",
          "correct": false
        },
        {
          "text": "قيادة تبني أحدث التقنيات والممارسات.",
          "correct": false
        },
        {
          "text": "توفير التوجيه طويل الأجل وتحفيز الفريق لتحقيقه.",
          "correct": true
        },
        {
          "text": "تحديد الأولويات وتوزيع المهام بما يتماشى مع الرؤية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي أسلوب قيادة يساعد الأشخاص على التواصل حتى عند العمل عن بُعد ولم يسبق لهم الالتقاء؟",
      "explanation": "الإجابة الصحيحة: الأسلوب العاطفي (التقاربي).\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالقيادة العاطفية (التقاربية) تركز على بناء علاقات شخصية وبيئة عمل داعمة، ما يساعد في خلق روابط بين الأفراد حتى في بيئات العمل عن بُعد.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالأسلوب التشاركي يركز على إشراك الفريق في اتخاذ القرار، لكنه ليس موجهًا لبناء علاقات.\nأسلوب تحديد الإيقاع يهتم بتحقيق نتائج بسرعة وفقًا لمعايير عالية.\nأسلوب التدريب يركز على تطوير الأفراد، لكن ليس على بناء روابط فورية.",
      "choices": [
        {
          "text": "الأسلوب التشاركي",
          "correct": false
        },
        {
          "text": "الأسلوب العاطفي (التقاربي)",
          "correct": true
        },
        {
          "text": "أسلوب تحديد الإيقاع",
          "correct": false
        },
        {
          "text": "أسلوب التدريب",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروعك، تحتاج إلى بعض المساعدة في تسهيل الاجتماعات، متابعة عناصر الإجراءات، تقديم أعضاء الفريق الجدد، والتوسط في النزاعات.\n\nمن هو العضو الأنسب في الفريق لمساعدتك في هذه الأنشطة؟",
      "explanation": "الإجابة الصحيحة: عضو فريق موجه نحو العلاقات.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nالعضو الموجه نحو العلاقات لديه مهارات التواصل، والقدرة على بناء الثقة، وتسهيل التعاون بين أعضاء الفريق، ما يجعله الأنسب لهذه الأنشطة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nعضو موجه نحو السلطة قد يفرض رأيه ولا يهتم بالتواصل.\nعضو موجه نحو الإنجاز يركز على إكمال المهام بغض النظر عن العلاقات.\nعضو موجه نحو التسليم يهتم بالنتائج النهائية أكثر من التفاعل مع الفريق.",
      "choices": [
        {
          "text": "عضو فريق موجه نحو السلطة.",
          "correct": false
        },
        {
          "text": "عضو فريق موجه نحو العلاقات.",
          "correct": true
        },
        {
          "text": "عضو فريق موجه نحو الإنجاز.",
          "correct": false
        },
        {
          "text": "عضو فريق موجه نحو التسليم.",
          "correct": false
        }
      ]
    }
  ]
}
