{
  "title": "مركز الإبداع",
  "description": "الأسئلة الموقفية في إدارة المشاريع الاحترافية",
  "time": 13800,
  "pass": 85,
  "test": [
    {
      "type": "multiple-choice",
      "text": "أثناء مرحلة التنفيذ في مشروعك، أبلغك مدير الموارد بأن أحد الخبراء المخصصين لمشروعك يحتاج إلى التحفيز ليؤدي بشكل جيد.\n\nما الإجراءات الموصى بها لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تذكير المدير الوظيفي بأن من واجبه تحفيز فريقه.",
          "correct": false
        },
        {
          "text": "تذكير عضو الفريق بوجود عقوبات على السلوكيات السيئة.",
          "correct": false
        },
        {
          "text": "تذكير عضو الفريق بوجود حوافز مالية للفريق.",
          "correct": false
        },
        {
          "text": "تذكير عضو الفريق بأهمية دوره وكيف سيتم مكافأته.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء تنفيذ المشروع، ارتكب أحد أعضاء الفريق خطأً أدى إلى تأخير لمدة أسبوع في الجدول الزمني للمشروع. ما الذي يجب على مدير المشروع فعله فيما يتعلق بهذا الخطأ والتأخير؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة المشكلة مع الفريق، البحث عن حلول، وتقديم الدعم والمساعدة للفريق.",
          "correct": true
        },
        {
          "text": "التأكد من أن عضو الفريق الذي ارتكب الخطأ يفهم تأثير هذا الخطأ.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى الإدارة العليا لضمان عدم تكرارها.",
          "correct": false
        },
        {
          "text": "إيجاد حل وإبلاغ الفريق به والتأكيد على تطبيقه فورًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يشارك مدير مشروع في مشروع تطوير للتجارة الإلكترونية. تم الانتهاء من المشروع بنجاح باستخدام نموذج هجين، وتم البدء في عملية تسليم العمليات. لاحظ مدير المشروع أن فريق التطوير أصبح غير نشط ولا يخصص وقتًا لعملية التسليم، مما يؤثر على دعم التطبيق.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "مواجهة فريق التطوير والمطالبة بتركيزهم الفوري على عملية التسليم.",
          "correct": false
        },
        {
          "text": "الاجتماع مع فريق التطوير لمناقشة أهمية عملية التسليم وتأثيرها على دعم التطبيق.",
          "correct": true
        },
        {
          "text": "تفويض مسؤولية عملية التسليم لعضو آخر في الفريق لضمان تنفيذها بشكل صحيح.",
          "correct": false
        },
        {
          "text": "تجاهل المشكلة وتوقع أن يتعامل فريق التطوير معها ويحلها من تلقاء نفسه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا يعمل وفق النهج المرن (Agile). لضمان توفر التمويل الكافي، يطلب الراعي من مدير المشروع تقديرًا لموعد الانتهاء من المشروع.\n\nكيف يجب على مدير المشروع الرد على الراعي؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الراعي بأن التقدير غير ضروري لأن المنهج المرن يفضل الاستجابة للتغيير بدلاً من الالتزام بالخطة.",
          "correct": false
        },
        {
          "text": "تذكير الراعي بأن المشاريع المرنة لا تُقاس بناءً على الميزانية والجدول الزمني.",
          "correct": false
        },
        {
          "text": "تقديم التقدير للراعي، لأن المنهج المرن يدعم وضع التقديرات.",
          "correct": true
        },
        {
          "text": "إقناع الراعي بإضافة هامش احتياطي للتكلفة في حال حدوث تجاوز.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا يحتوي على مكون يُدار باستخدام المنهجية المرنة (Agile). يطلب الراعي من مدير المشروع إضافة مكون جديد منظم من قبل الحكومة ويحتوي على قواعد ضريبية معقدة مع توفير وقت كافٍ لتنفيذ هذه القواعد. يقترح الراعي تنفيذ هذا المكون الجديد باستخدام المنهجية التنبؤية (غير المرنة) نظرًا لتعقيده.\n\nما هي المنهجية التي سيستخدمها مدير المشروع لهذا المكون الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الراعي بأنه سيتم إدارة المكون الجديد باستخدام منهجية Agile لأن Agile تناسب جميع الحالات.",
          "correct": false
        },
        {
          "text": "استخدام النهج الهجين من خلال الاستمرار في إدارة المكون الحالي باستخدام Agile، والمكون الجديد باستخدام المنهجية التنبؤية.",
          "correct": true
        },
        {
          "text": "إدارة المكون الحالي وكذلك المكون الجديد باستخدام المنهجية التنبؤية القائمة على التخطيط.",
          "correct": false
        },
        {
          "text": "طلب التوجيه من الراعي حول المنهجية الأنسب للمكون الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع فرقًا افتراضية موزعة حول العالم. ماذا يجب أن يفعل مدير المشروع للتغلب على الاختلافات الثقافية؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء قنوات تواصل غير رسمية ودعوة الأعضاء للمشاركة بحرية.",
          "correct": false
        },
        {
          "text": "تعزيز الحدود الشخصية والسيادة الفردية.",
          "correct": false
        },
        {
          "text": "إنشاء بيئة يتمكن فيها الأعضاء من التواصل بشكل مفتوح.",
          "correct": false
        },
        {
          "text": "إنشاء فهم مشترك لأهداف الفريق وغاياته.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بالنسبة للفرق الافتراضية، ما يلي هي الحواجز التي تحتاج الفرق إلى العمل من خلالها لتحقيق نتائج ناجحة، باستثناء:",
      "explanation": "",
      "choices": [
        {
          "text": "التفاعلات الشخصية وتطوير العلاقات.",
          "correct": false
        },
        {
          "text": "ممارسات وأساليب العمل.",
          "correct": false
        },
        {
          "text": "تنوع المعرفة.",
          "correct": false
        },
        {
          "text": "الراحة الشخصية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يمكن تحقيق التفاعل والتحفيز بنجاح من قبل مدير المشروع في الفريق الافتراضي من خلال كل ما يلي، باستثناء:",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد الأهداف.",
          "correct": false
        },
        {
          "text": "هيكلة المهام.",
          "correct": false
        },
        {
          "text": "التعاون غير الفعال.",
          "correct": true
        },
        {
          "text": "أنظمة المكافآت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تشمل آداب التواصل الجيدة لمدير المشروع عند إرسال رسائل البريد الإلكتروني ما يلي، باستثناء:",
      "explanation": "",
      "choices": [
        {
          "text": "الرد دائمًا فورًا على الرسائل العاطفية.",
          "correct": true
        },
        {
          "text": "معرفة الجمهور المستهدف.",
          "correct": false
        },
        {
          "text": "التحلي دائمًا باللباقة.",
          "correct": false
        },
        {
          "text": "استخدام قواعد نحوية وإملائية وعلامات ترقيم صحيحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يجب على مديري المشاريع أن يتحلّوا بروح القيادة وأن يدفعوا فريق المشروع لتحقيق النتائج المتوقعة. ما الصفات التي يجب أن يتحلى بها مدير المشروع؟ (اختر 3).",
      "explanation": "",
      "choices": [
        {
          "text": "القيادة",
          "correct": true
        },
        {
          "text": "الأخلاق",
          "correct": true
        },
        {
          "text": "القدرة على التكيّف",
          "correct": false
        },
        {
          "text": "العدوانية",
          "correct": false
        },
        {
          "text": "التمكين",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير مشروع على مشروع يعتمد بشكل كبير على التغيرات في السوق. أوصت وحدة إدارة المشاريع (PMO) باستخدام نهج Agile، وقد حجز مدير المشروع مراجعات مرجعية لاختيار شريك التنفيذ. ولكي ينجح المشروع، يحتاج Agile إلى مستوى عالٍ من الثقة بين العميل والمورد.\n\nما الجوانب التي يجب على مدير المشروع النظر فيها لبناء الثقة بأن المورد قادر على التنفيذ؟ (اختر 2).",
      "explanation": "",
      "choices": [
        {
          "text": "العمليات والأدوات - لضمان أن المورد يستخدم نهجًا فعالًا وقابلًا للتكرار في التسليم",
          "correct": true
        },
        {
          "text": "التميز التقني - لضمان أن النتائج تم إنجازها بسرعة وبجودة عالية",
          "correct": true
        },
        {
          "text": "المثابرة - لضمان أن المورد قادر على التغلب على التحديات الناتجة عن تغيّر نطاق العمل المتكرر",
          "correct": false
        },
        {
          "text": "مهارات التخطيط - لضمان أن المورد التزم بالتكلفة والمواعيد النهائية المتفق عليها في العقد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يُدير مدير مشروع تنفيذ تقنية جديدة، ويرغب في التأكد من أن المشروع يحقق قيمة تجارية للمؤسسة.\n\nما الأدوار الأساسية التي تضمن استفادة المؤسسة من تنفيذ المشروع؟ (اختر 3).",
      "explanation": "",
      "choices": [
        {
          "text": "مدير الأفراد والثقافة",
          "correct": false
        },
        {
          "text": "مدير المشروع",
          "correct": true
        },
        {
          "text": "محلل الأعمال",
          "correct": true
        },
        {
          "text": "قائد العميل",
          "correct": true
        },
        {
          "text": "المهندس المعماري التقني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا يهدف إلى التحول إلى Agile. المشروع سيقوم بتجربة Agile عبر أربعة أعضاء من المورد، يعملون جنبًا إلى جنب مع عضوين داخليين لا يملكون خبرة في Agile. يحتاج مدير المشروع إلى العمل كمدرّب للفريق ومساعدته على فهم الفروقات بين عمل الفريق التقليدي وفريق Agile.\n\nما هو أهم شيء يجب على مدير المشروع فعله لترسيخ سلوك فريق Agile؟",
      "explanation": "",
      "choices": [
        {
          "text": "التركيز على النتائج التي يحققها الفريق.",
          "correct": false
        },
        {
          "text": "بناء الثقة داخل الفريق.",
          "correct": true
        },
        {
          "text": "تشجيع التعاون بين أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تحميل كل عضو في الفريق المسؤولية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى فريق المشروع مؤخرًا مشروعًا طويل الأمد باستخدام نهج تنبؤي. ثم بدأ الفريق مشروعًا جديدًا مع نفس مدير المشروع، لكنهم الآن يستخدمون نهجًا مرنًا (Agile). بعد السبرنت الأولي، ينتظر الفريق من مدير المشروع اتخاذ القرارات نيابة عنهم، كما كان يتم في المشاريع السابقة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من مالك المنتج اتخاذ القرارات نيابة عن الفريق.",
          "correct": false
        },
        {
          "text": "تقديم ملاحظات إيجابية مستمرة لجميع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "تذكير الفريق بأنهم يستخدمون نهج Agile.",
          "correct": false
        },
        {
          "text": "توجيه الفريق وتدريبه لدعم اتخاذ قراراتهم بأنفسهم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع مراجعة السبرنت (Retrospective)، أكد فريق المشروع أن جميع المخرجات قد اكتملت وفقًا للمواصفات الواردة في سجل المنتج (Product Backlog). ومع ذلك، زاد عدد الأخطاء التي تم العثور عليها أثناء الاختبار بشكل كبير.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع متخصصي ضمان الجودة لتوضيح المشكلة والبحث عن حلول.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة المخاطر لتحديد استراتيجية التخفيف.",
          "correct": false
        },
        {
          "text": "إجراء تحليل مونتي كارلو لتحديد السيناريوهات والإجراءات الممكنة.",
          "correct": false
        },
        {
          "text": "تسجيل الخطر في سجل المخاطر ومراقبته خلال السبرنت التالي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أخذ مطور تطبيق بطاقة قصة مكتوب عليها \"يمكن للعميل الدفع باستخدام بطاقة الائتمان\". بعد التنفيذ، تم رفض الوظيفة لأن التطبيق لا يمكنه قبول بطاقات ائتمان أجنبية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "وصف قصة المستخدم بمزيد من التفصيل.",
          "correct": true
        },
        {
          "text": "جدولة قصة المستخدم للسبرنت التالي.",
          "correct": false
        },
        {
          "text": "تنفيذ مراجعة دورية لسجل المنتج (backlog grooming) مع الفريق.",
          "correct": false
        },
        {
          "text": "جمع مواصفات أكثر تفصيلاً من المستخدمين النهائيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ الراعي مالك المنتج أنه قد تمت الموافقة على الميزانية لمشروع معين. ومع ذلك، فإن أي استثمار إضافي في المشروع سيتعين تأجيله إلى السنة المالية التالية. يشعر مالك المنتج بالقلق من أن ذلك قد يعيق تقدم المشروع.\n\nما الذي يجب أن يفعله مالك المنتج؟",
      "explanation": "",
      "choices": [
        {
          "text": "تتبع الميزانية استنادًا إلى خطة الإطلاق وإظهار القيمة للأعمال.",
          "correct": true
        },
        {
          "text": "شرح أن المشروع قد بدأ للتو وأن الميزانية ستحتاج إلى تعديل.",
          "correct": false
        },
        {
          "text": "تتبع الميزانية بناءً على كل سبرنت وإزالة المخرجات غير الضرورية.",
          "correct": false
        },
        {
          "text": "ضمان أن مدير المشروع يراقب كل فاتورة تصدر عن المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تخطيط الإصدار، نشأ صراع بين أصحاب المصلحة بشأن أولوية بعض الاحتياجات، مما تسبب في فقدان فريق التطوير تركيزه. \n\nما هي تقنية حل النزاعات التي يجب على مدير المشروع استخدامها لمواءمة جميع أصحاب المصلحة وحل هذا الصراع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإجبار (Forcing)",
          "correct": false
        },
        {
          "text": "التعاون (Collaboration)",
          "correct": true
        },
        {
          "text": "الانسحاب (Withdrawal)",
          "correct": false
        },
        {
          "text": "التلطيف (Smoothing)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف فريق مشروع ببناء منتج جديد. أنشأ الفريق العرض التوضيحي أولاً وأضاف ميزات إلى المنتج الأولي. ما هي الممارسة التقنية التي يعبّر عنها هذا الأسلوب؟",
      "explanation": "",
      "choices": [
        {
          "text": "التطوير القائم على الاختبار (TDD)",
          "correct": false
        },
        {
          "text": "التسليم المستمر",
          "correct": true
        },
        {
          "text": "التطوير القائم على السلوك",
          "correct": false
        },
        {
          "text": "الاستكشافات (Spikes)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مكتب إدارة المشاريع (PMO) في الشركة بإدخال تقنيات أكثر تكيفًا وقد قام بتعيين مدير مشروع جديد لديه خبرة في الإدارة الهجينة. يتأخر الفريق في تبني المنهجية الجديدة ولم يقم بتحديث مستندات المشروع في الوقت المناسب.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لتحسين أداء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "إرسال بريد إلكتروني يطلب من جميع أعضاء الفريق إكمال التحديثات في نهاية اليوم.",
          "correct": false
        },
        {
          "text": "تنظيم جلسة تدريبية لجميع أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "التواصل مع المدراء الوظيفيين للحصول على الدعم.",
          "correct": false
        },
        {
          "text": "التحدث بشكل فردي مع كل عضو من الفريق حول التحديثات المطلوبة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق Agile صعوبة في مواكبة وتيرة العمل المخطط لها، مما يؤدي إلى فشل متكرر في السبرنت. ما الذي يجب على مدير المشروع فعله لتجنب هذا الموقف في المستقبل؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب موافقة الراعي للمشروع على العمل الإضافي لتعويض ضعف الأداء أثناء تعديل الخطة.",
          "correct": false
        },
        {
          "text": "مراجعة سرعة الفريق خلال عدة سبرنتات سابقة وتعديل الخطة وفقًا لذلك.",
          "correct": true
        },
        {
          "text": "استبدال الأعضاء المبتدئين بأعضاء أكثر خبرة والتفاوض على نطاق المشروع لتعويض الفجوة في الميزانية.",
          "correct": false
        },
        {
          "text": "التحول إلى نهج كانبان (Kanban) للحصول على تحكم أفضل من خلال تحديد الأعمال قيد التنفيذ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكافح مدير مشروع لفهم أداء فرق المشروع في بيئة Agile. لنفس نطاق العمل، قامت الفريق (A) بحساب وتسليم 100 نقطة قصة، بينما قامت الفريق (B) بحساب وتسليم 125 نقطة قصة.\n\nأي فريق يقدم أداءً أفضل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الفريق A لأنه حسب عدد أقل من نقاط القصة مقارنةً بالفريق B.",
          "correct": false
        },
        {
          "text": "الفريق B لأنه حسب عددًا أكبر من نقاط القصة مقارنةً بالفريق A.",
          "correct": false
        },
        {
          "text": "الفريق الذي يكمل أكبر عدد من القصص من سجل السبرنت.",
          "correct": false
        },
        {
          "text": "الفريق الذي لديه أقل عدد من العيوب في التسليمات.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تملك شركة عقدًا قائمًا لصيانة وتحسين قاعدة بيانات عملاء. أبلغ القسم القانوني مدير المشروع أن هناك تشريعًا جديدًا يتطلب حماية أكثر صرامة لمعلومات العملاء قد يتم توقيعه قريبًا. وسيتطلب هذا القانون إضافة ميزات أمان إضافية إلى قاعدة البيانات التي يديرها المشروع، وهذه الميزات غير مدرجة في نطاق العقد الحالي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب دعم راعي المشروع للتأثير على العميل لتعديل العقد فورًا.",
          "correct": false
        },
        {
          "text": "طلب من القسم القانوني إثارة القضية في مفاوضات العقد التالية مع العميل.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر بهذه المسألة وتخطيط الاستجابة للمخاطر مع الراعي والعميل.",
          "correct": true
        },
        {
          "text": "الانتظار حتى يتم اعتماد المتطلبات القانونية رسميًا ليتم تعريف التغيير في النطاق بوضوح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع ذو خبرة مشروع Agile بملايين الدولارات. أوضح مدير المشروع القواعد الأساسية للفريق، لكن بعد 12 دورة (iteration)، بدأ يلاحظ أن بعض الأعضاء لا يلتزمون بهذه القواعد.\n\nما الذي يجب أن يفعله مدير المشروع أولاً لضمان التزام الفريق بالقواعد؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاتصال بالموارد البشرية لطلب إرسال خطاب إنذار كتابي للأعضاء غير الملتزمين.",
          "correct": false
        },
        {
          "text": "طلب استبدال الأعضاء غير الملتزمين من المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "جدولة اجتماع مع الفريق لتعزيز القواعد الأساسية.",
          "correct": true
        },
        {
          "text": "إبلاغ راعي المشروع بهذا السلوك وطلب اتخاذ إجراء تأديبي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلبت اللجنة التوجيهية من مدير مشروع لديه خبرة في Agile تقديم مؤشر عن الوقت المتبقي لمشروع متوسط الحجم.\n\nما الأداة التي يمكن استخدامها لتقديم هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل وثيقة متطلبات العمل",
          "correct": false
        },
        {
          "text": "مخطط الحرق للإصدار (Release Burndown Chart)",
          "correct": true
        },
        {
          "text": "نقاط القصة (Story Points) للقصص المتبقية",
          "correct": false
        },
        {
          "text": "القياسات البديلة (Surrogate Measurements)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصبح فريق جديد معتادًا على ممارسات Agile. لاحظ قائد المشروع أن الفريق يعمل وفق التوقعات، لكن هناك ملل بين العديد من الأعضاء بسبب الروتين اليومي.\n\nما الذي يجب أن يفعله قائد المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "السماح للفريق بتنظيم نفسه وتحليل الوضع خلال اجتماع الاستعراض الذاتي (Retrospective) والتصحيح الذاتي.",
          "correct": false
        },
        {
          "text": "تحدي الفريق للعثور على طرق جديدة لتحقيق مستويات أداء أعلى لتحسين الوضع.",
          "correct": true
        },
        {
          "text": "التحدث مع الأعضاء فرديًا لمعرفة اقتراحاتهم لتحسين الوضع.",
          "correct": false
        },
        {
          "text": "مطالبة الفريق بإبلاغ الإدارة العليا وطلب توصيات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع مع فريق Scrum يواجه صعوبة في الالتزام بالمواعيد النهائية. بعد التحليل، اكتشف مدير المشروع وجود عدم توافق في الكفاءات داخل أحد الفرق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قبول المخاطرة المتعلقة بتأخر المشروع بسبب عدم التوافق.",
          "correct": false
        },
        {
          "text": "توفير تدريب مناسب لتعويض عدم التوافق.",
          "correct": true
        },
        {
          "text": "تحديث جدول المشروع لعكس التأخير.",
          "correct": false
        },
        {
          "text": "التأكيد على أهمية الالتزام بالمواعيد النهائية المتفق عليها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة كبيرة بالتحول من النهج التنبؤي إلى النهج الرشيق (Agile). يواجه أحد الفرق، الذي لديه معرفة بممارسات Agile، صراعات كبيرة مع المدراء التنفيذيين بشأن العمليات التي يجب اتباعها.\n\nكيف يجب حل هذه الصراعات؟",
      "explanation": "",
      "choices": [
        {
          "text": "التفاوض مع المدراء التنفيذيين والاتفاق على عملية محددة.",
          "correct": false
        },
        {
          "text": "تدريب المدراء التنفيذيين على ممارسات Agile.",
          "correct": true
        },
        {
          "text": "إشراك المدراء التنفيذيين في اجتماعات الاستعراض الذاتي (Retrospectives).",
          "correct": false
        },
        {
          "text": "مطالبة المدراء التنفيذيين باستخدام ممارسات Agile.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يستضيف أحد أعضاء الفريق حدثًا ويدعو عدة زملاء من خلال تقويمات العمل الخاصة بهم. عضو فريق آخر لم تتم دعوته إلى الحدث يبدو مشتتًا بشكل واضح خلال عدة اجتماعات وقوف.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "يطلب من الشخص الذي يستضيف الحدث أن يحدده كحدث خاص.",
          "correct": false
        },
        {
          "text": "تحديد اجتماع مع عضو الفريق المشتت لمناقشة أية مشكلات.",
          "correct": true
        },
        {
          "text": "يطلب من الشخص الذي يستضيف الحدث استخدام وسائل تواصل خاصة.",
          "correct": false
        },
        {
          "text": "إضافة قسم للفعاليات الاجتماعية في ميثاق المشروع للتعامل مع هذه المواقف.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا هجينًا. تواصل أحد أصحاب المصلحة مباشرة مع أحد أعضاء الفريق وطلب تغييرًا. أدى هذا الطلب إلى تشتيت انتباه عضو الفريق مما تسبب في انخفاض الإنتاجية.\n\nماذا يجب أن يفعل عضو الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ صاحب المصلحة بأن الإجراء الصحيح للمتطلبات الجديدة هو إرسالها مباشرة إلى مدير المشروع.",
          "correct": false
        },
        {
          "text": "إبلاغ صاحب المصلحة بأن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى لجنة التحكم بالتغييرات.",
          "correct": false
        },
        {
          "text": "إبلاغ Scrum Master بطلب التغيير من صاحب المصلحة والتأثير الناتج على الإنتاجية.",
          "correct": true
        },
        {
          "text": "إبلاغ Scrum Master لكي يتم مناقشة التغيير مباشرة مع صاحب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مصنع صناعي، قرر المالك إضافة قدرة إنتاجية عن طريق تركيب آلة جديدة وتحديث البرنامج المستخدم في الإنتاج. سيتم تنفيذ هذا التوسع أثناء استمرار المصنع في العمل والإنتاج. سيتم تحديث البرنامج باستخدام منهجية Agile لتقليل المخاطر، في حين أن شراء وتركيب الآلة سيتم باستخدام منهجية تنبؤية.\n\nما نوع الاتصالات التي يجب أن يصممها مدير المشروع في خطة إدارة الجدول الزمني لضمان التزام المشروع بالمواعيد؟",
      "explanation": "",
      "choices": [
        {
          "text": "اجتماعات أسبوعية في نفس الموقع مع أصحاب المصلحة المعنيين.",
          "correct": true
        },
        {
          "text": "تقارير حالة مكتوبة كل أسبوعين من أصحاب المصلحة المعنيين.",
          "correct": false
        },
        {
          "text": "اجتماعات أسبوعية فردية مع كل من أصحاب المصلحة المعنيين.",
          "correct": false
        },
        {
          "text": "مكالمات جماعية كل أسبوعين مع أصحاب المصلحة المعنيين.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع Agile في دورته الخامسة من أصل 10. بعد الاستعراض الأخير (Retrospective)، أدرك أعضاء الفريق أنهم اضطروا للعمل لساعات إضافية لإنجاز العمل المتفق عليه.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الفريق تقديم التزام أقل في الدورة التالية.",
          "correct": false
        },
        {
          "text": "طلب أعضاء إضافيين للحفاظ على سرعة الإنجاز.",
          "correct": false
        },
        {
          "text": "إجراء استعراض مركّز (Retrospective) لمساعدة الفريق على اكتشاف السبب الجذري.",
          "correct": true
        },
        {
          "text": "تنفيذ نقطة فحص في منتصف الدورة للتحقق مما إذا كان الفريق يسير على الطريق الصحيح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تنفيذ المشروع حاليًا باستخدام دورة حياة تنبؤية، ومع ذلك، سيتم تسليم منتج رئيسي بشكل تدريجي إلى العميل. الموارد المعينة تتمتع بخبرة وموثوقية ومستعدة لاتخاذ قرارات كان مدير المشروع يتخذها بعد كل تسليم تدريجي في مشاريع سابقة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ الفريق بأنه رغم أن البيئة هجينة، لا يزال مدير المشروع مسؤولًا عن اتخاذ القرارات.",
          "correct": false
        },
        {
          "text": "التشاور مع مالك المنتج حول السماح للموارد باتخاذ القرارات.",
          "correct": false
        },
        {
          "text": "دعم قرارات الفريق ونقل مسؤولية اتخاذ القرار إليهم.",
          "correct": true
        },
        {
          "text": "جدولة اجتماع مع اللجنة التوجيهية للحصول على الموافقة على الطلب.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق منذ شهرين ومع ذلك يفشل باستمرار في تنفيذ قصص المستخدم المخططة. كيف يجب على مدير المشروع التعامل مع هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تشجيع تغيير مدة الدورة من أجل الالتزام بالخطة.",
          "correct": false
        },
        {
          "text": "التأكد من أن حجم الدورة مناسب لمدة التكرار.",
          "correct": true
        },
        {
          "text": "الانخراط في توظيف مورد عالي المهارة لتعزيز القدرات.",
          "correct": false
        },
        {
          "text": "النظر في استخدام نظام مكافآت لتشجيع التسليم في الوقت المحدد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا باستخدام نهج هجين وطلب من عضو فريق كبير إجراء تحليل كمي للمخاطر. رد عضو الفريق بأنه لا يملك المعرفة الكافية للقيام بهذا التحليل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصعيد المشكلة إلى المدير الوظيفي.",
          "correct": false
        },
        {
          "text": "الاتصال بمكتب إدارة المشاريع (PMO) وطلب تعيين عضو آخر لديه المعرفة المناسبة.",
          "correct": false
        },
        {
          "text": "مساعدة عضو الفريق على إجراء التحليل الكمي من خلال التوجيه والتدريب.",
          "correct": true
        },
        {
          "text": "تنفيذ التحليل الكمي للمخاطر بدلًا من عضو الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة نقل بتحويل عملياتها التشغيلية والنظام الرئيسي المستخدم لتحريك الشحنات. تم وضع بيان النطاق، وتم الاتفاق على نهج تسليم تدريجي من قبل جميع أصحاب المصلحة.\n\nما الذي يحتاج مدير المشروع إلى القيام به بعد ذلك لمساعدة الفريق على فهم العمل المطلوب؟",
      "explanation": "",
      "choices": [
        {
          "text": "البدء في إعداد خطة إدارة المشروع تتضمن الحزم الزمنية والجدول التفصيلي وتوزيع المهام.",
          "correct": false
        },
        {
          "text": "العمل مباشرة مع أصحاب المصلحة على هيكل تقسيم العمل وتعيين المهام لكل عضو فريق.",
          "correct": false
        },
        {
          "text": "العمل مع الفريق لتفصيل النطاق إلى هيكل تقسيم العمل وحزم عمل لإنشاء التسليمات والجداول المطلوبة.",
          "correct": true
        },
        {
          "text": "إنشاء خطة إدارة المتطلبات وتعيينها لأعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أدى مشروع طويل وممتد إلى إنهاك فريق المشروع. بسبب مشكلات في الموعد النهائي، لا يستطيع مدير المشروع تمديد الجدول الزمني.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "تقديم المزيد من التقدير لأعضاء الفريق.",
          "correct": false
        },
        {
          "text": "مناقشة الوضع مع الفريق.",
          "correct": true
        },
        {
          "text": "طلب موارد إضافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بسبب حادثة حديثة، قدم أحد أصحاب المصلحة غير الراضين شكوى حول مشروع تم إغلاقه بالفعل.\n\nما الذي يمكن لمدير المشروع فعله للمساعدة في حل هذا؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ خطة إدارة العلاقات.",
          "correct": false
        },
        {
          "text": "التشاور مع راعي المشروع لإدارة صاحب المصلحة غير الراضي.",
          "correct": false
        },
        {
          "text": "مراجعة أرشيف نظام معلومات إدارة المشروع (PMIS).",
          "correct": true
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع لجنة توجيه المشروع، أبلغ مدير المشروع أن أحد أعضاء الفريق الرئيسيين الذين كانوا داعمين سابقًا أصبحوا مقاومين وسلبيين تجاه التغييرات. أين يجب توثيق هذه المعلومة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مصفوفة المسؤولية والمساءلة والتشاور والإعلام (RACI)",
          "correct": false
        },
        {
          "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
          "correct": true
        },
        {
          "text": "سجل المخاطر وسجل القضايا",
          "correct": false
        },
        {
          "text": "تقارير أداء العمل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتلقى الفريق نتائج تم التعاقد على تنفيذها خارجيًا ويحدد أنها لا تفي بمعايير القبول المتفق عليها. ما الذي يجب على مدير المشروع الرجوع إليه للتحقق من ذلك مع البائع؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطة إدارة المشتريات",
          "correct": false
        },
        {
          "text": "طلب تقديم العروض (RFP)",
          "correct": false
        },
        {
          "text": "بيان العمل (SOW)",
          "correct": true
        },
        {
          "text": "عمليات التفتيش",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في منظمة متعددة الوظائف يحتاج إلى إبلاغ مدير القسم بعدد ونوع الموارد المطلوبة، ومدة الحاجة إليها. ما الأداة التي يجب أن يستخدمها مدير المشروع لتقديم هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعيينات الموارد",
          "correct": false
        },
        {
          "text": "مخطط التوزيع البياني للموارد",
          "correct": true
        },
        {
          "text": "مصفوفة توزيع المسؤوليات (RAM)",
          "correct": false
        },
        {
          "text": "مخطط هيكل تنظيم المشروع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يصر أحد أصحاب المصلحة المتطلبين على إضافة ميزة إضافية إلى منتج المشروع دون تغيير النطاق أو الميزانية أو الجدول الزمني. يسمح مدير المشروع بإضافة هذه الميزة لأنها تضيف قيمة كبيرة للمنتج النهائي، لكنه يكتشف لاحقًا أن إضافتها أطالت الجدول الزمني وزادت التكاليف.\nما العملية التي كان ينبغي على مدير المشروع اتباعها قبل إضافة الميزة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة التغييرات",
          "correct": true
        },
        {
          "text": "تخطيط الجدول الزمني",
          "correct": false
        },
        {
          "text": "تخطيط المشتريات",
          "correct": false
        },
        {
          "text": "تدقيق الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم الانتهاء من مشروع لإنشاء منتج جديد وإطلاقه في السوق، ولكن كانت المبيعات أقل بكثير من المتوقع. أظهرت التحليلات أن المنتج لا يتماشى مع الكفاءات الأساسية للمنظمة.\n\nفي أي نشاط كان يجب اكتشاف هذا الخلل؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل سيناريوهات ماذا لو",
          "correct": false
        },
        {
          "text": "مراجعة دراسة الجدوى",
          "correct": true
        },
        {
          "text": "تقييم الأداء الاستراتيجي",
          "correct": false
        },
        {
          "text": "تحديد النطاق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يتم تدقيق مشروع للتأكد من الالتزام بسياسات المؤسسة. ما هي العملية التي يتم تنفيذها؟",
      "explanation": "",
      "choices": [
        {
          "text": "تدقيق الجدول الزمني",
          "correct": false
        },
        {
          "text": "تخطيط إدارة الجودة",
          "correct": false
        },
        {
          "text": "ضبط الجودة",
          "correct": false
        },
        {
          "text": "إدارة الجودة",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء العمل على مشروع، أدرك فريق المشروع أن ترقيات مركز البيانات الأخيرة قد تؤثر على نتائج المشروع. بعض وحدات المخرجات غير متوافقة مع البيئة الجديدة. حدد الفريق الخطوات المناسبة لمعالجة المشكلة.\n\nما هي الخطوة التالية لمدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب زيادة في الميزانية.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير.",
          "correct": true
        },
        {
          "text": "تغيير جدول المشروع.",
          "correct": false
        },
        {
          "text": "تحديث وثيقة المتطلبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمت الموافقة على تغيير تصميم طلبه العميل من قبل مجلس مراقبة التغيير (CCB). ثم اكتشف مدير المشروع أن هذا التغيير سيتسبب في تأخير لمدة ثلاثة أشهر.\n\nماذا كان ينبغي على مدير المشروع فعله لتفادي ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "زيادة الميزانية المصرح بها وطلب موارد إضافية",
          "correct": false
        },
        {
          "text": "إعادة تعريف نطاق المشروع ليشمل التصميم الجديد",
          "correct": false
        },
        {
          "text": "تسريع الأعمال وجدولة مضغوطة (crashing)",
          "correct": false
        },
        {
          "text": "تقييم الطلب بدقة وفقًا لخطة إدارة المخاطر",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تجري حاليًا أعمال بناء مرفق مستودع جديد. يقوم مدير المشروع بتنفيذ جهود لتطوير الفريق مثل التدريب، مما سيؤدي إلى تقليل معدل العيوب.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تقديم برنامج تدريبي.",
          "correct": false
        },
        {
          "text": "تحديث خطة إدارة الموارد.",
          "correct": true
        },
        {
          "text": "زيادة مراجعات ضبط الجودة.",
          "correct": false
        },
        {
          "text": "إضافة تكاليف التدريب إلى الميزانية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تستخدم شركة منهجية Lean Six Sigma في مشروع ما. في منتصف المشروع، يتم دعوة مستشار خارجي مختص بـ Lean لإجراء تدقيق لضمان التطبيق الصحيح للمنهجية.\n\nما هي العملية التي يتم تطبيقها؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة الجودة",
          "correct": true
        },
        {
          "text": "ضبط الجودة",
          "correct": false
        },
        {
          "text": "إجراء تحليل المخاطر النوعي",
          "correct": false
        },
        {
          "text": "تخطيط إدارة الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير مشروع ذو خبرة بالتحضير لاجتماع انطلاق لمشروع تقييم خدمة جديدة. تم توفير وصف عالي المستوى للخدمة.\n\nما الذي يجب أن يقوم به مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تطوير ميثاق المشروع.",
          "correct": true
        },
        {
          "text": "تطوير مصفوفة المسؤوليات (RACI).",
          "correct": false
        },
        {
          "text": "تحديد بيان نطاق المشروع.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تقسيم العمل (WBS).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال مرحلة بدء المشروع، يراجع مدير المشروع دراسة الجدوى ويجد أن المعلومات غير مكتملة. ماذا يجب على مدير المشروع أن يفعل؟",
      "explanation": "",
      "choices": [
        {
          "text": "إضافة فجوة المعلومات إلى سجل المخاطر.",
          "correct": false
        },
        {
          "text": "مراجعة بيان العمل (SOW) لإنشاء ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "تعديل دراسة الجدوى لتضييق نطاق المشروع وإنشاء ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة دراسة الجدوى مع الجهة الراعية للتأكد من توافق المشروع مع احتياجات العمل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال تنفيذ المشروع، ظهرت مشكلة تتطلب تنفيذ خطة الطوارئ، مما سيؤثر على جدول المشروع.\n\nما الذي يجب على مدير المشروع القيام به؟",
      "explanation": "",
      "choices": [
        {
          "text": "بدء تدقيق للمخاطر.",
          "correct": false
        },
        {
          "text": "إصدار طلب تغيير.",
          "correct": true
        },
        {
          "text": "مراجعة تأثير التكلفة.",
          "correct": false
        },
        {
          "text": "تحديث خطة الطوارئ.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اكتشف مدير المشروع عيبًا كبيرًا في أحد المخرجات الرئيسية للمشروع. ما هي عملية إدارة المشروع التي يتم تنفيذها؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة الجودة",
          "correct": false
        },
        {
          "text": "ضبط الجودة",
          "correct": true
        },
        {
          "text": "تخطيط إدارة الجودة",
          "correct": false
        },
        {
          "text": "المعاينة الإحصائية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إعداد ميثاق المشروع لمشروع جديد، يراجع مدير المشروع الدروس المستفادة من المشاريع السابقة. تُظهر الوثائق مشكلات متكررة في انخفاض مستوى المشاركة وعدم التوافق بين أصحاب المصلحة حول أهداف المشروع.\n\nما الذي يجب على مدير المشروع فعله لتجنب تكرار هذه المشكلة في المشروع الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "السماح لأي صاحب مصلحة بالانضمام إلى مجلس مراقبة التغيير (CCB) في أي وقت خلال المشروع.",
          "correct": false
        },
        {
          "text": "إدراج جميع أصحاب المصلحة في مصفوفة تعيين المسؤوليات (RAM) لقبول المخرجات.",
          "correct": false
        },
        {
          "text": "جمع جميع المتطلبات التي يقدمها كل صاحب مصلحة ودمجها في هيكل تقسيم العمل (WBS).",
          "correct": false
        },
        {
          "text": "بناء فهم مشترك بين أصحاب المصلحة حول المخرجات الرئيسية الموضحة في ميثاق المشروع المعتمد.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع جديد يحتوي على درجة عالية من عدم اليقين في التكاليف المطلوبة لاستكماله. ما هو النهج الذي يجب أن يستخدمه مدير المشروع لتحديد التكاليف المتوقعة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التقدير القياسي (Analogous estimating)",
          "correct": false
        },
        {
          "text": "تقنيات التقدير الإحصائي",
          "correct": false
        },
        {
          "text": "التقدير البراميتري",
          "correct": false
        },
        {
          "text": "التقدير بالنقاط الثلاث",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم اجتياز جميع ضوابط الجودة، وأصبح أحد مخرجات المشروع جاهزًا للتسليم للعميل. ومع ذلك، تم اعتماد طلب تغيير لإضافة معايير جودة جديدة.\n\nما الذي يجب أن يقوم به مدير المشروع أولاً؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة المشروع.",
          "correct": false
        },
        {
          "text": "إيقاف تسليم المخرج إلى العميل.",
          "correct": true
        },
        {
          "text": "استخدام معايير الجودة الجديدة للمخرجات المستقبلية.",
          "correct": false
        },
        {
          "text": "تحديث سجل المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء نشاط جماعي لتحديد أحد المدخلات لعملية تخطيط إدارة المشتريات، اختلف بعض المشاركين حول ترتيب عناصر متعلقة بالامتثال. ما الأداة أو التقنية التي يجب على مدير المشروع استخدامها لحل هذا الخلاف؟",
      "explanation": "",
      "choices": [
        {
          "text": "مخطط التقارب",
          "correct": false
        },
        {
          "text": "تحليل القرار متعدد المعايير",
          "correct": false
        },
        {
          "text": "تقنية المجموعة الاسمية",
          "correct": true
        },
        {
          "text": "العصف الذهني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة متعددة الجنسيات بتطوير منتج رقمي محليًا باستخدام منصة تقنية جديدة. ويوجد الخبير الوحيد في هذه المنصة في المقر الرئيسي للشركة، وهو مسؤول عن تقديم الدعم لعدة دول.\n\nكيف يمكن لمدير المشروع المحلي ضمان مشاركة هذا الخبير؟",
      "explanation": "",
      "choices": [
        {
          "text": "تصميم جدول سفر لضمان الدعم في الموقع في الوقت المناسب.",
          "correct": false
        },
        {
          "text": "إدراج الخبير ضمن الفريق باستخدام بيئة افتراضية.",
          "correct": true
        },
        {
          "text": "طلب من راعي المشروع تعيين الخبير كعضو دائم في الفريق.",
          "correct": false
        },
        {
          "text": "طلب من أعضاء الفريق التواصل مع الخبير كمصدر خارجي حسب الحاجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إغلاق المشروع، يجد مدير المشروع صعوبة في الحصول على ملاحظات إيجابية حول نجاح المشروع. بعض أصحاب المصلحة لا يوافقون على معايير نجاح المشروع وكانوا محبطين منذ بدايته.\n\nإلى ماذا يجب أن يرجع مدير المشروع لمعالجة هذه المخاوف؟",
      "explanation": "",
      "choices": [
        {
          "text": "ميثاق المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة الجودة",
          "correct": false
        },
        {
          "text": "بيان نطاق المشروع",
          "correct": false
        },
        {
          "text": "وثائق المتطلبات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يكشف تقييم الأثر أن أحد المخرجات قد يتأخر لمدة أسبوعين. أحد الموارد الرئيسية لم يكن متاحًا للعمل على نشاط غير حرج بسبب أولويات أخرى. قد يؤدي ذلك إلى تحميل زائد للعمل على الموارد المتبقية.\n\nنظرًا لأن التكلفة تمثل قيدًا رئيسيًا في هذا المشروع، ما الذي يجب أن يفعله مدير المشروع فورًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديد ما إذا كان لدى المهمة هامش زمني (Float) يسمح بتحقيق تاريخ نهاية المشروع.",
          "correct": true
        },
        {
          "text": "توظيف مورد مؤقت للقيام بالمهمة.",
          "correct": false
        },
        {
          "text": "التشاور مع الفريق وتقليل النطاق.",
          "correct": false
        },
        {
          "text": "تغيير تقويم الموارد لتفادي التأخيرات الكبرى.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ينص ميثاق المشروع المعتمد على ضرورة استخدام منهجية رشيقة (Agile). خلال جلسة استخلاص الدروس المستفادة، أشار العميل إلى أن الفريق لم يتمكن من تقديم تقديرات تكلفة موثوقة، وأنه يجب تخصيص مزيد من الوقت لتحديد النطاق في التكرار الأول.\n\nما الدرس الذي يجب توثيقه في سجل الدروس المستفادة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب تعريف العميل مسبقًا على المنهجية الرشيقة لفهم عملية تقدير التكاليف.",
          "correct": true
        },
        {
          "text": "لا ينبغي استخدام المنهجية الرشيقة إذا كان العميل يتطلب تقديرات تكاليف موثوقة.",
          "correct": false
        },
        {
          "text": "يجب تخصيص وقت في التكرار الأول لتعريف النطاق والتأكد من دقة تقديرات التكاليف.",
          "correct": false
        },
        {
          "text": "يجب تضمين تواصل العميل في الاجتماعات اليومية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ مدير رفيع المستوى مدير المشروع أن أداء المشروع ليس جيدًا مقارنة بالمشاريع الأخرى. ما الذي يمكن لمدير المشروع استخدامه لتحسين الأداء في التكرارات التالية؟",
      "explanation": "",
      "choices": [
        {
          "text": "جلسة مراجعة استعادية (Retrospective).",
          "correct": true
        },
        {
          "text": "تحليل قائمة الأعمال (Backlog).",
          "correct": false
        },
        {
          "text": "بناء الفريق.",
          "correct": false
        },
        {
          "text": "تحفيز الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تبدأ شركة مشروعًا جديدًا هجينًا للامتثال للوائح الحكومية الجديدة. حدد الفريق سرعة موثوقة تبلغ 40 نقطة قصة لكل تكرار. كل تكرار يستمر أسبوعين. يرغب الراعي في معرفة موعد الانتهاء إذا تبقى 800 نقطة قصة.",
      "explanation": "",
      "choices": [
        {
          "text": "4 ساعات",
          "correct": false
        },
        {
          "text": "8 أسابيع",
          "correct": false
        },
        {
          "text": "40 يومًا",
          "correct": false
        },
        {
          "text": "10 أشهر",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في مشروع صناعي ضخم. الفريق موزع في ست دول ومناطق زمنية مختلفة. خلال اجتماع مراجعة، لوحظ أن تواريخ المعالم الأساسية التي تم تحديدها قد فاتت.\n\nما هو السبب الأرجح لتفويت هذه المواعيد النهائية؟",
      "explanation": "",
      "choices": [
        {
          "text": "نقص الالتزام والدعم.",
          "correct": false
        },
        {
          "text": "سوء التواصل داخل الفريق.",
          "correct": true
        },
        {
          "text": "سوء فهم توقعات أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "توقعات أصحاب المصلحة كانت مرتفعة جدًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تكليف مديرة مشروع بمشروع جديد. بدأت بالعمل على وثائق المشروع، وبعد قراءتها لوثيقة ميثاق المشروع، بدأت في جمع المخاطر التي تراها. بعد أن أتمّت إعداد القائمة، متى يجب مراجعتها؟",
      "explanation": "",
      "choices": [
        {
          "text": "عند بدء المشروع ومع إغلاق كل خطر.",
          "correct": false
        },
        {
          "text": "أثناء تنظيم العمل، التحضير له، وتنفيذه.",
          "correct": false
        },
        {
          "text": "أثناء الاجتماعات الأسبوعية عند تحديد مخاطر جديدة وإضافتها.",
          "correct": false
        },
        {
          "text": "بشكل منتظم وطوال مدة المشروع.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بيئة تطوير رشيقة (أجايل)، متى يجب إجراء تحليل للمخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "قبل بدء كل تكرار (iteration)",
          "correct": true
        },
        {
          "text": "أثناء اجتماع الوقوف اليومي",
          "correct": false
        },
        {
          "text": "في اجتماع الاستعراض (retrospective)",
          "correct": false
        },
        {
          "text": "بعد كل اجتماع سكرم (scrum)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لاحظ مدير المشروع وجود صراع شخصي واضح بين بعض أعضاء الفريق أثناء مرحلة بدء المشروع. متى يجب على مدير المشروع معالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "في أقرب وقت ممكن لمنع تصاعد النزاع لاحقًا خلال المشروع",
          "correct": true
        },
        {
          "text": "قبل كل اجتماع من خلال تذكير الفريق بضرورة الاحترام المتبادل",
          "correct": false
        },
        {
          "text": "مباشرة بعد حدوث مشادة لتحديد من هو على صواب",
          "correct": false
        },
        {
          "text": "في نهاية المشروع للسماح بانخفاض حدة النزاع وتوثيقه في الدروس المستفادة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير مشروع جديد لقيادة مشروع لأول مرة ويشعر بالقلق من تصاعد التوتر. أعضاء الفريق يتجادلون خلال مرحلة تتطلب جهدًا كبيرًا، وقد أبدى أصحاب المصلحة بعض الشكوك حول أداء المشروع. خلال مناقشة مع مدير مشروع مخضرم، اعترف المدير الجديد بخوفه من الصراع وسأله عن كيفية نظرته للصراع.nnكيف يجب أن يرد مدير المشروع المخضرم؟",
      "explanation": "",
      "choices": [
        {
          "text": "الصراع في المشاريع أمر لا مفر منه - ركّز على إدارته.",
          "correct": true
        },
        {
          "text": "الصراع في المشاريع يمكن منعه - أعد تخطيط إجراءات التخفيف.",
          "correct": false
        },
        {
          "text": "الصراع في المشاريع كارثي - حضّر خطة تعافي.",
          "correct": false
        },
        {
          "text": "الصراع في المشاريع صحي - لا تتدخل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق على مشروع تطوير منتج جديد معقد وسريع التغيير. بعد تقييم حديث للعملية، قرر الفريق إضافة أدوات أجايل إلى المنهج التنبؤي الذي يستخدمه. تهدف هذه الإضافة إلى تحسين تسليم المشروع بشكل عام ونجاحه وإنتاجيته.\n\nأي مما يلي يصف كيف تهدف هذه الإضافة إلى تحقيق قيمة مضافة للتسليم العام والنجاح والإنتاجية؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدم أدوات الأجايل للاستفادة من قدرة منهجيات الأجايل على الاستجابة بفعالية للتغيير، مع الحفاظ على مزايا النهج التنبؤي لإدارة المشروع.",
          "correct": true
        },
        {
          "text": "استخدم أدوات الأجايل لاستبدال جميع الأساليب التنبؤية بأساليب أجايل جديدة، وبالتالي تقليل ضعف الإنتاجية.",
          "correct": false
        },
        {
          "text": "استخدم أدوات الأجايل لمقارنة الأجايل بالأساليب التنبؤية، ثم اختر النهج الأفضل للمشاريع المستقبلية.",
          "correct": false
        },
        {
          "text": "استخدم أدوات الأجايل واطلب من أعضاء الفريق الاختيار بين الأجايل والأساليب التنبؤية حتى يعملوا بشكل أكثر فعالية وإنتاجية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع يشارك في تنفيذ مشروع عالمي وهو في طور تجنيد فريق المشروع. بعد تكوين الفريق، ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "أرسل بريدًا ترحيبيًا واستضف فعالية تعريفية بالفريق حتى يتعرف الأعضاء على بعضهم البعض.",
          "correct": true
        },
        {
          "text": "أرسل خطة إدارة المشروع وميثاق المشروع لأعضاء الفريق ليطلعوا على أهداف المشروع وإجراءاته.",
          "correct": false
        },
        {
          "text": "رتب اجتماعًا لأعضاء الفريق لمناقشة أي مخاوف تتعلق بالمتطلبات ونطاق المشروع.",
          "correct": false
        },
        {
          "text": "أرسل استبيانًا لأعضاء الفريق للتعرف على كل عضو، وشارك النتائج عبر البريد الإلكتروني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في أي مرحلة من نموذج تطوير الفريق لتوكمان (Tuckman) يجب على مدير المشروع التركيز بشكل أكبر على زيادة تحفيز الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "مرحلة التكوين (Forming)",
          "correct": true
        },
        {
          "text": "مرحلة العصف (Storming)",
          "correct": false
        },
        {
          "text": "مرحلة التنظيم (Norming)",
          "correct": false
        },
        {
          "text": "مرحلة الأداء (Performing)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "لدى أحد أصحاب المصلحة التنفيذيين قوة اتخاذ قرار حاسمة في تنفيذ المشروع ونجاحه. كيف ينبغي أن ينعكس هذا الدور المهم في خطة إشراك أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "وصف مستوى دعم التنفيذي وتوقعاته وحدود المخاطر وأساليب التواصل المناسبة لمختلف احتياجات المشروع.",
          "correct": true
        },
        {
          "text": "رتّب التنفيذي في مخطط تنظيمي وبيّن علاقاته أو خلافاته مع أصحاب مصلحة آخرين.",
          "correct": false
        },
        {
          "text": "صنّف التنفيذي على أنه 'داعم' وتأكد من تحديث البريد الإلكتروني ورقم الهاتف وأوقات الإجازات.",
          "correct": false
        },
        {
          "text": "صف مشاركة التنفيذي في مشاريع سابقة مماثلة لتحديد مستوى المشاركة المناسب على أساس كل حالة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم خريج جديد مؤخرًا إلى فريق أبحاث وتطوير رشيق وناضج. الموجه المعيّن للعمل مع الخريج يشعر بالإرهاق من عبء العمل الإضافي. أداء الفريق وتحفيزه في تراجع.\n\nكيف يمكن لمدير المشروع المساعدة في هذا الوضع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الحفاظ على أسلوب القيادة غير التدخلي مع الفريق، ولكن استخدام أسلوب القيادة المعاملاتي لإعطاء توجيهات واضحة للخريج.",
          "correct": true
        },
        {
          "text": "اطلب من الموجه استخدام أسلوب القيادة الخدمية التعاونية للقيام بالمهام المعتادة بالإضافة إلى دور التوجيه.",
          "correct": false
        },
        {
          "text": "إلغاء خطة التوجيه والتركيز على تحفيز الخريج من خلال التعلم المكثف بالغمر.",
          "correct": false
        },
        {
          "text": "اطلب من ثلاثة أعضاء إضافيين في الفريق مشاركة دور التوجيه لتقليل عبء العمل الفردي بنسبة 75٪.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أعرب بعض أعضاء الفريق المكلّفين بمشروع تكنولوجيا جديدة عن عدم معرفتهم بالتكنولوجيا والتحديات التي سيواجهونها أثناء التنفيذ. ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "نظرًا لمواعيد التسليم، استبدل الأعضاء بموظفين أكثر دراية.",
          "correct": false
        },
        {
          "text": "اطلب من أعضاء الفريق إجراء بعض الأبحاث والتعلم الذاتي حول التكنولوجيا.",
          "correct": false
        },
        {
          "text": "أعد توزيع الأعضاء للعمل على مهام أخرى تتناسب مع خبراتهم.",
          "correct": false
        },
        {
          "text": "طمئن أعضاء الفريق بأن هناك مسار تدريب معد لتعلم التكنولوجيا الجديدة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مشروع دوائي في مرحلة البدء من المحتمل أن يتأثر بلوائح سوقية جديدة. ما هي فئة أصحاب المصلحة التي يجب على مدير المشروع تخصيصها للجهة التنظيمية المعنية؟",
      "explanation": "",
      "choices": [
        {
          "text": "خارجي ذو سلطة/تأثير مرتفع",
          "correct": true
        },
        {
          "text": "داخلي ذو سلطة/تأثير مرتفع",
          "correct": false
        },
        {
          "text": "داخلي بمستوى دعم مقاوم أو معارض",
          "correct": false
        },
        {
          "text": "خارجي بمستوى دعم مقاوم أو معارض",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تواصل أحد أعضاء الفريق مع مدير المشروع مباشرة بعد نهاية اجتماع المشروع بشأن حاجته إلى المساعدة في إكمال مهمة متأخرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجاهل طلب عضو الفريق، واطلب بذل جهد مضاعف لإكمال المهمة.",
          "correct": false
        },
        {
          "text": "ناقش المشكلة خلال الاجتماع اليومي، واتخذ القرار المناسب مع الفريق.",
          "correct": true
        },
        {
          "text": "اطلب من عضو الفريق الانسحاب من المهمة وأعد تخصيصها لشخص آخر.",
          "correct": false
        },
        {
          "text": "اطلب من عضو فريق مبتدئ المساعدة في إكمال المهمة في موعدها.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه فريق المشروع قرارًا بشأن الخطوات التالية لمعالجة التأخيرات المكتشفة مؤخرًا في الجدول الزمني للمهام. يتوقع مدير المشروع من أعضاء الفريق اتخاذ القرارات المناسبة فيما يتعلق بالمهام الموكلة إليهم والمضي قدمًا في تنفيذها.\n\nما هو نمط القيادة الذي يستخدمه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "ديمقراطي",
          "correct": false
        },
        {
          "text": "استبدادي",
          "correct": false
        },
        {
          "text": "القيادة الحرة (Free rein)",
          "correct": true
        },
        {
          "text": "التسوية (Smoothing)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم فريق مشروع حاليًا بتحديد الفوائد المرتبطة بمشروعين لاختيار المشروع الذي سيقدم قيمة تجارية أكبر. تتضمن المهمة تحليل أي مشروع يساعد الشركة بشكل أفضل في تلبية متطلبات الامتثال والتنظيم، بالإضافة إلى تحسين رضا العملاء.\n\nأي من الفئات التالية تصف بشكل أفضل نوع الفوائد التي يتم تحليلها في هذه المهمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "فائدة كمية",
          "correct": false
        },
        {
          "text": "فائدة نوعية",
          "correct": true
        },
        {
          "text": "فائدة جودة",
          "correct": false
        },
        {
          "text": "فائدة حقيقية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تدرس شركة اعتماد منهجية أجايل (Agile) للمشاريع المستقبلية. يقود مدير المشروع مناقشة تركز على الفوائد المرتبطة بمنهجية أجايل.\n\nأي من النقاط التالية يجب أن يسلط مدير المشروع الضوء عليها؟",
      "explanation": "",
      "choices": [
        {
          "text": "الشفافية عنصر أساسي، التسليم المبكر والموثوق، المنهجية تتبنى التغيير",
          "correct": true
        },
        {
          "text": "منهج قائم على المنتج، يقسم المشاريع إلى مراحل ذات قيمة، يركز على المبرر التجاري",
          "correct": false
        },
        {
          "text": "وجود توثيق واضح، نقطة مسؤولية واحدة، تعاون فعال",
          "correct": false
        },
        {
          "text": "لا وقت إضافي إن أمكن، تواصل وجهًا لوجه والنظر إلى الوراء باستمرار للتقدم إلى الأمام",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل فريق المشروع مسحًا بيئيًا وكشف عن العديد من العوائق المرتبطة التي يمكن أن تؤثر سلبًا على تسليم المشروع. يعمل مدير المشروع مع الفريق لفهم تفاصيل كل عائق تم تحديده وكيفية ارتباط هذه العوائق ببعضها البعض، وذلك لفهم تعقيد المشروع بشكل عام. سيمكن ذلك الفريق من الوصول إلى خطة لمعالجة التحديات المحددة.\n\nما هي التقنية التي استخدمها مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل باريتو",
          "correct": false
        },
        {
          "text": "تحليل حرج",
          "correct": false
        },
        {
          "text": "التفكير النظمي (Systems Thinking)",
          "correct": true
        },
        {
          "text": "إدارة الجودة الشاملة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي المهارات الشخصية التي يحتاجها مديرو المشاريع أو الفرق لمراقبة علاقات أصحاب المصلحة، وتقييم استراتيجيات المشاركة، وتعديل هذه الأساليب حسب الحاجة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستماع النشط، القيادة، والوعي الثقافي والسياسي",
          "correct": true
        },
        {
          "text": "التوجيه، اتخاذ القرار، والوعي الثقافي والسياسي",
          "correct": false
        },
        {
          "text": "الاستماع النشط، بناء الفريق، القيادة، والشبكات",
          "correct": false
        },
        {
          "text": "بناء العلاقات، التأثير، والوعي الثقافي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "عند إدارة مشروع استراتيجي للمؤسسة، ما هي الأدوات الأربع التي يجب على مدير المشروع استخدامها لتحليل المخاطر؟ (اختر أربعًا)",
      "explanation": "",
      "choices": [
        {
          "text": "العصف الذهني",
          "correct": true
        },
        {
          "text": "الفحص",
          "correct": true
        },
        {
          "text": "قوائم التحقق من المخاطر",
          "correct": true
        },
        {
          "text": "تقييم المنتج",
          "correct": false
        },
        {
          "text": "إجراء المقابلات",
          "correct": true
        },
        {
          "text": "تحليل شجرة القرار",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "أعضاء فريق المشروع موزعين في دول مختلفة. وفجأة، لم تعد القيود على السفر تسمح بتواجد الأعضاء في موقع واحد.\n\nعند تحليل مخاطر المشروع، ما الأدوات التي يجب على مدير المشروع استخدامها؟ (اختر اثنين).",
      "explanation": "",
      "choices": [
        {
          "text": "قائمة التحقق من المخاطر",
          "correct": true
        },
        {
          "text": "مخطط السياق",
          "correct": false
        },
        {
          "text": "الاجتماعات",
          "correct": true
        },
        {
          "text": "تمثيل البيانات",
          "correct": false
        },
        {
          "text": "تقنيات التخطيط البياني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال اجتماع الفريق، طلب الأعضاء من مدير المشروع تقديم نصائح حول التبعيات في المشروع. ما الذي يجب أن يطلبه مدير المشروع من الفريق بخصوص التبعيات الداخلية؟",
      "explanation": "",
      "choices": [
        {
          "text": "أن يتعرفوا على أحدث التغييرات التنظيمية.",
          "correct": true
        },
        {
          "text": "قراءة معلومات عن الاندماج مع مؤسسة منافسة.",
          "correct": false
        },
        {
          "text": "التحقق من التغييرات المتعلقة بسياسة العمل من المنزل.",
          "correct": false
        },
        {
          "text": "التعرف على تحديث مزود الإنترنت.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير مشروع على مشروع معقد يتضمن العديد من أصحاب المصلحة ذوي الأولويات المتضاربة.\n\nما هما الإجراءان اللذان يجب على مدير المشروع اتخاذهما للاستعداد للمفاوضات وكسب دعم جميع أصحاب المصلحة؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "تخصيص هامش احتياطي كافٍ لمواجهة تغييرات النطاق.",
          "correct": false
        },
        {
          "text": "تطوير علاقة جيدة مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "فهم السياسة والمصالح الشخصية لأصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "تطوير خطة جيدة لإدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "تطوير خطة جيدة لإدارة المخاطر.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير مشروع على مشروع معقد يحظى باهتمام كبير من الإدارة العليا. هناك العديد من أصحاب المصلحة ذوي الأولويات المتضاربة، ويتطلب الأمر مهارات تفاوض كبيرة للتغلب على النزاعات المتزايدة.\n\nما المبدأان اللذان يجب على مدير المشروع اتباعهما عند تطوير استراتيجية التفاوض؟ (اختر اثنين).",
      "explanation": "",
      "choices": [
        {
          "text": "فصل الأشخاص عن المشكلة.",
          "correct": true
        },
        {
          "text": "التركيز على القضايا السياسية أولاً.",
          "correct": false
        },
        {
          "text": "التركيز على أولويات الإدارة.",
          "correct": false
        },
        {
          "text": "التركيز على المصالح وليس المواقف.",
          "correct": true
        },
        {
          "text": "تفويض القرارات إلى الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد به العديد من أصحاب المصلحة ذوي الأولويات المتضاربة. طلبت الإدارة العليا من مدير المشروع تجنب \"الضجيج\" لأن المشروع ذو طابع سياسي عالي. اختار مدير المشروع استخدام آراء الخبراء من شخصيات بارزة في الصناعة.\n\nما الذي فعله مدير المشروع لتلبية طلب الإدارة العليا؟",
      "explanation": "",
      "choices": [
        {
          "text": "استجاب بطريقة ودية للإدارة العليا",
          "correct": false
        },
        {
          "text": "بدا متسقًا في استخدام الكلمات والأفعال",
          "correct": false
        },
        {
          "text": "تعاون مع الإدارة العليا لتحقيق أهداف مشتركة",
          "correct": false
        },
        {
          "text": "اتخذ إجراءً استنادًا إلى سلطة الإدارة العليا",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع سياسي معقد يضم العديد من أصحاب المصلحة ذوي الأولويات المتضاربة. طلبت الإدارة العليا من مدير المشروع التأكد من عدم وجود \"ضجيج\" حول المشروع. خلال اجتماع مع أصحاب المصلحة، طرح مدير المشروع سلسلة من الأسئلة لتأكيد القبول لكل عنصر من عناصر التسليم قبل طلب القبول للمشروع بأكمله.\n\nما الذي فعله مدير المشروع لإرضاء أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "استجاب للأفعال الإيجابية من أصحاب المصلحة لمكافأة التصرفات",
          "correct": false
        },
        {
          "text": "تصرف بطريقة متسقة بين الكلمات والأفعال",
          "correct": true
        },
        {
          "text": "تعاون مع أصحاب المصلحة لتحقيق أهداف مشتركة",
          "correct": false
        },
        {
          "text": "تصرف بناءً على السلطة الممنوحة من الإدارة العليا",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع مع الفريق على تطوير حزم العمل. لاحظ مدير المشروع وجود فجوة في جمع المتطلبات حيث كانت هناك نقاط مهمة مفقودة، مما قد يؤثر على الجدول الزمني للمشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاجتماع مع الراعي لمناقشة إلغاء المشروع.",
          "correct": false
        },
        {
          "text": "الاجتماع مع الراعي وأصحاب المصلحة لطلب زيادة الميزانية.",
          "correct": false
        },
        {
          "text": "الاجتماع مع مدير المنتج لإنشاء قائمة المتطلبات الناقصة في سجل المهام.",
          "correct": true
        },
        {
          "text": "تقييم الأثر وتحديث سجل المخاطر وعرضه على أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أصيب مدير مشروع يخطط لمشروع استراتيجي تنبؤي بوعكة مفاجئة. يجب تقديم خط الأساس للمشروع إلى العميل خلال 3 أيام، ويجب على مدير مكتب إدارة المشاريع (PMO) العثور على شخص لإكمال التخطيط. الخيارات هي:\n\nمدير المشروع A: ذو خبرة عالية في مشاريع Scrum فقط، متاح فورًا لمدة يومين فقط\nمدير المشروع B: ذو خبرة متوسطة أساسًا في مشاريع البناء، متاح في اليوم التالي لمدة أسبوع\n\nمن يجب أن يختار مدير مكتب إدارة المشاريع وعلى أي أساس؟",
      "explanation": "",
      "choices": [
        {
          "text": "A متاح على الفور ولديه خبرة أكثر للتخطيط بسرعة وبشكل صحيح.",
          "correct": false
        },
        {
          "text": "B يفهم بشكل أفضل تعقيدات التخطيط التنبؤي ولديه شبكة من خبراء الموضوع.",
          "correct": true
        },
        {
          "text": "A على اطلاع أكبر ويتقن أحدث اتجاهات ومنهجيات التخطيط.",
          "correct": false
        },
        {
          "text": "B سيكون متاحًا للعمل لفترة أطول في حال فات موعد التسليم.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع مشروعًا حيويًا لمؤسسته وللسلطة المحلية للطاقة والبيئة. خلال اجتماع للفريق لمناقشة مخاطر المشروع، أثار الفريق وجود خطر كبير يتمثل في أن مديرًا كبيرًا مهمًا غير مشارك حاليًا في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذا الخطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنفيذ تقارير الحالة المنتظمة.",
          "correct": false
        },
        {
          "text": "تصعيد هذا الخطر إلى الإدارة العليا.",
          "correct": true
        },
        {
          "text": "تطوير خطة إدارة مشروع مفصلة للغاية.",
          "correct": false
        },
        {
          "text": "دعوة المدير الكبير إلى اجتماعات المشروع اليومية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قدّمت مؤسسة تعليمية شكوى بعد طلبها وحدة برمجية من شركة تستخدم ممارسات أجايل. تدّعي الشكوى أن الفوترة مقابل تسليم جزئي تنتهك بيان أجايل إذا لم يُشرك العميل في اجتماعات التقدم.\n\nتستند مطالبة العميل إلى أي من القيم الأربع في بيان أجايل؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمليات التي تحافظ على وتيرة ثابتة إلى أجل غير مسمى",
          "correct": false
        },
        {
          "text": "تسليم البرمجيات بشكل متكرر وفي فترات قصيرة",
          "correct": false
        },
        {
          "text": "التعاون مع العميل أكثر من التفاوض على العقد",
          "correct": true
        },
        {
          "text": "البرمجيات العاملة كمقياس أساسي للتقدم",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أجرى مدير المشروع محادثة مع الراعي وناقش مخاوف بشأن عدم الامتثال. يفهم مدير المشروع أن ذلك قد يؤدي إلى حالة تدقيق محتملة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "عدم القيام بأي شيء والاستمرار في العمل كما كان من قبل، بافتراض حدوث تدقيق.",
          "correct": false
        },
        {
          "text": "فصل القسم غير المتوافق، لأنه يمثل مشكلة.",
          "correct": false
        },
        {
          "text": "الإفصاح عن مصدر المشكلة للمُدققين وترك القرار لهم.",
          "correct": true
        },
        {
          "text": "الحصول على التزام وموافقة القيادة على عدم الامتثال.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل فريق مشروع على تحديد التبعيات بين الأنشطة لمشروع جارٍ. ما الإجراء الأول الذي يجب أن يتخذه الفريق لإدارة التبعيات بنجاح؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة وتتبع التبعيات.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بالتبعيات.",
          "correct": false
        },
        {
          "text": "تقييم وتوثيق التبعيات.",
          "correct": true
        },
        {
          "text": "تعيين مخططين للمشروع لكل المهام.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ أحد البائعين مدير المشروع أن أحد العناصر المسؤولة عنه ضمن المشروع سيتم تسليمه بعد 6 أشهر من التاريخ المتفق عليه في الجدول الزمني. أوضح البائع أنه يركز على عناصر أخرى ذات أولوية أعلى لوجود تبعيات محددة، بينما لا توجد تبعيات مذكورة لهذا العنصر.\n\nما الذي يجب أن يفعله مدير المشروع لتجنب تأخيرات الجدول الزمني في المستقبل؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة التبعيات والاستجابة للتحديات.",
          "correct": false
        },
        {
          "text": "ضمان أن جميع التبعيات الجديدة تكون من نوع 'من الانتهاء إلى البدء'.",
          "correct": false
        },
        {
          "text": "تحديد أي تبعيات إذا كانت موجودة.",
          "correct": true
        },
        {
          "text": "عقد اجتماع لإبلاغ العميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع امتثال جديد يختلف عن المشاريع المعتادة لأنه يتضمن شركاء متعددين الجنسيات وعدة هيئات حكومية. سينتج عن المشروع اعتماد معايير وإجراءات جديدة.\n\nما الذي يجب على مدير المشروع ضمانه منذ البداية؟",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان تحديد وتلبية المتطلبات التجارية.",
          "correct": false
        },
        {
          "text": "ضمان توفر تصميم الحل منذ بداية المشروع.",
          "correct": false
        },
        {
          "text": "ضمان تنفيذ وتسليم المشروع بفعالية.",
          "correct": false
        },
        {
          "text": "ضمان تفسير إرشادات الامتثال والتحقق منها.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "سيتم تسليم آلات المشروع من المصنع خلال شهرين. يقوم فريق المشروع حاليًا بعقد اجتماع متابعة لمراجعة الالتزامات والتبعيات المتعلقة بهذه الآلات.\n\nما الإجراءات التي يجب أن يتخذها فريق المشروع لضمان التسليم السليم من المصنع؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "ضمان تتبع جميع التبعيات ومراقبتها والتقرير عنها بانتظام.",
          "correct": true
        },
        {
          "text": "إرسال بريد إلكتروني إلى المصنع قبل أسبوع من موعد التسليم.",
          "correct": false
        },
        {
          "text": "تحديد متى تكون التبعية مطلوبة ومدة استمرار الحاجة إليها.",
          "correct": true
        },
        {
          "text": "جدولة اجتماع مع المصنع لمناقشة كيفية تصنيع الآلات.",
          "correct": false
        },
        {
          "text": "التحدث إلى موظفي المصنع لمعرفة ما إذا كانوا مؤهلين لبناء الآلات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "واجه فريق المشروع مؤخرًا تأخيرات بسبب عدم الامتثال، مما جعل جدول المشروع أقل مرونة وزاد من مخاطر التكلفة والجودة. الفريق الآن يناقش سبل تجنب ذلك في المستقبل.\n\nما هو التأثير الأكثر بُعدًا على المؤسسة إذا لم يتم حل مشكلة عدم الامتثال؟",
      "explanation": "",
      "choices": [
        {
          "text": "بقاء واستمرارية الأعمال.",
          "correct": true
        },
        {
          "text": "عدم رضا العملاء أو المستخدمين النهائيين.",
          "correct": false
        },
        {
          "text": "بطء في استجابة النظام.",
          "correct": false
        },
        {
          "text": "الغرامات والعقوبات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "قرر فريق المشروع توثيق جوانب جديدة من أحد الأنظمة التنظيمية كعناصر إضافية في هيكل تقسيم العمل (WBS).\n\nما الآثار السلبية المحتملة لهذا النهج؟ (اختر اثنين)",
      "explanation": "",
      "choices": [
        {
          "text": "يتحسن التتبع، ولكن تبقى المتطلبات مجزأة.",
          "correct": false
        },
        {
          "text": "يصبح تتبع المتطلبات أكثر صعوبة على مستوى المشروع.",
          "correct": true
        },
        {
          "text": "قد لا يتم استكمال بعض هذه المتطلبات كجزء من المشروع نفسه.",
          "correct": true
        },
        {
          "text": "المتطلبات التنظيمية ليست دائمًا مرتبطة بنطاق المشروع.",
          "correct": false
        },
        {
          "text": "تجزئة العناصر الجديدة يتطلب وقتًا وجهدًا لتحديث هيكل تقسيم العمل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعتبر مدير المشروع الامتثال جزءًا من أصول العمليات التنظيمية. ومع ذلك، قرر فريق المشروع تضمين الامتثال كمُدخل في العمليات ذات الصلة بدلاً من توثيق هذه القواعد كمتطلبات.\n\nما هي مسؤولية مدير المشروع فيما يخص الامتثال؟",
      "explanation": "",
      "choices": [
        {
          "text": "يعمل كمنسق للموارد والأنشطة",
          "correct": true
        },
        {
          "text": "يجري عمليات تدقيق لمتطلبات الامتثال",
          "correct": false
        },
        {
          "text": "يجري تحليلات مخاطر لمخاطر الامتثال",
          "correct": false
        },
        {
          "text": "يُغيّر أصول عمليات المنظمة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يساعد مدير مشروع منظمة في الانتقال من الأساليب التقليدية إلى الأساليب الأجايل. تعمل فرق البنية التحتية ومستودعات البيانات والهندسة المعمارية المؤسسية بشكل مختلف تمامًا عن فرق تطوير التطبيقات.\n\nكيف يجب على مدير المشروع تنفيذ الأجايل في هذه المنظمة؟",
      "explanation": "",
      "choices": [
        {
          "text": "يطلب من كل فريق في المنظمة تنفيذ نفس منهجية الأجايل حتى يمكن للحل الموحد أن يوفر الاتساق بين الفرق.",
          "correct": false
        },
        {
          "text": "يقوم بتكييف التنفيذ عن عمد لجعل المنهجية أكثر ملاءمة للبيئة وطبيعة العمل الحالية.",
          "correct": true
        },
        {
          "text": "يفرض أسلوب الانتقال من الأعلى للأسفل من خلال طلب دعم الرئيس التنفيذي لتطبيق الأجايل في جميع الفرق.",
          "correct": false
        },
        {
          "text": "يطلب من فريق واحد تنفيذ سكرم كمشروع تجريبي حتى تتمكن بقية الفرق من التعلم وتطبيقه.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجري مجموعة من أصحاب المصلحة في مؤسسة مالية مراجعة لإغلاق المشروع. أعرب بعض أصحاب المصلحة عن قلقهم من أن مخرجات المشروع لا تستوفي معايير الإغلاق المُحددة.\n\nما هو أول إجراء يجب على مدير المشروع اتخاذه لمعالجة هذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "طمأنة أصحاب المصلحة بأن مخرجات المشروع تفي بجميع معايير الإغلاق المحددة.",
          "correct": false
        },
        {
          "text": "اقتراح تعديل معايير الإغلاق بحذف المعايير التي لم يتم تحقيقها.",
          "correct": false
        },
        {
          "text": "اتخاذ تدابير تصحيحية من خلال تعديل المعايير وتمديد الجدول الزمني.",
          "correct": false
        },
        {
          "text": "إجراء تحليل شامل لمعرفة سبب عدم استيفاء المعايير.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف تسليم تدريجي للمشروع، أبلغ أحد أعضاء الفريق قائد المشروع أنه بسبب تغير التكنولوجيا ونقص المعرفة بالتكنولوجيا الجديدة، سيتم تأخير التسليم واقترح الاستعانة بخدمات خارجية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "إبلاغ المستخدم النهائي بتأخير التسليم المحدد بسبب التكنولوجيا الجديدة",
          "correct": false
        },
        {
          "text": "البحث عن خدمة خارجية تمتلك الخبرة اللازمة",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بالتأخير وطلب دعمه وموافقته",
          "correct": false
        },
        {
          "text": "مناقشة تأثير التكنولوجيا الجديدة مع الفريق واتخاذ القرار بشكل مشترك",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدرب أجايل بتقديم المشورة لشركة برمجيات كبيرة كانت تستخدم منهجية الشلال وتخطط الآن لبدء استخدام الأجايل أو منهجية هجينة.\n\nما الذي يمكن أن يقترحه مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستمرار في استخدام الشلال، لأن المنهجية الهجينة لا تتناسب مع الهيكل التنظيمي.",
          "correct": false
        },
        {
          "text": "البدء بالأجايل ثم الانتقال إلى الهجينة، مع العلم أن تنفيذ الأجايل يستغرق وقتًا.",
          "correct": true
        },
        {
          "text": "البدء باستخدام المنهجيات الهجينة لأن المعرفة بمنهجية الشلال قابلة للنقل.",
          "correct": false
        },
        {
          "text": "البدء باستخدام الهجينة لأنها الأنسب لمنظمات البرمجيات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب مالك المنتج دمج وظيفة مدمجة في بوابة المرضى في السبرينت القادم. قرر الفريق إجراء جلسة تقدير التقارب (Affinity Estimation) لتحديد مقدار القيمة التي سيتم تسليمها.\n\nما هو الدور المسؤول عن تسهيل الجلسة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مالك المنتج",
          "correct": false
        },
        {
          "text": "سكرم ماستر",
          "correct": true
        },
        {
          "text": "المطور",
          "correct": false
        },
        {
          "text": "صاحب المصلحة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقود مدير مشروع فريقًا في مشروع تطوير جديد. يتكون الفريق من مجموعة متنوعة من الأشخاص ذوي الشخصيات وأنماط العمل المختلفة. يلتزم مدير المشروع ببناء فريق منسجم ومنتج، لذلك قرر تقديم نموذج السلوك DISC لمساعدة الأعضاء على فهم بعضهم البعض بشكل أفضل.\n\nاستنادًا إلى نموذج DISC، ما هي الخصائص التي تصف أسلوب التأثير (Influence)؟",
      "explanation": "",
      "choices": [
        {
          "text": "مباشر، موجه نحو النتائج، وحازم",
          "correct": false
        },
        {
          "text": "اجتماعي، متحمّس، متفائل",
          "correct": true
        },
        {
          "text": "متسامح، صبور، متواضع، لبق",
          "correct": false
        },
        {
          "text": "تحليلي، متحفظ، ودقيق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يجب على مديري المشاريع القدرة على تحديد العيوب التي تسبب أخطاء في اتخاذ القرار. أي من الخيارات التالية يساعد مدير المشروع على اتخاذ قرارات مثلى؟",
      "explanation": "",
      "choices": [
        {
          "text": "استخدام الانحيازات",
          "correct": false
        },
        {
          "text": "استخدام افتراضات خاطئة",
          "correct": false
        },
        {
          "text": "التحقق مع الآخرين",
          "correct": true
        },
        {
          "text": "تطبيق أخطاء منطقية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في شركة سيارات ناجحة مع معايير جودة عالية. يحتاج مدير المشروع إلى التأكد من أنه ينشئ هيكل تقسيم عمل (WBS) عالي الجودة.\n\nأي من الخصائص التالية لا تُعد من خصائص WBS عالية الجودة؟",
      "explanation": "",
      "choices": [
        {
          "text": "موجه نحو المخرجات",
          "correct": false
        },
        {
          "text": "هرمي",
          "correct": false
        },
        {
          "text": "قاعدة 100٪",
          "correct": false
        },
        {
          "text": "يركز على العميل",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من مستندات المشروع التالية لا تستخدم WBS كمدخل؟",
      "explanation": "",
      "choices": [
        {
          "text": "جدول المشروع",
          "correct": false
        },
        {
          "text": "نطاق المشروع",
          "correct": true
        },
        {
          "text": "خطة إدارة المخاطر",
          "correct": false
        },
        {
          "text": "خطة الجودة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على إدارة المتطلبات في شركة أدوية. ما هو التحسين الذي يجب أن تتوقعه المنظمة كنتيجة لهذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "انخفاض الجودة",
          "correct": false
        },
        {
          "text": "زيادة التكاليف",
          "correct": false
        },
        {
          "text": "تقليل المخاطر",
          "correct": true
        },
        {
          "text": "زيادة الجدول الزمني",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع في شركة عالمية ويدرك أهمية خطة إدارة المتطلبات. متى يجب تنفيذ خطة إدارة المتطلبات؟",
      "explanation": "",
      "choices": [
        {
          "text": "في بداية المشروع",
          "correct": false
        },
        {
          "text": "قبل التنفيذ",
          "correct": false
        },
        {
          "text": "بعد توقيع عقد العميل",
          "correct": false
        },
        {
          "text": "خلال مرحلة التخطيط",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين مدير المشروع (B) لتولي مشروع من مدير المشروع (A). أبلغ المدير (A) بأن المشروع يسير وفق الجدول الزمني فقط لأنه كان يضغط باستمرار على الفريق للأداء.\n\nما هو أول إجراء يجب أن يتخذه المدير (B) بصفته المدير الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقق من حالة المخاطر.",
          "correct": false
        },
        {
          "text": "التحقق من أداء التكاليف.",
          "correct": false
        },
        {
          "text": "تحديد استراتيجية للإدارة.",
          "correct": true
        },
        {
          "text": "إبلاغ الفريق بالأهداف الجديدة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هو العنصر الأساسي للحفاظ على دعم والتزام جميع أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الصدق",
          "correct": false
        },
        {
          "text": "الاتصال الفعال",
          "correct": true
        },
        {
          "text": "الشفافية",
          "correct": false
        },
        {
          "text": "الاعتمادية",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي إحدى التكتيكات التي يمكن لمدير المشروع استخدامها لمراقبة تأثير المخاطر على المشروع بشكل فعال أثناء مراقبة المخاطر؟",
      "explanation": "",
      "choices": [
        {
          "text": "تجنب المخاطر",
          "correct": false
        },
        {
          "text": "تصعيد المخاطر",
          "correct": false
        },
        {
          "text": "قبول المخاطر",
          "correct": false
        },
        {
          "text": "الإبلاغ عن المخاطر",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "تم تعيين مدير مشروع جديد لمشروع قيد التنفيذ بالفعل لأن المدير السابق غادر المنظمة بشكل غير متوقع. للأسف، لم يلتزم المدير السابق بإجراءات نقل المعرفة الخاصة بالمنظمة قبل مغادرته.\n\nما الذي يمكن أن يفعله المدير الجديد لسد فجوات المعرفة؟ (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة وثائق المشروع، بما في ذلك خطة المشروع، ووثيقة المتطلبات، وسجل المخاطر.",
          "correct": true
        },
        {
          "text": "المضي قدمًا في المشروع كما هو مخطط له والمشاركة في أنشطة المرافقة في العمل (job shadowing).",
          "correct": false
        },
        {
          "text": "الاجتماع مع أصحاب المصلحة الرئيسيين لفهم توقعاتهم وأولوياتهم.",
          "correct": true
        },
        {
          "text": "مقابلة أعضاء الفريق لمعرفة مجالات خبرتهم وتجربتهم في المشروع.",
          "correct": true
        },
        {
          "text": "الاتصال بمدير المشروع السابق وطلب تحويل شامل للمعرفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد فريق المشروع أن هناك نقصًا في توقعات نقل المعرفة داخل المشروع.\n\nأي من العقبات التالية لا تنطبق في هذا الموقف؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة منهجية للمشروع المكتمل",
          "correct": true
        },
        {
          "text": "الإخفاقات والأخطاء التي تم التعامل معها شخصيًا",
          "correct": false
        },
        {
          "text": "نقص الدافع الفردي لتوثيق الدروس المستفادة",
          "correct": false
        },
        {
          "text": "ضعف مشاركة القيادة في تعزيز نقل المعرفة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في بيئة أجايل، يجب على قائد المشروع دائمًا تخصيص وقت للنقاش المفتوح والحُر بين أعضاء الفريق حول كيفية تحسين أدائهم.\n\nلماذا تُعد هذه الممارسة مهمة للفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "يجب على الفرق اتخاذ إجراءات لزيادة الإنتاجية باستمرار",
          "correct": false
        },
        {
          "text": "يجب على الفرق تجربة طرق جديدة في العمل باستمرار",
          "correct": false
        },
        {
          "text": "يجب على الفرق السعي باستمرار لتحسين عملياتهم",
          "correct": true
        },
        {
          "text": "يجب على الفرق دفع أعضائها باستمرار للعمل بجهد أكبر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير مشروع مشروعًا يتضمن التعامل مع بعض البائعين. يسأل الراعي كيف سيتم الحصول على السلع والخدمات الخارجية.\n\nأين يجب توثيق هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "في خطة إدارة المشتريات",
          "correct": true
        },
        {
          "text": "في اتفاقية الخدمة الرئيسية (MSA)",
          "correct": false
        },
        {
          "text": "في عقد قائمة المواد",
          "correct": false
        },
        {
          "text": "في اتفاقية مستوى الخدمة (SLA)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "المشروع في مرحلة التنفيذ. يجب نقل المعدات والأجهزة من مستودع البائع إلى موقع المشروع عبر خمس مدن.\n\nما هي الأطراف المعنية التي يجب على مدير المشروع إشراكها في تخطيط وتنفيذ النقل الآمن؟ (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "مجالس المدن",
          "correct": true
        },
        {
          "text": "راعي المشروع",
          "correct": false
        },
        {
          "text": "فنيي تركيب المعدات",
          "correct": true
        },
        {
          "text": "موردو المعدات",
          "correct": true
        },
        {
          "text": "فني المستودع",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع معقد له تأثير بيئي كبير. تمت الموافقة على المشروع من قبل مكتب إدارة المشاريع (PMO) في المنظمة، وهو الآن في مرحلة التخطيط. قدم راعي المشروع لمدير المشروع قائمة بجميع أصحاب المصلحة في المشروع.\n\nما هي النشاط التالي في خطة إدارة أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحليل",
          "correct": true
        },
        {
          "text": "المراقبة",
          "correct": false
        },
        {
          "text": "المشاركة",
          "correct": false
        },
        {
          "text": "التحديد",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يدير مدير المشروع مشروعًا باستخدام النهج الأجايل. مدير مكتب إدارة المشاريع (PMO) غير مطلع على تسليم المشاريع بالنهج الأجايل.\n\nأي من العبارات التالية تصف نهج الأجايل؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستجابة للتغيير بدلاً من الالتزام بالخطة",
          "correct": true
        },
        {
          "text": "تعاون العميل بدلاً من الالتزام بالخطة",
          "correct": false
        },
        {
          "text": "الاستجابة للتغيير بدلاً من العمليات والأدوات",
          "correct": false
        },
        {
          "text": "تعاون العميل بدلاً من الاختبارات الشاملة",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أكمل مدير المشروع حديثًا مرحلة بدء مشروع ويحتاج الآن إلى تحديد وتحليل أصحاب المصلحة. ركز ميثاق المشروع على الموافقة على النطاق والميزانية فقط.\n\nماذا يجب أن يفعل مدير المشروع لتحديد أصحاب المصلحة؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراجعة الدروس المستفادة من المشاريع السابقة.",
          "correct": true
        },
        {
          "text": "مراجعة ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "إجراء جلسة عصف ذهني مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "مراجعة الهيكل التنظيمي.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "انضم مدير مشروع مؤخرًا إلى منظمة جديدة. راعي المشروع هو خبير في المجال ويريد إدارة النطاق من خلال التسليم على مراحل صغيرة وتعديل النطاق بناءً على التعليقات.\n\nأي من النهوج التالية يُوصى بها؟",
      "explanation": "",
      "choices": [
        {
          "text": "سكرم (Scrum)",
          "correct": true
        },
        {
          "text": "شلال (Waterfall)",
          "correct": false
        },
        {
          "text": "كانبان (Kanban)",
          "correct": false
        },
        {
          "text": "تنبئي (Predictive)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يقود مدير مشروع فريقًا مكونًا من 34 عضوًا من ست دول. نطاق المشروع هو تحديث عملية مستخدمة منذ حوالي 40 عامًا في المنظمة.\n\nما هي المعايير التي يجب أن يأخذها مدير المشروع في الاعتبار أثناء تطوير خطة الاتصال؟ (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "التنوع الشخصي",
          "correct": true
        },
        {
          "text": "التنوع العمري",
          "correct": true
        },
        {
          "text": "التنوع الثقافي",
          "correct": true
        },
        {
          "text": "تنوع المهارات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "قررت مجموعة التوجيه في المشروع تغيير المورد الذي سيقوم بتسليم أحد مكونات المشروع.\n\nما الأنشطة التي يجب تضمينها في عملية التسليم؟ (اختر 2).",
      "explanation": "",
      "choices": [
        {
          "text": "يجب على المورد القديم توفير تدريب للمورد الجديد والمساعدة في الانتقال.",
          "correct": true
        },
        {
          "text": "يجب على كلا الموردين تقديم حوافز إضافية للموظفين أثناء الانتقال.",
          "correct": false
        },
        {
          "text": "يجب على المورد الجديد استلام الأنشطة حسب خطة المشروع الحالية.",
          "correct": true
        },
        {
          "text": "يجب على المورد الجديد متابعة المورد القديم لضمان نقل المعرفة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يعمل مدير مشروع على مشروع تحوّل تجاري كبير. تم توقيع جميع مخرجات البناء، ويقوم مدير المشروع الآن بإدارة الانتقال إلى الوضع التشغيلي الاعتيادي (BAU).\n\nما الاعتبارات المهمة لجاهزية العمليات التي يجب على مدير المشروع أخذها بعين الاعتبار؟ (اختر 2).",
      "explanation": "",
      "choices": [
        {
          "text": "يتم توفير ورقة غش للوظائف الأساسية ويُشجع التدريب الذاتي.",
          "correct": false
        },
        {
          "text": "يجب توفير تدريب رسمي وإتاحة الوثائق لجميع المستخدمين.",
          "correct": true
        },
        {
          "text": "يتم تسليم المسؤوليات والمحاسبة رسميًا إلى فرق العمليات.",
          "correct": true
        },
        {
          "text": "تظل مسؤولية الدعم التشغيلي على عاتق فريق المشروع أثناء مرحلة BAU.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد التشاور مع أصحاب المصلحة التنفيذيين، تقرر أن يقوم مدير المشروع باستبدال أحد الموردين أثناء مرحلة التنفيذ. يتمتع المورد الجديد بمعرفة أوسع بالمجال ولم يتم تحديده في السابق، لكنه مرشح مناسب الآن.\n\nأي من الوثائق التالية تحتوي على أفضل المعلومات للمورد الجديد؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب المعلومات (RFI)",
          "correct": false
        },
        {
          "text": "طلب عرض السعر (RFQ)",
          "correct": false
        },
        {
          "text": "طلب تقديم عرض (RFP)",
          "correct": true
        },
        {
          "text": "طلب التعاقد (RFC)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنت مدير مشروع في منظمة تطبق منهجية التسليم الأجايل. لديك خبرة كـ Scrum Master وستؤدي هذا الدور إلى جانب مسؤولياتك كمدير مشروع. أحد أعضاء الفريق يريد معرفة ما هو التركيز الرئيسي للقائد الخادم (Servant Leader).\n\nما إجابتك المناسبة؟",
      "explanation": "",
      "choices": [
        {
          "text": "رضا العميل وعرض القيمة المقدمة.",
          "correct": false
        },
        {
          "text": "نمو ورفاهية الأفراد والمجتمعات التي ينتمون إليها.",
          "correct": true
        },
        {
          "text": "إدارة توقعات أصحاب المصلحة والتواصل معهم.",
          "correct": false
        },
        {
          "text": "الإنتاجية والكفاءة لتحقيق الالتزامات.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي أنماط القيادة الأربعة التي تُستخدم في بناء الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "رؤيوي، تحالفي، توجيهي، وتشاركي",
          "correct": true
        },
        {
          "text": "رؤيوي، تحالفي، توجيهي، وسرعة التنفيذ",
          "correct": false
        },
        {
          "text": "رؤيوي، تحالفي، توجيهي، وأمري",
          "correct": false
        },
        {
          "text": "رؤيوي، تحالفي، توجيهي، ومستوى عالي",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "خلال الاجتماع الأسبوعي، يقوم أعضاء الفريق بمراجعة المهام التي تم تعيينها من قبل مدير المشروع. اشتكى بعض أعضاء الفريق من عدم توفر معلومات كافية لتقدير الوقت اللازم لإكمال العمل.\n\nما هو السبب الأكثر احتمالاً لهذه المشكلة؟",
      "explanation": "",
      "choices": [
        {
          "text": "لم يتم تحديد أهداف المشروع بوضوح",
          "correct": true
        },
        {
          "text": "بيئة الأعمال ديناميكية جدًا",
          "correct": false
        },
        {
          "text": "تنافس داخلي بين أعضاء الفريق",
          "correct": false
        },
        {
          "text": "لم يتم تحديد الأدوار والمسؤوليات بوضوح",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنت تدير مشروعًا معقدًا يحتوي على عدد كبير من أصحاب المصلحة. قررت استخدام نموذج السطوع (Salience Model) لتحديد وتصنيف أصحاب المصلحة الأكثر أهمية بناءً على القوة، والإلحاح، والشرعية.\n\nما هو الجانب الأكثر أهمية في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "المهيمن",
          "correct": false
        },
        {
          "text": "التابع",
          "correct": false
        },
        {
          "text": "المطالب",
          "correct": false
        },
        {
          "text": "الحاسم",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في اجتماع فريق المشروع، يشتكي الأعضاء من انخفاض في الدافعية وأنهم لا يشعرون بأن جهودهم محل تقدير. قررت تقديم الفريق كمجموعة عالية الأداء أمام المنظمة.\n\nما هي السمات التالية في بيئة العمل وأسلوب الإدارة التي تؤدي إلى فريق عالي الأداء؟ اختر 3.",
      "explanation": "",
      "choices": [
        {
          "text": "الدوافع الشخصية.",
          "correct": false
        },
        {
          "text": "عائد تحدي العمل.",
          "correct": false
        },
        {
          "text": "مكافآت مالية تصاعدية.",
          "correct": false
        },
        {
          "text": "بيئة محفزة.",
          "correct": false
        },
        {
          "text": "تقنيات حل المشكلات.",
          "correct": false
        },
        {
          "text": "نظرية القيود.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "قرر مدير المشروع إشراك طرف ثالث لإدارة المخاطر في المشروع نظرًا لامتلاكهم خبرة أكبر من فريق المشروع الحالي.\n\nما نوع استراتيجية الاستجابة التي استخدمها مدير المشروع لمعالجة المخاطر العامة للمشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التجنب",
          "correct": false
        },
        {
          "text": "الاستغلال",
          "correct": false
        },
        {
          "text": "التحويل",
          "correct": true
        },
        {
          "text": "التقليل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد أن قامت المؤسسة بتدريب وتطبيق برنامج جديد لإدارة المشاريع إلزامي لجميع موظفي المشروع، لاحظ مدير المشروع أن عدة أعضاء في الفريق يُظهرون التزامًا منخفضًا تجاه البرنامج الجديد.\n\nما هو سبب ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "الخوف من المجهول",
          "correct": true
        },
        {
          "text": "نقص المهارات المطلوبة",
          "correct": false
        },
        {
          "text": "نقص في وضوح رؤية المشروع",
          "correct": false
        },
        {
          "text": "وجود تواصل مفرط",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير مشروع على مشروع طويل الأمد في بيئة معقدة. يركز مدير المشروع على الحفاظ على عمل جماعي صحي وتعاون فعال.\n\nما هي استراتيجية حل النزاع التي يجب استخدامها داخل الفريق؟",
      "explanation": "",
      "choices": [
        {
          "text": "حل المشكلات",
          "correct": true
        },
        {
          "text": "التسوية",
          "correct": false
        },
        {
          "text": "الاستيعاب",
          "correct": false
        },
        {
          "text": "التشاور",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تعيين قائد فريق في مشروع جارٍ. أعضاء الفريق يعملون معًا منذ فترة.\n\nكيف يجب على قائد الفريق أن يبدأ في بناء العلاقات؟",
      "explanation": "",
      "choices": [
        {
          "text": "توزيع المهام ومراقبة جودة النتائج.",
          "correct": false
        },
        {
          "text": "التحدث عن التفضيلات الشخصية والتأكد من أن الفريق يفهم أسلوبك.",
          "correct": false
        },
        {
          "text": "طلب بعض المعلومات عن الأعضاء من زملائهم للتعرف عليهم.",
          "correct": false
        },
        {
          "text": "سؤال أعضاء الفريق مباشرةً عن الأمور الشخصية والعملية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يريد مدير المشروع وضع استراتيجية تحفيز ومكافآت لفريق المشروع.\n\nما هو الأسلوب الأنسب لذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "سؤال قسم الموارد البشرية عن الحوافز التي يجب تقديمها.",
          "correct": false
        },
        {
          "text": "التحقق من توفر الميزانية لتحديد قيم المكافآت.",
          "correct": false
        },
        {
          "text": "توفير فرصة لتقديم النتائج علنًا.",
          "correct": false
        },
        {
          "text": "تحديد احتياجات كل عضو من الفريق لتحديد الحوافز المناسبة.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "اختر ثلاث طرق لتحسين وممارسة مهارات القيادة. (اختر 3)",
      "explanation": "",
      "choices": [
        {
          "text": "إشراك الفريق في عملية المشروع.",
          "correct": false
        },
        {
          "text": "المشاركة النشطة في مهام المشروع.",
          "correct": false
        },
        {
          "text": "معاملة جميع أعضاء الفريق بنفس الطريقة.",
          "correct": false
        },
        {
          "text": "طلب التعليقات وتحليل النتائج.",
          "correct": false
        },
        {
          "text": "استخدام الديمقراطية في جميع قرارات الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في منتصف المشروع، أُبلغ مدير المشروع بحركة في السوق ستجعل نتائج المشروع عديمة الفائدة للعميل. قد تؤدي هذه المعلومات إلى إلغاء المشروع أو على الأقل تغيير كبير في نطاق العمل والنتائج المرجوة.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إعداد جميع تقارير الحالة والعروض التوضيحية لإبقاء العميل مركزًا على تنفيذ المشروع الذي كان ناجحًا.",
          "correct": false
        },
        {
          "text": "إجراء مناقشة شفافة مع الراعي، مع عرض تقديم الدعم في تقييم الاستراتيجية إذا لزم الأمر.",
          "correct": true
        },
        {
          "text": "الاستمرار في تنفيذ المشروع، لأن الاستراتيجية التجارية ليست من مسؤوليات مدير المشروع.",
          "correct": false
        },
        {
          "text": "إيقاف المشروع فورًا، لأن مدير المشروع يعلم أنه سيكون عديم الفائدة للعميل.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تنفيذ مشروع داخلي وحقق نطاقه في الوقت المحدد، وضمن الميزانية، وبالجودة المتوقعة. كان العميل راضيًا عن النتيجة، مما مكنه من إطلاق منتج جديد في السوق. ومع ذلك، لم يجذب المنتج الاهتمام المتوقع ولم يغطي الاستثمار. يعلم فريق المشروع بهذه النتائج، وهذا يؤثر على معنوياتهم في تنفيذ المشروع التالي.\n\nكيف يجب أن يتعامل مدير المشروع مع هذا الموقف؟ اختر إجابتين.",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة مع الفريق لتوضيح أن نجاح المنتج ليس نتيجة مباشرة للمشروع ولا يعكس أدائهم.",
          "correct": false
        },
        {
          "text": "عقد اجتماع مع إدارة الأعمال للتأكد من فهمهم أن المشروع حقق أهدافه.",
          "correct": false
        },
        {
          "text": "لا يلزم اتخاذ أي إجراء، لأن مدير المشروع مسؤول فقط عن تسليمات المشروع.",
          "correct": false
        },
        {
          "text": "مناقشة مع الراعي التجاري للتحقق من الاستراتيجية للمشروع الجديد بناءً على هذه النتيجة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من الخطوات التالية تولي اهتمامًا خاصًا لعمليات اتخاذ القرار الجماعي؟",
      "explanation": "",
      "choices": [
        {
          "text": "تعريف المشكلة",
          "correct": false
        },
        {
          "text": "توليد حلول للمشكلة",
          "correct": false
        },
        {
          "text": "تحويل الأفكار إلى أفعال",
          "correct": true
        },
        {
          "text": "تخطيط تنفيذ الحل",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "ما هو الفرق بين المخاطر والمشكلات؟ (اختر اثنين).",
      "explanation": "",
      "choices": [
        {
          "text": "المخاطر غير مؤكدة والمشكلات مؤكدة.",
          "correct": true
        },
        {
          "text": "المخاطر مؤكدة والمشكلات غير مؤكدة.",
          "correct": false
        },
        {
          "text": "وقعت المخاطر وقد لا تحدث المشكلات.",
          "correct": false
        },
        {
          "text": "قد لا تحدث المخاطر ولكن المشكلة قد حدثت.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يسعى مدير المشروع إلى تخفيف عبء العمل على قسم تكنولوجيا المعلومات مع تمكين الأعمال من بدء عمليات تنفيذ جديدة ووضع الأساس للحلول المستقبلية.\n\nكيف يجب أن يُسهل مدير المشروع هذا الانتقال؟",
      "explanation": "",
      "choices": [
        {
          "text": "فرض سياسات حوكمة صارمة مركزية داخل قسم تكنولوجيا المعلومات لضمان التوحيد والسيطرة.",
          "correct": false
        },
        {
          "text": "فرض مقترحات مشاريع تكنولوجيا المعلومات الشاملة للتقييم والموافقة قبل بدء أي مشروع.",
          "correct": false
        },
        {
          "text": "تمكين وحدات الأعمال من استخدام منصة مبسطة لإدارة مشاريع تكنولوجيا المعلومات لبدء المشاريع ومتابعتها بشكل مستقل.",
          "correct": true
        },
        {
          "text": "التعاون مع فرق تكنولوجيا المعلومات متعددة الوظائف لتخطيط وتنفيذ المشاريع بشكل مشترك.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي من الخيارات التالية تختلف عن الخيارات الأخرى في إدارة أصحاب المصلحة الخارجيين في المشاريع الكبرى؟",
      "explanation": "",
      "choices": [
        {
          "text": "الإقناع",
          "correct": false
        },
        {
          "text": "النيابة",
          "correct": false
        },
        {
          "text": "الأخذ والعطاء",
          "correct": false
        },
        {
          "text": "الأوامر الصارمة",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أي مما يلي لا يُعتبر من القوى المستندة إلى الموارد في المشاريع الكبرى؟",
      "explanation": "",
      "choices": [
        {
          "text": "التوظيف على أساس تعاقدي",
          "correct": false
        },
        {
          "text": "توظيف المواهب الخبيرة",
          "correct": false
        },
        {
          "text": "التوظيف على أساس الإعارة",
          "correct": false
        },
        {
          "text": "التوظيف عبر التحكم المباشر",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "يحتاج مدير المشروع إلى التأكد من أن منتجات المؤسسة تفي بمعايير وأنظمة حكومية معينة. يقوم فريق مدير المشروع بتطوير وثيقة متطلبات العمل (BRD) للمساعدة في هذا الشأن.\n\nأي من العبارات التالية صحيحة بخصوص متطلبات الامتثال؟ (اختر 2).",
      "explanation": "",
      "choices": [
        {
          "text": "متطلبات الامتثال هي متطلبات وظيفية ويجب تضمينها في وثيقة BRD.",
          "correct": false
        },
        {
          "text": "متطلبات الامتثال هي متطلبات غير وظيفية ويجب توثيقها في وثيقة BRD.",
          "correct": true
        },
        {
          "text": "يجب أن تكون متطلبات الامتثال جزءًا من نطاق المشروع ويجب أن تُدار من قبل فريق المشروع.",
          "correct": true
        },
        {
          "text": "يمكن اعتبار متطلبات الامتثال أصولًا تنظيمية ولا تحتاج إلى تضمينها في وثيقة BRD.",
          "correct": false
        },
        {
          "text": "لا يمكن اعتبار متطلبات الامتثال أصولًا تنظيمية ويجب تضمينها في وثيقة BRD.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في مبادرة تحول تجاري تؤثر على معظم موظفي الشركة البالغ عددهم 10,000 موظف. نطاق المشروع هو تحسين التعاون بين الفرق من خلال تنفيذ منصة سحابية جديدة تحل محل أداة الاتصال المستخدمة منذ 20 عامًا.\n\nما هو عامل النجاح الأكثر أهمية؟",
      "explanation": "",
      "choices": [
        {
          "text": "جودة جيدة، يجب ألا تحتوي النسخة النهائية على أي أعطال حرجة.",
          "correct": false
        },
        {
          "text": "واجهة مستخدم جيدة تم تطويرها من قبل مصممين موهوبين.",
          "correct": false
        },
        {
          "text": "تخطيط وتنفيذ جيد لإدارة التغيير.",
          "correct": true
        },
        {
          "text": "عملية تحكم بالتغيير فعالة وسريعة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "مدير مشروع في مؤسسة يفكر في تنفيذ طريقة تسليم المشروع عبر النهج المرن (Agile). لدى المؤسسة مكتب إدارة مشاريع قوي (PMO) وعملية مراقبة تغييرات محددة جيدًا.\n\nما هو الجانب الرئيسي الذي يجب على مدير المشروع التأكيد عليه كأقوى حجة لتبني النهج المرن؟",
      "explanation": "",
      "choices": [
        {
          "text": "يمكن أن يحسن النهج المرن الجودة من خلال التسليم المتكرر والإصلاح الفعال للأعطال.",
          "correct": false
        },
        {
          "text": "توفر الفرق المرنة مرونة في استيعاب التغييرات المخططة مع تسريع عمليات الموافقة.",
          "correct": false
        },
        {
          "text": "يستخدم مالك المنتج قائمة تُعرف باسم قائمة المهام (backlog) لتحديد أولويات العمل.",
          "correct": false
        },
        {
          "text": "النهج المرن مناسب جدًا للتعامل مع التغييرات غير المتوقعة وتغير توقعات العمل.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "مدير مشروع في منظمة حكومية كبيرة قرر توفير التكاليف عن طريق تغيير شريك التنفيذ المحلي، ويفكر في استخدام موارد خارجية.\n\nما هي المخاطر الرئيسية المرتبطة باستخدام الموارد الخارجية؟ (اختر 3).",
      "explanation": "",
      "choices": [
        {
          "text": "قد تحتاج الموارد الخارجية إلى إشراف أكبر بسبب اختلافات التوقيت والثقافة.",
          "correct": true
        },
        {
          "text": "قد لا تمتلك الموارد الخارجية نفس المعرفة في مجال الأعمال مثل البائع السابق.",
          "correct": true
        },
        {
          "text": "قد تحتاج الموارد الخارجية إلى جهد أكبر في التخطيط وإدارة ميزانيات المشروع.",
          "correct": false
        },
        {
          "text": "قد تحتاج الموارد الخارجية إلى وقت أطول في التهيئة بسبب الفروقات الجيوسياسية.",
          "correct": true
        },
        {
          "text": "قد تحتاج الموارد الخارجية إلى توثيق مفصل بسبب الفروقات الزمنية والثقافية.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-answer",
      "text": "تم تعيين مدير مشروع لمشروع معقد للغاية ويتطلب خبرة فنية عالية. يعمل المدير حاليًا على خطة الموارد، ويعتزم أن يوصي الراعي باستخدام موارد خارجية بدلاً من الداخلية.\n\nما هي المخاطر التي يمكن التخفيف منها باستخدام موردين خارجيين لتسليم بعض مكونات المشروع؟ (اختر 3).",
      "explanation": "",
      "choices": [
        {
          "text": "المالية",
          "correct": false
        },
        {
          "text": "الجدول الزمني",
          "correct": true
        },
        {
          "text": "الفنية",
          "correct": true
        },
        {
          "text": "السياسية",
          "correct": false
        },
        {
          "text": "نطاق العمل",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الأداة التي يجب على مدير المشروع دمجها بشكل أفضل لتحديد ومعالجة مقاومة أصحاب المصلحة الشائعة تجاه التغيير؟",
      "explanation": "",
      "choices": [
        {
          "text": "إدارة التغيير",
          "correct": true
        },
        {
          "text": "إدارة المخاطر",
          "correct": false
        },
        {
          "text": "إدارة أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "إدارة الاتصالات",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "حدد مدير المشروع أصحاب المصلحة لمشروع تطوير برمجيات: فريق المبيعات سيكون المستخدم الأساسي للتطبيق الجديد، قسم تكنولوجيا المعلومات سيكون مسؤولاً عن نشر وصيانة التطبيق، والراعي التنفيذي هو من يوافق على المشروع ويموله. مدير المشروع في مرحلة التخطيط ويجب عليه إشراك أصحاب المصلحة.\n\nما هو أهم شيء يجب على مدير المشروع فعله لبناء فهم مشترك؟",
      "explanation": "",
      "choices": [
        {
          "text": "عقد اجتماع بدء المشروع مع جميع أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "إنشاء سجل أصحاب المصلحة وخطة الاتصال.",
          "correct": false
        },
        {
          "text": "تحديد احتياجات وتوقعات أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "توثيق مخاوف ومخاطر أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يرتب فريق المشروع لاختبار المستخدم ضمن المشروع، لكنه لا يمتلك خادمًا قويًا بما فيه الكفاية. قام الفريق بطلب خادم جديد وتم تأجيل الاختبار.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "إلغاء اختبار المستخدم من خطة المشروع.",
          "correct": false
        },
        {
          "text": "استخدام الخادم الحالي لإجراء الاختبار.",
          "correct": false
        },
        {
          "text": "طلب تسريع توريد الخادم الجديد من المورد.",
          "correct": false
        },
        {
          "text": "الانتظار لوصول الخادم الجديد وإعادة تقييم الجداول الزمنية لاختبار المستخدم.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم الفريق ومالك المنتج بمراجعة قصص المستخدم في اجتماع تخطيط التكرار. أثناء المراجعة، تم تحديد أن بعض القصص ذات القيمة العالية مرتبطة بمزيد من المخاطر.\n\nماذا يجب أن يفعل مدير المشروع في بيئة أجايل؟",
      "explanation": "",
      "choices": [
        {
          "text": "يوصي بأن يتضمن الفريق القصص ذات المخاطر في التكرارات المبكرة بدلاً من المتأخرة.",
          "correct": true
        },
        {
          "text": "يوصي بأن يختار الفريق القصص منخفضة المخاطر لإكمالها بسهولة والحفاظ على الحافز.",
          "correct": false
        },
        {
          "text": "يعمل مع مالك المنتج لتحديد القصص التي يجب تضمينها في التكرار.",
          "correct": false
        },
        {
          "text": "يستخدم تحليل باريتو لتحديد أي القصص يمكن إكمالها بشكل أسرع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يرسل مدير المشروع طلبات لعقد اجتماعات دورية واجتماعات يومية خلال مرحلة إعداد المشروع، لكن أصحاب المصلحة من جهة الأعمال يرفضون حضور هذه الاجتماعات.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التحقق من سبب رفض الاجتماعات.",
          "correct": true
        },
        {
          "text": "إعادة مشاركة خطة الاتصالات.",
          "correct": false
        },
        {
          "text": "وضع قواعد سلوك للفريق في المشروع.",
          "correct": false
        },
        {
          "text": "عقد اجتماع انطلاق المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تخطط إدارة البحث والتطوير لتطوير منتج جديد سيدشن خط أعمال جديد للمؤسسة.\n\nما الذي يجب على مدير المشروع القيام به لزيادة فرص نجاح المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "بدء تطوير خطة إدارة المشروع باستخدام قالب مشروع سابق من مكتب إدارة المشاريع (PMO).",
          "correct": false
        },
        {
          "text": "إجراء تحليل تأثير للمبادرة الجديدة لتحديد كيفية تنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "تنظيم جلسة عمل تركز على النطاق والرؤية والرسالة للمبادرة.",
          "correct": true
        },
        {
          "text": "إجراء دراسة مقارنة لتحديد جدوى المبادرة تجاريًا.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "منذ بداية المشروع، يواصل مالك المنتج السؤال خلال الاجتماعات الرسمية عن الميزانية المنفقة لكل تكرار. يبدو أن مالك المنتج مهتم أكثر بالتكلفة من المنتج نفسه.\n\nما الذي كان يجب على مدير المشروع فعله في وقت سابق لتغيير سلوك مالك المنتج؟",
      "explanation": "",
      "choices": [
        {
          "text": "العمل على أساليب مختلفة في التقدير لإعطاء ثقة حول التكاليف لكل إصدار.",
          "correct": false
        },
        {
          "text": "إعداد خطة لإدارة الاتصالات تتضمن تقارير عن الميزانية المنفقة في كل تكرار مقابل المخطط.",
          "correct": false
        },
        {
          "text": "العمل مع مالك المنتج لتوضيح دوره في مشروع أجايل ونطاق الاجتماعات الرسمية.",
          "correct": true
        },
        {
          "text": "العمل بعقد بسعر ثابت لتحويل اهتمام مالك المنتج من التكلفة إلى القيمة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما الذي يمكن لمدير المشروع فعله لإعلان المشروع رسميًا وتوصيل المعلومات ذات الصلة لأصحاب المصلحة ثم كسب التزامهم؟",
      "explanation": "",
      "choices": [
        {
          "text": "إنشاء ميثاق المشروع.",
          "correct": false
        },
        {
          "text": "عقد اجتماع انطلاق المشروع.",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة الاتصالات.",
          "correct": true
        },
        {
          "text": "إعداد وتوزيع مصفوفة المسؤوليات (RACI).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أثناء إعداد التقرير الثالث لتقدم المشروع، يكتشف مدير المشروع أن المشروع سيواجه تأخيرات بسبب تأخر تسليم المواد. كان التقريرين السابقين يشيران إلى أن المشروع يسير حسب الخطة.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "مناقشة الأمر مع فريق المشروع لتحديد أنسب طريقة للاستجابة.",
          "correct": false
        },
        {
          "text": "إضافة التأخير إلى سجل القضايا وتضمينه في تقرير المشروع.",
          "correct": true
        },
        {
          "text": "الاتصال بمدير المشتريات لتسريع تسليم المواد.",
          "correct": false
        },
        {
          "text": "تصعيد المشكلة إلى مالك المشروع وطلب تغيير الجدول الزمني.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تمر المنظمة بتحول تجاري. تم تعيين مدير المشروع لمشروع يتعلق بأحد خطوط الأعمال الجديدة.\n\nما الذي يجب على مدير المشروع والفريق فعله قبل تحديد نطاق المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قيادة اجتماع للمشتريات.",
          "correct": false
        },
        {
          "text": "إنشاء هيكل تجزئة العمل (WBS).",
          "correct": false
        },
        {
          "text": "تكييف وتخصيص الأصول الحالية.",
          "correct": true
        },
        {
          "text": "الموافقة على دراسة الجدوى (business case).",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تقوم شركة بتنفيذ مشروع بعقد بسعر ثابت مع أحد الموردين. أثناء التنفيذ، وافق المورد على تسليم متطلبات إضافية لم تكن مدرجة في العقد. لتلبية النطاق الموسع، أضاف الطرفان المزيد من الموارد للحفاظ على الجدول الزمني المخطط.\n\nما هي التقنية التي يتم تطبيقها في هذا المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "التنفيذ المتوازي (Fast tracking)",
          "correct": false
        },
        {
          "text": "التسريع (Crashing)",
          "correct": true
        },
        {
          "text": "تسوية الموارد (Resource leveling)",
          "correct": false
        },
        {
          "text": "الفترة التمهيدية والتأخير (Lead and lag)",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يقوم مدير المشروع بإعداد خطة إدارة المشروع لتقديمها إلى الراعي خلال أسبوعين. ومع ذلك، يريد الراعي مراجعة التقديرات الأولية للموارد قبل الموعد النهائي.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب من الراعي الانتظار حتى يتم الانتهاء من هيكل تجزئة العمل (WBS).",
          "correct": false
        },
        {
          "text": "مشاركة نسخة أولية من ورقة تقدير الميزانية (BES) مع الراعي.",
          "correct": false
        },
        {
          "text": "إعادة مشاركة بيان العمل (SOW) مع الراعي.",
          "correct": false
        },
        {
          "text": "مشاركة نسخة أولية من هيكل توزيع الموارد (RBS) مع الراعي.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "طلب العميل تغييرًا على وظيفة سيتم تسليمها في التكرار التالي. تم تعيين المختص المسؤول عن هذه الوظيفة مؤخرًا في مشروع آخر.\n\nما الذي يجب على مدير المشروع فعله أولًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب مورد جديد من قسم الموارد البشرية.",
          "correct": false
        },
        {
          "text": "طلب مورد جديد من الراعي.",
          "correct": false
        },
        {
          "text": "التفاوض بشأن توافر المورد.",
          "correct": true
        },
        {
          "text": "إبلاغ العميل بعدم إمكانية تنفيذ التغيير الجديد.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بدأ مدير المشروع للتو في بناء الفريق لمشروع ضخم ومعقد. يهتم مدير المشروع بشدة بإقامة تواصل فعال مع فريقه الكبير.\n\nما الذي يجب أن يفعله المدير لتحقيق ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "تنظيم أنشطة جماعية لمساعدة أعضاء الفريق على التعبير عن اهتماماتهم.",
          "correct": false
        },
        {
          "text": "إنشاء عملية لمشاركة المعلومات مع جميع أعضاء الفريق.",
          "correct": true
        },
        {
          "text": "استخدام تقييم واضح وفي الوقت المناسب للوضع مع أعضاء الفريق.",
          "correct": false
        },
        {
          "text": "السماح بتبادل حر للأفكار والآراء بين أعضاء الفريق.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "بعد الانتهاء من تحليل أصحاب المصلحة، أصبح مدير المشروع في مرحلة تخطيط الإجراءات. ماذا يجب أن يفعل مدير المشروع مع أصحاب المصلحة الذين ليس لديهم اهتمام أو تأثير في المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "مراقبة هؤلاء أصحاب المصلحة عن كثب.",
          "correct": true
        },
        {
          "text": "تشجيع هؤلاء أصحاب المصلحة بشكل كبير.",
          "correct": false
        },
        {
          "text": "التركيز بانتباه على هؤلاء أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "استغلال هؤلاء أصحاب المصلحة بشكل واضح.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ أحد البائعين مدير المشروع أن معدات المشروع يمكن تسليمها في وقت أبكر من المتوقع. يدرك مدير المشروع أن هذه فرصة لإنهاء المشروع قبل الموعد المحدد.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
      "explanation": "",
      "choices": [
        {
          "text": "طلب موافقة الإدارة.",
          "correct": false
        },
        {
          "text": "استخدام المعدات المقدمة.",
          "correct": false
        },
        {
          "text": "تعديل جدول المشروع.",
          "correct": false
        },
        {
          "text": "تحديد ما إذا كانت هناك مخاطر.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أبلغ أحد الموردين أن لديهم طاقة إنتاجية زائدة، مما قد يؤخر التسليم. ما الذي يجب على مدير المشروع تحديثه؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل المخاطر.",
          "correct": true
        },
        {
          "text": "سجل أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "سجل القضايا.",
          "correct": false
        },
        {
          "text": "جدول المشروع.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تم تحديد خطر كبير في المشروع، وتم تنفيذ خطة إدارة المخاطر. بعد إتمام الإجراءات المعتمدة، ماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحديث خطة إدارة المخاطر.",
          "correct": false
        },
        {
          "text": "تعديل جدول المشروع والميزانية.",
          "correct": false
        },
        {
          "text": "تحديث الدروس المستفادة.",
          "correct": false
        },
        {
          "text": "تحديد مخاطر جديدة ومراقبة المخاطر المتبقية.",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "تعتمد نتائج المشروع بشكل كبير على نشاط السوق المالية. لذلك، يقدم المستشار المالي للشركة توقعات يومية لسعر الصرف. تم تخطيط ميزانية المشروع باستخدام سيناريو تحفظي بافتراض تقلبات كبيرة في سعر الصرف. الآن يرغب مدير المشروع في مراجعة هذه الميزانية لتحديث احتمال وتأثير سيناريو جديد محتمل بناءً على الظروف المالية الحالية.\n\nإلى ماذا يجب أن يرجع مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "سجل المخاطر",
          "correct": true
        },
        {
          "text": "الدروس المستفادة",
          "correct": false
        },
        {
          "text": "ظروف السوق",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "ما هي العملية التي ينفذها مدير المشروع لتحديد أولويات المخاطر الفردية في المشروع لتحليلها أو اتخاذ إجراء بشأنها، من خلال تقييم احتمال حدوثها وتأثيرها وخصائص أخرى؟",
      "explanation": "",
      "choices": [
        {
          "text": "تحليل المخاطر الكمي",
          "correct": false
        },
        {
          "text": "تحليل المخاطر النوعي",
          "correct": true
        },
        {
          "text": "تحديد المخاطر",
          "correct": false
        },
        {
          "text": "تخطيط إدارة المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أنهى مدير المشروع تحليل المخاطر النوعي مع فريقه. ما هي مستندات المشروع التي قد تحتاج إلى تحديث بناءً على هذه المعلومات؟",
      "explanation": "",
      "choices": [
        {
          "text": "سجل المخاطر، تقرير المخاطر، الدروس المستفادة",
          "correct": false
        },
        {
          "text": "خطة إدارة المخاطر، سجل الافتراضات",
          "correct": false
        },
        {
          "text": "سجل المخاطر، سجل الافتراضات، سجل القضايا، تقرير المخاطر",
          "correct": true
        },
        {
          "text": "سجل المخاطر، تقرير المخاطر",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "أحد الموردين في مشروع تنظيمي مسؤول عن إجراء تغييرات على المكونات. من غير المرجح أن يفي المورد بالجدول الزمني للمشروع. استنادًا إلى خطة الاستجابة للمخاطر، حصل مدير المشروع على موافقة أصحاب المصلحة لاستخدام النماذج الورقية حتى يتم تنفيذ التغييرات. ومع ذلك، لا يزال من الممكن ألا تكون التغييرات على النماذج الورقية جاهزة في الوقت المناسب.\n\nما نوع الخطر الذي يواجهه مدير المشروع في هذه الحالة؟",
      "explanation": "",
      "choices": [
        {
          "text": "خطر ثانوي",
          "correct": false
        },
        {
          "text": "خطر متبقٍ",
          "correct": true
        },
        {
          "text": "الخطر الأساسي",
          "correct": false
        },
        {
          "text": "خطر الامتثال",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "غالبًا ما يطرح فريق المشروع أسئلة حول سبب عملهم وكيف ينظر العميل إلى تقدمهم والنتائج المقدمة. ماذا يجب أن يفعل مدير المشروع لبناء الثقة وجعل الفريق أكثر انخراطًا؟",
      "explanation": "",
      "choices": [
        {
          "text": "مشاركة الملاحظات ودعوة أعضاء الفريق إلى اجتماعات الحالة مع أصحاب المصلحة.",
          "correct": true
        },
        {
          "text": "طمأنة الفريق بأن العميل راضٍ وأنك تدير التوقعات.",
          "correct": false
        },
        {
          "text": "عرض خطة المشروع وتقرير التقدم على الفريق مع التحديثات المنتظمة عند التعديل.",
          "correct": false
        },
        {
          "text": "مقارنة المهام المعلقة بالمهام المكتملة حتى يشعر الفريق بالإنجاز.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يواجه مدير المشروع صعوبة في إقناع أصحاب المصلحة باعتماد التكنولوجيا الجديدة في المشروع.\nماذا كان يجب على مدير المشروع فعله لتجنب هذا النوع من المقاومة؟",
      "explanation": "",
      "choices": [
        {
          "text": "الاستثمار في تواصل فعال مع أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "توفير الدعم الفني لأصحاب المصلحة",
          "correct": false
        },
        {
          "text": "اقتراح اتفاق رسمي مع أصحاب المصلحة",
          "correct": false
        },
        {
          "text": "إشراك أصحاب المصلحة في أقرب وقت ممكن",
          "correct": true
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "في مشروع هجين، يتلقى مدير المشروع إشعارًا يفيد بأنه، استجابةً لحكم قضائي حديث، يجب تضمين متطلب جديد في نطاق المشروع.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "قبول المتطلب الجديد كجزء من نطاق المشروع.",
          "correct": false
        },
        {
          "text": "استبعاد المتطلب الجديد من نطاق المشروع.",
          "correct": false
        },
        {
          "text": "تقديم طلب تغيير إلى مجلس التحكم في التغييرات (CCB).",
          "correct": true
        },
        {
          "text": "تضمين المتطلب الجديد بعد الاجتماع مع أصحاب المصلحة.",
          "correct": false
        }
      ]
    },
    {
      "type": "multiple-choice",
      "text": "يعمل مدير المشروع على مشروع حاسم لا تتوفر له بيانات تاريخية. قد يعرض ذلك المشروع للخطر.\n\nماذا يجب أن يفعل مدير المشروع؟",
      "explanation": "",
      "choices": [
        {
          "text": "تخطيط تنفيذ المشروع بناءً على شهية المخاطر لدى أصحاب المصلحة.",
          "correct": false
        },
        {
          "text": "تطوير خطة إدارة المشروع لتحديد الفرص والتهديدات وترتيبها حسب الأولوية.",
          "correct": false
        },
        {
          "text": "إبلاغ الراعي بالمخاطر المتوقعة، ثم متابعة تنفيذ المشروع.",
          "correct": false
        },
        {
          "text": "وضع خطة لإدارة المخاطر وإبلاغ أصحاب المصلحة الرئيسيين بالمخاطر المحتملة.",
          "correct": true
        }
      ]
    }
  ]
}
