{
  "time": 13800,
  "pass": 85,
  "test": [
    {
  "type": "multiple-choice",
  "text": "أثناء مرحلة التنفيذ في مشروعك، أبلغك مدير الموارد بأن أحد الخبراء المخصصين لمشروعك يحتاج إلى التحفيز ليؤدي بشكل جيد.\n\nما الإجراءات الموصى بها لمعالجة هذه المشكلة؟",
  "explanation": "الإجابة الصحيحة: تذكير عضو الفريق بأهمية دوره وكيف سيتم مكافأته.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nتحفيز الأفراد يتم عبر ربط جهودهم بأهداف المشروع وبيان أثر مساهماتهم مع إيضاح المكافآت المعنوية أو المادية، وهذا يعزز الدافع الداخلي.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتذكير المدير الوظيفي قد لا يكون فعالًا لأن المسؤولية هنا على مدير المشروع.\nذكر العقوبات يعزز مناخًا سلبيًا بدلاً من التحفيز.\nالتركيز فقط على الحوافز المالية قد لا يغطي جوانب التحفيز الشخصي المرتبط بالقيمة الذاتية.",
  "choices": [
    {
      "text": "تذكير المدير الوظيفي بأن من واجبه تحفيز فريقه.",
      "correct": false
    },
    {
      "text": "تذكير عضو الفريق بوجود عقوبات على السلوكيات السيئة.",
      "correct": false
    },
    {
      "text": "تذكير عضو الفريق بوجود حوافز مالية للفريق.",
      "correct": false
    },
    {
      "text": "تذكير عضو الفريق بأهمية دوره وكيف سيتم مكافأته.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء تنفيذ المشروع، ارتكب أحد أعضاء الفريق خطأً أدى إلى تأخير لمدة أسبوع في الجدول الزمني للمشروع. ما الذي يجب على مدير المشروع فعله فيما يتعلق بهذا الخطأ والتأخير؟",
  "explanation": "الإجابة الصحيحة: مناقشة المشكلة مع الفريق، البحث عن حلول، وتقديم الدعم والمساعدة للفريق.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nحل المشكلات في إدارة المشاريع يعتمد على الشفافية والعمل الجماعي وتحليل الأسباب الجذرية دون لوم مباشر، مع التركيز على الحلول.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتحميل فرد واحد مسؤولية الخطأ يُضعف الروح الجماعية.\nالتصعيد للإدارة العليا مباشرة قد يؤدي إلى فقدان الثقة في الفريق.\nفرض حل دون إشراك الفريق يضعف التزامهم ويقلل من فرص تحسين الأداء.",
  "choices": [
    {
      "text": "مناقشة المشكلة مع الفريق، البحث عن حلول، وتقديم الدعم والمساعدة للفريق.",
      "correct": true
    },
    {
      "text": "التأكد من أن عضو الفريق الذي ارتكب الخطأ يفهم تأثير هذا الخطأ.",
      "correct": false
    },
    {
      "text": "تصعيد المشكلة إلى الإدارة العليا لضمان عدم تكرارها.",
      "correct": false
    },
    {
      "text": "إيجاد حل وإبلاغ الفريق به والتأكيد على تطبيقه فورًا.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يشارك مدير مشروع في مشروع تطوير للتجارة الإلكترونية. تم الانتهاء من المشروع بنجاح باستخدام نموذج هجين، وتم البدء في عملية تسليم العمليات. لاحظ مدير المشروع أن فريق التطوير أصبح غير نشط ولا يخصص وقتًا لعملية التسليم، مما يؤثر على دعم التطبيق.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
  "explanation": "الإجابة الصحيحة: الاجتماع مع فريق التطوير لمناقشة أهمية عملية التسليم وتأثيرها على دعم التطبيق.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nفي بيئة المشاريع، من المهم تعزيز الوعي الجماعي بمراحل المشروع المختلفة. توضيح أهمية مرحلة التسليم يعيد تركيز الفريق ويحفزهم على إكمال العمل بجودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالمواجهة المباشرة قد تسبب توترًا بدون نتائج فعالة.\nتفويض المسؤولية قد يؤدي إلى تشتت وتجاهل جزء من الفريق.\nتجاهل المشكلة يعرض المشروع لمخاطر متعلقة بالجودة والدعم الفني.",
  "choices": [
    {
      "text": "مواجهة فريق التطوير والمطالبة بتركيزهم الفوري على عملية التسليم.",
      "correct": false
    },
    {
      "text": "الاجتماع مع فريق التطوير لمناقشة أهمية عملية التسليم وتأثيرها على دعم التطبيق.",
      "correct": true
    },
    {
      "text": "تفويض مسؤولية عملية التسليم لعضو آخر في الفريق لضمان تنفيذها بشكل صحيح.",
      "correct": false
    },
    {
      "text": "تجاهل المشكلة وتوقع أن يتعامل فريق التطوير معها ويحلها من تلقاء نفسه.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع مشروعًا يعمل وفق النهج المرن (Agile). لضمان توفر التمويل الكافي، يطلب الراعي من مدير المشروع تقديرًا لموعد الانتهاء من المشروع.\n\nكيف يجب على مدير المشروع الرد على الراعي؟",
  "explanation": "الإجابة الصحيحة: تقديم التقدير للراعي، لأن المنهج المرن يدعم وضع التقديرات.\n\n- لماذا هذه هي الإجابة الصحيحة؟\nحتى في المشاريع المرنة، يحتاج أصحاب المصلحة إلى تقديرات أولية لإدارة التمويل والتخطيط، مع قبول أن هذه التقديرات قد تتغير لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\nرفض التقدير بحجة أن المرونة لا تتطلبه يتعارض مع مبادئ إدارة المشاريع المرنة، حيث يتم تقديم تقديرات مستمرة.\nإقناع الراعي بإضافة هامش احتياطي دون تقديم تقدير أصلي غير مهني.\nالتذكير بأن الميزانية والجدول الزمني غير مهمين في المرونة غير دقيق، لأنهما يظلان جزءًا من الضوابط العامة للمشروع.",
  "choices": [
    {
      "text": "إبلاغ الراعي بأن التقدير غير ضروري لأن المنهج المرن يفضل الاستجابة للتغيير بدلاً من الالتزام بالخطة.",
      "correct": false
    },
    {
      "text": "تذكير الراعي بأن المشاريع المرنة لا تُقاس بناءً على الميزانية والجدول الزمني.",
      "correct": false
    },
    {
      "text": "تقديم التقدير للراعي، لأن المنهج المرن يدعم وضع التقديرات.",
      "correct": true
    },
    {
      "text": "إقناع الراعي بإضافة هامش احتياطي للتكلفة في حال حدوث تجاوز.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع مشروعًا يحتوي على مكون يُدار باستخدام المنهجية المرنة (Agile). يطلب الراعي من مدير المشروع إضافة مكون جديد منظم من قبل الحكومة ويحتوي على قواعد ضريبية معقدة مع توفير وقت كافٍ لتنفيذ هذه القواعد. يقترح الراعي تنفيذ هذا المكون الجديد باستخدام المنهجية التنبؤية (غير المرنة) نظرًا لتعقيده.\n\nما هي المنهجية التي سيستخدمها مدير المشروع لهذا المكون الجديد؟",
  "explanation": "الإجابة الصحيحة هي: استخدام النهج الهجين من خلال الاستمرار في إدارة المكون الحالي باستخدام Agile، والمكون الجديد باستخدام المنهجية التنبؤية.\n\n- لماذا؟\nالمنهج الهجين يجمع بين مزايا المرونة والصرامة، ويُستخدم عادة عندما يحتوي المشروع على أجزاء ذات طبيعة مختلفة مثل أجزاء قابلة للتطوير التدريجي وأخرى ذات متطلبات صارمة وثابتة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nAgile لا تناسب جميع الحالات خصوصًا مع المتطلبات التنظيمية الصارمة.\nإدارة كلا المكونين بنفس المنهجية بدون مراعاة خصائصهما قد يضر بكفاءة التنفيذ.\nطلب التوجيه من الراعي غير مهني لأن القرار يتعلق باختيار منهجية مناسبة بناءً على خصائص العمل، وليس مجرد توجيه إداري.",
  "choices": [
    {
      "text": "إبلاغ الراعي بأنه سيتم إدارة المكون الجديد باستخدام منهجية Agile لأن Agile تناسب جميع الحالات.",
      "correct": false
    },
    {
      "text": "استخدام النهج الهجين من خلال الاستمرار في إدارة المكون الحالي باستخدام Agile، والمكون الجديد باستخدام المنهجية التنبؤية.",
      "correct": true
    },
    {
      "text": "إدارة المكون الحالي وكذلك المكون الجديد باستخدام المنهجية التنبؤية القائمة على التخطيط.",
      "correct": false
    },
    {
      "text": "طلب التوجيه من الراعي حول المنهجية الأنسب للمكون الجديد.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع فرقًا افتراضية موزعة حول العالم. ماذا يجب أن يفعل مدير المشروع للتغلب على الاختلافات الثقافية؟",
  "explanation": "الإجابة الصحيحة: إنشاء فهم مشترك لأهداف الفريق وغاياته.\n\n- لماذا؟\nعند العمل مع فرق متعددة الثقافات، وجود أهداف وغايات واضحة ومشتركة يساعد في توحيد الجهود وتخفيف تأثير الاختلافات الثقافية على الأداء.\n\n- لماذا الخيارات الأخرى خاطئة؟\nإنشاء قنوات تواصل غير رسمية مهم لكنه لا يكفي وحده لضمان التفاهم.\nتعزيز السيادة الفردية قد يزيد من حدة الخلافات بدلاً من حلها.\nبيئة التواصل المفتوح ضرورية، لكن بدون أهداف مشتركة، قد تظل الفروقات الثقافية عائقًا في فهم الأولويات.",
  "choices": [
    {
      "text": "إنشاء قنوات تواصل غير رسمية ودعوة الأعضاء للمشاركة بحرية.",
      "correct": false
    },
    {
      "text": "تعزيز الحدود الشخصية والسيادة الفردية.",
      "correct": false
    },
    {
      "text": "إنشاء بيئة يتمكن فيها الأعضاء من التواصل بشكل مفتوح.",
      "correct": false
    },
    {
      "text": "إنشاء فهم مشترك لأهداف الفريق وغاياته.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "بالنسبة للفرق الافتراضية، ما يلي هي الحواجز التي تحتاج الفرق إلى العمل من خلالها لتحقيق نتائج ناجحة، باستثناء:",
  "explanation": "الإجابة الصحيحة: الراحة الشخصية.\n\n- لماذا؟\nالراحة الشخصية ليست من الحواجز الجوهرية التي تؤثر على نجاح الفرق الافتراضية من منظور إدارة المشاريع. الفرق الافتراضية عادة ما تواجه تحديات مثل:\n1. ضعف التفاعل الشخصي.\n2. اختلاف ممارسات وأساليب العمل.\n3. تنوع المعرفة وتفاوت الخلفيات.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالتفاعلات الشخصية، ممارسات وأساليب العمل، وتنويع المعرفة تعتبر من أبرز التحديات التي يجب إدارتها لتحقيق نتائج فعالة.",
  "choices": [
    {
      "text": "التفاعلات الشخصية وتطوير العلاقات.",
      "correct": false
    },
    {
      "text": "ممارسات وأساليب العمل.",
      "correct": false
    },
    {
      "text": "تنوع المعرفة.",
      "correct": false
    },
    {
      "text": "الراحة الشخصية.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يمكن تحقيق التفاعل والتحفيز بنجاح من قبل مدير المشروع في الفريق الافتراضي من خلال كل ما يلي، باستثناء:",
  "explanation": "الإجابة الصحيحة: التعاون غير الفعال.\n\n- لماذا؟\nالتعاون غير الفعال يعيق التحفيز والتفاعل بدلاً من تحقيقهما. أما تحديد الأهداف، هيكلة المهام، وأنظمة المكافآت فهي أدوات رئيسية يستخدمها مدير المشروع لتعزيز العمل الجماعي والتحفيز.\n\n- لماذا الخيارات الأخرى خاطئة؟\nتحديد الأهداف يوجه الفريق.\nهيكلة المهام تساعد على توزيع العمل بوضوح.\nأنظمة المكافآت تعزز الدافعية.",
  "choices": [
    {
      "text": "تحديد الأهداف.",
      "correct": false
    },
    {
      "text": "هيكلة المهام.",
      "correct": false
    },
    {
      "text": "التعاون غير الفعال.",
      "correct": true
    },
    {
      "text": "أنظمة المكافآت.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تشمل آداب التواصل الجيدة لمدير المشروع عند إرسال رسائل البريد الإلكتروني ما يلي، باستثناء:",
  "explanation": "الإجابة الصحيحة: الرد دائمًا فورًا على الرسائل العاطفية.\n\n- لماذا؟\nالرد الفوري على الرسائل العاطفية قد يؤدي إلى قرارات متسرعة أو تعبير غير مهني عن المشاعر. يُفضل دائمًا التروي وإعادة قراءة الرسالة قبل الرد لتجنب ردود الفعل الاندفاعية.\n\n- لماذا الخيارات الأخرى خاطئة؟\nمعرفة الجمهور والتحلي باللباقة واستخدام القواعد الصحيحة في الكتابة كلها عناصر أساسية في التواصل المهني الفعال عبر البريد الإلكتروني.",
  "choices": [
    {
      "text": "الرد دائمًا فورًا على الرسائل العاطفية.",
      "correct": true
    },
    {
      "text": "معرفة الجمهور المستهدف.",
      "correct": false
    },
    {
      "text": "التحلي دائمًا باللباقة.",
      "correct": false
    },
    {
      "text": "استخدام قواعد نحوية وإملائية وعلامات ترقيم صحيحة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "يجب على مديري المشاريع أن يتحلّوا بروح القيادة وأن يدفعوا فريق المشروع لتحقيق النتائج المتوقعة. ما الصفات التي يجب أن يتحلى بها مدير المشروع؟ (اختر 3).",
  "explanation": "الإجابات الصحيحة: القيادة، الأخلاق، التمكين.\n\n- لماذا هذه الصفات مهمة؟\n1. القيادة: حتى يوجّه الفريق نحو الأهداف.\n2. الأخلاق: للحفاظ على بيئة عمل تحترم القيم والمبادئ.\n3. التمكين: لتمكين أعضاء الفريق من اتخاذ قرارات وتنفيذ المهام بكفاءة.\n\n- لماذا الخيارات الأخرى خاطئة؟\nالقدرة على التكيّف مهمة لكنها ليست من الصفات الأساسية المطلوبة في كل الحالات.\nالعدوانية ليست صفة قيادية إيجابية وقد تؤدي إلى نتائج عكسية.",
  "choices": [
    {
      "text": "القيادة",
      "correct": true
    },
    {
      "text": "الأخلاق",
      "correct": true
    },
    {
      "text": "القدرة على التكيّف",
      "correct": false
    },
    {
      "text": "العدوانية",
      "correct": false
    },
    {
      "text": "التمكين",
      "correct": true
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "يعمل مدير مشروع على مشروع يعتمد بشكل كبير على التغيرات في السوق. أوصت وحدة إدارة المشاريع (PMO) باستخدام نهج Agile، وقد حجز مدير المشروع مراجعات مرجعية لاختيار شريك التنفيذ. ولكي ينجح المشروع، يحتاج Agile إلى مستوى عالٍ من الثقة بين العميل والمورد.\n\nما الجوانب التي يجب على مدير المشروع النظر فيها لبناء الثقة بأن المورد قادر على التنفيذ؟ (اختر 2).",
  "explanation": "الإجابات الصحيحة: العمليات والأدوات + التميز التقني.\n\n- لماذا؟\n1. العمليات والأدوات: تضمن أن لدى المورد آليات وخطط واضحة ومنهجيات مثبتة تساعده على تنفيذ العمل بشكل متكرر وفعّال.\n2. التميز التقني: يدل على قدرة المورد على إنجاز العمل بالجودة والسرعة المطلوبة، مما يعزز ثقة العميل.\n\n- لماذا الإجابات الأخرى خاطئة؟\n- المثابرة مهمة، لكنها ليست معيارًا مباشرًا لبناء الثقة في تنفيذ Agile.\n- مهارات التخطيط ضرورية لكن التركيز في Agile يكون أكثر على الاستجابة للتغير وليس فقط الالتزام بالخطة.",
  "choices": [
    {
      "text": "العمليات والأدوات - لضمان أن المورد يستخدم نهجًا فعالًا وقابلًا للتكرار في التسليم",
      "correct": true
    },
    {
      "text": "التميز التقني - لضمان أن النتائج تم إنجازها بسرعة وبجودة عالية",
      "correct": true
    },
    {
      "text": "المثابرة - لضمان أن المورد قادر على التغلب على التحديات الناتجة عن تغيّر نطاق العمل المتكرر",
      "correct": false
    },
    {
      "text": "مهارات التخطيط - لضمان أن المورد التزم بالتكلفة والمواعيد النهائية المتفق عليها في العقد",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "يُدير مدير مشروع تنفيذ تقنية جديدة، ويرغب في التأكد من أن المشروع يحقق قيمة تجارية للمؤسسة.\n\nما الأدوار الأساسية التي تضمن استفادة المؤسسة من تنفيذ المشروع؟ (اختر 3).",
  "explanation": "الإجابات الصحيحة: مدير المشروع + محلل الأعمال + قائد العميل.\n\n- لماذا؟\n1. مدير المشروع: مسؤول عن التأكد من أن المشروع يسير ضمن الأهداف المحددة.\n2. محلل الأعمال: يضمن أن الحل يلبّي احتياجات العمل ويوفر قيمة.\n3. قائد العميل: يمثل مصالح العميل ويتأكد من أن القيمة تصل إليه.\n\n- لماذا الإجابات الأخرى خاطئة؟\n- مدير الأفراد والثقافة: ليس دوره الأساسي مرتبطًا بالقيمة المباشرة للمشروع.\n- المهندس المعماري التقني: يركز على الجانب الفني أكثر من الجانب التجاري للمشروع.",
  "choices": [
    {
      "text": "مدير الأفراد والثقافة",
      "correct": false
    },
    {
      "text": "مدير المشروع",
      "correct": true
    },
    {
      "text": "محلل الأعمال",
      "correct": true
    },
    {
      "text": "قائد العميل",
      "correct": true
    },
    {
      "text": "المهندس المعماري التقني",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقود مدير مشروع مشروعًا يهدف إلى التحول إلى Agile. المشروع سيقوم بتجربة Agile عبر أربعة أعضاء من المورد، يعملون جنبًا إلى جنب مع عضوين داخليين لا يملكون خبرة في Agile. يحتاج مدير المشروع إلى العمل كمدرّب للفريق ومساعدته على فهم الفروقات بين عمل الفريق التقليدي وفريق Agile.\n\nما هو أهم شيء يجب على مدير المشروع فعله لترسيخ سلوك فريق Agile؟",
  "explanation": "الإجابة الصحيحة هي: بناء الثقة داخل الفريق. \nفي Agile، بناء الثقة ضروري لأن الفريق يحتاج إلى بيئة تسمح له بالتجربة، مشاركة الأفكار بحرية، وتحمل المسؤولية دون خوف من اللوم. بينما التركيز على النتائج والتعاون وتحميل المسؤولية أمور مهمة، فإنها تبنى على أساس الثقة أولاً.",
  "choices": [
    {
      "text": "التركيز على النتائج التي يحققها الفريق.",
      "correct": false
    },
    {
      "text": "بناء الثقة داخل الفريق.",
      "correct": true
    },
    {
      "text": "تشجيع التعاون بين أعضاء الفريق.",
      "correct": false
    },
    {
      "text": "تحميل كل عضو في الفريق المسؤولية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أنهى فريق المشروع مؤخرًا مشروعًا طويل الأمد باستخدام نهج تنبؤي. ثم بدأ الفريق مشروعًا جديدًا مع نفس مدير المشروع، لكنهم الآن يستخدمون نهجًا مرنًا (Agile). بعد السبرنت الأولي، ينتظر الفريق من مدير المشروع اتخاذ القرارات نيابة عنهم، كما كان يتم في المشاريع السابقة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة هي: توجيه الفريق وتدريبه لدعم اتخاذ قراراتهم بأنفسهم. \nفي Agile، أحد المبادئ الأساسية هو تمكين الفرق لتكون ذاتية التنظيم وتتخذ قراراتها بشكل مستقل. لو استمر الفريق في الاعتماد على المدير، فهذا يعني أنهم لم يتحولوا بعد إلى العقلية الرشيقة (Agile mindset).",
  "choices": [
    {
      "text": "طلب من مالك المنتج اتخاذ القرارات نيابة عن الفريق.",
      "correct": false
    },
    {
      "text": "تقديم ملاحظات إيجابية مستمرة لجميع أعضاء الفريق.",
      "correct": false
    },
    {
      "text": "تذكير الفريق بأنهم يستخدمون نهج Agile.",
      "correct": false
    },
    {
      "text": "توجيه الفريق وتدريبه لدعم اتخاذ قراراتهم بأنفسهم.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال اجتماع مراجعة السبرنت (Retrospective)، أكد فريق المشروع أن جميع المخرجات قد اكتملت وفقًا للمواصفات الواردة في سجل المنتج (Product Backlog). ومع ذلك، زاد عدد الأخطاء التي تم العثور عليها أثناء الاختبار بشكل كبير.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة هي: الاجتماع مع متخصصي ضمان الجودة لتوضيح المشكلة والبحث عن حلول. \nفي هذا الوضع، من المهم أولًا تحديد السبب الجذري لزيادة الأخطاء. قد تكون المشكلة في طريقة الاختبار أو في فهم معايير القبول. بينما مراجعة خطة المخاطر أو تسجيلها يعتبر خطوة لاحقة، فإن التعامل المباشر مع فريق الجودة هو الإجراء الفوري والأكثر فعالية.",
  "choices": [
    {
      "text": "الاجتماع مع متخصصي ضمان الجودة لتوضيح المشكلة والبحث عن حلول.",
      "correct": true
    },
    {
      "text": "مراجعة خطة إدارة المخاطر لتحديد استراتيجية التخفيف.",
      "correct": false
    },
    {
      "text": "إجراء تحليل مونتي كارلو لتحديد السيناريوهات والإجراءات الممكنة.",
      "correct": false
    },
    {
      "text": "تسجيل الخطر في سجل المخاطر ومراقبته خلال السبرنت التالي.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أخذ مطور تطبيق بطاقة قصة مكتوب عليها \"يمكن للعميل الدفع باستخدام بطاقة الائتمان\". بعد التنفيذ، تم رفض الوظيفة لأن التطبيق لا يمكنه قبول بطاقات ائتمان أجنبية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذه المشكلة؟",
  "explanation": "الإجابة الصحيحة هي: وصف قصة المستخدم بمزيد من التفصيل. \nالقصص غير المحددة بشكل كافٍ تؤدي إلى سوء فهم ومتطلبات غير مكتملة. في منهجية Agile، من المهم أن تحتوي كل قصة على معايير قبول واضحة حتى يفهم المطور بالضبط ما هو المطلوب. هذا يُسمى INVEST في قصص المستخدم: (مستقلة، قابلة للتفاوض، ذات قيمة، قابلة للتقدير، صغيرة، قابلة للاختبار).",
  "choices": [
    {
      "text": "وصف قصة المستخدم بمزيد من التفصيل.",
      "correct": true
    },
    {
      "text": "جدولة قصة المستخدم للسبرنت التالي.",
      "correct": false
    },
    {
      "text": "تنفيذ مراجعة دورية لسجل المنتج (backlog grooming) مع الفريق.",
      "correct": false
    },
    {
      "text": "جمع مواصفات أكثر تفصيلاً من المستخدمين النهائيين.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أبلغ الراعي مالك المنتج أنه قد تمت الموافقة على الميزانية لمشروع معين. ومع ذلك، فإن أي استثمار إضافي في المشروع سيتعين تأجيله إلى السنة المالية التالية. يشعر مالك المنتج بالقلق من أن ذلك قد يعيق تقدم المشروع.\n\nما الذي يجب أن يفعله مالك المنتج؟",
  "explanation": "الإجابة الصحيحة: تتبع الميزانية استنادًا إلى خطة الإطلاق وإظهار القيمة للأعمال.\n\n- لماذا؟\nمالك المنتج مسؤول عن التأكد من أن القيمة التجارية تظهر بوضوح في مقابل الاستثمارات التي تم صرفها. في حال وجود قيود على الميزانية، يكون من الأفضل التركيز على تحقيق أقصى قيمة ممكنة ضمن الميزانية الحالية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- شرح أن المشروع قد بدأ للتو وأن الميزانية ستحتاج إلى تعديل: هذا ليس حلاً واقعيًا إذا تم تثبيت الميزانية بالفعل.\n- تتبع الميزانية بناءً على كل سبرنت وإزالة المخرجات غير الضرورية: هذا قد يؤثر على الجودة والمخرجات الأساسية.\n- ضمان أن مدير المشروع يراقب كل فاتورة: هذا دور إداري وليس دورًا استراتيجيًا يعالج المخاوف الرئيسية المتعلقة بالقيمة.",
  "choices": [
    {
      "text": "تتبع الميزانية استنادًا إلى خطة الإطلاق وإظهار القيمة للأعمال.",
      "correct": true
    },
    {
      "text": "شرح أن المشروع قد بدأ للتو وأن الميزانية ستحتاج إلى تعديل.",
      "correct": false
    },
    {
      "text": "تتبع الميزانية بناءً على كل سبرنت وإزالة المخرجات غير الضرورية.",
      "correct": false
    },
    {
      "text": "ضمان أن مدير المشروع يراقب كل فاتورة تصدر عن المشروع.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال تخطيط الإصدار، نشأ صراع بين أصحاب المصلحة بشأن أولوية بعض الاحتياجات، مما تسبب في فقدان فريق التطوير تركيزه.\n\nما هي تقنية حل النزاعات التي يجب على مدير المشروع استخدامها لمواءمة جميع أصحاب المصلحة وحل هذا الصراع؟",
  "explanation": "الإجابة الصحيحة: التعاون (Collaboration).\n\n- لماذا؟\nالتعاون يعتبر الطريقة الأكثر فعالية لحل النزاعات حيث يركز على تلبية احتياجات جميع الأطراف المعنية. بدلاً من فرض رأي جهة واحدة، يُستخدم أسلوب التعاون للوصول إلى حل يرضي الجميع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الإجبار: قد يؤدي إلى استياء الأطراف ويؤثر على أداء الفريق.\n- الانسحاب: يؤدي إلى ترك المشكلة دون حل.\n- التلطيف: قد يخفي المشكلة بدلاً من حلها بشكل جذري.",
  "choices": [
    {
      "text": "الإجبار (Forcing)",
      "correct": false
    },
    {
      "text": "التعاون (Collaboration)",
      "correct": true
    },
    {
      "text": "الانسحاب (Withdrawal)",
      "correct": false
    },
    {
      "text": "التلطيف (Smoothing)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم تكليف فريق مشروع ببناء منتج جديد. أنشأ الفريق العرض التوضيحي أولاً وأضاف ميزات إلى المنتج الأولي. ما هي الممارسة التقنية التي يعبّر عنها هذا الأسلوب؟",
  "explanation": "الإجابة الصحيحة: التسليم المستمر.\n\n- لماذا؟\nالتسليم المستمر (Continuous Delivery) هو أسلوب تطوير برمجي يتم فيه إصدار المنتج بشكل متكرر عبر مراحل تدريجية، حيث يتم أولًا تقديم نسخة أولية أو عرض توضيحي ثم إضافة ميزات تدريجيًا.\n\n- لماذا الإجابات الأخرى خاطئة؟\n- التطوير القائم على الاختبار (TDD): يركّز على كتابة الاختبارات قبل كتابة الكود.\n- التطوير القائم على السلوك: يعتمد على وصف السلوك المتوقع للنظام من منظور المستخدم.\n- الاستكشافات (Spikes): تُستخدم للاستكشاف والتحقق، وليس لإصدار منتج كامل بالتدريج.",
  "choices": [
    {
      "text": "التطوير القائم على الاختبار (TDD)",
      "correct": false
    },
    {
      "text": "التسليم المستمر",
      "correct": true
    },
    {
      "text": "التطوير القائم على السلوك",
      "correct": false
    },
    {
      "text": "الاستكشافات (Spikes)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقوم مكتب إدارة المشاريع (PMO) في الشركة بإدخال تقنيات أكثر تكيفًا وقد قام بتعيين مدير مشروع جديد لديه خبرة في الإدارة الهجينة. يتأخر الفريق في تبني المنهجية الجديدة ولم يقم بتحديث مستندات المشروع في الوقت المناسب.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع لتحسين أداء الفريق؟",
  "explanation": "الإجابة الصحيحة: تنظيم جلسة تدريبية لجميع أعضاء الفريق.\n\n- لماذا؟\nعندما يتم إدخال منهجيات جديدة، يحتاج الفريق إلى فهمها وتعلّم كيفية العمل وفقًا لها. التدريب الجماعي يرفع مستوى المعرفة والكفاءة ويوضح التوقعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال بريد إلكتروني: قد لا يكون كافيًا لتحفيز التغيير.\n- التواصل مع المدراء الوظيفيين: ليس الحل المباشر لتغيير سلوك الفريق.\n- التحدث بشكل فردي: أقل فاعلية مقارنة بجلسة تدريبية شاملة للفريق.",
  "choices": [
    {
      "text": "إرسال بريد إلكتروني يطلب من جميع أعضاء الفريق إكمال التحديثات في نهاية اليوم.",
      "correct": false
    },
    {
      "text": "تنظيم جلسة تدريبية لجميع أعضاء الفريق.",
      "correct": true
    },
    {
      "text": "التواصل مع المدراء الوظيفيين للحصول على الدعم.",
      "correct": false
    },
    {
      "text": "التحدث بشكل فردي مع كل عضو من الفريق حول التحديثات المطلوبة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يواجه فريق Agile صعوبة في مواكبة وتيرة العمل المخطط لها، مما يؤدي إلى فشل متكرر في السبرنت. ما الذي يجب على مدير المشروع فعله لتجنب هذا الموقف في المستقبل؟",
  "explanation": "الإجابة الصحيحة: مراجعة سرعة الفريق خلال عدة سبرنتات سابقة وتعديل الخطة وفقًا لذلك.\n\n- لماذا؟\nسرعة الفريق (Velocity) هي مقياس حقيقي يُظهر كمية العمل التي يمكن للفريق إنجازها خلال السبرنت الواحد. مراجعتها تساعد مدير المشروع على وضع توقعات واقعية وتعديل الخطة بما يتناسب مع القدرات الفعلية للفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب موافقة الراعي للعمل الإضافي: ليس حلاً مستدامًا وقد يؤدي إلى إجهاد الفريق.\n- استبدال الأعضاء والتفاوض على النطاق: إجراء جذرية قد تكون غير ضرورية في البداية.\n- التحول إلى كانبان: قد لا يكون مناسبًا دائمًا لمشكلات سرعة الفريق، ويجب تقييمه بناءً على السياق.",
  "choices": [
    {
      "text": "طلب موافقة الراعي للمشروع على العمل الإضافي لتعويض ضعف الأداء أثناء تعديل الخطة.",
      "correct": false
    },
    {
      "text": "مراجعة سرعة الفريق خلال عدة سبرنتات سابقة وتعديل الخطة وفقًا لذلك.",
      "correct": true
    },
    {
      "text": "استبدال الأعضاء المبتدئين بأعضاء أكثر خبرة والتفاوض على نطاق المشروع لتعويض الفجوة في الميزانية.",
      "correct": false
    },
    {
      "text": "التحول إلى نهج كانبان (Kanban) للحصول على تحكم أفضل من خلال تحديد الأعمال قيد التنفيذ.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يكافح مدير مشروع لفهم أداء فرق المشروع في بيئة Agile. لنفس نطاق العمل، قامت الفريق (A) بحساب وتسليم 100 نقطة قصة، بينما قامت الفريق (B) بحساب وتسليم 125 نقطة قصة.\n\nأي فريق يقدم أداءً أفضل؟",
  "explanation": "الإجابة الصحيحة: الفريق الذي لديه أقل عدد من العيوب في التسليمات.\n\n- لماذا؟\nفي بيئة Agile، جودة التسليمات مهمة بنفس قدر الكمية. يمكن أن ينجز الفريق B نقاط قصة أكثر لكن إذا كانت هناك عيوب كثيرة فهذا يؤثر سلبًا على القيمة النهائية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- فقط عدد نقاط القصة لا يعكس جودة العمل أو كفاءة الفريق.\n- إكمال أكبر عدد من القصص دون النظر للجودة قد يؤدي إلى مشاكل في المنتج النهائي.",
  "choices": [
    {
      "text": "الفريق A لأنه حسب عدد أقل من نقاط القصة مقارنةً بالفريق B.",
      "correct": false
    },
    {
      "text": "الفريق B لأنه حسب عددًا أكبر من نقاط القصة مقارنةً بالفريق A.",
      "correct": false
    },
    {
      "text": "الفريق الذي يكمل أكبر عدد من القصص من سجل السبرنت.",
      "correct": false
    },
    {
      "text": "الفريق الذي لديه أقل عدد من العيوب في التسليمات.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تملك شركة عقدًا قائمًا لصيانة وتحسين قاعدة بيانات عملاء. أبلغ القسم القانوني مدير المشروع أن هناك تشريعًا جديدًا يتطلب حماية أكثر صرامة لمعلومات العملاء قد يتم توقيعه قريبًا. وسيتطلب هذا القانون إضافة ميزات أمان إضافية إلى قاعدة البيانات التي يديرها المشروع، وهذه الميزات غير مدرجة في نطاق العقد الحالي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: تحديث سجل المخاطر بهذه المسألة وتخطيط الاستجابة للمخاطر مع الراعي والعميل.\n\n- لماذا؟\nالتغييرات القانونية تمثل مخاطر يجب إدارتها بفعالية. تحديث سجل المخاطر يسمح للمدير بتتبع الوضع والتواصل مع أصحاب المصلحة لاتخاذ قرارات مناسبة بخصوص تعديل النطاق أو التكاليف أو الجدول الزمني.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب دعم راعي المشروع لتعديل العقد فورًا قد يكون سابقًا لأوانه قبل تقييم المخاطر والتخطيط.\n- انتظار اعتماد المتطلبات رسميًا قد يؤخر الاستجابة وقد يؤدي إلى مشاكل لاحقًا.\n- إثارة القضية في مفاوضات العقد التالية غير كافٍ إذا كان التشريع وشيكاً ويتطلب تحركاً فورياً.",
  "choices": [
    {
      "text": "طلب دعم راعي المشروع للتأثير على العميل لتعديل العقد فورًا.",
      "correct": false
    },
    {
      "text": "طلب من القسم القانوني إثارة القضية في مفاوضات العقد التالية مع العميل.",
      "correct": false
    },
    {
      "text": "تحديث سجل المخاطر بهذه المسألة وتخطيط الاستجابة للمخاطر مع الراعي والعميل.",
      "correct": true
    },
    {
      "text": "الانتظار حتى يتم اعتماد المتطلبات القانونية رسميًا ليتم تعريف التغيير في النطاق بوضوح.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع ذو خبرة مشروع Agile بملايين الدولارات. أوضح مدير المشروع القواعد الأساسية للفريق، لكن بعد 12 دورة (iteration)، بدأ يلاحظ أن بعض الأعضاء لا يلتزمون بهذه القواعد.\n\nما الذي يجب أن يفعله مدير المشروع أولاً لضمان التزام الفريق بالقواعد؟",
  "explanation": "الإجابة الصحيحة: جدولة اجتماع مع الفريق لتعزيز القواعد الأساسية.\n\n- لماذا؟\nالتواصل المفتوح مع الفريق يساعد في إعادة تأكيد القواعد وتفسيرها وضمان فهم الجميع لأهميتها. هذا الإجراء يعزز التزام الفريق بشكل بناء دون تصعيد غير ضروري.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال إنذارات أو طلب استبدال الأعضاء دون محاولة إعادة التواصل والتوضيح قد يؤدي إلى توتر في الفريق ويؤثر على الأداء.\n- إبلاغ الراعي وطلب إجراءات تأديبية قد يكون تصعيدًا سريعًا ويجب أن يكون الخيار الأخير بعد المحاولات البناءة.",
  "choices": [
    {
      "text": "الاتصال بالموارد البشرية لطلب إرسال خطاب إنذار كتابي للأعضاء غير الملتزمين.",
      "correct": false
    },
    {
      "text": "طلب استبدال الأعضاء غير الملتزمين من المدير الوظيفي.",
      "correct": false
    },
    {
      "text": "جدولة اجتماع مع الفريق لتعزيز القواعد الأساسية.",
      "correct": true
    },
    {
      "text": "إبلاغ راعي المشروع بهذا السلوك وطلب اتخاذ إجراء تأديبي.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "طلبت اللجنة التوجيهية من مدير مشروع لديه خبرة في Agile تقديم مؤشر عن الوقت المتبقي لمشروع متوسط الحجم.\n\nما الأداة التي يمكن استخدامها لتقديم هذه المعلومات؟",
  "explanation": "الإجابة الصحيحة: مخطط الحرق للإصدار (Release Burndown Chart).\n\n- لماذا؟\nمخطط الحرق للإصدار يُظهر التقدم الحالي والوقت المتبقي بناءً على العمل المنجز والعمل المتبقي، مما يساعد في تقديم مؤشر دقيق للوقت المتوقع لإنهاء المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل وثيقة متطلبات العمل لا يعطي تقديرًا زمنيًا مباشرًا.\n- نقاط القصة للقصص المتبقية تعبر عن حجم العمل، لكن لا تترجم مباشرة إلى الوقت المتبقي بدون سياق السرعة.\n- القياسات البديلة هي مؤشرات غير مباشرة ولا توفر رؤية واضحة للوقت المتبقي.",
  "choices": [
    {
      "text": "تحليل وثيقة متطلبات العمل",
      "correct": false
    },
    {
      "text": "مخطط الحرق للإصدار (Release Burndown Chart)",
      "correct": true
    },
    {
      "text": "نقاط القصة (Story Points) للقصص المتبقية",
      "correct": false
    },
    {
      "text": "القياسات البديلة (Surrogate Measurements)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أصبح فريق جديد معتادًا على ممارسات Agile. لاحظ قائد المشروع أن الفريق يعمل وفق التوقعات، لكن هناك ملل بين العديد من الأعضاء بسبب الروتين اليومي.\n\nما الذي يجب أن يفعله قائد المشروع في هذه الحالة؟",
  "explanation": "الإجابة الصحيحة: تحدي الفريق للعثور على طرق جديدة لتحقيق مستويات أداء أعلى لتحسين الوضع.\n\n- لماذا؟\nتشجيع الفريق على البحث عن تحسينات جديدة يعزز الابتكار والتحفيز، مما يقلل الملل ويزيد من التفاعل والحماس.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- السماح فقط للاجتماع الاستعراضي بالتصحيح الذاتي قد لا يكون كافياً إذا كان الفريق يشعر بالملل بالفعل.\n- التحدث مع الأعضاء فردياً مفيد لكنه قد لا يؤدي إلى حلول جماعية وفعالة.\n- مطالبة الفريق بإبلاغ الإدارة العليا قد تؤخر الحلول ويقلل من استقلالية الفريق.",
  "choices": [
    {
      "text": "السماح للفريق بتنظيم نفسه وتحليل الوضع خلال اجتماع الاستعراض الذاتي (Retrospective) والتصحيح الذاتي.",
      "correct": false
    },
    {
      "text": "تحدي الفريق للعثور على طرق جديدة لتحقيق مستويات أداء أعلى لتحسين الوضع.",
      "correct": true
    },
    {
      "text": "التحدث مع الأعضاء فرديًا لمعرفة اقتراحاتهم لتحسين الوضع.",
      "correct": false
    },
    {
      "text": "مطالبة الفريق بإبلاغ الإدارة العليا وطلب توصيات.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يعمل مدير مشروع مع فريق Scrum يواجه صعوبة في الالتزام بالمواعيد النهائية. بعد التحليل، اكتشف مدير المشروع وجود عدم توافق في الكفاءات داخل أحد الفرق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: توفير تدريب مناسب لتعويض عدم التوافق.\n\n- لماذا؟\nعدم التوافق في الكفاءات يمكن أن يؤدي إلى ضعف الأداء والتأخير، وتوفير التدريب المناسب يعزز مهارات الفريق ويقلل الفجوات التقنية، مما يساعد الفريق على الالتزام بالمواعيد النهائية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- قبول المخاطرة المتعلقة بتأخر المشروع يعني تجاهل المشكلة دون محاولة حلها.\n- تحديث جدول المشروع لعكس التأخير يعالج الأعراض وليس السبب.\n- التأكيد على أهمية الالتزام بالمواعيد وحده لا يحل مشكلة نقص الكفاءة.",
  "choices": [
    {
      "text": "قبول المخاطرة المتعلقة بتأخر المشروع بسبب عدم التوافق.",
      "correct": false
    },
    {
      "text": "توفير تدريب مناسب لتعويض عدم التوافق.",
      "correct": true
    },
    {
      "text": "تحديث جدول المشروع لعكس التأخير.",
      "correct": false
    },
    {
      "text": "التأكيد على أهمية الالتزام بالمواعيد النهائية المتفق عليها.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تقوم شركة كبيرة بالتحول من النهج التنبؤي إلى النهج الرشيق (Agile). يواجه أحد الفرق، الذي لديه معرفة بممارسات Agile، صراعات كبيرة مع المدراء التنفيذيين بشأن العمليات التي يجب اتباعها.\n\nكيف يجب حل هذه الصراعات؟",
  "explanation": "الإجابة الصحيحة: تدريب المدراء التنفيذيين على ممارسات Agile.\n\n- لماذا؟\nتدريب المدراء التنفيذيين يساعدهم على فهم ممارسات Agile وأهدافها، مما يقلل الصراعات ويعزز دعمهم للفريق ويُسهل التحول الثقافي في المؤسسة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التفاوض على عملية محددة قد يكون صعبًا دون فهم عميق لممارسات Agile.\n- إشراك المدراء في اجتماعات الاستعراض قد لا يكون كافيًا لفهم كامل الممارسات.\n- مطالبة المدراء باستخدام Agile دون تدريب قد يؤدي إلى مقاومة وعدم تعاون.",
  "choices": [
    {
      "text": "التفاوض مع المدراء التنفيذيين والاتفاق على عملية محددة.",
      "correct": false
    },
    {
      "text": "تدريب المدراء التنفيذيين على ممارسات Agile.",
      "correct": true
    },
    {
      "text": "إشراك المدراء التنفيذيين في اجتماعات الاستعراض الذاتي (Retrospectives).",
      "correct": false
    },
    {
      "text": "مطالبة المدراء التنفيذيين باستخدام ممارسات Agile.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يستضيف أحد أعضاء الفريق حدثًا ويدعو عدة زملاء من خلال تقويمات العمل الخاصة بهم. عضو فريق آخر لم تتم دعوته إلى الحدث يبدو مشتتًا بشكل واضح خلال عدة اجتماعات وقوف.\n\nماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: تحديد اجتماع مع عضو الفريق المشتت لمناقشة أية مشكلات.\n\n- لماذا؟\nعندما يظهر عضو الفريق علامات تشتيت، من المهم أن يتواصل مدير المشروع معه مباشرة لفهم الأسباب والعمل على حلها لضمان بيئة عمل متجانسة وداعمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب تحديد الحدث كخاص لا يعالج سبب التشتيت.\n- استخدام وسائل تواصل خاصة قد لا يحل المشكلة الجذرية.\n- إضافة قسم للفعاليات الاجتماعية في ميثاق المشروع قد يكون غير عملي ولا يعالج المشكلة الفردية.",
  "choices": [
    {
      "text": "يطلب من الشخص الذي يستضيف الحدث أن يحدده كحدث خاص.",
      "correct": false
    },
    {
      "text": "تحديد اجتماع مع عضو الفريق المشتت لمناقشة أية مشكلات.",
      "correct": true
    },
    {
      "text": "يطلب من الشخص الذي يستضيف الحدث استخدام وسائل تواصل خاصة.",
      "correct": false
    },
    {
      "text": "إضافة قسم للفعاليات الاجتماعية في ميثاق المشروع للتعامل مع هذه المواقف.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير المشروع مشروعًا هجينًا. تواصل أحد أصحاب المصلحة مباشرة مع أحد أعضاء الفريق وطلب تغييرًا. أدى هذا الطلب إلى تشتيت انتباه عضو الفريق مما تسبب في انخفاض الإنتاجية.\n\nماذا يجب أن يفعل عضو الفريق؟",
  "explanation": "الإجابة الصحيحة: إبلاغ Scrum Master بطلب التغيير من صاحب المصلحة والتأثير الناتج على الإنتاجية.\n\n- لماذا؟\nScrum Master هو المسؤول عن تسهيل العملية والتعامل مع طلبات التغيير بطريقة منظمة للحفاظ على تركيز الفريق والإنتاجية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ صاحب المصلحة مباشرة عن الإجراء الصحيح بدون إشراك Scrum Master قد يفتقر إلى التنسيق.\n- تقديم الطلب مباشرة إلى لجنة التحكم بالتغييرات قد لا يكون سريعًا أو عمليًا في بيئة هجين.\n- إبلاغ Scrum Master لمناقشة التغيير مع صاحب المصلحة هو خطوة لاحقة بعد إبلاغه بالأثر.",
  "choices": [
    {
      "text": "إبلاغ صاحب المصلحة بأن الإجراء الصحيح للمتطلبات الجديدة هو إرسالها مباشرة إلى مدير المشروع.",
      "correct": false
    },
    {
      "text": "إبلاغ صاحب المصلحة بأن الإجراء الصحيح للمتطلبات الجديدة هو تقديمها مباشرة إلى لجنة التحكم بالتغييرات.",
      "correct": false
    },
    {
      "text": "إبلاغ Scrum Master بطلب التغيير من صاحب المصلحة والتأثير الناتج على الإنتاجية.",
      "correct": true
    },
    {
      "text": "إبلاغ Scrum Master لكي يتم مناقشة التغيير مباشرة مع صاحب المصلحة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "في مصنع صناعي، قرر المالك إضافة قدرة إنتاجية عن طريق تركيب آلة جديدة وتحديث البرنامج المستخدم في الإنتاج. سيتم تنفيذ هذا التوسع أثناء استمرار المصنع في العمل والإنتاج. سيتم تحديث البرنامج باستخدام منهجية Agile لتقليل المخاطر، في حين أن شراء وتركيب الآلة سيتم باستخدام منهجية تنبؤية.\n\nما نوع الاتصالات التي يجب أن يصممها مدير المشروع في خطة إدارة الجدول الزمني لضمان التزام المشروع بالمواعيد؟",
  "explanation": "الإجابة الصحيحة: اجتماعات أسبوعية في نفس الموقع مع أصحاب المصلحة المعنيين.\n\n- لماذا؟\nاجتماعات أسبوعية متكررة في نفس الموقع تساعد على التنسيق الفوري بين الفرق التي تستخدم منهجيات مختلفة وتضمن تبادل المعلومات والتحديثات المستمرة، مما يقلل من المخاطر ويساعد في التزام المشروع بالمواعيد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التقارير المكتوبة كل أسبوعين قد تتأخر في نقل المعلومات ولا تسمح بالتفاعل الفوري.\n- الاجتماعات الفردية الأسبوعية قد لا توفر التنسيق الجماعي الضروري.\n- المكالمات الجماعية كل أسبوعين أقل تواترًا ولا تحقق التواصل المستمر المطلوب.",
  "choices": [
    {
      "text": "اجتماعات أسبوعية في نفس الموقع مع أصحاب المصلحة المعنيين.",
      "correct": true
    },
    {
      "text": "تقارير حالة مكتوبة كل أسبوعين من أصحاب المصلحة المعنيين.",
      "correct": false
    },
    {
      "text": "اجتماعات أسبوعية فردية مع كل من أصحاب المصلحة المعنيين.",
      "correct": false
    },
    {
      "text": "مكالمات جماعية كل أسبوعين مع أصحاب المصلحة المعنيين.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مشروع Agile في دورته الخامسة من أصل 10. بعد الاستعراض الأخير (Retrospective)، أدرك أعضاء الفريق أنهم اضطروا للعمل لساعات إضافية لإنجاز العمل المتفق عليه.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: إجراء استعراض مركّز (Retrospective) لمساعدة الفريق على اكتشاف السبب الجذري.\n\n- لماذا؟\nالاستعراض المركّز يسمح للفريق بالتعمق في الأسباب التي أدت إلى الحاجة للعمل الإضافي، مما يمكنهم من اتخاذ إجراءات تصحيحية مستدامة لتحسين التخطيط والتنفيذ في الدورات القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب تقديم التزام أقل قد يكون حلاً مؤقتًا لكنه لا يعالج الأسباب الحقيقية.\n- طلب أعضاء إضافيين قد يضيف تعقيدات إدارية وربما لا يحل المشكلة الجذرية.\n- تنفيذ نقطة فحص منتصف الدورة لا يضمن كشف الأسباب الجذرية للعمل الإضافي.",
  "choices": [
    {
      "text": "طلب من الفريق تقديم التزام أقل في الدورة التالية.",
      "correct": false
    },
    {
      "text": "طلب أعضاء إضافيين للحفاظ على سرعة الإنجاز.",
      "correct": false
    },
    {
      "text": "إجراء استعراض مركّز (Retrospective) لمساعدة الفريق على اكتشاف السبب الجذري.",
      "correct": true
    },
    {
      "text": "تنفيذ نقطة فحص في منتصف الدورة للتحقق مما إذا كان الفريق يسير على الطريق الصحيح.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يتم تنفيذ المشروع حاليًا باستخدام دورة حياة تنبؤية، ومع ذلك، سيتم تسليم منتج رئيسي بشكل تدريجي إلى العميل. الموارد المعينة تتمتع بخبرة وموثوقية ومستعدة لاتخاذ قرارات كان مدير المشروع يتخذها بعد كل تسليم تدريجي في مشاريع سابقة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: دعم قرارات الفريق ونقل مسؤولية اتخاذ القرار إليهم.\n\n- لماذا؟\nعندما تكون الموارد موثوقة وذات خبرة، وتمتلك المعرفة لاتخاذ القرارات، فإن تفويض القرار يعزز الاستقلالية ويحفز الفريق، مما يزيد من سرعة وكفاءة العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إبلاغ الفريق بأن مدير المشروع هو المسؤول عن اتخاذ القرارات يقلل من استقلالية الفريق ولا يتناسب مع بيئة التسليم التدريجي.\n- التشاور مع مالك المنتج قد يضيف طبقة إدارية غير ضرورية في هذه الحالة.\n- جدولة اجتماع مع اللجنة التوجيهية غير ضروري وقد يبطئ العملية.",
  "choices": [
    {
      "text": "إبلاغ الفريق بأنه رغم أن البيئة هجينة، لا يزال مدير المشروع مسؤولًا عن اتخاذ القرارات.",
      "correct": false
    },
    {
      "text": "التشاور مع مالك المنتج حول السماح للموارد باتخاذ القرارات.",
      "correct": false
    },
    {
      "text": "دعم قرارات الفريق ونقل مسؤولية اتخاذ القرار إليهم.",
      "correct": true
    },
    {
      "text": "جدولة اجتماع مع اللجنة التوجيهية للحصول على الموافقة على الطلب.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يعمل فريق منذ شهرين ومع ذلك يفشل باستمرار في تنفيذ قصص المستخدم المخططة. كيف يجب على مدير المشروع التعامل مع هذه المشكلة؟",
  "explanation": "الإجابة الصحيحة: التأكد من أن حجم الدورة مناسب لمدة التكرار.\n\n- لماذا؟\nاختيار حجم دورة (Sprint) مناسب أمر مهم لضمان أن الفريق يمكنه تسليم قصص المستخدم ضمن الإطار الزمني المحدد، مما يحسن من الالتزام بالخطة ويزيد من الإنتاجية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تغيير مدة الدورة بشكل عشوائي قد يؤدي إلى تأثير سلبي على استقرار الفريق.\n- توظيف مورد عالي المهارة قد لا يحل المشكلة إذا كانت مرتبطة بحجم الدورة.\n- استخدام نظام مكافآت قد يحفز الفريق مؤقتًا لكنه لا يعالج الأسباب الجوهرية للفشل.",
  "choices": [
    {
      "text": "تشجيع تغيير مدة الدورة من أجل الالتزام بالخطة.",
      "correct": false
    },
    {
      "text": "التأكد من أن حجم الدورة مناسب لمدة التكرار.",
      "correct": true
    },
    {
      "text": "الانخراط في توظيف مورد عالي المهارة لتعزيز القدرات.",
      "correct": false
    },
    {
      "text": "النظر في استخدام نظام مكافآت لتشجيع التسليم في الوقت المحدد.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع مشروعًا باستخدام نهج هجين وطلب من عضو فريق كبير إجراء تحليل كمي للمخاطر. رد عضو الفريق بأنه لا يملك المعرفة الكافية للقيام بهذا التحليل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: مساعدة عضو الفريق على إجراء التحليل الكمي من خلال التوجيه والتدريب.\n\n- لماذا؟\nتوفير الدعم والتدريب يعزز مهارات الفريق ويضمن إنجاز العمل بدقة، كما يبني قدرة الفريق على التعامل مع مهام مشابهة مستقبلًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصعيد المشكلة إلى المدير الوظيفي قد يؤدي إلى تأخير ولا يعالج نقص المعرفة بشكل مباشر.\n- الاتصال بمكتب إدارة المشاريع (PMO) قد لا يكون الحل الأمثل عندما يمكن تطوير مهارات الفريق داخليًا.\n- تنفيذ التحليل بدلًا من عضو الفريق يقلل من فرص بناء القدرات في الفريق.",
  "choices": [
    {
      "text": "تصعيد المشكلة إلى المدير الوظيفي.",
      "correct": false
    },
    {
      "text": "الاتصال بمكتب إدارة المشاريع (PMO) وطلب تعيين عضو آخر لديه المعرفة المناسبة.",
      "correct": false
    },
    {
      "text": "مساعدة عضو الفريق على إجراء التحليل الكمي من خلال التوجيه والتدريب.",
      "correct": true
    },
    {
      "text": "تنفيذ التحليل الكمي للمخاطر بدلًا من عضو الفريق.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تقوم شركة نقل بتحويل عملياتها التشغيلية والنظام الرئيسي المستخدم لتحريك الشحنات. تم وضع بيان النطاق، وتم الاتفاق على نهج تسليم تدريجي من قبل جميع أصحاب المصلحة.\n\nما الذي يحتاج مدير المشروع إلى القيام به بعد ذلك لمساعدة الفريق على فهم العمل المطلوب؟",
  "explanation": "الإجابة الصحيحة: العمل مع الفريق لتفصيل النطاق إلى هيكل تقسيم العمل وحزم عمل لإنشاء التسليمات والجداول المطلوبة.\n\n- لماذا؟\nتفصيل النطاق إلى هيكل تقسيم العمل يساعد في تحويل الأهداف العامة إلى مهام واضحة وقابلة للتنفيذ، مما يسهل إدارة المشروع وتنظيم العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعداد خطة إدارة المشروع يتطلب فهمًا واضحًا للنطاق أولاً.\n- العمل مباشرة مع أصحاب المصلحة على التعيينات دون تفصيل هيكل العمل قد يؤدي إلى عدم وضوح المسؤوليات.\n- إنشاء خطة إدارة المتطلبات مهم لاحقًا بعد تحديد هيكل تقسيم العمل.",
  "choices": [
    {
      "text": "البدء في إعداد خطة إدارة المشروع تتضمن الحزم الزمنية والجدول التفصيلي وتوزيع المهام.",
      "correct": false
    },
    {
      "text": "العمل مباشرة مع أصحاب المصلحة على هيكل تقسيم العمل وتعيين المهام لكل عضو فريق.",
      "correct": false
    },
    {
      "text": "العمل مع الفريق لتفصيل النطاق إلى هيكل تقسيم العمل وحزم عمل لإنشاء التسليمات والجداول المطلوبة.",
      "correct": true
    },
    {
      "text": "إنشاء خطة إدارة المتطلبات وتعيينها لأعضاء الفريق.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أدى مشروع طويل وممتد إلى إنهاك فريق المشروع. بسبب مشكلات في الموعد النهائي، لا يستطيع مدير المشروع تمديد الجدول الزمني.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
  "explanation": "الإجابة الصحيحة: مناقشة الوضع مع الفريق.\n\n- لماذا؟\nمناقشة الوضع مع الفريق يساعد في فهم التحديات الحقيقية، وإيجاد حلول مشتركة لتحسين الأداء أو تعديل الأولويات ضمن الجدول الزمني المحدد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة ميثاق المشروع لا تعالج المشكلة الحالية مباشرة.\n- تقديم المزيد من التقدير قد يكون جيدًا لكنه لا يحل مشكلة الإرهاق أو الجدول الزمني.\n- طلب موارد إضافية قد لا يكون متاحًا أو ممكنًا بسبب القيود الزمنية.",
  "choices": [
    {
      "text": "مراجعة ميثاق المشروع.",
      "correct": false
    },
    {
      "text": "تقديم المزيد من التقدير لأعضاء الفريق.",
      "correct": false
    },
    {
      "text": "مناقشة الوضع مع الفريق.",
      "correct": true
    },
    {
      "text": "طلب موارد إضافية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "بسبب حادثة حديثة، قدم أحد أصحاب المصلحة غير الراضين شكوى حول مشروع تم إغلاقه بالفعل.\n\nما الذي يمكن لمدير المشروع فعله للمساعدة في حل هذا؟",
  "explanation": "الإجابة الصحيحة: مراجعة أرشيف نظام معلومات إدارة المشروع (PMIS).\n\n- لماذا؟\nمراجعة أرشيف PMIS يتيح لمدير المشروع الوصول إلى جميع الوثائق والتقارير المتعلقة بالمشروع المغلق، مما يساعد في فهم القضية والرد بشكل مناسب على الشكوى.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تنفيذ خطة إدارة العلاقات عادة يكون أثناء تنفيذ المشروع وليس بعد الإغلاق.\n- التشاور مع راعي المشروع قد يكون مفيدًا لكنه ليس الخطوة الأولى دون جمع المعلومات.\n- تحديث سجل المخاطر غير ملائم لمشروع تم إغلاقه.",
  "choices": [
    {
      "text": "تنفيذ خطة إدارة العلاقات.",
      "correct": false
    },
    {
      "text": "التشاور مع راعي المشروع لإدارة صاحب المصلحة غير الراضي.",
      "correct": false
    },
    {
      "text": "مراجعة أرشيف نظام معلومات إدارة المشروع (PMIS).",
      "correct": true
    },
    {
      "text": "تحديث سجل المخاطر.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال اجتماع لجنة توجيه المشروع، أبلغ مدير المشروع أن أحد أعضاء الفريق الرئيسيين الذين كانوا داعمين سابقًا أصبحوا مقاومين وسلبيين تجاه التغييرات. أين يجب توثيق هذه المعلومة؟",
  "explanation": "الإجابة الصحيحة: مصفوفة تقييم مشاركة أصحاب المصلحة.\n\n- لماذا؟\nمصفوفة تقييم مشاركة أصحاب المصلحة توثق مستوى دعم وتفاعل كل صاحب مصلحة، وتتبع تغييرات المواقف والتأثير على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مصفوفة RACI توضح الأدوار والمسؤوليات لكنها لا تتابع سلوك أو موقف أصحاب المصلحة.\n- سجل المخاطر والقضايا يركز على المشكلات والمخاطر وليس على مواقف أصحاب المصلحة بشكل مباشر.\n- تقارير أداء العمل تركز على تقدم العمل وليس على تقييم أصحاب المصلحة.",
  "choices": [
    {
      "text": "مصفوفة المسؤولية والمساءلة والتشاور والإعلام (RACI)",
      "correct": false
    },
    {
      "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
      "correct": true
    },
    {
      "text": "سجل المخاطر وسجل القضايا",
      "correct": false
    },
    {
      "text": "تقارير أداء العمل",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يتلقى الفريق نتائج تم التعاقد على تنفيذها خارجيًا ويحدد أنها لا تفي بمعايير القبول المتفق عليها. ما الذي يجب على مدير المشروع الرجوع إليه للتحقق من ذلك مع البائع؟",
  "explanation": "الإجابة الصحيحة: بيان العمل (SOW).\n\n- لماذا؟\nبيان العمل يحدد نطاق العمل، معايير القبول، والمتطلبات التي يجب أن يلتزم بها البائع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة المشتريات تتعلق بكيفية إدارة عمليات الشراء لكنها لا تحدد معايير القبول.\n- طلب تقديم العروض (RFP) هو مستند دعائي قبل التعاقد وليس مرجعًا لتقييم العمل بعد التنفيذ.\n- عمليات التفتيش تستخدم للتحقق من جودة العمل لكنها لا تحتوي على تفاصيل الاتفاقيات التعاقدية.",
  "choices": [
    {
      "text": "خطة إدارة المشتريات",
      "correct": false
    },
    {
      "text": "طلب تقديم العروض (RFP)",
      "correct": false
    },
    {
      "text": "بيان العمل (SOW)",
      "correct": true
    },
    {
      "text": "عمليات التفتيش",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع في منظمة متعددة الوظائف يحتاج إلى إبلاغ مدير القسم بعدد ونوع الموارد المطلوبة، ومدة الحاجة إليها. ما الأداة التي يجب أن يستخدمها مدير المشروع لتقديم هذه المعلومات؟",
  "explanation": "الإجابة الصحيحة: مخطط التوزيع البياني للموارد.\n\n- لماذا؟\nمخطط التوزيع البياني للموارد يوضح كمية الموارد المطلوبة عبر فترة زمنية، مما يساعد مديري الأقسام على فهم الحاجة للموارد وتخطيطها بشكل أفضل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تعيينات الموارد تركز على من هو المسؤول عن المهام لكن لا توضح مقدار أو فترة استخدام الموارد.\n- مصفوفة توزيع المسؤوليات (RAM) توضح توزيع الأدوار والمسؤوليات لكنها لا تعرض تفاصيل كمية الموارد أو مدتها.\n- مخطط هيكل تنظيم المشروع يوضح الهيكل الإداري للفريق وليس تفاصيل الموارد المطلوبة.",
  "choices": [
    {
      "text": "تعيينات الموارد",
      "correct": false
    },
    {
      "text": "مخطط التوزيع البياني للموارد",
      "correct": true
    },
    {
      "text": "مصفوفة توزيع المسؤوليات (RAM)",
      "correct": false
    },
    {
      "text": "مخطط هيكل تنظيم المشروع",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يصر أحد أصحاب المصلحة المتطلبين على إضافة ميزة إضافية إلى منتج المشروع دون تغيير النطاق أو الميزانية أو الجدول الزمني. يسمح مدير المشروع بإضافة هذه الميزة لأنها تضيف قيمة كبيرة للمنتج النهائي، لكنه يكتشف لاحقًا أن إضافتها أطالت الجدول الزمني وزادت التكاليف.\nما العملية التي كان ينبغي على مدير المشروع اتباعها قبل إضافة الميزة؟",
  "explanation": "الإجابة الصحيحة: مراقبة التغييرات.\n\n- لماذا؟\nعملية مراقبة التغييرات تسمح بتقييم تأثير أي تغييرات على النطاق والجدول والميزانية قبل الموافقة عليها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تخطيط الجدول الزمني يتعلق بإنشاء الجدول لكن لا يتحكم في طلبات التغيير.\n- تخطيط المشتريات يركز على عمليات الشراء وليس التغييرات في نطاق المشروع.\n- تدقيق الجودة يختبر جودة المنتج وليس إدارة تغييرات النطاق أو الجدول.",
  "choices": [
    {
      "text": "مراقبة التغييرات",
      "correct": true
    },
    {
      "text": "تخطيط الجدول الزمني",
      "correct": false
    },
    {
      "text": "تخطيط المشتريات",
      "correct": false
    },
    {
      "text": "تدقيق الجودة",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم الانتهاء من مشروع لإنشاء منتج جديد وإطلاقه في السوق، ولكن كانت المبيعات أقل بكثير من المتوقع. أظهرت التحليلات أن المنتج لا يتماشى مع الكفاءات الأساسية للمنظمة.\n\nفي أي نشاط كان يجب اكتشاف هذا الخلل؟",
  "explanation": "الإجابة الصحيحة: مراجعة دراسة الجدوى.\n\n- لماذا؟\nدراسة الجدوى تُجرى في مرحلة مبكرة لتقييم ما إذا كان المشروع يتوافق مع أهداف المنظمة وكفاءاتها الأساسية قبل البدء بالتنفيذ.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل سيناريوهات ماذا لو يُستخدم لتقييم المخاطر والاحتمالات وليس لتحديد توافق المنتج مع الكفاءات.\n- تقييم الأداء الاستراتيجي يُركز على مراجعة الأداء بعد التنفيذ وليس أثناء التخطيط.\n- تحديد النطاق يحدد مخرجات المشروع لكنه لا يتعمق في توافقها مع الكفاءات الأساسية.",
  "choices": [
    {
      "text": "تحليل سيناريوهات ماذا لو",
      "correct": false
    },
    {
      "text": "مراجعة دراسة الجدوى",
      "correct": true
    },
    {
      "text": "تقييم الأداء الاستراتيجي",
      "correct": false
    },
    {
      "text": "تحديد النطاق",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يتم تدقيق مشروع للتأكد من الالتزام بسياسات المؤسسة. ما هي العملية التي يتم تنفيذها؟",
  "explanation": "الإجابة الصحيحة: إدارة الجودة.\n\n- لماذا؟\nإدارة الجودة تشمل مراجعة الالتزام بالسياسات والمعايير وضمان تطبيقها خلال تنفيذ المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تدقيق الجدول الزمني يركز فقط على الجدول وليس على الالتزام بالسياسات.\n- تخطيط إدارة الجودة يحدد كيف ستتم إدارة الجودة لكنه ليس عملية التدقيق نفسها.\n- ضبط الجودة يركز على التحقق من المخرجات وليس التدقيق في الالتزام بالسياسات.",
  "choices": [
    {
      "text": "تدقيق الجدول الزمني",
      "correct": false
    },
    {
      "text": "تخطيط إدارة الجودة",
      "correct": false
    },
    {
      "text": "ضبط الجودة",
      "correct": false
    },
    {
      "text": "إدارة الجودة",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء العمل على مشروع، أدرك فريق المشروع أن ترقيات مركز البيانات الأخيرة قد تؤثر على نتائج المشروع. بعض وحدات المخرجات غير متوافقة مع البيئة الجديدة. حدد الفريق الخطوات المناسبة لمعالجة المشكلة.\n\nما هي الخطوة التالية لمدير المشروع؟",
  "explanation": "الإجابة الصحيحة: تقديم طلب تغيير.\n\n- لماذا؟\nعند اكتشاف تأثير على مخرجات المشروع بسبب تغييرات بيئية أو غير متوقعة، يجب على مدير المشروع تقديم طلب تغيير رسمي لإدارة تأثير هذه المشكلة وضمان مراجعتها واعتمادها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب زيادة في الميزانية قد يكون لاحقًا بعد تقييم التغيير وليس الخطوة الأولى.\n- تغيير جدول المشروع يتم بعد الموافقة على التغيير وليس قبل.\n- تحديث وثيقة المتطلبات يتم بعد موافقة التغيير وليس قبله.",
  "choices": [
    {
      "text": "طلب زيادة في الميزانية.",
      "correct": false
    },
    {
      "text": "تقديم طلب تغيير.",
      "correct": true
    },
    {
      "text": "تغيير جدول المشروع.",
      "correct": false
    },
    {
      "text": "تحديث وثيقة المتطلبات.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تمت الموافقة على تغيير تصميم طلبه العميل من قبل مجلس مراقبة التغيير (CCB). ثم اكتشف مدير المشروع أن هذا التغيير سيتسبب في تأخير لمدة ثلاثة أشهر.\n\nماذا كان ينبغي على مدير المشروع فعله لتفادي ذلك؟",
  "explanation": "الإجابة الصحيحة: تقييم الطلب بدقة وفقًا لخطة إدارة المخاطر.\n\n- لماذا؟\nيجب تقييم جميع طلبات التغيير بعناية قبل الموافقة عليها، خاصةً فيما يتعلق بتأثيرها على الجدول الزمني والمخاطر، لتجنب تأخيرات أو مشكلات غير متوقعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- زيادة الميزانية وطلب موارد إضافية قد يكونان رد فعل بعد التقييم وليس أول خطوة.\n- إعادة تعريف النطاق يجب أن يتم بناءً على تقييم دقيق وليس بشكل مباشر.\n- تسريع الأعمال (crashing) يُعتبر خيارًا لإدارة التأخير لكنه ليس بديلًا للتقييم الصحيح للطلب.",
  "choices": [
    {
      "text": "زيادة الميزانية المصرح بها وطلب موارد إضافية",
      "correct": false
    },
    {
      "text": "إعادة تعريف نطاق المشروع ليشمل التصميم الجديد",
      "correct": false
    },
    {
      "text": "تسريع الأعمال وجدولة مضغوطة (crashing)",
      "correct": false
    },
    {
      "text": "تقييم الطلب بدقة وفقًا لخطة إدارة المخاطر",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تجري حاليًا أعمال بناء مرفق مستودع جديد. يقوم مدير المشروع بتنفيذ جهود لتطوير الفريق مثل التدريب، مما سيؤدي إلى تقليل معدل العيوب.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
  "explanation": "الإجابة الصحيحة: تحديث خطة إدارة الموارد.\n\n- لماذا؟\nبعد تنفيذ تدريب الفريق، يجب تحديث خطة إدارة الموارد لتعكس التغييرات في مهارات الفريق وقدراته، مما يساعد على مراقبة وتحسين جودة العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقديم برنامج تدريبي تم بالفعل.\n- زيادة مراجعات ضبط الجودة قد تكون لاحقة لكنها ليست الخطوة التالية الأساسية.\n- إضافة تكاليف التدريب إلى الميزانية يُفترض أنه تم قبل التنفيذ وليس بعده.",
  "choices": [
    {
      "text": "تقديم برنامج تدريبي.",
      "correct": false
    },
    {
      "text": "تحديث خطة إدارة الموارد.",
      "correct": true
    },
    {
      "text": "زيادة مراجعات ضبط الجودة.",
      "correct": false
    },
    {
      "text": "إضافة تكاليف التدريب إلى الميزانية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تستخدم شركة منهجية Lean Six Sigma في مشروع ما. في منتصف المشروع، يتم دعوة مستشار خارجي مختص بـ Lean لإجراء تدقيق لضمان التطبيق الصحيح للمنهجية.\n\nما هي العملية التي يتم تطبيقها؟",
  "explanation": "الإجابة الصحيحة: إدارة الجودة.\n\n- لماذا؟\nدعوة مستشار خارجي لإجراء تدقيق يندرج ضمن أنشطة إدارة الجودة التي تضمن التزام المشروع بالمعايير والإجراءات المطلوبة لتحقيق الجودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ضبط الجودة يركز على مراقبة العمليات وليس التدقيق الخارجي.\n- إجراء تحليل المخاطر النوعي يتعلق بتقييم المخاطر وليس التدقيق.\n- تخطيط إدارة الجودة يتم في بداية المشروع وليس أثناء التنفيذ.",
  "choices": [
    {
      "text": "إدارة الجودة",
      "correct": true
    },
    {
      "text": "ضبط الجودة",
      "correct": false
    },
    {
      "text": "إجراء تحليل المخاطر النوعي",
      "correct": false
    },
    {
      "text": "تخطيط إدارة الجودة",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقوم مدير مشروع ذو خبرة بالتحضير لاجتماع انطلاق لمشروع تقييم خدمة جديدة. تم توفير وصف عالي المستوى للخدمة.\n\nما الذي يجب أن يقوم به مدير المشروع أولاً؟",
  "explanation": "الإجابة الصحيحة: تطوير ميثاق المشروع.\n\n- لماذا؟\nتطوير ميثاق المشروع هو الخطوة الأولى الرسمية التي تمنح السلطة لبدء المشروع وتوفر إطارًا واضحًا للأهداف والتوقعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تطوير مصفوفة المسؤوليات (RACI) يأتي بعد تأسيس ميثاق المشروع.\n- تحديد بيان نطاق المشروع يتبع عادةً تطوير الميثاق.\n- إنشاء هيكل تقسيم العمل (WBS) يتم بعد تحديد النطاق بوضوح.",
  "choices": [
    {
      "text": "تطوير ميثاق المشروع.",
      "correct": true
    },
    {
      "text": "تطوير مصفوفة المسؤوليات (RACI).",
      "correct": false
    },
    {
      "text": "تحديد بيان نطاق المشروع.",
      "correct": false
    },
    {
      "text": "إنشاء هيكل تقسيم العمل (WBS).",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال مرحلة بدء المشروع، يراجع مدير المشروع دراسة الجدوى ويجد أن المعلومات غير مكتملة. ماذا يجب على مدير المشروع أن يفعل؟",
  "explanation": "الإجابة الصحيحة: مراجعة دراسة الجدوى مع الجهة الراعية للتأكد من توافق المشروع مع احتياجات العمل.\n\n- لماذا؟\nللتأكد من أن المشروع يتماشى مع أهداف العمل والتوجه الاستراتيجي، يجب مناقشة ودراسة أوجه النقص مع الراعي للحصول على توجيه واضح.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إضافة فجوة المعلومات إلى سجل المخاطر لا تحل المشكلة الأساسية.\n- مراجعة بيان العمل (SOW) لإنشاء الميثاق لا تعالج نقص المعلومات في دراسة الجدوى.\n- تعديل دراسة الجدوى يتم بعد الحصول على توجيهات واضحة من الراعي.",
  "choices": [
    {
      "text": "إضافة فجوة المعلومات إلى سجل المخاطر.",
      "correct": false
    },
    {
      "text": "مراجعة بيان العمل (SOW) لإنشاء ميثاق المشروع.",
      "correct": false
    },
    {
      "text": "تعديل دراسة الجدوى لتضييق نطاق المشروع وإنشاء ميثاق المشروع.",
      "correct": false
    },
    {
      "text": "مراجعة دراسة الجدوى مع الجهة الراعية للتأكد من توافق المشروع مع احتياجات العمل.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال تنفيذ المشروع، ظهرت مشكلة تتطلب تنفيذ خطة الطوارئ، مما سيؤثر على جدول المشروع.\n\nما الذي يجب على مدير المشروع القيام به؟",
  "explanation": "الإجابة الصحيحة: إصدار طلب تغيير.\n\n- لماذا؟\nعند تنفيذ خطة الطوارئ التي تؤثر على الجدول، يجب توثيق التغيير رسمياً من خلال طلب تغيير لضمان الموافقة والتتبع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- بدء تدقيق للمخاطر ليس الإجراء المناسب بعد تنفيذ خطة الطوارئ.\n- مراجعة تأثير التكلفة يجب أن تتم بعد إصدار طلب التغيير.\n- تحديث خطة الطوارئ لا يعالج تأثير التنفيذ على الجدول.",
  "choices": [
    {
      "text": "بدء تدقيق للمخاطر.",
      "correct": false
    },
    {
      "text": "إصدار طلب تغيير.",
      "correct": true
    },
    {
      "text": "مراجعة تأثير التكلفة.",
      "correct": false
    },
    {
      "text": "تحديث خطة الطوارئ.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "اكتشف مدير المشروع عيبًا كبيرًا في أحد المخرجات الرئيسية للمشروع. ما هي عملية إدارة المشروع التي يتم تنفيذها؟",
  "explanation": "الإجابة الصحيحة: ضبط الجودة.\n\n- لماذا؟\nضبط الجودة يتضمن التعرف على العيوب وتصحيحها لضمان أن المنتج النهائي يلبي المعايير والمتطلبات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إدارة الجودة تشمل تخطيط وضبط الجودة ولا تركز فقط على اكتشاف العيوب.\n- تخطيط إدارة الجودة يتم في مرحلة التخطيط وليس عند اكتشاف العيب.\n- المعاينة الإحصائية هي أداة تستخدم ضمن ضبط الجودة وليست العملية الكاملة.",
  "choices": [
    {
      "text": "إدارة الجودة",
      "correct": false
    },
    {
      "text": "ضبط الجودة",
      "correct": true
    },
    {
      "text": "تخطيط إدارة الجودة",
      "correct": false
    },
    {
      "text": "المعاينة الإحصائية",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء إعداد ميثاق المشروع لمشروع جديد، يراجع مدير المشروع الدروس المستفادة من المشاريع السابقة. تُظهر الوثائق مشكلات متكررة في انخفاض مستوى المشاركة وعدم التوافق بين أصحاب المصلحة حول أهداف المشروع.\n\nما الذي يجب على مدير المشروع فعله لتجنب تكرار هذه المشكلة في المشروع الجديد؟",
  "explanation": "الإجابة الصحيحة: بناء فهم مشترك بين أصحاب المصلحة حول المخرجات الرئيسية الموضحة في ميثاق المشروع المعتمد.\n\n- لماذا؟\nلإنشاء اتفاق جماعي واضح يحد من التباينات والاختلافات في الفهم بين أصحاب المصلحة، مما يعزز المشاركة والتوافق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- السماح لأي صاحب مصلحة بالانضمام إلى مجلس مراقبة التغيير (CCB) بدون ضوابط قد يزيد التعقيد ولا يحل المشكلة الأساسية.\n- إدراج جميع أصحاب المصلحة في مصفوفة تعيين المسؤوليات لا يضمن توافقهم ولا مشاركة فعالة.\n- دمج كل المتطلبات في هيكل تقسيم العمل بدون توحيد الرؤية قد يؤدي إلى تعقيدات وتضارب في الأهداف.",
  "choices": [
    {
      "text": "السماح لأي صاحب مصلحة بالانضمام إلى مجلس مراقبة التغيير (CCB) في أي وقت خلال المشروع.",
      "correct": false
    },
    {
      "text": "إدراج جميع أصحاب المصلحة في مصفوفة تعيين المسؤوليات (RAM) لقبول المخرجات.",
      "correct": false
    },
    {
      "text": "جمع جميع المتطلبات التي يقدمها كل صاحب مصلحة ودمجها في هيكل تقسيم العمل (WBS).",
      "correct": false
    },
    {
      "text": "بناء فهم مشترك بين أصحاب المصلحة حول المخرجات الرئيسية الموضحة في ميثاق المشروع المعتمد.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مشروع جديد يحتوي على درجة عالية من عدم اليقين في التكاليف المطلوبة لاستكماله. ما هو النهج الذي يجب أن يستخدمه مدير المشروع لتحديد التكاليف المتوقعة؟",
  "explanation": "الإجابة الصحيحة: التقدير بالنقاط الثلاث.\n\n- لماذا؟\nهذا النهج يدمج تقديرات متفائلة، متشائمة، والأكثر احتمالاً، مما يعكس عدم اليقين ويعطي تقديراً أكثر دقة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التقدير القياسي يعتمد على مشاريع سابقة قد لا تعكس عدم اليقين الحالي.\n- التقنيات الإحصائية تتطلب بيانات تاريخية كبيرة وقد لا تكون مناسبة في هذه الحالة.\n- التقدير البراميتري يعتمد على عوامل محددة بدقة وليس مثاليًا في حالات عدم اليقين العالية.",
  "choices": [
    {
      "text": "التقدير القياسي (Analogous estimating)",
      "correct": false
    },
    {
      "text": "تقنيات التقدير الإحصائي",
      "correct": false
    },
    {
      "text": "التقدير البراميتري",
      "correct": false
    },
    {
      "text": "التقدير بالنقاط الثلاث",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم اجتياز جميع ضوابط الجودة، وأصبح أحد مخرجات المشروع جاهزًا للتسليم للعميل. ومع ذلك، تم اعتماد طلب تغيير لإضافة معايير جودة جديدة.\n\nما الذي يجب أن يقوم به مدير المشروع أولاً؟",
  "explanation": "الإجابة الصحيحة: إيقاف تسليم المخرج إلى العميل.\n\n- لماذا؟\nلأنه بعد اعتماد طلب تغيير يضيف معايير جودة جديدة، يجب التوقف عن التسليم لضمان أن المخرج يلبي المعايير الجديدة قبل الإرسال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث خطة إدارة المشروع خطوة لاحقة بعد التوقف عن التسليم والتأكد من تطبيق التغيير.\n- استخدام المعايير الجديدة للمخرجات المستقبلية فقط قد يؤدي إلى تسليم مخرجات غير مطابقة للمعايير الحالية.\n- تحديث سجل المخاطر لا يعالج مباشرة حالة التوقف عن التسليم بسبب التغيير.",
  "choices": [
    {
      "text": "تحديث خطة إدارة المشروع.",
      "correct": false
    },
    {
      "text": "إيقاف تسليم المخرج إلى العميل.",
      "correct": true
    },
    {
      "text": "استخدام معايير الجودة الجديدة للمخرجات المستقبلية.",
      "correct": false
    },
    {
      "text": "تحديث سجل المخاطر.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء نشاط جماعي لتحديد أحد المدخلات لعملية تخطيط إدارة المشتريات، اختلف بعض المشاركين حول ترتيب عناصر متعلقة بالامتثال. ما الأداة أو التقنية التي يجب على مدير المشروع استخدامها لحل هذا الخلاف؟",
  "explanation": "الإجابة الصحيحة: تقنية المجموعة الاسمية.\n\n- لماذا؟\nهذه التقنية تساعد على جمع آراء المشاركين بشكل منظم وتقييمها للتوصل إلى توافق في الآراء خاصة في حالات الخلاف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مخطط التقارب يساعد في تجميع أفكار ولكنه لا يضمن ترتيب أو أولوية محددة في حالة الخلاف.\n- تحليل القرار متعدد المعايير يستخدم لتقييم الخيارات بناءً على معايير محددة وليس لحل خلافات في ترتيب العناصر.\n- العصف الذهني يُستخدم لتوليد الأفكار وليس لحل الخلافات أو الترتيب.",
  "choices": [
    {
      "text": "مخطط التقارب",
      "correct": false
    },
    {
      "text": "تحليل القرار متعدد المعايير",
      "correct": false
    },
    {
      "text": "تقنية المجموعة الاسمية",
      "correct": true
    },
    {
      "text": "العصف الذهني",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تقوم شركة متعددة الجنسيات بتطوير منتج رقمي محليًا باستخدام منصة تقنية جديدة. ويوجد الخبير الوحيد في هذه المنصة في المقر الرئيسي للشركة، وهو مسؤول عن تقديم الدعم لعدة دول.\n\nكيف يمكن لمدير المشروع المحلي ضمان مشاركة هذا الخبير؟",
  "explanation": "الإجابة الصحيحة: إدراج الخبير ضمن الفريق باستخدام بيئة افتراضية.\n\n- لماذا؟\nلضمان مشاركة الخبير بشكل فعال بالرغم من بعده الجغرافي، يمكن دمجه في الفريق عبر بيئة افتراضية توفر له وسيلة اتصال مستمرة وتشاركية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تصميم جدول سفر مكلف وغير عملي لدعم مستمر.\n- طلب تعيين الخبير كعضو دائم قد لا يكون ممكنًا بسبب مسؤولياته العديدة.\n- التواصل حسب الحاجة قد يؤدي إلى تأخير في الدعم ويؤثر على سير المشروع.",
  "choices": [
    {
      "text": "تصميم جدول سفر لضمان الدعم في الموقع في الوقت المناسب.",
      "correct": false
    },
    {
      "text": "إدراج الخبير ضمن الفريق باستخدام بيئة افتراضية.",
      "correct": true
    },
    {
      "text": "طلب من راعي المشروع تعيين الخبير كعضو دائم في الفريق.",
      "correct": false
    },
    {
      "text": "طلب من أعضاء الفريق التواصل مع الخبير كمصدر خارجي حسب الحاجة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء إغلاق المشروع، يجد مدير المشروع صعوبة في الحصول على ملاحظات إيجابية حول نجاح المشروع. بعض أصحاب المصلحة لا يوافقون على معايير نجاح المشروع وكانوا محبطين منذ بدايته.\n\nإلى ماذا يجب أن يرجع مدير المشروع لمعالجة هذه المخاوف؟",
  "explanation": "الإجابة الصحيحة: ميثاق المشروع.\n\n- لماذا؟\nميثاق المشروع هو الوثيقة التي تحدد معايير نجاح المشروع وتوقعات أصحاب المصلحة، وبالتالي يجب العودة إليه لمعالجة خلافات أو مخاوف أصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة إدارة الجودة تركز على جودة المنتج وليس تقييم النجاح العام.\n- بيان نطاق المشروع يحدد مكونات العمل لكنه لا يعالج معايير النجاح المتفق عليها.\n- وثائق المتطلبات تحدد الوظائف والمتطلبات، لكنها لا تغطي موافقات أصحاب المصلحة أو معايير النجاح.",
  "choices": [
    {
      "text": "ميثاق المشروع",
      "correct": true
    },
    {
      "text": "خطة إدارة الجودة",
      "correct": false
    },
    {
      "text": "بيان نطاق المشروع",
      "correct": false
    },
    {
      "text": "وثائق المتطلبات",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يكشف تقييم الأثر أن أحد المخرجات قد يتأخر لمدة أسبوعين. أحد الموارد الرئيسية لم يكن متاحًا للعمل على نشاط غير حرج بسبب أولويات أخرى. قد يؤدي ذلك إلى تحميل زائد للعمل على الموارد المتبقية.\n\nنظرًا لأن التكلفة تمثل قيدًا رئيسيًا في هذا المشروع، ما الذي يجب أن يفعله مدير المشروع فورًا؟",
  "explanation": "الإجابة الصحيحة: تحديد ما إذا كان لدى المهمة هامش زمني (Float) يسمح بتحقيق تاريخ نهاية المشروع.\n\n- لماذا؟\nبما أن التكلفة مقيدة، فإن تعيين موارد إضافية أو تغيير التقويم قد يرفع التكاليف. لذا، من الأفضل أولاً تحديد ما إذا كان يمكن استيعاب التأخير ضمن هامش زمني متاح دون التأثير على تاريخ التسليم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- توظيف مورد مؤقت قد يزيد من التكلفة.\n- تقليل النطاق قد يتطلب إعادة التفاوض مع أصحاب المصلحة.\n- تغيير تقويم الموارد قد يؤدي إلى تحميل زائد وزيادة في التكاليف.",
  "choices": [
    {
      "text": "تحديد ما إذا كان لدى المهمة هامش زمني (Float) يسمح بتحقيق تاريخ نهاية المشروع.",
      "correct": true
    },
    {
      "text": "توظيف مورد مؤقت للقيام بالمهمة.",
      "correct": false
    },
    {
      "text": "التشاور مع الفريق وتقليل النطاق.",
      "correct": false
    },
    {
      "text": "تغيير تقويم الموارد لتفادي التأخيرات الكبرى.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ينص ميثاق المشروع المعتمد على ضرورة استخدام منهجية رشيقة (Agile). خلال جلسة استخلاص الدروس المستفادة، أشار العميل إلى أن الفريق لم يتمكن من تقديم تقديرات تكلفة موثوقة، وأنه يجب تخصيص مزيد من الوقت لتحديد النطاق في التكرار الأول.\n\nما الدرس الذي يجب توثيقه في سجل الدروس المستفادة؟",
  "explanation": "الإجابة الصحيحة: يجب تعريف العميل مسبقًا على المنهجية الرشيقة لفهم عملية تقدير التكاليف.\n\n- لماذا؟\nتقديرات التكاليف في بيئة Agile تختلف عن النماذج التقليدية، لذا من الضروري توعية العميل بأسلوب العمل لتجنب توقعات غير واقعية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- رفض استخدام Agile غير عملي إذا كان المشروع محدد بهذه المنهجية.\n- تخصيص وقت لتحديد النطاق مهم لكنه ليس الدرس الأساسي المكتوب هنا.\n- تضمين العميل في الاجتماعات اليومية قد لا يحل مشكلة تقدير التكاليف بشكل مباشر.",
  "choices": [
    {
      "text": "يجب تعريف العميل مسبقًا على المنهجية الرشيقة لفهم عملية تقدير التكاليف.",
      "correct": true
    },
    {
      "text": "لا ينبغي استخدام المنهجية الرشيقة إذا كان العميل يتطلب تقديرات تكاليف موثوقة.",
      "correct": false
    },
    {
      "text": "يجب تخصيص وقت في التكرار الأول لتعريف النطاق والتأكد من دقة تقديرات التكاليف.",
      "correct": false
    },
    {
      "text": "يجب تضمين تواصل العميل في الاجتماعات اليومية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أبلغ مدير رفيع المستوى مدير المشروع أن أداء المشروع ليس جيدًا مقارنة بالمشاريع الأخرى. ما الذي يمكن لمدير المشروع استخدامه لتحسين الأداء في التكرارات التالية؟",
  "explanation": "الإجابة الصحيحة: جلسة مراجعة استعادية (Retrospective).\n\n- لماذا؟\nجلسة المراجعة الاستعادية تسمح للفريق بمراجعة الأداء، تحديد المشاكل، ووضع خطط لتحسين الأداء في التكرارات القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل قائمة الأعمال يركز على تحديد الأولويات وليس تحسين الأداء العام.\n- بناء الفريق وتحفيز الفريق مهمان لكن لا يوفران مراجعة منظمة لتحسين الأداء كما توفرها جلسة المراجعة الاستعادية.",
  "choices": [
    {
      "text": "جلسة مراجعة استعادية (Retrospective).",
      "correct": true
    },
    {
      "text": "تحليل قائمة الأعمال (Backlog).",
      "correct": false
    },
    {
      "text": "بناء الفريق.",
      "correct": false
    },
    {
      "text": "تحفيز الفريق.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تبدأ شركة مشروعًا جديدًا هجينًا للامتثال للوائح الحكومية الجديدة. حدد الفريق سرعة موثوقة تبلغ 40 نقطة قصة لكل تكرار. كل تكرار يستمر أسبوعين. يرغب الراعي في معرفة موعد الانتهاء إذا تبقى 800 نقطة قصة.",
  "explanation": "الإجابة الصحيحة: 10 أشهر.\n\n- لماذا؟\nلحساب الوقت اللازم لإنهاء 800 نقطة قصة بسرعة 40 نقطة لكل تكرار، نقسم 800 ÷ 40 = 20 تكرار.\nكل تكرار أسبوعين، 20 × 2 = 40 أسبوعًا.\nبما أن الشهر يحتوي على حوالي 4 أسابيع، 40 ÷ 4 = 10 أشهر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 4 ساعات، 8 أسابيع، و40 يومًا لا تتطابق مع حساب سرعة العمل ومدة التكرار.",
  "choices": [
    {
      "text": "4 ساعات",
      "correct": false
    },
    {
      "text": "8 أسابيع",
      "correct": false
    },
    {
      "text": "40 يومًا",
      "correct": false
    },
    {
      "text": "10 أشهر",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع في مشروع صناعي ضخم. الفريق موزع في ست دول ومناطق زمنية مختلفة. خلال اجتماع مراجعة، لوحظ أن تواريخ المعالم الأساسية التي تم تحديدها قد فاتت.\n\nما هو السبب الأرجح لتفويت هذه المواعيد النهائية؟",
  "explanation": "الإجابة الصحيحة: سوء التواصل داخل الفريق.\n\n- لماذا؟\nالفريق الموزع في مناطق زمنية مختلفة يواجه تحديات في التنسيق والتواصل، مما قد يؤدي إلى تأخير في متابعة المعالم النهائية والتنسيق الفعال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- نقص الالتزام والدعم قد يكون له تأثير، لكنه ليس السبب الأرجح في ظل وجود فريق موزع.\n- سوء فهم توقعات أصحاب المصلحة وتوقعات مرتفعة لا تؤدي بالضرورة لتأخر المواعيد النهائية بنفس الطريقة التي يؤثر بها ضعف التواصل.",
  "choices": [
    {
      "text": "نقص الالتزام والدعم.",
      "correct": false
    },
    {
      "text": "سوء التواصل داخل الفريق.",
      "correct": true
    },
    {
      "text": "سوء فهم توقعات أصحاب المصلحة.",
      "correct": false
    },
    {
      "text": "توقعات أصحاب المصلحة كانت مرتفعة جدًا.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم تكليف مديرة مشروع بمشروع جديد. بدأت بالعمل على وثائق المشروع، وبعد قراءتها لوثيقة ميثاق المشروع، بدأت في جمع المخاطر التي تراها. بعد أن أتمّت إعداد القائمة، متى يجب مراجعتها؟",
  "explanation": "الإجابة الصحيحة: بشكل منتظم وطوال مدة المشروع.\n\n- لماذا؟\nالمخاطر تتغير وتتطور أثناء دورة حياة المشروع، لذا يجب مراجعتها وتحديثها باستمرار لضمان التعامل معها بشكل فعال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة المخاطر فقط في نقاط معينة مثل بداية المشروع أو الاجتماعات الأسبوعية غير كافية للحفاظ على إدارة مخاطر فعالة طوال المشروع.",
  "choices": [
    {
      "text": "عند بدء المشروع ومع إغلاق كل خطر.",
      "correct": false
    },
    {
      "text": "أثناء تنظيم العمل، التحضير له، وتنفيذه.",
      "correct": false
    },
    {
      "text": "أثناء الاجتماعات الأسبوعية عند تحديد مخاطر جديدة وإضافتها.",
      "correct": false
    },
    {
      "text": "بشكل منتظم وطوال مدة المشروع.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "في بيئة تطوير رشيقة (أجايل)، متى يجب إجراء تحليل للمخاطر؟",
  "explanation": "الإجابة الصحيحة: قبل بدء كل تكرار (iteration).\n\n- لماذا؟\nفي منهجية أجايل، يتم تقييم وتحليل المخاطر بشكل مستمر ومتكرر قبل كل تكرار لتحديد وتخفيف المخاطر المحتملة التي قد تؤثر على الإنجاز في هذا التكرار.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- أثناء اجتماع الوقوف اليومي يركز على التقدم اليومي وليس بالضرورة على تحليل المخاطر العميق.\n- اجتماع الاستعراض (retrospective) يهدف لمراجعة العمل المنجز وتحسين العمليات، لكنه ليس الوقت الأمثل لتحليل المخاطر بشكل استباقي.\n- بعد كل اجتماع سكرم (scrum) لا يوجد اجتماع بهذا الاسم، والاجتماعات المعروفة هي التخطيط، الوقوف، الاستعراض، والرجوع.",
  "choices": [
    {
      "text": "قبل بدء كل تكرار (iteration)",
      "correct": true
    },
    {
      "text": "أثناء اجتماع الوقوف اليومي",
      "correct": false
    },
    {
      "text": "في اجتماع الاستعراض (retrospective)",
      "correct": false
    },
    {
      "text": "بعد كل اجتماع سكرم (scrum)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "لاحظ مدير المشروع وجود صراع شخصي واضح بين بعض أعضاء الفريق أثناء مرحلة بدء المشروع. متى يجب على مدير المشروع معالجة هذه المشكلة؟",
  "explanation": "الإجابة الصحيحة: في أقرب وقت ممكن لمنع تصاعد النزاع لاحقًا خلال المشروع.\n\n- لماذا؟\nالمشاكل الشخصية تؤثر على أداء الفريق وقد تتفاقم إذا لم يتم التعامل معها مبكرًا، مما قد يضر بجو العمل والتقدم في المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التذكير قبل كل اجتماع لا يعالج المشكلة الجذرية.\n- تحديد من هو على صواب قد يزيد النزاع.\n- الانتظار حتى نهاية المشروع قد يؤدي إلى تدهور الأجواء وتفاقم المشكلة.",
  "choices": [
    {
      "text": "في أقرب وقت ممكن لمنع تصاعد النزاع لاحقًا خلال المشروع",
      "correct": true
    },
    {
      "text": "قبل كل اجتماع من خلال تذكير الفريق بضرورة الاحترام المتبادل",
      "correct": false
    },
    {
      "text": "مباشرة بعد حدوث مشادة لتحديد من هو على صواب",
      "correct": false
    },
    {
      "text": "في نهاية المشروع للسماح بانخفاض حدة النزاع وتوثيقه في الدروس المستفادة",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم تعيين مدير مشروع جديد لقيادة مشروع لأول مرة ويشعر بالقلق من تصاعد التوتر. أعضاء الفريق يتجادلون خلال مرحلة تتطلب جهدًا كبيرًا، وقد أبدى أصحاب المصلحة بعض الشكوك حول أداء المشروع. خلال مناقشة مع مدير مشروع مخضرم، اعترف المدير الجديد بخوفه من الصراع وسأله عن كيفية نظرته للصراع.\n\nكيف يجب أن يرد مدير المشروع المخضرم؟",
  "explanation": "الإجابة الصحيحة: الصراع في المشاريع أمر لا مفر منه - ركّز على إدارته.\n\n- لماذا؟\nالصراع هو جزء طبيعي من العمل الجماعي في المشاريع، خاصة في المراحل التي تتطلب جهدًا كبيرًا. المهم هو عدم محاولة منعه بشكل كامل، بل إدارته بطريقة فعالة لضمان استمرار التعاون والإنتاجية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- القول بأن الصراع يمكن منعه غير واقعي ويقلل من أهمية إدارة الصراع.\n- وصف الصراع بأنه كارثي يسبب توترًا إضافيًا ولا يشجع على إيجاد حلول عملية.\n- القول بأن الصراع صحي ولا يتطلب تدخل قد يؤدي إلى تفاقم المشكلات والتأثير سلبًا على أداء الفريق.",
  "choices": [
    {
      "text": "الصراع في المشاريع أمر لا مفر منه - ركّز على إدارته.",
      "correct": true
    },
    {
      "text": "الصراع في المشاريع يمكن منعه - أعد تخطيط إجراءات التخفيف.",
      "correct": false
    },
    {
      "text": "الصراع في المشاريع كارثي - حضّر خطة تعافي.",
      "correct": false
    },
    {
      "text": "الصراع في المشاريع صحي - لا تتدخل.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يعمل فريق على مشروع تطوير منتج جديد معقد وسريع التغيير. بعد تقييم حديث للعملية، قرر الفريق إضافة أدوات أجايل إلى المنهج التنبؤي الذي يستخدمه. تهدف هذه الإضافة إلى تحسين تسليم المشروع بشكل عام ونجاحه وإنتاجيته.\n\nأي مما يلي يصف كيف تهدف هذه الإضافة إلى تحقيق قيمة مضافة للتسليم العام والنجاح والإنتاجية؟",
  "explanation": "الإجابة الصحيحة: استخدم أدوات الأجايل للاستفادة من قدرة منهجيات الأجايل على الاستجابة بفعالية للتغيير، مع الحفاظ على مزايا النهج التنبؤي لإدارة المشروع.\n\n- لماذا؟\nالنهج الهجين يدمج مزايا النهجين لتوفير مرونة أكبر في التعامل مع التغييرات دون فقدان التنظيم والتخطيط الدقيق للنهج التنبؤي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- استبدال جميع الأساليب التنبؤية قد يسبب فقدان بعض المزايا الأساسية للتحكم والتخطيط.\n- مقارنة الأجايل بالنهج التنبؤي لا تقدم قيمة فورية للمشروع الجاري.\n- السماح للفريق بالاختيار بين الأساليب قد يسبب تضاربًا في العمل وعدم وضوح في العمليات.",
  "choices": [
    {
      "text": "استخدم أدوات الأجايل للاستفادة من قدرة منهجيات الأجايل على الاستجابة بفعالية للتغيير، مع الحفاظ على مزايا النهج التنبؤي لإدارة المشروع.",
      "correct": true
    },
    {
      "text": "استخدم أدوات الأجايل لاستبدال جميع الأساليب التنبؤية بأساليب أجايل جديدة، وبالتالي تقليل ضعف الإنتاجية.",
      "correct": false
    },
    {
      "text": "استخدم أدوات الأجايل لمقارنة الأجايل بالأساليب التنبؤية، ثم اختر النهج الأفضل للمشاريع المستقبلية.",
      "correct": false
    },
    {
      "text": "استخدم أدوات الأجايل واطلب من أعضاء الفريق الاختيار بين الأجايل والأساليب التنبؤية حتى يعملوا بشكل أكثر فعالية وإنتاجية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع يشارك في تنفيذ مشروع عالمي وهو في طور تجنيد فريق المشروع. بعد تكوين الفريق، ماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: أرسل بريدًا ترحيبيًا واستضف فعالية تعريفية بالفريق حتى يتعرف الأعضاء على بعضهم البعض.\n\n- لماذا؟\nهذه الخطوة تعزز بناء العلاقات والتواصل بين أعضاء الفريق مما يساعد في تأسيس بيئة عمل إيجابية من البداية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إرسال خطة المشروع وميثاقه مهم لكنه ليس الخطوة الأولى بعد تكوين الفريق.\n- عقد اجتماع لمناقشة المخاوف حول المتطلبات خطوة لاحقة بعد بناء الثقة بين الفريق.\n- إرسال استبيان والتواصل عبر البريد الإلكتروني أقل فعالية في بناء تفاعل شخصي مباشر.",
  "choices": [
    {
      "text": "أرسل بريدًا ترحيبيًا واستضف فعالية تعريفية بالفريق حتى يتعرف الأعضاء على بعضهم البعض.",
      "correct": true
    },
    {
      "text": "أرسل خطة إدارة المشروع وميثاق المشروع لأعضاء الفريق ليطلعوا على أهداف المشروع وإجراءاته.",
      "correct": false
    },
    {
      "text": "رتب اجتماعًا لأعضاء الفريق لمناقشة أي مخاوف تتعلق بالمتطلبات ونطاق المشروع.",
      "correct": false
    },
    {
      "text": "أرسل استبيانًا لأعضاء الفريق للتعرف على كل عضو، وشارك النتائج عبر البريد الإلكتروني.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "في أي مرحلة من نموذج تطوير الفريق لتوكمان (Tuckman) يجب على مدير المشروع التركيز بشكل أكبر على زيادة تحفيز الفريق؟",
  "explanation": "الإجابة الصحيحة: مرحلة التكوين (Forming).\n\n- لماذا؟\nفي هذه المرحلة يبدأ الفريق في التعارف وبناء الثقة، وتحفيز الأعضاء يساعد على تأسيس روح الفريق والتوجه نحو الهدف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- العصف (Storming) مرحلة صراع وتحديات، لكنها ليست الوقت الأساسي للتحفيز.\n- التنظيم (Norming) مرحلة استقرار وتحسن العلاقات.\n- الأداء (Performing) مرحلة تنفيذ فعّالة حيث يكون التحفيز أقل حاجة لأنه بالفعل عالي.",
  "choices": [
    {
      "text": "مرحلة التكوين (Forming)",
      "correct": true
    },
    {
      "text": "مرحلة العصف (Storming)",
      "correct": false
    },
    {
      "text": "مرحلة التنظيم (Norming)",
      "correct": false
    },
    {
      "text": "مرحلة الأداء (Performing)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "لدى أحد أصحاب المصلحة التنفيذيين قوة اتخاذ قرار حاسمة في تنفيذ المشروع ونجاحه. كيف ينبغي أن ينعكس هذا الدور المهم في خطة إشراك أصحاب المصلحة؟",
  "explanation": "الإجابة الصحيحة: وصف مستوى دعم التنفيذي وتوقعاته وحدود المخاطر وأساليب التواصل المناسبة لمختلف احتياجات المشروع.\n\n- لماذا؟\nلأن هذه الطريقة تضمن تحديد الدور الحقيقي للتنفيذي بشكل دقيق، مع توضيح توقعاته ودعمه، مما يسهل إدارة العلاقة والتواصل الفعّال.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ترتيب التنفيذي في المخطط التنظيمي لا يعكس تأثيره الفعلي في المشروع.\n- تصنيفه كداعم مع تحديث معلومات الاتصال لا يكفي لتوضيح دوره وتأثيره.\n- وصف مشاركته السابقة قد لا يعكس الوضع الحالي بشكل دقيق ولا يحدد أساليب التواصل المناسبة.",
  "choices": [
    {
      "text": "وصف مستوى دعم التنفيذي وتوقعاته وحدود المخاطر وأساليب التواصل المناسبة لمختلف احتياجات المشروع.",
      "correct": true
    },
    {
      "text": "رتّب التنفيذي في مخطط تنظيمي وبيّن علاقاته أو خلافاته مع أصحاب مصلحة آخرين.",
      "correct": false
    },
    {
      "text": "صنّف التنفيذي على أنه 'داعم' وتأكد من تحديث البريد الإلكتروني ورقم الهاتف وأوقات الإجازات.",
      "correct": false
    },
    {
      "text": "صف مشاركة التنفيذي في مشاريع سابقة مماثلة لتحديد مستوى المشاركة المناسب على أساس كل حالة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "انضم خريج جديد مؤخرًا إلى فريق أبحاث وتطوير رشيق وناضج. الموجه المعيّن للعمل مع الخريج يشعر بالإرهاق من عبء العمل الإضافي. أداء الفريق وتحفيزه في تراجع.\n\nكيف يمكن لمدير المشروع المساعدة في هذا الوضع؟",
  "explanation": "الإجابة الصحيحة: الحفاظ على أسلوب القيادة غير التدخلي مع الفريق، ولكن استخدام أسلوب القيادة المعاملاتي لإعطاء توجيهات واضحة للخريج.\n\n- لماذا؟\nالأسلوب المعاملاتي يتيح توجيه الخريج بوضوح دون التدخل المفرط في عمل الفريق الناضج، مما يقلل العبء على الموجه ويحافظ على أداء الفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- أسلوب القيادة الخدمية قد يزيد العبء على الموجه.\n- إلغاء خطة التوجيه قد يؤثر سلبًا على تطوير الخريج.\n- طلب مشاركة إضافية من الفريق قد يرهق أعضاء الفريق الآخرين ويؤثر على الأداء.",
  "choices": [
    {
      "text": "الحفاظ على أسلوب القيادة غير التدخلي مع الفريق، ولكن استخدام أسلوب القيادة المعاملاتي لإعطاء توجيهات واضحة للخريج.",
      "correct": true
    },
    {
      "text": "اطلب من الموجه استخدام أسلوب القيادة الخدمية التعاونية للقيام بالمهام المعتادة بالإضافة إلى دور التوجيه.",
      "correct": false
    },
    {
      "text": "إلغاء خطة التوجيه والتركيز على تحفيز الخريج من خلال التعلم المكثف بالغمر.",
      "correct": false
    },
    {
      "text": "اطلب من ثلاثة أعضاء إضافيين في الفريق مشاركة دور التوجيه لتقليل عبء العمل الفردي بنسبة 75٪.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أعرب بعض أعضاء الفريق المكلّفين بمشروع تكنولوجيا جديدة عن عدم معرفتهم بالتكنولوجيا والتحديات التي سيواجهونها أثناء التنفيذ. ماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: طمئن أعضاء الفريق بأن هناك مسار تدريب معد لتعلم التكنولوجيا الجديدة.\n\n- لماذا؟\nيعد توفير التدريب الدعم الأمثل لتعزيز مهارات الفريق وتمكينهم من التعامل مع التحديات التقنية، مما يحافظ على استمرارية العمل وجودته.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاستبدال قد يسبب تأخيرات ويزيد التكلفة.\n- الاعتماد فقط على التعلم الذاتي قد لا يكون كافياً أو فعالاً.\n- إعادة التوزيع قد تؤدي إلى سوء استغلال الموارد وعدم استغلال مهارات الفريق بالكامل.",
  "choices": [
    {
      "text": "نظرًا لمواعيد التسليم، استبدل الأعضاء بموظفين أكثر دراية.",
      "correct": false
    },
    {
      "text": "اطلب من أعضاء الفريق إجراء بعض الأبحاث والتعلم الذاتي حول التكنولوجيا.",
      "correct": false
    },
    {
      "text": "أعد توزيع الأعضاء للعمل على مهام أخرى تتناسب مع خبراتهم.",
      "correct": false
    },
    {
      "text": "طمئن أعضاء الفريق بأن هناك مسار تدريب معد لتعلم التكنولوجيا الجديدة.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مشروع دوائي في مرحلة البدء من المحتمل أن يتأثر بلوائح سوقية جديدة. ما هي فئة أصحاب المصلحة التي يجب على مدير المشروع تخصيصها للجهة التنظيمية المعنية؟",
  "explanation": "الإجابة الصحيحة: خارجي ذو سلطة/تأثير مرتفع.\n\n- لماذا؟\nالجهة التنظيمية هي جهة خارجية تمتلك سلطة وتأثير كبير على سير المشروع من خلال اللوائح والتشريعات، لذا يجب تصنيفها على هذا الأساس.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الجهات الداخلية ليست معنية هنا.\n- الجهات ذات الدعم المقاوم أو المعارضة لا تنطبق على الجهات التنظيمية ذات السلطة والتأثير العالي.",
  "choices": [
    {
      "text": "خارجي ذو سلطة/تأثير مرتفع",
      "correct": true
    },
    {
      "text": "داخلي ذو سلطة/تأثير مرتفع",
      "correct": false
    },
    {
      "text": "داخلي بمستوى دعم مقاوم أو معارض",
      "correct": false
    },
    {
      "text": "خارجي بمستوى دعم مقاوم أو معارض",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تواصل أحد أعضاء الفريق مع مدير المشروع مباشرة بعد نهاية اجتماع المشروع بشأن حاجته إلى المساعدة في إكمال مهمة متأخرة.\n\nماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: ناقش المشكلة خلال الاجتماع اليومي، واتخذ القرار المناسب مع الفريق.\n\n- لماذا؟\nمشاركة المشكلة مع الفريق في الاجتماع اليومي يضمن الشفافية ويتيح للمدير وأعضاء الفريق التعاون لإيجاد أفضل حل بطريقة جماعية ومنظمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تجاهل الطلب قد يؤدي لتفاقم التأخير وضعف الروح المعنوية.\n- إعادة تخصيص المهمة بشكل فردي دون مناقشة قد يسبب توترات ويقلل التعاون.\n- تحميل عضو مبتدئ مهمة قد تؤدي إلى تراجع الجودة وعدم إنجاز المهمة في الوقت المناسب.",
  "choices": [
    {
      "text": "تجاهل طلب عضو الفريق، واطلب بذل جهد مضاعف لإكمال المهمة.",
      "correct": false
    },
    {
      "text": "ناقش المشكلة خلال الاجتماع اليومي، واتخذ القرار المناسب مع الفريق.",
      "correct": true
    },
    {
      "text": "اطلب من عضو الفريق الانسحاب من المهمة وأعد تخصيصها لشخص آخر.",
      "correct": false
    },
    {
      "text": "اطلب من عضو فريق مبتدئ المساعدة في إكمال المهمة في موعدها.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يواجه فريق المشروع قرارًا بشأن الخطوات التالية لمعالجة التأخيرات المكتشفة مؤخرًا في الجدول الزمني للمهام. يتوقع مدير المشروع من أعضاء الفريق اتخاذ القرارات المناسبة فيما يتعلق بالمهام الموكلة إليهم والمضي قدمًا في تنفيذها.\n\nما هو نمط القيادة الذي يستخدمه مدير المشروع في هذه الحالة؟",
  "explanation": "الإجابة الصحيحة: القيادة الحرة (Free rein).\n\n- لماذا؟\nهذا النمط يتيح للفريق حرية اتخاذ القرارات بشأن كيفية تنفيذ المهام، مع الحد الأدنى من تدخل المدير، مما يعزز الاستقلالية والمسؤولية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الديمقراطي يشمل مشاركة القرارات مع المدير بشكل فعال وليس ترك القرار بالكامل للفريق.\n- الاستبدادي يتحكم المدير في جميع القرارات ولا يترك حرية للفريق.\n- التسوية تعني تجنب الصراع وليست نمط قيادة مرتبط باتخاذ القرارات.",
  "choices": [
    {
      "text": "ديمقراطي",
      "correct": false
    },
    {
      "text": "استبدادي",
      "correct": false
    },
    {
      "text": "القيادة الحرة (Free rein)",
      "correct": true
    },
    {
      "text": "التسوية (Smoothing)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقوم فريق مشروع حاليًا بتحديد الفوائد المرتبطة بمشروعين لاختيار المشروع الذي سيقدم قيمة تجارية أكبر. تتضمن المهمة تحليل أي مشروع يساعد الشركة بشكل أفضل في تلبية متطلبات الامتثال والتنظيم، بالإضافة إلى تحسين رضا العملاء.\n\nأي من الفئات التالية تصف بشكل أفضل نوع الفوائد التي يتم تحليلها في هذه المهمة؟",
  "explanation": "الإجابة الصحيحة: فائدة نوعية.\n\n- لماذا؟\nالفوائد النوعية تتعلق بالعناصر غير القابلة للقياس بسهولة مثل رضا العملاء، الالتزام التنظيمي، وتحسين السمعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الفائدة الكمية تركز على الأرقام والقيم المالية أو المؤشرات القابلة للقياس بدقة.\n- فائدة الجودة ليست تصنيفًا شائعًا في تحليل الفوائد.\n- الفائدة الحقيقية مصطلح غير مستخدم في هذا السياق.",
  "choices": [
    {
      "text": "فائدة كمية",
      "correct": false
    },
    {
      "text": "فائدة نوعية",
      "correct": true
    },
    {
      "text": "فائدة جودة",
      "correct": false
    },
    {
      "text": "فائدة حقيقية",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تدرس شركة اعتماد منهجية أجايل (Agile) للمشاريع المستقبلية. يقود مدير المشروع مناقشة تركز على الفوائد المرتبطة بمنهجية أجايل.\n\nأي من النقاط التالية يجب أن يسلط مدير المشروع الضوء عليها؟",
  "explanation": "الإجابة الصحيحة: الشفافية عنصر أساسي، التسليم المبكر والموثوق، المنهجية تتبنى التغيير.\n\n- لماذا؟\nهذه النقاط تعكس القيم الأساسية لمنهجية أجايل، التي تركز على التكيف السريع مع التغيير، وتسليم القيمة بشكل مستمر، وتعزيز التعاون والشفافية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الخيار الثاني يتحدث عن منهجيات تنبؤية وليس أجايل.\n- الخيار الثالث يركز على بعض المبادئ الإدارية العامة وليس خصائص أجايل الأساسية.\n- الخيار الرابع يحتوي على مزيج من أفكار غير دقيقة أو غير مكتملة فيما يخص أجايل.",
  "choices": [
    {
      "text": "الشفافية عنصر أساسي، التسليم المبكر والموثوق، المنهجية تتبنى التغيير",
      "correct": true
    },
    {
      "text": "منهج قائم على المنتج، يقسم المشاريع إلى مراحل ذات قيمة، يركز على المبرر التجاري",
      "correct": false
    },
    {
      "text": "وجود توثيق واضح، نقطة مسؤولية واحدة، تعاون فعال",
      "correct": false
    },
    {
      "text": "لا وقت إضافي إن أمكن، تواصل وجهًا لوجه والنظر إلى الوراء باستمرار للتقدم إلى الأمام",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أكمل فريق المشروع مسحًا بيئيًا وكشف عن العديد من العوائق المرتبطة التي يمكن أن تؤثر سلبًا على تسليم المشروع. يعمل مدير المشروع مع الفريق لفهم تفاصيل كل عائق تم تحديده وكيفية ارتباط هذه العوائق ببعضها البعض، وذلك لفهم تعقيد المشروع بشكل عام. سيمكن ذلك الفريق من الوصول إلى خطة لمعالجة التحديات المحددة.\n\nما هي التقنية التي استخدمها مدير المشروع في هذه الحالة؟",
  "explanation": "الإجابة الصحيحة: التفكير النظمي (Systems Thinking).\n\n- لماذا؟\nالتفكير النظمي هو أسلوب لفهم العلاقات المتبادلة بين مكونات النظام أو المشروع ككل، ويساعد على التعرف على كيفية تأثير العوامل المختلفة بعضها على بعض لفهم تعقيد المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل باريتو يركز على تحديد الأسباب الأكثر تأثيرًا بناءً على مبدأ 80/20.\n- التحليل الحرج يركز على تحديد المسار الحرج في الجدول الزمني للمشروع.\n- إدارة الجودة الشاملة هي منهجية تركز على تحسين الجودة في العمليات، وليست تقنية تحليل تعقيد الأنظمة.",
  "choices": [
    {
      "text": "تحليل باريتو",
      "correct": false
    },
    {
      "text": "تحليل حرج",
      "correct": false
    },
    {
      "text": "التفكير النظمي (Systems Thinking)",
      "correct": true
    },
    {
      "text": "إدارة الجودة الشاملة",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ما هي المهارات الشخصية التي يحتاجها مديرو المشاريع أو الفرق لمراقبة علاقات أصحاب المصلحة، وتقييم استراتيجيات المشاركة، وتعديل هذه الأساليب حسب الحاجة؟",
  "explanation": "الإجابة الصحيحة: الاستماع النشط، القيادة، والوعي الثقافي والسياسي.\n\n- لماذا؟\nهذه المهارات تساعد مدير المشروع على فهم أصحاب المصلحة بشكل أفضل، التعامل مع التنوع الثقافي والسياسي، وتوجيه الفريق بفعالية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التوجيه واتخاذ القرار مهمان لكن لا يشملان مراقبة علاقات أصحاب المصلحة بشكل مباشر.\n- بناء الفريق والشبكات مهارات مهمة لكنها ليست مركزة على تقييم وتعديل استراتيجيات المشاركة.\n- بناء العلاقات والتأثير والوعي الثقافي مهمة ولكن الاستماع النشط والقيادة تكمل الصورة بشكل أفضل.",
  "choices": [
    {
      "text": "الاستماع النشط، القيادة، والوعي الثقافي والسياسي",
      "correct": true
    },
    {
      "text": "التوجيه، اتخاذ القرار، والوعي الثقافي والسياسي",
      "correct": false
    },
    {
      "text": "الاستماع النشط، بناء الفريق، القيادة، والشبكات",
      "correct": false
    },
    {
      "text": "بناء العلاقات، التأثير، والوعي الثقافي",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "عند إدارة مشروع استراتيجي للمؤسسة، ما هي الأدوات الأربع التي يجب على مدير المشروع استخدامها لتحليل المخاطر؟ (اختر أربعًا)",
  "explanation": "الإجابة الصحيحة تشمل: العصف الذهني، الفحص، قوائم التحقق من المخاطر، وإجراء المقابلات.\n\n- العصف الذهني: لتوليد أفكار المخاطر المحتملة من فريق المشروع وأصحاب المصلحة.\n- الفحص: مراجعة الوثائق والسجلات للعثور على المخاطر السابقة أو المحتملة.\n- قوائم التحقق من المخاطر: استخدام قوائم معدة مسبقًا لمراجعة المخاطر المعروفة.\n- إجراء المقابلات: جمع معلومات المخاطر من خبراء أو أصحاب مصلحة.\n\n- الخيارات غير الصحيحة:\n- تقييم المنتج ليس أداة لتحليل المخاطر.\n- تحليل شجرة القرار يستخدم لاتخاذ القرارات وليس لتحليل المخاطر الأساسية.",
  "choices": [
    {
      "text": "العصف الذهني",
      "correct": true
    },
    {
      "text": "الفحص",
      "correct": true
    },
    {
      "text": "قوائم التحقق من المخاطر",
      "correct": true
    },
    {
      "text": "تقييم المنتج",
      "correct": false
    },
    {
      "text": "إجراء المقابلات",
      "correct": true
    },
    {
      "text": "تحليل شجرة القرار",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "أعضاء فريق المشروع موزعين في دول مختلفة. وفجأة، لم تعد القيود على السفر تسمح بتواجد الأعضاء في موقع واحد.\n\nعند تحليل مخاطر المشروع، ما الأدوات التي يجب على مدير المشروع استخدامها؟ (اختر اثنين).",
  "explanation": "الإجابة الصحيحة: قائمة التحقق من المخاطر والاجتماعات.\n\n- قائمة التحقق من المخاطر تساعد على التأكد من مراجعة كل المخاطر المعروفة مسبقًا بغض النظر عن مكان الفريق.\n- الاجتماعات (حتى لو كانت افتراضية) مهمة لجمع المعلومات ومناقشة المخاطر مع الفريق الموزع.\n\n- الخيارات الأخرى غير مناسبة:\n- مخطط السياق يساعد على فهم النظام وليس أداة تحليل مخاطر مباشرة.\n- تمثيل البيانات وتقنيات التخطيط البياني تستخدم لأغراض أخرى مثل التحليل الإحصائي والجدولة.",
  "choices": [
    {
      "text": "قائمة التحقق من المخاطر",
      "correct": true
    },
    {
      "text": "مخطط السياق",
      "correct": false
    },
    {
      "text": "الاجتماعات",
      "correct": true
    },
    {
      "text": "تمثيل البيانات",
      "correct": false
    },
    {
      "text": "تقنيات التخطيط البياني",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال اجتماع الفريق، طلب الأعضاء من مدير المشروع تقديم نصائح حول التبعيات في المشروع. ما الذي يجب أن يطلبه مدير المشروع من الفريق بخصوص التبعيات الداخلية؟",
  "explanation": "الإجابة الصحيحة هي أن يتعرفوا على أحدث التغييرات التنظيمية.\n\n- التبعيات الداخلية تتعلق بالعوامل والعمليات داخل المنظمة التي تؤثر على المشروع، مثل التغييرات التنظيمية.\n- الخيارات الأخرى مثل الاندماج مع مؤسسة منافسة، أو تحديث مزود الإنترنت، أو سياسة العمل من المنزل غالبًا ما تكون عوامل خارجية أو غير ذات صلة مباشرة بالتبعيات الداخلية للمشروع.",
  "choices": [
    {
      "text": "أن يتعرفوا على أحدث التغييرات التنظيمية.",
      "correct": true
    },
    {
      "text": "قراءة معلومات عن الاندماج مع مؤسسة منافسة.",
      "correct": false
    },
    {
      "text": "التحقق من التغييرات المتعلقة بسياسة العمل من المنزل.",
      "correct": false
    },
    {
      "text": "التعرف على تحديث مزود الإنترنت.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "يعمل مدير مشروع على مشروع معقد يتضمن العديد من أصحاب المصلحة ذوي الأولويات المتضاربة.\n\nما هما الإجراءان اللذان يجب على مدير المشروع اتخاذهما للاستعداد للمفاوضات وكسب دعم جميع أصحاب المصلحة؟ (اختر اثنين)",
  "explanation": "الإجابتان الصحيحتان هما فهم السياسة والمصالح الشخصية لأصحاب المصلحة، وتطوير خطة جيدة لإدارة الاتصالات.\n\n- فهم السياسة والمصالح يساعد مدير المشروع على تحديد دوافع وتوقعات أصحاب المصلحة مما يسهل التفاوض.\n- إدارة الاتصالات الجيدة تضمن توصيل المعلومات بشكل فعال وتحقيق توافق بين أصحاب المصلحة.\n- الخيارات الأخرى مثل تخصيص هامش احتياطي أو تطوير علاقة مع فريق المشروع أو إدارة المخاطر ليست إجراءات مباشرة للمفاوضات مع أصحاب المصلحة.",
  "choices": [
    {
      "text": "تخصيص هامش احتياطي كافٍ لمواجهة تغييرات النطاق.",
      "correct": false
    },
    {
      "text": "تطوير علاقة جيدة مع فريق المشروع.",
      "correct": false
    },
    {
      "text": "فهم السياسة والمصالح الشخصية لأصحاب المصلحة.",
      "correct": true
    },
    {
      "text": "تطوير خطة جيدة لإدارة الاتصالات.",
      "correct": true
    },
    {
      "text": "تطوير خطة جيدة لإدارة المخاطر.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-answer",
  "text": "يعمل مدير مشروع على مشروع معقد يحظى باهتمام كبير من الإدارة العليا. هناك العديد من أصحاب المصلحة ذوي الأولويات المتضاربة، ويتطلب الأمر مهارات تفاوض كبيرة للتغلب على النزاعات المتزايدة.\n\nما المبدأان اللذان يجب على مدير المشروع اتباعهما عند تطوير استراتيجية التفاوض؟ (اختر اثنين).",
  "explanation": "الإجابتان الصحيحان هما: فصل الأشخاص عن المشكلة، والتركيز على المصالح وليس المواقف.\n\n- فصل الأشخاص عن المشكلة يساعد في تجنب التصعيد العاطفي ويُركز الحوار على حل المشكلة بدلاً من النزاع الشخصي.\n- التركيز على المصالح بدلاً من المواقف يُسهل الوصول إلى حلول ترضي جميع الأطراف وتقلل النزاعات.\n- التركيز على القضايا السياسية أو أولويات الإدارة أو تفويض القرارات ليست من المبادئ الأساسية الفعالة في التفاوض في سياق النزاعات المتعددة.",
  "choices": [
    {
      "text": "فصل الأشخاص عن المشكلة.",
      "correct": true
    },
    {
      "text": "التركيز على القضايا السياسية أولاً.",
      "correct": false
    },
    {
      "text": "التركيز على أولويات الإدارة.",
      "correct": false
    },
    {
      "text": "التركيز على المصالح وليس المواقف.",
      "correct": true
    },
    {
      "text": "تفويض القرارات إلى الفريق.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يعمل مدير مشروع على مشروع معقد به العديد من أصحاب المصلحة ذوي الأولويات المتضاربة. طلبت الإدارة العليا من مدير المشروع تجنب \"الضجيج\" لأن المشروع ذو طابع سياسي عالي. اختار مدير المشروع استخدام آراء الخبراء من شخصيات بارزة في الصناعة.\n\nما الذي فعله مدير المشروع لتلبية طلب الإدارة العليا؟",
  "explanation": "الإجابة الصحيحة هي: اتخذ إجراءً استنادًا إلى سلطة الإدارة العليا.\n\n- استخدام آراء خبراء بارزين يعكس استجابة واضحة ومبنية على سلطة الإدارة العليا لتقليل النزاعات \"الضجيج\" والسيطرة على المشروع.\n- الخيارات الأخرى مثل الاستجابة الودية أو التناسق في الكلمات أو التعاون هي سلوكيات عامة لكنها لا تعكس الإجراءات المحددة التي تُلبي طلب الإدارة العليا بوضوح.",
  "choices": [
    {
      "text": "استجاب بطريقة ودية للإدارة العليا",
      "correct": false
    },
    {
      "text": "بدا متسقًا في استخدام الكلمات والأفعال",
      "correct": false
    },
    {
      "text": "تعاون مع الإدارة العليا لتحقيق أهداف مشتركة",
      "correct": false
    },
    {
      "text": "اتخذ إجراءً استنادًا إلى سلطة الإدارة العليا",
      "correct": true
    }
  ]
},
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع سياسي معقد يضم العديد من أصحاب المصلحة ذوي الأولويات المتضاربة. طلبت الإدارة العليا من مدير المشروع التأكد من عدم وجود \"ضجيج\" حول المشروع. خلال اجتماع مع أصحاب المصلحة، طرح مدير المشروع سلسلة من الأسئلة لتأكيد القبول لكل عنصر من عناصر التسليم قبل طلب القبول للمشروع بأكمله.\n\nما الذي فعله مدير المشروع لإرضاء أصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة هي \"تصرف بطريقة متسقة بين الكلمات والأفعال\".\n\n- السبب: التناسق بين الأقوال والأفعال يعزز الثقة ويقلل الشكوك ويحد من \"الضجيج\" حول المشروع.\n- لماذا الخيارات الأخرى خاطئة:\n  - استجابة للأفعال الإيجابية لمكافأة التصرفات لا تكفي وحدها لضمان قبول أصحاب المصلحة.\n  - التعاون لتحقيق أهداف مشتركة مهم لكن لم يتم ذكره كالإجراء المباشر هنا.\n  - التصرف بناءً على السلطة وحده قد يسبب مقاومة ويزيد \"الضجيج\".",
    "choices": [
      {
        "text": "استجاب للأفعال الإيجابية من أصحاب المصلحة لمكافأة التصرفات",
        "correct": false
      },
      {
        "text": "تصرف بطريقة متسقة بين الكلمات والأفعال",
        "correct": true
      },
      {
        "text": "تعاون مع أصحاب المصلحة لتحقيق أهداف مشتركة",
        "correct": false
      },
      {
        "text": "تصرف بناءً على السلطة الممنوحة من الإدارة العليا",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع مع الفريق على تطوير حزم العمل. لاحظ مدير المشروع وجود فجوة في جمع المتطلبات حيث كانت هناك نقاط مهمة مفقودة، مما قد يؤثر على الجدول الزمني للمشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة هي \"الاجتماع مع مدير المنتج لإنشاء قائمة المتطلبات الناقصة في سجل المهام\".\n\n- السبب: التنسيق مع مدير المنتج يساعد في استكمال المتطلبات الناقصة لضمان اكتمال النطاق وتجنب التأخيرات.\n- لماذا الخيارات الأخرى خاطئة:\n  - الاجتماع مع الراعي لمناقشة إلغاء المشروع هو تصرف مبكر وغير عملي.\n  - طلب زيادة الميزانية ليس الحل الأمثل دون تحليل واضح.\n  - تقييم الأثر وتحديث سجل المخاطر مهم لكن يجب أولاً تحديد المتطلبات الناقصة بدقة.",
    "choices": [
      {
        "text": "الاجتماع مع الراعي لمناقشة إلغاء المشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الراعي وأصحاب المصلحة لطلب زيادة الميزانية.",
        "correct": false
      },
      {
        "text": "الاجتماع مع مدير المنتج لإنشاء قائمة المتطلبات الناقصة في سجل المهام.",
        "correct": true
      },
      {
        "text": "تقييم الأثر وتحديث سجل المخاطر وعرضه على أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أصيب مدير مشروع يخطط لمشروع استراتيجي تنبؤي بوعكة مفاجئة. يجب تقديم خط الأساس للمشروع إلى العميل خلال 3 أيام، ويجب على مدير مكتب إدارة المشاريع (PMO) العثور على شخص لإكمال التخطيط. الخيارات هي:\n\nمدير المشروع A: ذو خبرة عالية في مشاريع Scrum فقط، متاح فورًا لمدة يومين فقط\nمدير المشروع B: ذو خبرة متوسطة أساسًا في مشاريع البناء، متاح في اليوم التالي لمدة أسبوع\n\nمن يجب أن يختار مدير مكتب إدارة المشاريع وعلى أي أساس؟",
    "explanation": "الإجابة الصحيحة هي \"B يفهم بشكل أفضل تعقيدات التخطيط التنبؤي ولديه شبكة من خبراء الموضوع\".\n\n- السبب: المشروع يتطلب خبرة في التخطيط التنبؤي وليس الرشيق (Scrum). رغم أن B غير متاح فورًا، خبرته وأنشطته في مشاريع البناء (التنبؤية) تجعله الاختيار الأنسب لإكمال التخطيط بشكل صحيح.\n- لماذا الخيارات الأخرى خاطئة:\n  - A متاح فورًا لكن خبرته في Scrum فقط غير ملائمة للمشروع التنبؤي.\n  - التركيز على أحدث الاتجاهات لا يغني عن الخبرة المناسبة.\n  - مدة توفر B أطول لكنها ليست السبب الرئيسي للاختيار.",
    "choices": [
      {
        "text": "A متاح على الفور ولديه خبرة أكثر للتخطيط بسرعة وبشكل صحيح.",
        "correct": false
      },
      {
        "text": "B يفهم بشكل أفضل تعقيدات التخطيط التنبؤي ولديه شبكة من خبراء الموضوع.",
        "correct": true
      },
      {
        "text": "A على اطلاع أكبر ويتقن أحدث اتجاهات ومنهجيات التخطيط.",
        "correct": false
      },
      {
        "text": "B سيكون متاحًا للعمل لفترة أطول في حال فات موعد التسليم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع مشروعًا حيويًا لمؤسسته وللسلطة المحلية للطاقة والبيئة. خلال اجتماع للفريق لمناقشة مخاطر المشروع، أثار الفريق وجود خطر كبير يتمثل في أن مديرًا كبيرًا مهمًا غير مشارك حاليًا في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع للتخفيف من هذا الخطر؟",
    "explanation": "الإجابة الصحيحة هي \"تصعيد هذا الخطر إلى الإدارة العليا\".\n\n- السبب: غياب مدير كبير مهم عن المشروع يمثل خطرًا حيويًا ويحتاج إلى تدخل الإدارة العليا لضمان المشاركة والدعم.\n- لماذا الخيارات الأخرى خاطئة:\n  - تقارير الحالة المنتظمة مهمة لكن لا تحل مشكلة غياب المدير الكبير.\n  - خطة إدارة مفصلة لا تعالج غياب دعم رئيسي.\n  - دعوة المدير للاجتماعات اليومية قد لا تكون عملية أو كافية دون دعم إداري.",
    "choices": [
      {
        "text": "تنفيذ تقارير الحالة المنتظمة.",
        "correct": false
      },
      {
        "text": "تصعيد هذا الخطر إلى الإدارة العليا.",
        "correct": true
      },
      {
        "text": "تطوير خطة إدارة مشروع مفصلة للغاية.",
        "correct": false
      },
      {
        "text": "دعوة المدير الكبير إلى اجتماعات المشروع اليومية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قدّمت مؤسسة تعليمية شكوى بعد طلبها وحدة برمجية من شركة تستخدم ممارسات أجايل. تدّعي الشكوى أن الفوترة مقابل تسليم جزئي تنتهك بيان أجايل إذا لم يُشرك العميل في اجتماعات التقدم.\n\nتستند مطالبة العميل إلى أي من القيم الأربع في بيان أجايل؟",
    "explanation": "الإجابة الصحيحة هي \"التعاون مع العميل أكثر من التفاوض على العقد\".\n\n- السبب:\nالشكوى تتعلق بعدم إشراك العميل في الاجتماعات التقدمية، مما يشير إلى ضعف التعاون والتواصل، وهو أحد القيم الأساسية في بيان أجايل.\n- لماذا الخيارات الأخرى خاطئة:\n  - العمليات التي تحافظ على وتيرة ثابتة لا تتعلق بالشكوى.\n  - تسليم البرمجيات المتكرر صحيح لكنه لا يتعلق بمشاركة العميل.\n  - البرمجيات العاملة كمقياس أساسي للتقدم لا تعالج قضية التعاون مع العميل.",
    "choices": [
      {
        "text": "العمليات التي تحافظ على وتيرة ثابتة إلى أجل غير مسمى",
        "correct": false
      },
      {
        "text": "تسليم البرمجيات بشكل متكرر وفي فترات قصيرة",
        "correct": false
      },
      {
        "text": "التعاون مع العميل أكثر من التفاوض على العقد",
        "correct": true
      },
      {
        "text": "البرمجيات العاملة كمقياس أساسي للتقدم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أجرى مدير المشروع محادثة مع الراعي وناقش مخاوف بشأن عدم الامتثال. يفهم مدير المشروع أن ذلك قد يؤدي إلى حالة تدقيق محتملة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة هي \"الإفصاح عن مصدر المشكلة للمُدققين وترك القرار لهم\".\n\n- السبب:\nالشفافية والامتثال أمران أساسيان في إدارة المشاريع، ويجب إبلاغ الجهات المختصة لمتابعة الإجراءات المطلوبة.\n- لماذا الخيارات الأخرى خاطئة:\n  - عدم القيام بأي شيء قد يؤدي إلى تفاقم المشكلة.\n  - فصل القسم غير المتوافق لا يعالج المشكلة الجذرية.\n  - الحصول على موافقة القيادة على عدم الامتثال مخالف للمعايير والأخلاقيات المهنية.",
    "choices": [
      {
        "text": "عدم القيام بأي شيء والاستمرار في العمل كما كان من قبل، بافتراض حدوث تدقيق.",
        "correct": false
      },
      {
        "text": "فصل القسم غير المتوافق، لأنه يمثل مشكلة.",
        "correct": false
      },
      {
        "text": "الإفصاح عن مصدر المشكلة للمُدققين وترك القرار لهم.",
        "correct": true
      },
      {
        "text": "الحصول على التزام وموافقة القيادة على عدم الامتثال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق مشروع على تحديد التبعيات بين الأنشطة لمشروع جارٍ. ما الإجراء الأول الذي يجب أن يتخذه الفريق لإدارة التبعيات بنجاح؟",
    "explanation": "الإجابة الصحيحة: \"تقييم وتوثيق التبعيات\".\n\n- الشرح المفصل:\nتحديد التبعيات بين الأنشطة هو الخطوة الأولى والأساسية في إدارة الجدول الزمني للمشروع. بدون معرفة وتقييم التبعيات، يصبح من المستحيل متابعة أو التحكم في تأثيرها على سير المشروع.\n- بعد التقييم، يقوم الفريق بتوثيق هذه التبعيات بشكل دقيق في خطة المشروع أو جدول الأعمال لتكون مرجعًا واضحًا للجميع.\n- هذه الوثائق تتيح مراقبة التبعيات وتتبعها لاحقًا، مما يساعد في التعرف على التأخيرات المحتملة واتخاذ الإجراءات اللازمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - مراقبة وتتبع التبعيات مهمة لكنها تأتي بعد تحديدها وتوثيقها.\n  - إبلاغ الراعي لا يحل المشكلة الأساسية، فهو خطوة لاحقة للتواصل.\n  - تعيين مخططين لكل المهام غير ضروري قبل فهم التبعيات بشكل دقيق.",
    "choices": [
      {
        "text": "مراقبة وتتبع التبعيات.",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بالتبعيات.",
        "correct": false
      },
      {
        "text": "تقييم وتوثيق التبعيات.",
        "correct": true
      },
      {
        "text": "تعيين مخططين للمشروع لكل المهام.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أبلغ أحد البائعين مدير المشروع أن أحد العناصر المسؤولة عنه ضمن المشروع سيتم تسليمه بعد 6 أشهر من التاريخ المتفق عليه في الجدول الزمني. أوضح البائع أنه يركز على عناصر أخرى ذات أولوية أعلى لوجود تبعيات محددة، بينما لا توجد تبعيات مذكورة لهذا العنصر.\n\nما الذي يجب أن يفعله مدير المشروع لتجنب تأخيرات الجدول الزمني في المستقبل؟",
    "explanation": "الإجابة الصحيحة: \"تحديد أي تبعيات إذا كانت موجودة\".\n\n- الشرح المفصل:\nفي هذه الحالة، البائع يشير إلى وجود تبعيات غير موثقة تؤثر على الأولويات، مما يشير إلى ضعف في عملية تحديد التبعيات.\n- يجب على مدير المشروع أن يعمل على تحديد وتوثيق كل التبعيات بدقة في خطة المشروع وجدول المهام.\n- هذا يسمح بإدارة أفضل للتسلسل الزمني للمشروع، ويجنب التأخيرات المفاجئة نتيجة لتبعيات غير معروفة.\n- بمعرفة التبعيات، يمكن لمدير المشروع اتخاذ إجراءات استباقية لتعديل الجدول أو الموارد.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - مراقبة التبعيات واستجابة للتحديات دون معرفتها مسبقًا لن تكون فعالة.\n  - ضمان أن تكون التبعيات من نوع معين (مثل من الانتهاء إلى البدء) ليس الحل الرئيسي، فالأهم هو تحديدها كلها.\n  - عقد اجتماع لإبلاغ العميل لا يعالج أصل المشكلة في إدارة التبعيات.",
    "choices": [
      {
        "text": "مراقبة التبعيات والاستجابة للتحديات.",
        "correct": false
      },
      {
        "text": "ضمان أن جميع التبعيات الجديدة تكون من نوع 'من الانتهاء إلى البدء'.",
        "correct": false
      },
      {
        "text": "تحديد أي تبعيات إذا كانت موجودة.",
        "correct": true
      },
      {
        "text": "عقد اجتماع لإبلاغ العميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع امتثال جديد يختلف عن المشاريع المعتادة لأنه يتضمن شركاء متعددين الجنسيات وعدة هيئات حكومية. سينتج عن المشروع اعتماد معايير وإجراءات جديدة.\n\nما الذي يجب على مدير المشروع ضمانه منذ البداية؟",
    "explanation": "الإجابة الصحيحة: \"ضمان تفسير إرشادات الامتثال والتحقق منها\".\n\n- الشرح المفصل:\nفي مشاريع الامتثال، خاصة التي تتضمن جهات متعددة ومعايير معقدة، من الأساسي أن يتم فهم وتفسير إرشادات الامتثال بشكل صحيح منذ البداية لضمان توافق كل الأطراف مع المتطلبات.\n- هذا يمنع سوء الفهم والتأخير في التسليم الناتج عن تطبيق خاطئ للمعايير.\n- ضمان التفسير الصحيح للإرشادات يساعد في التحقق من أن المشروع يسير وفق اللوائح والقوانين المعمول بها.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - تحديد وتلبية المتطلبات التجارية مهم لكن ليس الأولوية في مشروع الامتثال المعقد.\n  - توفر تصميم الحل منذ البداية قد يكون غير ممكن في مشاريع الامتثال التي تتطلب فهمًا دقيقًا للمعايير أولاً.\n  - تنفيذ وتسليم المشروع بفعالية يعتمد على التفسير الصحيح أولًا للإرشادات.",
    "choices": [
      {
        "text": "ضمان تحديد وتلبية المتطلبات التجارية.",
        "correct": false
      },
      {
        "text": "ضمان توفر تصميم الحل منذ بداية المشروع.",
        "correct": false
      },
      {
        "text": "ضمان تنفيذ وتسليم المشروع بفعالية.",
        "correct": false
      },
      {
        "text": "ضمان تفسير إرشادات الامتثال والتحقق منها.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "سيتم تسليم آلات المشروع من المصنع خلال شهرين. يقوم فريق المشروع حاليًا بعقد اجتماع متابعة لمراجعة الالتزامات والتبعيات المتعلقة بهذه الآلات.\n\nما الإجراءات التي يجب أن يتخذها فريق المشروع لضمان التسليم السليم من المصنع؟ (اختر اثنين)",
    "explanation": "الإجابات الصحيحة: \"ضمان تتبع جميع التبعيات ومراقبتها والتقرير عنها بانتظام\" و \"تحديد متى تكون التبعية مطلوبة ومدة استمرار الحاجة إليها\".\n\n- الشرح المفصل:\n- تتبع التبعيات يساعد الفريق على التأكد من أن كل عنصر مرتبط بعملية التسليم مُراقب ويتم التعامل معه بشكل مناسب، مما يقلل من المخاطر المتعلقة بالتأخيرات أو المشاكل التقنية.\n- تحديد توقيت التبعيات ومدة استمرارها يسمح بتخطيط أفضل للجدول الزمني وضمان أن التسليم سيتم في الوقت المحدد دون تعارض أو نقص في الموارد.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - إرسال بريد إلكتروني قبل أسبوع فقط قد لا يكون كافيًا لضمان التنسيق الجيد.\n  - جدولة اجتماع لمناقشة كيفية تصنيع الآلات غير ضروري على المستوى الإداري لفريق المشروع، بل مسؤولية المصنع.\n  - التحدث إلى موظفي المصنع لمعرفة مؤهلاتهم خارج نطاق مسؤوليات مدير المشروع وفريقه.",
    "choices": [
      {
        "text": "ضمان تتبع جميع التبعيات ومراقبتها والتقرير عنها بانتظام.",
        "correct": true
      },
      {
        "text": "إرسال بريد إلكتروني إلى المصنع قبل أسبوع من موعد التسليم.",
        "correct": false
      },
      {
        "text": "تحديد متى تكون التبعية مطلوبة ومدة استمرار الحاجة إليها.",
        "correct": true
      },
      {
        "text": "جدولة اجتماع مع المصنع لمناقشة كيفية تصنيع الآلات.",
        "correct": false
      },
      {
        "text": "التحدث إلى موظفي المصنع لمعرفة ما إذا كانوا مؤهلين لبناء الآلات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "واجه فريق المشروع مؤخرًا تأخيرات بسبب عدم الامتثال، مما جعل جدول المشروع أقل مرونة وزاد من مخاطر التكلفة والجودة. الفريق الآن يناقش سبل تجنب ذلك في المستقبل.\n\nما هو التأثير الأكثر بُعدًا على المؤسسة إذا لم يتم حل مشكلة عدم الامتثال؟",
    "explanation": "الإجابة الصحيحة: \"بقاء واستمرارية الأعمال\".\n\n- الشرح المفصل:\nعدم الامتثال قد يؤدي إلى مشكلات تشغيلية وقانونية قد تهدد وجود المؤسسة على المدى الطويل، مما يؤثر على استمراريتها وبقائها في السوق.\n- على الرغم من أن الغرامات وعدم رضا العملاء تمثل مخاطر حقيقية، فإن التأثير الأبعد والأكثر خطورة هو تهديد وجود المؤسسة نفسها.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - عدم رضا العملاء أو المستخدمين النهائيين يمثل تأثيرًا مهمًا لكنه غالبًا ما يكون قصير أو متوسط المدى.\n  - بطء استجابة النظام هو أثر تقني وليس التأثير الأبعد.\n  - الغرامات والعقوبات تؤثر على التكلفة لكنها قد لا تهدد بقاء المؤسسة بشكل مباشر.",
    "choices": [
      {
        "text": "بقاء واستمرارية الأعمال.",
        "correct": true
      },
      {
        "text": "عدم رضا العملاء أو المستخدمين النهائيين.",
        "correct": false
      },
      {
        "text": "بطء في استجابة النظام.",
        "correct": false
      },
      {
        "text": "الغرامات والعقوبات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "قرر فريق المشروع توثيق جوانب جديدة من أحد الأنظمة التنظيمية كعناصر إضافية في هيكل تقسيم العمل (WBS).\n\nما الآثار السلبية المحتملة لهذا النهج؟ (اختر اثنين)",
    "explanation": "الإجابات الصحيحة: \"يصبح تتبع المتطلبات أكثر صعوبة على مستوى المشروع\" و \"قد لا يتم استكمال بعض هذه المتطلبات كجزء من المشروع نفسه\".\n\n- الشرح المفصل:\n- إضافة عناصر تنظيمية جديدة إلى هيكل تقسيم العمل قد يؤدي إلى تعقيد وتتبع صعب، لأن هذه العناصر قد لا تكون واضحة ضمن نطاق المشروع.\n- بعض المتطلبات التنظيمية قد تكون خارج نطاق المشروع، مما يجعل من الصعب ضمان تنفيذها ضمن المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - تحسين التتبع لا يحدث في هذه الحالة بسبب تعقيد إضافي.\n  - تجزئة العناصر الجديدة تتطلب وقت وجهد، لكنه ليس بالضرورة أثرًا سلبيًا جوهريًا مقارنة بالتحديات الأخرى.",
    "choices": [
      {
        "text": "يتحسن التتبع، ولكن تبقى المتطلبات مجزأة.",
        "correct": false
      },
      {
        "text": "يصبح تتبع المتطلبات أكثر صعوبة على مستوى المشروع.",
        "correct": true
      },
      {
        "text": "قد لا يتم استكمال بعض هذه المتطلبات كجزء من المشروع نفسه.",
        "correct": true
      },
      {
        "text": "المتطلبات التنظيمية ليست دائمًا مرتبطة بنطاق المشروع.",
        "correct": false
      },
      {
        "text": "تجزئة العناصر الجديدة يتطلب وقتًا وجهدًا لتحديث هيكل تقسيم العمل.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعتبر مدير المشروع الامتثال جزءًا من أصول العمليات التنظيمية. ومع ذلك، قرر فريق المشروع تضمين الامتثال كمُدخل في العمليات ذات الصلة بدلاً من توثيق هذه القواعد كمتطلبات.\n\nما هي مسؤولية مدير المشروع فيما يخص الامتثال؟",
    "explanation": "الإجابة الصحيحة: \"يعمل كمنسق للموارد والأنشطة\".\n\n- الشرح:\n  مدير المشروع مسؤول عن تنسيق الأنشطة والموارد لضمان الالتزام بالامتثال ضمن إطار العمل الخاص بالمشروع.\n- لماذا الخيارات الأخرى خاطئة:\n  - إجراء عمليات تدقيق ليست من مسؤوليات مدير المشروع بل تكون عادة من مسؤولية فريق الجودة أو التدقيق.\n  - تحليلات مخاطر الامتثال يمكن أن يشارك فيها مدير المشروع، لكنها ليست المسؤولية الرئيسية له.\n  - تغيير أصول عمليات المنظمة هو قرار على مستوى أعلى ولا يقع ضمن مسؤوليات مدير المشروع.",
    "choices": [
      {
        "text": "يعمل كمنسق للموارد والأنشطة",
        "correct": true
      },
      {
        "text": "يجري عمليات تدقيق لمتطلبات الامتثال",
        "correct": false
      },
      {
        "text": "يجري تحليلات مخاطر لمخاطر الامتثال",
        "correct": false
      },
      {
        "text": "يُغيّر أصول عمليات المنظمة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يساعد مدير مشروع منظمة في الانتقال من الأساليب التقليدية إلى الأساليب الأجايل. تعمل فرق البنية التحتية ومستودعات البيانات والهندسة المعمارية المؤسسية بشكل مختلف تمامًا عن فرق تطوير التطبيقات.\n\nكيف يجب على مدير المشروع تنفيذ الأجايل في هذه المنظمة؟",
    "explanation": "الإجابة الصحيحة: \"يقوم بتكييف التنفيذ عن عمد لجعل المنهجية أكثر ملاءمة للبيئة وطبيعة العمل الحالية\".\n\n- الشرح:\n  نظراً لاختلاف طبيعة عمل الفرق المختلفة، فإن تكييف منهجية الأجايل لتناسب البيئة والمهام الفريدة لكل فريق يضمن نجاح التطبيق وفعاليته.\n- لماذا الخيارات الأخرى خاطئة:\n  - فرض نفس المنهجية على كل الفرق يقلل من الفعالية ولا يأخذ في الاعتبار اختلافات العمل.\n  - الانتقال من الأعلى للأسفل قد يواجه مقاومة ولا يضمن التكيف الصحيح.\n  - استخدام فريق واحد كمشروع تجريبي مفيد لكنه لا يعالج الحاجة لتكييف المنهجية عبر الفرق المختلفة.",
    "choices": [
      {
        "text": "يطلب من كل فريق في المنظمة تنفيذ نفس منهجية الأجايل حتى يمكن للحل الموحد أن يوفر الاتساق بين الفرق.",
        "correct": false
      },
      {
        "text": "يقوم بتكييف التنفيذ عن عمد لجعل المنهجية أكثر ملاءمة للبيئة وطبيعة العمل الحالية.",
        "correct": true
      },
      {
        "text": "يفرض أسلوب الانتقال من الأعلى للأسفل من خلال طلب دعم الرئيس التنفيذي لتطبيق الأجايل في جميع الفرق.",
        "correct": false
      },
      {
        "text": "يطلب من فريق واحد تنفيذ سكرم كمشروع تجريبي حتى تتمكن بقية الفرق من التعلم وتطبيقه.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يجري مجموعة من أصحاب المصلحة في مؤسسة مالية مراجعة لإغلاق المشروع. أعرب بعض أصحاب المصلحة عن قلقهم من أن مخرجات المشروع لا تستوفي معايير الإغلاق المُحددة.\n\nما هو أول إجراء يجب على مدير المشروع اتخاذه لمعالجة هذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: \"إجراء تحليل شامل لمعرفة سبب عدم استيفاء المعايير\".\n\n- الشرح:\n  عند وجود قلق حول عدم استيفاء معايير الإغلاق، يجب على مدير المشروع أولاً فهم السبب الجذري للمشكلة قبل اتخاذ أي إجراءات أخرى. هذا يساعد على تحديد الحل المناسب سواء كان تعديل المخرجات أو تحديث المعايير أو غير ذلك.\n- لماذا الخيارات الأخرى خاطئة:\n  - طمأنة أصحاب المصلحة دون تحليل قد يؤدي إلى تجاهل مشكلة حقيقية.\n  - اقتراح حذف المعايير غير منطقي لأنه قد يقلل من جودة المشروع.\n  - اتخاذ تدابير تصحيحية قبل فهم السبب قد يؤدي إلى إجراءات غير فعالة أو مضيعة للوقت والموارد.",
    "choices": [
      {
        "text": "طمأنة أصحاب المصلحة بأن مخرجات المشروع تفي بجميع معايير الإغلاق المحددة.",
        "correct": false
      },
      {
        "text": "اقتراح تعديل معايير الإغلاق بحذف المعايير التي لم يتم تحقيقها.",
        "correct": false
      },
      {
        "text": "اتخاذ تدابير تصحيحية من خلال تعديل المعايير وتمديد الجدول الزمني.",
        "correct": false
      },
      {
        "text": "إجراء تحليل شامل لمعرفة سبب عدم استيفاء المعايير.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف تسليم تدريجي للمشروع، أبلغ أحد أعضاء الفريق قائد المشروع أنه بسبب تغير التكنولوجيا ونقص المعرفة بالتكنولوجيا الجديدة، سيتم تأخير التسليم واقترح الاستعانة بخدمات خارجية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: \"مناقشة تأثير التكنولوجيا الجديدة مع الفريق واتخاذ القرار بشكل مشترك\".\n\n- الشرح:\n  التعامل مع التغيرات التكنولوجية يجب أن يكون جماعياً لضمان فهم جميع الأعضاء للتحديات وتأثيرها على الجدول الزمني والجودة، مما يساعد على اتخاذ قرار مدروس بشأن الاستعانة بالخدمات الخارجية أو غيرها من الحلول.\n- لماذا الخيارات الأخرى خاطئة:\n  - إبلاغ المستخدم النهائي بالتأخير قبل تحليل المشكلة قد يسبب انطباعاً سلبياً دون محاولة لحل المشكلة داخليًا.\n  - البحث عن خدمة خارجية بدون مناقشة الفريق قد يؤدي إلى قرارات غير مدعومة من الفريق وتكلفة زائدة.\n  - إبلاغ الراعي وطلب الدعم قبل تقييم تأثير المشكلة مع الفريق قد يؤدي إلى قرارات متسرعة أو غير ملائمة.",
    "choices": [
      {
        "text": "إبلاغ المستخدم النهائي بتأخير التسليم المحدد بسبب التكنولوجيا الجديدة",
        "correct": false
      },
      {
        "text": "البحث عن خدمة خارجية تمتلك الخبرة اللازمة",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بالتأخير وطلب دعمه وموافقته",
        "correct": false
      },
      {
        "text": "مناقشة تأثير التكنولوجيا الجديدة مع الفريق واتخاذ القرار بشكل مشترك",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يقوم مدرب أجايل بتقديم المشورة لشركة برمجيات كبيرة كانت تستخدم منهجية الشلال وتخطط الآن لبدء استخدام الأجايل أو منهجية هجينة.\n\nما الذي يمكن أن يقترحه مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: \"البدء بالأجايل ثم الانتقال إلى الهجينة، مع العلم أن تنفيذ الأجايل يستغرق وقتًا\".\n\n- الشرح:\n  - الانتقال إلى الأجايل مباشرة قد يكون تحديًا بسبب الحاجة لتغيير الثقافة والعمليات، لذلك البدء بالأجايل تدريجيًا يُعد خيارًا جيدًا.\n  - المنهجية الهجينة تجمع بين مزايا الشلال والأجايل، لكنها ليست دائمًا الخيار الأفضل بدايةً.\n- لماذا الخيارات الأخرى خاطئة:\n  - الاستمرار في استخدام الشلال لا يستفيد من مزايا الأجايل الحديثة.\n  - الاعتماد على الهجينة من البداية قد لا يكون مناسبًا إذا لم يكن الفريق متمكنًا من الأجايل بعد.\n  - القول بأن الهجينة هي الأنسب دومًا ليس دقيقًا لأن الخيار يعتمد على بيئة العمل والاحتياجات.",
    "choices": [
      {
        "text": "الاستمرار في استخدام الشلال، لأن المنهجية الهجينة لا تتناسب مع الهيكل التنظيمي.",
        "correct": false
      },
      {
        "text": "البدء بالأجايل ثم الانتقال إلى الهجينة، مع العلم أن تنفيذ الأجايل يستغرق وقتًا.",
        "correct": true
      },
      {
        "text": "البدء باستخدام المنهجيات الهجينة لأن المعرفة بمنهجية الشلال قابلة للنقل.",
        "correct": false
      },
      {
        "text": "البدء باستخدام الهجينة لأنها الأنسب لمنظمات البرمجيات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب مالك المنتج دمج وظيفة مدمجة في بوابة المرضى في السبرينت القادم. قرر الفريق إجراء جلسة تقدير التقارب (Affinity Estimation) لتحديد مقدار القيمة التي سيتم تسليمها.\n\nما هو الدور المسؤول عن تسهيل الجلسة؟",
    "explanation": "الإجابة الصحيحة: \"سكرم ماستر\".\n\n- الشرح:\n  - سكرم ماستر هو المسؤول عن تسهيل الاجتماعات والفعاليات الرشيقة، بما في ذلك جلسات تقدير التقارب.\n  - يضمن أن الفريق يتبع المبادئ والأطر المتفق عليها ويعمل بشكل تعاوني.\n- لماذا الخيارات الأخرى خاطئة:\n  - مالك المنتج يحدد الأولويات لكنه لا يسهّل الجلسة.\n  - المطورون يشاركون في التقدير ولكن لا يسهّلون.\n  - أصحاب المصلحة قد يكونون حاضرين ولكن ليسوا مسؤولين عن التسهيل.",
    "choices": [
      {
        "text": "مالك المنتج",
        "correct": false
      },
      {
        "text": "سكرم ماستر",
        "correct": true
      },
      {
        "text": "المطور",
        "correct": false
      },
      {
        "text": "صاحب المصلحة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع فريقًا في مشروع تطوير جديد. يتكون الفريق من مجموعة متنوعة من الأشخاص ذوي الشخصيات وأنماط العمل المختلفة. يلتزم مدير المشروع ببناء فريق منسجم ومنتج، لذلك قرر تقديم نموذج السلوك DISC لمساعدة الأعضاء على فهم بعضهم البعض بشكل أفضل.\n\nاستنادًا إلى نموذج DISC، ما هي الخصائص التي تصف أسلوب التأثير (Influence)؟",
    "explanation": "الإجابة الصحيحة: \"اجتماعي، متحمّس، متفائل\".\n\n- الشرح:\n  - أسلوب التأثير في نموذج DISC يركز على التواصل الاجتماعي، الحماس، والتفاؤل.\n  - هؤلاء الأشخاص يكونون جيدين في تحفيز الآخرين وبناء علاقات.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"مباشر، موجه نحو النتائج، وحازم\" تصف نمط السيطرة (Dominance).\n  - \"متسامح، صبور، متواضع، لبق\" تصف نمط الاستقرار (Steadiness).\n  - \"تحليلي، متحفظ، ودقيق\" تصف نمط الامتثال (Conscientiousness).",
    "choices": [
      {
        "text": "مباشر، موجه نحو النتائج، وحازم",
        "correct": false
      },
      {
        "text": "اجتماعي، متحمّس، متفائل",
        "correct": true
      },
      {
        "text": "متسامح، صبور، متواضع، لبق",
        "correct": false
      },
      {
        "text": "تحليلي، متحفظ، ودقيق",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجب على مديري المشاريع القدرة على تحديد العيوب التي تسبب أخطاء في اتخاذ القرار. أي من الخيارات التالية يساعد مدير المشروع على اتخاذ قرارات مثلى؟",
    "explanation": "الإجابة الصحيحة: \"التحقق مع الآخرين\".\n\n- الشرح:\n  - التحقق مع الآخرين يساعد في تقليل الأخطاء والانحيازات عن طريق الحصول على وجهات نظر مختلفة وتقييم الأفكار بدقة.\n- لماذا الخيارات الأخرى خاطئة:\n  - استخدام الانحيازات يؤدي إلى اتخاذ قرارات غير موضوعية وغير صحيحة.\n  - استخدام افتراضات خاطئة يؤدي إلى استنتاجات غير دقيقة.\n  - تطبيق أخطاء منطقية يزيد من احتمالية اتخاذ قرارات سيئة.",
    "choices": [
      {
        "text": "استخدام الانحيازات",
        "correct": false
      },
      {
        "text": "استخدام افتراضات خاطئة",
        "correct": false
      },
      {
        "text": "التحقق مع الآخرين",
        "correct": true
      },
      {
        "text": "تطبيق أخطاء منطقية",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في شركة سيارات ناجحة مع معايير جودة عالية. يحتاج مدير المشروع إلى التأكد من أنه ينشئ هيكل تقسيم عمل (WBS) عالي الجودة.\n\nأي من الخصائص التالية لا تُعد من خصائص WBS عالية الجودة؟",
    "explanation": "الإجابة الصحيحة: \"يركز على العميل\" ليست من خصائص WBS عالية الجودة.\n\n- الشرح:\n  - هيكل تقسيم العمل (WBS) يجب أن يكون موجهًا نحو المخرجات، أي يركز على النتائج النهائية للمشروع وليس على العميل مباشرة.\n  - يجب أن يكون هرميًا وينفذ قاعدة 100٪ التي تعني أن كل العمل المطلوب يجب أن يُدرج بالكامل في الهيكل.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"موجه نحو المخرجات\" خاصية صحيحة وأساسية للـWBS.\n  - \"هرمي\" خاصية صحيحة لأن الـWBS يُبنى بشكل هيكلي.\n  - \"قاعدة 100٪\" ضرورية لضمان شمول كل مكونات العمل.",
    "choices": [
      {
        "text": "موجه نحو المخرجات",
        "correct": false
      },
      {
        "text": "هرمي",
        "correct": false
      },
      {
        "text": "قاعدة 100٪",
        "correct": false
      },
      {
        "text": "يركز على العميل",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أي من مستندات المشروع التالية لا تستخدم WBS كمدخل؟",
    "explanation": "الإجابة الصحيحة: \"نطاق المشروع\".\n\n- الشرح:\n  - وثيقة نطاق المشروع تحدد ما يجب القيام به ولماذا، وهي مدخل لتطوير WBS وليس نتيجة لها.\n  - بينما جدول المشروع، خطة إدارة المخاطر، وخطة الجودة تعتمد على WBS لتنظيم العمل وتخطيط الموارد.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"جدول المشروع\" يستخدم WBS لتحديد الأنشطة والتسلسل الزمني.\n  - \"خطة إدارة المخاطر\" تستفيد من WBS لتحديد النقاط التي يمكن أن تحدث فيها المخاطر.\n  - \"خطة الجودة\" تعتمد على WBS لتحديد متطلبات الجودة على مكونات المشروع.",
    "choices": [
      {
        "text": "جدول المشروع",
        "correct": false
      },
      {
        "text": "نطاق المشروع",
        "correct": true
      },
      {
        "text": "خطة إدارة المخاطر",
        "correct": false
      },
      {
        "text": "خطة الجودة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على إدارة المتطلبات في شركة أدوية. ما هو التحسين الذي يجب أن تتوقعه المنظمة كنتيجة لهذا المشروع؟",
    "explanation": "الإجابة الصحيحة: \"تقليل المخاطر\".\n\n- الشرح:\n  - إدارة المتطلبات بشكل فعال تساعد على تقليل المخاطر المتعلقة بفهم وتلبية احتياجات العملاء بدقة.\n  - عدم وضوح أو سوء إدارة المتطلبات قد يؤدي إلى زيادة التكاليف أو تأخير الجدول الزمني أو تقليل الجودة.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"انخفاض الجودة\" و\"زيادة التكاليف\" و\"زيادة الجدول الزمني\" هي نتائج سلبية وليست من التحسينات المتوقعة.",
    "choices": [
      {
        "text": "انخفاض الجودة",
        "correct": false
      },
      {
        "text": "زيادة التكاليف",
        "correct": false
      },
      {
        "text": "تقليل المخاطر",
        "correct": true
      },
      {
        "text": "زيادة الجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في شركة عالمية ويدرك أهمية خطة إدارة المتطلبات. متى يجب تنفيذ خطة إدارة المتطلبات؟",
    "explanation": "الإجابة الصحيحة: \"خلال مرحلة التخطيط\".\n\n- الشرح:\n  - يتم تطوير خطة إدارة المتطلبات ضمن مرحلة تخطيط المشروع لضمان تحديد، توثيق، وتحكم فعال في المتطلبات طوال دورة حياة المشروع.\n  - إعداد هذه الخطة في بداية المشروع قبل التنفيذ يضمن وضوح الأهداف ويقلل من التغييرات غير المخططة.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"في بداية المشروع\" غير محدد بدقة، حيث مرحلة التخطيط هي الوقت المناسب.\n  - \"قبل التنفيذ\" قد تكون متأخرة جداً لتحديد استراتيجية إدارة المتطلبات.\n  - \"بعد توقيع عقد العميل\" قد يكون متأخراً لأن التخطيط يكون عادةً قبله.",
    "choices": [
      {
        "text": "في بداية المشروع",
        "correct": false
      },
      {
        "text": "قبل التنفيذ",
        "correct": false
      },
      {
        "text": "بعد توقيع عقد العميل",
        "correct": false
      },
      {
        "text": "خلال مرحلة التخطيط",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "تم تعيين مدير المشروع (B) لتولي مشروع من مدير المشروع (A). أبلغ المدير (A) بأن المشروع يسير وفق الجدول الزمني فقط لأنه كان يضغط باستمرار على الفريق للأداء.\n\nما هو أول إجراء يجب أن يتخذه المدير (B) بصفته المدير الجديد؟",
    "explanation": "الإجابة الصحيحة: \"تحديد استراتيجية للإدارة\".\n\n- الشرح:\n  - كمدير مشروع جديد، من المهم أولاً تقييم الوضع الحالي ووضع خطة واضحة لإدارة المشروع تتضمن التغيير في أسلوب الإدارة إذا لزم الأمر.\n  - مجرد التحقق من حالة المخاطر أو أداء التكاليف بدون استراتيجية شاملة لن يساعد في حل المشكلات الأساسية.\n  - إبلاغ الفريق بالأهداف الجديدة يأتي بعد وضع استراتيجية واضحة.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"التحقق من حالة المخاطر\" و\"التحقق من أداء التكاليف\" إجراءات مهمة ولكنها ليست الأولوية الأولى.\n  - \"إبلاغ الفريق بالأهداف الجديدة\" بدون استراتيجية قد يسبب ارتباكاً.",
    "choices": [
      {
        "text": "التحقق من حالة المخاطر.",
        "correct": false
      },
      {
        "text": "التحقق من أداء التكاليف.",
        "correct": false
      },
      {
        "text": "تحديد استراتيجية للإدارة.",
        "correct": true
      },
      {
        "text": "إبلاغ الفريق بالأهداف الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ما هو العنصر الأساسي للحفاظ على دعم والتزام جميع أصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة: \"الاتصال الفعال\".\n\n- الشرح:\n  - الاتصال الفعال يضمن تبادل المعلومات بوضوح ودقة، مما يعزز الفهم والالتزام من قبل جميع أصحاب المصلحة.\n  - بدون اتصال فعال، قد تحدث سوء تفاهم يؤدي إلى فقدان الدعم.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"الصدق\" و\"الشفافية\" و\"الاعتمادية\" هي قيم مهمة لكنها تعتمد على وجود اتصال فعال للحفاظ عليها.",
    "choices": [
      {
        "text": "الصدق",
        "correct": false
      },
      {
        "text": "الاتصال الفعال",
        "correct": true
      },
      {
        "text": "الشفافية",
        "correct": false
      },
      {
        "text": "الاعتمادية",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "ما هي إحدى التكتيكات التي يمكن لمدير المشروع استخدامها لمراقبة تأثير المخاطر على المشروع بشكل فعال أثناء مراقبة المخاطر؟",
    "explanation": "الإجابة الصحيحة: \"الإبلاغ عن المخاطر\".\n\n- الشرح:\n  - الإبلاغ المنتظم عن المخاطر يضمن أن جميع أصحاب المصلحة على علم بالمخاطر الحالية وتأثيرها، مما يساعد في اتخاذ إجراءات سريعة وفعالة.\n  - تجنب المخاطر أو قبولها أو تصعيدها هي استراتيجيات للتعامل مع المخاطر لكنها ليست تكتيكًا لمراقبتها بفعالية.\n- لماذا الخيارات الأخرى خاطئة:\n  - \"تجنب المخاطر\" و\"قبول المخاطر\" و\"تصعيد المخاطر\" ترتبط بإدارة المخاطر وليس المراقبة والإبلاغ المستمر.",
    "choices": [
      {
        "text": "تجنب المخاطر",
        "correct": false
      },
      {
        "text": "تصعيد المخاطر",
        "correct": false
      },
      {
        "text": "قبول المخاطر",
        "correct": false
      },
      {
        "text": "الإبلاغ عن المخاطر",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "تم تعيين مدير مشروع جديد لمشروع قيد التنفيذ بالفعل لأن المدير السابق غادر المنظمة بشكل غير متوقع. للأسف، لم يلتزم المدير السابق بإجراءات نقل المعرفة الخاصة بالمنظمة قبل مغادرته.\n\nما الذي يمكن أن يفعله المدير الجديد لسد فجوات المعرفة؟ (اختر 3)",
    "explanation": "الإجابات الصحيحة تركز على استراتيجيات التعويض لسد فجوات المعرفة من خلال مراجعة الوثائق والتفاعل مع أصحاب المصلحة وأعضاء الفريق.\n\n- مراجعة وثائق المشروع توفر فهمًا واضحًا لحالة المشروع وأهدافه.\n- الاجتماع مع أصحاب المصلحة لفهم توقعاتهم يساعد في توجيه العمل بشكل صحيح.\n- مقابلة أعضاء الفريق تساعد في معرفة تفاصيل الخبرات والمعرفة العملية للمشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n  - \"المضي قدمًا في المشروع دون جمع المعرفة\" قد يؤدي إلى أخطاء.\n  - \"الاتصال بالمدير السابق\" قد يكون غير ممكن أو غير موثوق به.",
    "choices": [
      {
        "text": "مراجعة وثائق المشروع، بما في ذلك خطة المشروع، ووثيقة المتطلبات، وسجل المخاطر.",
        "correct": true
      },
      {
        "text": "المضي قدمًا في المشروع كما هو مخطط له والمشاركة في أنشطة المرافقة في العمل (job shadowing).",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة الرئيسيين لفهم توقعاتهم وأولوياتهم.",
        "correct": true
      },
      {
        "text": "مقابلة أعضاء الفريق لمعرفة مجالات خبرتهم وتجربتهم في المشروع.",
        "correct": true
      },
      {
        "text": "الاتصال بمدير المشروع السابق وطلب تحويل شامل للمعرفة.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "حدد فريق المشروع أن هناك نقصًا في توقعات نقل المعرفة داخل المشروع.\n\nأي من العقبات التالية لا تنطبق في هذا الموقف؟",
    "explanation": "الإجابة الصحيحة هي: \"مراجعة منهجية للمشروع المكتمل\" لأنها عملية إيجابية تهدف لتحليل المشروع بعد الانتهاء منه وتحديد الدروس المستفادة، وهذا يعزز نقل المعرفة بدلاً من أن يكون عقبة.\n\nشرح الخيارات:\n- مراجعة منهجية للمشروع المكتمل: ليست عقبة، بل فرصة لتحسين العمليات ونقل المعرفة، لذا لا تنطبق كعقبة.\n- الإخفاقات والأخطاء التي تم التعامل معها شخصيًا: تعتبر عقبة لأن عدم مشاركة الأخطاء والدروس المستفادة مع الفريق يمنع التعلم الجماعي.\n- نقص الدافع الفردي لتوثيق الدروس المستفادة: عقبة واضحة لأن دون حافز لتوثيق المعلومات، تفقد المعرفة القيمة.\n- ضعف مشاركة القيادة في تعزيز نقل المعرفة: عقبة هامة تؤثر على ثقافة المؤسسة في تبادل المعرفة.\n\nباختصار، العقبات هي العوامل التي تعيق انتقال المعرفة، ومراجعة المشروع تعد من أفضل الأدوات لتسهيل ذلك، لذلك هي الخيار غير الصحيح.",
    "choices": [
      {
        "text": "مراجعة منهجية للمشروع المكتمل",
        "correct": true
      },
      {
        "text": "الإخفاقات والأخطاء التي تم التعامل معها شخصيًا",
        "correct": false
      },
      {
        "text": "نقص الدافع الفردي لتوثيق الدروس المستفادة",
        "correct": false
      },
      {
        "text": "ضعف مشاركة القيادة في تعزيز نقل المعرفة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في بيئة أجايل، يجب على قائد المشروع دائمًا تخصيص وقت للنقاش المفتوح والحُر بين أعضاء الفريق حول كيفية تحسين أدائهم.\n\nلماذا تُعد هذه الممارسة مهمة للفريق؟",
    "explanation": "الإجابة الصحيحة: \"يجب على الفرق السعي باستمرار لتحسين عملياتهم\".\n\nشرح الإجابة:\n- التحسين المستمر هو أحد المبادئ الأساسية في منهجيات أجايل، حيث يسعى الفريق دومًا لتطوير طرق العمل وتحسين الأداء لتقديم قيمة أفضل.\n- النقاش المفتوح يساعد الفريق على تحديد العقبات، طرح الأفكار الجديدة، ومشاركة التعلم الجماعي.\n\nشرح الخيارات الأخرى:\n- \"يجب على الفرق اتخاذ إجراءات لزيادة الإنتاجية باستمرار\": صحيح لكن أكثر عمومية، والتحسين المستمر يركز أكثر على العملية وليس فقط الإنتاجية.\n- \"يجب على الفرق تجربة طرق جديدة في العمل باستمرار\": جزء من التحسين، لكن ليس الهدف الوحيد للنقاش المفتوح.\n- \"يجب على الفرق دفع أعضائها باستمرار للعمل بجهد أكبر\": هذا قد يؤدي إلى الإرهاق وليس تحسين الأداء بشكل مستدام.\n\nبالتالي، التركيز على تحسين العمليات يعكس روح أجايل الحقيقية في تعزيز التعاون والتحسين المستمر.",
    "choices": [
      {
        "text": "يجب على الفرق اتخاذ إجراءات لزيادة الإنتاجية باستمرار",
        "correct": false
      },
      {
        "text": "يجب على الفرق تجربة طرق جديدة في العمل باستمرار",
        "correct": false
      },
      {
        "text": "يجب على الفرق السعي باستمرار لتحسين عملياتهم",
        "correct": true
      },
      {
        "text": "يجب على الفرق دفع أعضائها باستمرار للعمل بجهد أكبر",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يدير مدير مشروع مشروعًا يتضمن التعامل مع بعض البائعين. يسأل الراعي كيف سيتم الحصول على السلع والخدمات الخارجية.\n\nأين يجب توثيق هذه المعلومات؟",
    "explanation": "الإجابة الصحيحة هي \"في خطة إدارة المشتريات\".\n\n- لماذا؟\nخطة إدارة المشتريات هي الوثيقة التي تحدد كيفية شراء السلع والخدمات من البائعين، بما في ذلك أنواع العقود، إجراءات التعاقد، معايير التقييم، والعمليات المرتبطة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- اتفاقية الخدمة الرئيسية (MSA) هي عقد يحدد شروط العمل العامة مع البائع، لكنها لا تحتوي على خطة مفصلة لعملية الشراء.\n- عقد قائمة المواد هو وثيقة تقنية تفصيلية تركز على المواد نفسها، وليس طريقة الشراء أو الإجراءات.\n- اتفاقية مستوى الخدمة (SLA) تحدد مستوى الأداء المتوقع من مقدم الخدمة، لكنها لا تتناول طريقة الحصول على السلع والخدمات.",
    "choices": [
      {
        "text": "في خطة إدارة المشتريات",
        "correct": true
      },
      {
        "text": "في اتفاقية الخدمة الرئيسية (MSA)",
        "correct": false
      },
      {
        "text": "في عقد قائمة المواد",
        "correct": false
      },
      {
        "text": "في اتفاقية مستوى الخدمة (SLA)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "المشروع في مرحلة التنفيذ. يجب نقل المعدات والأجهزة من مستودع البائع إلى موقع المشروع عبر خمس مدن.\n\nما هي الأطراف المعنية التي يجب على مدير المشروع إشراكها في تخطيط وتنفيذ النقل الآمن؟ (اختر 3)",
    "explanation": "الإجابات الصحيحة: \"مجالس المدن\"، \"فنيي تركيب المعدات\"، \"موردو المعدات\".\n\n- لماذا؟\n1. مجالس المدن: مهم إشراكها للحصول على التصاريح اللازمة لضمان مرور آمن وسلس عبر المدن المختلفة، كما أنها تساعد في التنسيق مع السلطات المحلية.\n2. فنيي تركيب المعدات: مسؤولون عن تركيب المعدات في الموقع بشكل صحيح، ويحتاجون إلى معرفة مواعيد النقل لضمان جاهزيتهم.\n3. موردو المعدات: مصدر المعدات، ويجب التنسيق معهم لضمان تسليمها وفق الجدول ولحل أي مشاكل لوجستية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- راعي المشروع: هو جهة إشرافية وليست جهة تنفيذية في النقل.\n- فني المستودع: دورهم محصور في تخزين وصيانة المعدات داخل المستودع وليس النقل عبر المدن.",
    "choices": [
      {
        "text": "مجالس المدن",
        "correct": true
      },
      {
        "text": "راعي المشروع",
        "correct": false
      },
      {
        "text": "فنيي تركيب المعدات",
        "correct": true
      },
      {
        "text": "موردو المعدات",
        "correct": true
      },
      {
        "text": "فني المستودع",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد له تأثير بيئي كبير. تمت الموافقة على المشروع من قبل مكتب إدارة المشاريع (PMO) في المنظمة، وهو الآن في مرحلة التخطيط. قدم راعي المشروع لمدير المشروع قائمة بجميع أصحاب المصلحة في المشروع.\n\nما هي النشاط التالي في خطة إدارة أصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة: التحليل.\n\n- لماذا؟\nبعد تحديد أصحاب المصلحة وتوثيقهم، يتم تحليلهم لفهم احتياجاتهم وتوقعاتهم ومستوى تأثيرهم على المشروع، ويشمل ذلك تقييم قوتهم واهتمامهم والتخطيط لكيفية إدارتهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التحديد: تم مسبقًا بتسليم القائمة.\n- المشاركة: تأتي بعد التحليل حيث يتم وضع خطة لتفاعل أصحاب المصلحة.\n- المراقبة: تُجرى لاحقًا خلال تنفيذ المشروع للتحقق من استمرار فعالية استراتيجيات أصحاب المصلحة.",
    "choices": [
      {
        "text": "التحليل",
        "correct": true
      },
      {
        "text": "المراقبة",
        "correct": false
      },
      {
        "text": "المشاركة",
        "correct": false
      },
      {
        "text": "التحديد",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدير مدير المشروع مشروعًا باستخدام النهج الأجايل. مدير مكتب إدارة المشاريع (PMO) غير مطلع على تسليم المشاريع بالنهج الأجايل.\n\nأي من العبارات التالية تصف نهج الأجايل؟",
    "explanation": "الإجابة الصحيحة: الاستجابة للتغيير بدلاً من الالتزام بالخطة.\n\n- لماذا؟\nأجايل تركز على التكيف مع التغيرات وتحديث خطة العمل بناءً على المتغيرات بدلاً من التقيد الصارم بخطة محددة منذ البداية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تعاون العميل بدلاً من الالتزام بالخطة: هذه ليست صيغة دقيقة لما ورد في القيم الأربعة للأجايل.\n- الاستجابة للتغيير بدلاً من العمليات والأدوات: هذا يتعارض مع القيمة الأصلية (الأفراد والتفاعلات أكثر من العمليات والأدوات).\n- تعاون العميل بدلاً من الاختبارات الشاملة: ليس تعبيرًا رسميًا في البيان الخاص بالأجايل.",
    "choices": [
      {
        "text": "الاستجابة للتغيير بدلاً من الالتزام بالخطة",
        "correct": true
      },
      {
        "text": "تعاون العميل بدلاً من الالتزام بالخطة",
        "correct": false
      },
      {
        "text": "الاستجابة للتغيير بدلاً من العمليات والأدوات",
        "correct": false
      },
      {
        "text": "تعاون العميل بدلاً من الاختبارات الشاملة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أكمل مدير المشروع حديثًا مرحلة بدء مشروع ويحتاج الآن إلى تحديد وتحليل أصحاب المصلحة. ركز ميثاق المشروع على الموافقة على النطاق والميزانية فقط.\n\nماذا يجب أن يفعل مدير المشروع لتحديد أصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة: مراجعة الدروس المستفادة من المشاريع السابقة.\n\n- لماذا؟\nمراجعة الدروس المستفادة تساعد في تحديد الأنماط المتكررة حول أصحاب المصلحة المحتملين الذين قد يتم تجاهلهم. هذه الخطوة توفر رؤية أوسع بجانب الوثائق الرسمية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة ميثاق المشروع: غير كافٍ لأنه ركز فقط على النطاق والميزانية، ولم يتضمن قائمة أصحاب المصلحة.\n- إجراء جلسة عصف ذهني مع فريق المشروع: قد تكون خطوة لاحقة، لكن البداية تكون من خلال مراجعة المصادر المتاحة أولًا.\n- مراجعة الهيكل التنظيمي: يفيد في تحديد بعض أصحاب المصلحة، لكنه غير شامل مثل مراجعة الدروس المستفادة.",
    "choices": [
      {
        "text": "مراجعة الدروس المستفادة من المشاريع السابقة.",
        "correct": true
      },
      {
        "text": "مراجعة ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "إجراء جلسة عصف ذهني مع فريق المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة الهيكل التنظيمي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "انضم مدير مشروع مؤخرًا إلى منظمة جديدة. راعي المشروع هو خبير في المجال ويريد إدارة النطاق من خلال التسليم على مراحل صغيرة وتعديل النطاق بناءً على التعليقات.\n\nأي من النهوج التالية يُوصى بها؟",
    "explanation": "الإجابة الصحيحة: سكرم (Scrum).\n\n- لماذا؟\nسكرم يعتمد على تسليم العمل على شكل تكرارات قصيرة (سبرينت)، مع مراجعة متكررة وتعديل النطاق بناءً على التغذية الراجعة. هذا يتماشى مع ما يطلبه الراعي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- شلال (Waterfall): لا يسمح بالتغيير المستمر بعد تحديد النطاق.\n- كانبان (Kanban): مناسب لتدفق العمل المستمر لكنه لا يتضمن هيكل تسليم تكراري كما في سكرم.\n- تنبئي (Predictive): يعتمد على خطة ثابتة، مما لا يتوافق مع إدارة النطاق المرنة.",
    "choices": [
      {
        "text": "سكرم (Scrum)",
        "correct": true
      },
      {
        "text": "شلال (Waterfall)",
        "correct": false
      },
      {
        "text": "كانبان (Kanban)",
        "correct": false
      },
      {
        "text": "تنبئي (Predictive)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "يقود مدير مشروع فريقًا مكونًا من 34 عضوًا من ست دول. نطاق المشروع هو تحديث عملية مستخدمة منذ حوالي 40 عامًا في المنظمة.\n\nما هي المعايير التي يجب أن يأخذها مدير المشروع في الاعتبار أثناء تطوير خطة الاتصال؟ (اختر 3)",
    "explanation": "الإجابات الصحيحة: التنوع الشخصي، التنوع العمري، التنوع الثقافي.\n\n- لماذا؟\nعند إعداد خطة الاتصال في فرق متعددة الجنسيات وكبيرة الحجم، من المهم الأخذ بعين الاعتبار الفروقات الشخصية والثقافية والعمرية حتى تكون الرسائل مفهومة وفعالة للجميع.\n\n- لماذا الخيار غير الصحيح خاطئ؟\n- تنوع المهارات يتعلق بتوزيع العمل وتوزيع الأدوار أكثر من ارتباطه بخطة الاتصال المباشر.",
    "choices": [
      {
        "text": "التنوع الشخصي",
        "correct": true
      },
      {
        "text": "التنوع العمري",
        "correct": true
      },
      {
        "text": "التنوع الثقافي",
        "correct": true
      },
      {
        "text": "تنوع المهارات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "قررت مجموعة التوجيه في المشروع تغيير المورد الذي سيقوم بتسليم أحد مكونات المشروع.\n\nما الأنشطة التي يجب تضمينها في عملية التسليم؟ (اختر 2).",
    "explanation": "الإجابات الصحيحة: يجب على المورد القديم توفير تدريب للمورد الجديد والمساعدة في الانتقال + يجب على المورد الجديد استلام الأنشطة حسب خطة المشروع الحالية.\n\n- لماذا؟\nالتغيير في المورد يتطلب دائمًا نقل معرفة ومنهجية انتقال منظمة حتى لا يتأثر سير المشروع. التدريب واستلام الأنشطة بشكل منظم يساعد في استمرارية العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقديم حوافز إضافية ليس جزءًا أساسيًا من عملية التسليم.\n- متابعة المورد القديم ليست مسؤولية مباشرة للمورد الجديد وإنما تنظم ضمن خطة الانتقال المتفق عليها.",
    "choices": [
      {
        "text": "يجب على المورد القديم توفير تدريب للمورد الجديد والمساعدة في الانتقال.",
        "correct": true
      },
      {
        "text": "يجب على كلا الموردين تقديم حوافز إضافية للموظفين أثناء الانتقال.",
        "correct": false
      },
      {
        "text": "يجب على المورد الجديد استلام الأنشطة حسب خطة المشروع الحالية.",
        "correct": true
      },
      {
        "text": "يجب على المورد الجديد متابعة المورد القديم لضمان نقل المعرفة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "يعمل مدير مشروع على مشروع تحوّل تجاري كبير. تم توقيع جميع مخرجات البناء، ويقوم مدير المشروع الآن بإدارة الانتقال إلى الوضع التشغيلي الاعتيادي (BAU).\n\nما الاعتبارات المهمة لجاهزية العمليات التي يجب على مدير المشروع أخذها بعين الاعتبار؟ (اختر 2).",
    "explanation": "الإجابات الصحيحة: \n- يجب توفير تدريب رسمي وإتاحة الوثائق لجميع المستخدمين.\n- يتم تسليم المسؤوليات والمحاسبة رسميًا إلى فرق العمليات.\n\n- لماذا؟\nلضمان استمرارية العمل بعد انتهاء المشروع، يجب أن تكون الفرق التشغيلية جاهزة ومدربة مع الوثائق الكاملة، ويجب أن يتم تسليم المسؤوليات رسميًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- ورقة الغش والتدريب الذاتي غير كافية لمشاريع التحوّل الكبيرة.\n- بقاء الدعم التشغيلي على عاتق فريق المشروع يتعارض مع مفهوم الانتقال إلى BAU.",
    "choices": [
      {
        "text": "يتم توفير ورقة غش للوظائف الأساسية ويُشجع التدريب الذاتي.",
        "correct": false
      },
      {
        "text": "يجب توفير تدريب رسمي وإتاحة الوثائق لجميع المستخدمين.",
        "correct": true
      },
      {
        "text": "يتم تسليم المسؤوليات والمحاسبة رسميًا إلى فرق العمليات.",
        "correct": true
      },
      {
        "text": "تظل مسؤولية الدعم التشغيلي على عاتق فريق المشروع أثناء مرحلة BAU.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد التشاور مع أصحاب المصلحة التنفيذيين، تقرر أن يقوم مدير المشروع باستبدال أحد الموردين أثناء مرحلة التنفيذ. يتمتع المورد الجديد بمعرفة أوسع بالمجال ولم يتم تحديده في السابق، لكنه مرشح مناسب الآن.\n\nأي من الوثائق التالية تحتوي على أفضل المعلومات للمورد الجديد؟",
    "explanation": "الإجابة الصحيحة: طلب تقديم عرض (RFP).\n\n- لماذا؟\nطلب تقديم عرض (RFP) يشرح تفاصيل المتطلبات وشروط العقد بطريقة تسمح للموردين بتقديم حلولهم وعروضهم الفنية والمالية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- RFI مخصص لجمع المعلومات الأولية فقط.\n- RFQ يستخدم لطلب أسعار محددة عندما تكون المواصفات معروفة بالكامل.\n- RFC لا يرتبط بإدارة المشتريات بل يخص تغييرات العقود.",
    "choices": [
      {
        "text": "طلب المعلومات (RFI)",
        "correct": false
      },
      {
        "text": "طلب عرض السعر (RFQ)",
        "correct": false
      },
      {
        "text": "طلب تقديم عرض (RFP)",
        "correct": true
      },
      {
        "text": "طلب التعاقد (RFC)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنت مدير مشروع في منظمة تطبق منهجية التسليم الأجايل. لديك خبرة كـ Scrum Master وستؤدي هذا الدور إلى جانب مسؤولياتك كمدير مشروع. أحد أعضاء الفريق يريد معرفة ما هو التركيز الرئيسي للقائد الخادم (Servant Leader).\n\nما إجابتك المناسبة؟",
    "explanation": "الإجابة الصحيحة: نمو ورفاهية الأفراد والمجتمعات التي ينتمون إليها.\n\nالشرح: القائد الخادم (Servant Leader) يركز على تمكين الفريق ودعمه ليحقق أفضل أداء مع الحفاظ على رفاهية الأفراد وتطويرهم. هذا يختلف عن الأساليب التقليدية التي تركز على السلطة أو التحكم.\n\nلماذا الخيارات الأخرى خاطئة:\n- رضا العميل وعرض القيمة مهمة، لكنها ليست تركيز القائد الخادم.\n- إدارة توقعات أصحاب المصلحة جزء من دور مدير المشروع، وليس من خصائص القائد الخادم تحديدًا.\n- الإنتاجية والكفاءة نتيجة وليس تركيزًا مباشرًا.",
    "choices": [
      {
        "text": "رضا العميل وعرض القيمة المقدمة.",
        "correct": false
      },
      {
        "text": "نمو ورفاهية الأفراد والمجتمعات التي ينتمون إليها.",
        "correct": true
      },
      {
        "text": "إدارة توقعات أصحاب المصلحة والتواصل معهم.",
        "correct": false
      },
      {
        "text": "الإنتاجية والكفاءة لتحقيق الالتزامات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ما هي أنماط القيادة الأربعة التي تُستخدم في بناء الفريق؟",
    "explanation": "الإجابة الصحيحة: رؤيوي، تحالفي، توجيهي، وتشاركي.\n\nالشرح:\n- النمط الرؤيوي يركز على خلق رؤية مشتركة.\n- النمط التحالفي يبني الثقة والعلاقات.\n- النمط التوجيهي يعطي التعليمات ويوضح المسار.\n- النمط التشاركي يشجع على اتخاذ القرار الجماعي.\n\nالخيارات الأخرى خلطت بين أنماط صحيحة وغير دقيقة حسب التصنيفات المعتمدة في إدارة المشاريع.",
    "choices": [
      {
        "text": "رؤيوي، تحالفي، توجيهي، وتشاركي",
        "correct": true
      },
      {
        "text": "رؤيوي، تحالفي، توجيهي، وسرعة التنفيذ",
        "correct": false
      },
      {
        "text": "رؤيوي، تحالفي، توجيهي، وأمري",
        "correct": false
      },
      {
        "text": "رؤيوي، تحالفي، توجيهي، ومستوى عالي",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال الاجتماع الأسبوعي، يقوم أعضاء الفريق بمراجعة المهام التي تم تعيينها من قبل مدير المشروع. اشتكى بعض أعضاء الفريق من عدم توفر معلومات كافية لتقدير الوقت اللازم لإكمال العمل.\n\nما هو السبب الأكثر احتمالاً لهذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: لم يتم تحديد أهداف المشروع بوضوح.\n\nالشرح: عندما لا تكون أهداف المشروع واضحة، يصعب على أعضاء الفريق فهم الغرض الكامل من المهام الموكلة إليهم، مما يؤدي إلى صعوبة في تقدير الوقت والجهد اللازمين. هذا يؤثر مباشرة على التخطيط وتوقعات الأداء.\n\nلماذا الخيارات الأخرى خاطئة:\n- بيئة الأعمال الديناميكية تؤثر على التغييرات، لكنها ليست السبب المباشر في غياب معلومات المهام.\n- التنافس الداخلي مشكلة في بيئة الفريق، وليس سببًا في عدم توفر المعلومات.\n- الأدوار والمسؤوليات تتعلق بمن يفعل ماذا، لكن هنا المشكلة مرتبطة بنقص المعلومات حول المهام وليس من سينفذها.",
    "choices": [
      {
        "text": "لم يتم تحديد أهداف المشروع بوضوح",
        "correct": true
      },
      {
        "text": "بيئة الأعمال ديناميكية جدًا",
        "correct": false
      },
      {
        "text": "تنافس داخلي بين أعضاء الفريق",
        "correct": false
      },
      {
        "text": "لم يتم تحديد الأدوار والمسؤوليات بوضوح",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أنت تدير مشروعًا معقدًا يحتوي على عدد كبير من أصحاب المصلحة. قررت استخدام نموذج السطوع (Salience Model) لتحديد وتصنيف أصحاب المصلحة الأكثر أهمية بناءً على القوة، والإلحاح، والشرعية.\n\nما هو الجانب الأكثر أهمية في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: الحاسم.\n\nالشرح: في نموذج السطوع، يُعتبر أصحاب المصلحة الحاسمون (Definitive Stakeholders) هم الأكثر أهمية لأنهم يجمعون بين القوة والإلحاح والشرعية. هؤلاء يتطلبون اهتمامًا فوريًا ومباشرًا من مدير المشروع.\n\nلماذا الخيارات الأخرى خاطئة:\n- المهيمن يمتلك القوة والشرعية لكن ليس الإلحاح.\n- التابع يمتلك الشرعية والإلحاح لكن لا يملك القوة.\n- المطالب لديه القوة والإلحاح لكن قد لا يمتلك الشرعية.",
    "choices": [
      {
        "text": "المهيمن",
        "correct": false
      },
      {
        "text": "التابع",
        "correct": false
      },
      {
        "text": "المطالب",
        "correct": false
      },
      {
        "text": "الحاسم",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-answer",
    "text": "في اجتماع فريق المشروع، يشتكي الأعضاء من انخفاض في الدافعية وأنهم لا يشعرون بأن جهودهم محل تقدير. قررت تقديم الفريق كمجموعة عالية الأداء أمام المنظمة.\n\nما هي السمات التالية في بيئة العمل وأسلوب الإدارة التي تؤدي إلى فريق عالي الأداء؟ اختر 3.",
    "explanation": "الإجابات الصحيحة: عائد تحدي العمل، بيئة محفزة، وتقنيات حل المشكلات.\n\nالشرح:\n- عائد تحدي العمل يعزز شعور الأفراد بالقيمة والمساهمة.\n- بيئة محفزة تساعد على إبقاء الفريق نشطًا ومبدعًا.\n- تقنيات حل المشكلات تدعم التعاون والعمل الجماعي.\n\nلماذا الخيارات الأخرى خاطئة:\n- الدوافع الشخصية ليست دائمًا مرتبطة بالفريق بل ترتبط بالفرد.\n- المكافآت المالية قد تحفز على المدى القصير لكنها لا تضمن أداءً عاليًا مستدامًا.\n- نظرية القيود هي منهجية لتحسين العمليات وليست عاملًا مباشرًا في بناء فرق عالية الأداء.",
    "choices": [
      {
        "text": "الدوافع الشخصية.",
        "correct": false
      },
      {
        "text": "عائد تحدي العمل.",
        "correct": true
      },
      {
        "text": "مكافآت مالية تصاعدية.",
        "correct": false
      },
      {
        "text": "بيئة محفزة.",
        "correct": true
      },
      {
        "text": "تقنيات حل المشكلات.",
        "correct": true
      },
      {
        "text": "نظرية القيود.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قرر مدير المشروع إشراك طرف ثالث لإدارة المخاطر في المشروع نظرًا لامتلاكهم خبرة أكبر من فريق المشروع الحالي.\n\nما نوع استراتيجية الاستجابة التي استخدمها مدير المشروع لمعالجة المخاطر العامة للمشروع؟",
    "explanation": "الإجابة الصحيحة: التحويل.\n\nالشرح:\nالتحويل يعني نقل أثر المخاطر إلى جهة أخرى (مثل شركة تأمين أو مقاول خارجي)، مقابل تعويض مالي أو اتفاق رسمي. هذا ينطبق تمامًا على حالة إشراك طرف ثالث.\n\nلماذا الخيارات الأخرى خاطئة:\n- التجنب تعني إلغاء النشاط الذي يحتوي على الخطر.\n- الاستغلال ترتبط بالفرص وليس التهديدات.\n- التقليل تعني تقليل احتمالية أو أثر الخطر داخليًا دون نقله لجهة أخرى.",
    "choices": [
      {
        "text": "التجنب",
        "correct": false
      },
      {
        "text": "الاستغلال",
        "correct": false
      },
      {
        "text": "التحويل",
        "correct": true
      },
      {
        "text": "التقليل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد أن قامت المؤسسة بتدريب وتطبيق برنامج جديد لإدارة المشاريع إلزامي لجميع موظفي المشروع، لاحظ مدير المشروع أن عدة أعضاء في الفريق يُظهرون التزامًا منخفضًا تجاه البرنامج الجديد.\n\nما هو سبب ذلك؟",
    "explanation": "الإجابة الصحيحة: الخوف من المجهول.\n\nالشرح: عند تطبيق نظام جديد أو تغيير كبير في بيئة العمل، يُعد الخوف من المجهول (Fear of the Unknown) من أكثر الأسباب شيوعًا لرفض أو مقاومة التغيير. حتى مع وجود تدريب كافٍ، قد يتردد الأفراد في الالتزام بسبب عدم وضوح النتائج أو بسبب الاعتياد على الأنظمة القديمة.\n\nلماذا الخيارات الأخرى خاطئة:\n- نقص المهارات تم معالجته عبر التدريب.\n- نقص في وضوح رؤية المشروع لا يتعلق مباشرة باستخدام برنامج إدارة المشاريع.\n- وجود تواصل مفرط لا يؤدي عادةً إلى انخفاض الالتزام بل قد يؤدي إلى الإرباك.",
    "choices": [
      {
        "text": "الخوف من المجهول",
        "correct": true
      },
      {
        "text": "نقص المهارات المطلوبة",
        "correct": false
      },
      {
        "text": "نقص في وضوح رؤية المشروع",
        "correct": false
      },
      {
        "text": "وجود تواصل مفرط",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع طويل الأمد في بيئة معقدة. يركز مدير المشروع على الحفاظ على عمل جماعي صحي وتعاون فعال.\n\nما هي استراتيجية حل النزاع التي يجب استخدامها داخل الفريق؟",
    "explanation": "الإجابة الصحيحة: حل المشكلات.\n\nالشرح: حل المشكلات (Problem Solving) هو نهج تعاوني يُستخدم لمعالجة النزاعات بطريقة بناءة ودائمة. في بيئات العمل الطويلة والمعقدة، يُفضل هذا الأسلوب لأنه يدعم بناء الثقة ويحافظ على العلاقات طويلة الأمد.\n\nلماذا الخيارات الأخرى خاطئة:\n- التسوية قد تؤدي إلى حلول وسط غير مرضية بالكامل.\n- الاستيعاب يعني التضحية برأي طرف لصالح آخر، وهو غير مستدام.\n- التشاور أسلوب للتواصل وليس استراتيجية لحل النزاعات بحد ذاتها.",
    "choices": [
      {
        "text": "حل المشكلات",
        "correct": true
      },
      {
        "text": "التسوية",
        "correct": false
      },
      {
        "text": "الاستيعاب",
        "correct": false
      },
      {
        "text": "التشاور",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين قائد فريق في مشروع جارٍ. أعضاء الفريق يعملون معًا منذ فترة.\n\nكيف يجب على قائد الفريق أن يبدأ في بناء العلاقات؟",
    "explanation": "الإجابة الصحيحة: سؤال أعضاء الفريق مباشرةً عن الأمور الشخصية والعملية.\n\nالشرح: لبناء علاقات قوية كقائد جديد، من الأفضل التفاعل المباشر مع أعضاء الفريق وسؤالهم عن اهتماماتهم وأسلوب عملهم. هذا يعزز الثقة والتفاهم.\n\nلماذا الخيارات الأخرى خاطئة:\n- توزيع المهام فقط لا يعزز بناء العلاقات.\n- التحدث عن التفضيلات الشخصية من طرف واحد دون الاستماع للفريق قد يُعتبر متسلطًا.\n- طلب المعلومات من زملاء آخرين بدل التواصل المباشر قد يُشعر الفريق بعدم الاحترام أو التجاهل.",
    "choices": [
      {
        "text": "توزيع المهام ومراقبة جودة النتائج.",
        "correct": false
      },
      {
        "text": "التحدث عن التفضيلات الشخصية والتأكد من أن الفريق يفهم أسلوبك.",
        "correct": false
      },
      {
        "text": "طلب بعض المعلومات عن الأعضاء من زملائهم للتعرف عليهم.",
        "correct": false
      },
      {
        "text": "سؤال أعضاء الفريق مباشرةً عن الأمور الشخصية والعملية.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يريد مدير المشروع وضع استراتيجية تحفيز ومكافآت لفريق المشروع.\n\nما هو الأسلوب الأنسب لذلك؟",
    "explanation": "الإجابة الصحيحة: تحديد احتياجات كل عضو من الفريق لتحديد الحوافز المناسبة.\n\nالشرح: ليس كل عضو في الفريق يتحفز بنفس الطريقة. بعضهم قد يفضل المكافآت المالية، وآخرون يفضلون التقدير العلني أو فرص التدريب. لذلك من الأفضل معرفة ما يناسب كل عضو.\n\nلماذا الخيارات الأخرى خاطئة:\n- سؤال قسم الموارد البشرية يعطي أفكارًا عامة، وليس مخصصة.\n- التحقق من الميزانية خطوة إدارية لكنها ليست الطريقة الأنسب لابتكار استراتيجية فعالة.\n- تقديم النتائج علنًا يعتبر أسلوبًا لتقدير العمل وليس استراتيجية تحفيز شاملة.",
    "choices": [
      {
        "text": "سؤال قسم الموارد البشرية عن الحوافز التي يجب تقديمها.",
        "correct": false
      },
      {
        "text": "التحقق من توفر الميزانية لتحديد قيم المكافآت.",
        "correct": false
      },
      {
        "text": "توفير فرصة لتقديم النتائج علنًا.",
        "correct": false
      },
      {
        "text": "تحديد احتياجات كل عضو من الفريق لتحديد الحوافز المناسبة.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "اختر ثلاث طرق لتحسين وممارسة مهارات القيادة. (اختر 3)",
    "explanation": "الإجابات الصحيحة: إشراك الفريق في عملية المشروع، المشاركة النشطة في مهام المشروع، طلب التعليقات وتحليل النتائج.\n\nالشرح: تحسين مهارات القيادة يحتاج إلى مزيج من العمل المباشر مع الفريق، والاستماع إلى آرائهم، والمشاركة في الأنشطة.\n\nلماذا الخيارات الأخرى خاطئة:\n- معاملة جميع أعضاء الفريق بنفس الطريقة ليست دائمًا فعالة؛ كل شخص لديه احتياجات وتحفيزات مختلفة.\n- استخدام الديمقراطية في جميع قرارات الفريق قد يؤدي إلى بطء في اتخاذ القرار في بعض الحالات التي تتطلب الحسم.",
    "choices": [
      {
        "text": "إشراك الفريق في عملية المشروع.",
        "correct": true
      },
      {
        "text": "المشاركة النشطة في مهام المشروع.",
        "correct": true
      },
      {
        "text": "معاملة جميع أعضاء الفريق بنفس الطريقة.",
        "correct": false
      },
      {
        "text": "طلب التعليقات وتحليل النتائج.",
        "correct": true
      },
      {
        "text": "استخدام الديمقراطية في جميع قرارات الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف المشروع، أُبلغ مدير المشروع بحركة في السوق ستجعل نتائج المشروع عديمة الفائدة للعميل. قد تؤدي هذه المعلومات إلى إلغاء المشروع أو على الأقل تغيير كبير في نطاق العمل والنتائج المرجوة.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "explanation": "الإجابة الصحيحة: إجراء مناقشة شفافة مع الراعي، مع عرض تقديم الدعم في تقييم الاستراتيجية إذا لزم الأمر.\n\nالشرح: مدير المشروع مسؤول عن نقل المعلومات ذات التأثير الاستراتيجي إلى الراعي وأصحاب المصلحة وليس اتخاذ القرار بنفسه. يجب الحفاظ على الشفافية والمهنية.\n\nلماذا الخيارات الأخرى خاطئة:\n- إعداد تقارير ومحاولة إقناع العميل بالاستمرار تصرُّف غير أخلاقي.\n- الاستمرار في التنفيذ دون اهتمام بتغيرات السوق ينافي دور مدير المشروع.\n- إيقاف المشروع فورًا قرار يعود للراعي أو أصحاب القرار، وليس لمدير المشروع منفردًا.",
    "choices": [
      {
        "text": "إعداد جميع تقارير الحالة والعروض التوضيحية لإبقاء العميل مركزًا على تنفيذ المشروع الذي كان ناجحًا.",
        "correct": false
      },
      {
        "text": "إجراء مناقشة شفافة مع الراعي، مع عرض تقديم الدعم في تقييم الاستراتيجية إذا لزم الأمر.",
        "correct": true
      },
      {
        "text": "الاستمرار في تنفيذ المشروع، لأن الاستراتيجية التجارية ليست من مسؤوليات مدير المشروع.",
        "correct": false
      },
      {
        "text": "إيقاف المشروع فورًا، لأن مدير المشروع يعلم أنه سيكون عديم الفائدة للعميل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "تم تنفيذ مشروع داخلي وحقق نطاقه في الوقت المحدد، وضمن الميزانية، وبالجودة المتوقعة. كان العميل راضيًا عن النتيجة، مما مكنه من إطلاق منتج جديد في السوق. ومع ذلك، لم يجذب المنتج الاهتمام المتوقع ولم يغطي الاستثمار. يعلم فريق المشروع بهذه النتائج، وهذا يؤثر على معنوياتهم في تنفيذ المشروع التالي.\n\nكيف يجب أن يتعامل مدير المشروع مع هذا الموقف؟ اختر إجابتين.",
    "explanation": "الإجابات الصحيحة: \n1. مناقشة مع الفريق لتوضيح أن نجاح المنتج ليس نتيجة مباشرة للمشروع ولا يعكس أدائهم.\n2. عقد اجتماع مع إدارة الأعمال للتأكد من فهمهم أن المشروع حقق أهدافه.\n\nالشرح:\n- يجب على مدير المشروع دعم الفريق ورفع معنوياتهم من خلال توضيح أن مسؤولية نجاح المنتج في السوق تتعلق بعوامل تجارية وتسويقية خارج نطاق المشروع.\n- من المهم أيضًا التواصل مع إدارة الأعمال لضمان أن الإدارة تفهم الفرق بين نجاح المشروع وتنفيذ مهامه، ونجاح المنتج في السوق.\n\nلماذا الخيارات الأخرى خاطئة:\n- لا اتخاذ أي إجراء يعزز الإحباط لدى الفريق ولا يُظهر القيادة المسؤولة.\n- مناقشة الاستراتيجية مع الراعي التجاري قد تكون مفيدة، لكنها ليست من مهام مدير المشروع الأساسية في هذا السياق.",
    "choices": [
      {
        "text": "مناقشة مع الفريق لتوضيح أن نجاح المنتج ليس نتيجة مباشرة للمشروع ولا  يعكس أدائهم.",
        "correct": true
      },
      {
        "text": "عقد اجتماع مع إدارة الأعمال للتأكد من فهمهم أن المشروع حقق أهدافه.",
        "correct": true
      },
      {
        "text": "لا يلزم اتخاذ أي إجراء، لأن مدير المشروع مسؤول فقط عن تسليمات المشروع.",
        "correct": false
      },
      {
        "text": "مناقشة مع الراعي التجاري للتحقق من الاستراتيجية للمشروع الجديد بناءً على هذه النتيجة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أي من الخطوات التالية تولي اهتمامًا خاصًا لعمليات اتخاذ القرار الجماعي؟",
    "explanation": "الإجابة الصحيحة: تحويل الأفكار إلى أفعال.\n\nالشرح: \n- اتخاذ القرار الجماعي لا يكتفي بتوليد الأفكار أو تعريف المشكلة، بل يتطلب التزامًا فعليًا بتنفيذ الحلول التي تم الاتفاق عليها.\n- تحويل الأفكار إلى أفعال هو الخطوة التي تضمن تحقق القرارات الجماعية على أرض الواقع.\n\nلماذا الخيارات الأخرى خاطئة:\n- تعريف المشكلة وتوليد الحلول خطوات مهمة، لكنها تركز على التحليل وليس على التنفيذ.",
    "choices": [
      {
        "text": "تعريف المشكلة",
        "correct": false
      },
      {
        "text": "توليد حلول للمشكلة",
        "correct": false
      },
      {
        "text": "تحويل الأفكار إلى أفعال",
        "correct": true
      },
      {
        "text": "تخطيط تنفيذ الحل",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-answer",
    "text": "ما هو الفرق بين المخاطر والمشكلات؟ (اختر اثنين).",
    "explanation": "الفرق الأساسي بين المخاطر والمشكلات هو أن المخاطر هي أحداث محتملة أو غير مؤكدة قد تحدث في المستقبل، بينما المشكلات هي أحداث مؤكدة أو وقعت بالفعل وتتطلب معالجة.\n\nالإجابات الصحيحة:\n- المخاطر غير مؤكدة والمشكلات مؤكدة: لأن المخاطر عبارة عن احتمالات بينما المشكلات حقيقية ووقعت.\n- قد لا تحدث المخاطر ولكن المشكلة قد حدثت: لأن المخاطر قد لا تتحقق لكن المشكلات وقعت بالفعل.\n\nالخيارات الخاطئة:\n- المخاطر مؤكدة والمشكلات غير مؤكدة: غير صحيحة لأن المخاطر غير مؤكدة والمشكلات مؤكدة.\n- وقعت المخاطر وقد لا تحدث المشكلات: خاطئة لأن المشكلات هي الأحداث التي وقعت بالفعل.",
    "choices": [
      {
        "text": "المخاطر غير مؤكدة والمشكلات مؤكدة.",
        "correct": true
      },
      {
        "text": "المخاطر مؤكدة والمشكلات غير مؤكدة.",
        "correct": false
      },
      {
        "text": "وقعت المخاطر وقد لا تحدث المشكلات.",
        "correct": false
      },
      {
        "text": "قد لا تحدث المخاطر ولكن المشكلة قد حدثت.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يسعى مدير المشروع إلى تخفيف عبء العمل على قسم تكنولوجيا المعلومات مع تمكين الأعمال من بدء عمليات تنفيذ جديدة ووضع الأساس للحلول المستقبلية.\n\nكيف يجب أن يُسهل مدير المشروع هذا الانتقال؟",
    "explanation": "الإجابة الصحيحة:\n- تمكين وحدات الأعمال من استخدام منصة مبسطة لإدارة مشاريع تكنولوجيا المعلومات لبدء المشاريع ومتابعتها بشكل مستقل.\n\nالشرح:\n- هذا الأسلوب يدعم تفويض السلطة لفرق الأعمال، مما يقلل العبء على قسم تكنولوجيا المعلومات ويسمح ببدء وتنفيذ المشاريع بسرعة ومرونة.\n- فرض سياسات صارمة أو تقييم شامل قد يؤدي إلى بطء وتأخير في تنفيذ المشاريع.\n- التعاون مع فرق متعددة الوظائف مهم لكنه لا يوضح تخفيف العبء مباشرة كما في الإجابة الصحيحة.",
    "choices": [
      {
        "text": "فرض سياسات حوكمة صارمة مركزية داخل قسم تكنولوجيا المعلومات لضمان التوحيد والسيطرة.",
        "correct": false
      },
      {
        "text": "فرض مقترحات مشاريع تكنولوجيا المعلومات الشاملة للتقييم والموافقة قبل بدء أي مشروع.",
        "correct": false
      },
      {
        "text": "تمكين وحدات الأعمال من استخدام منصة مبسطة لإدارة مشاريع تكنولوجيا المعلومات لبدء المشاريع ومتابعتها بشكل مستقل.",
        "correct": true
      },
      {
        "text": "التعاون مع فرق تكنولوجيا المعلومات متعددة الوظائف لتخطيط وتنفيذ المشاريع بشكل مشترك.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "أي من الخيارات التالية تختلف عن الخيارات الأخرى في إدارة أصحاب المصلحة الخارجيين في المشاريع الكبرى؟",
    "explanation": "الإجابات \"الإقناع\"، \"النيابة\"، و\"الأخذ والعطاء\" تمثل استراتيجيات تواصل وتفاعل مرنة تستخدم لإدارة أصحاب المصلحة الخارجيين، وتعتمد على بناء علاقات وتفاوض.\n\nأما \"الأوامر الصارمة\" فهي تختلف لأنها تعبر عن أسلوب إداري قمعي أو مباشر، غير مناسب عادة في إدارة أصحاب المصلحة الخارجيين الذين يتطلب التعامل معهم مهارات دبلوماسية وتفاوض.\n\nلذلك، الإجابة الصحيحة هي \"الأوامر الصارمة\" لأنها تختلف من حيث النهج والأسلوب.",
    "choices": [
      {
        "text": "الإقناع",
        "correct": false
      },
      {
        "text": "النيابة",
        "correct": false
      },
      {
        "text": "الأخذ والعطاء",
        "correct": false
      },
      {
        "text": "الأوامر الصارمة",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أي مما يلي لا يُعتبر من القوى المستندة إلى الموارد في المشاريع الكبرى؟",
    "explanation": "القوى المستندة إلى الموارد تعتمد على استخدام الموارد البشرية بطريقة مرنة مثل التوظيف التعاقدي، توظيف المواهب، أو الإعارة.\n\n\"التوظيف عبر التحكم المباشر\" لا يُعتبر قوة مستندة إلى الموارد لأنه يشير إلى سلطة أو سيطرة مباشرة وليس إلى استخدام الموارد بشكل مرن.\n\nلذا، الإجابة الصحيحة هي \"التوظيف عبر التحكم المباشر\" لأنها تختلف عن الطرق الأخرى التي تعتمد على الموارد بشكل غير مباشر أو مرن.",
    "choices": [
      {
        "text": "التوظيف على أساس تعاقدي",
        "correct": false
      },
      {
        "text": "توظيف المواهب الخبيرة",
        "correct": false
      },
      {
        "text": "التوظيف على أساس الإعارة",
        "correct": false
      },
      {
        "text": "التوظيف عبر التحكم المباشر",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "يحتاج مدير المشروع إلى التأكد من أن منتجات المؤسسة تفي بمعايير وأنظمة حكومية معينة. يقوم فريق مدير المشروع بتطوير وثيقة متطلبات العمل (BRD) للمساعدة في هذا الشأن.\n\nأي من العبارات التالية صحيحة بخصوص متطلبات الامتثال؟ (اختر 2).",
    "explanation": "متطلبات الامتثال تُعتبر عادة من المتطلبات غير الوظيفية لأنها تتعلق بالقيود والمعايير التي يجب أن يتبعها المنتج أو النظام، وليس بوظائفه المباشرة. لذا يجب توثيقها بشكل واضح في وثيقة متطلبات العمل (BRD) لتضمن الالتزام بالقوانين واللوائح.\n\nبالإضافة إلى ذلك، يجب أن تكون هذه المتطلبات جزءًا من نطاق المشروع حتى تتم إدارتها بشكل فعال من قبل فريق المشروع، مما يضمن توافق المنتج مع المعايير التنظيمية المطلوبة.",
    "choices": [
      {
        "text": "متطلبات الامتثال هي متطلبات وظيفية ويجب تضمينها في وثيقة BRD.",
        "correct": false
      },
      {
        "text": "متطلبات الامتثال هي متطلبات غير وظيفية ويجب توثيقها في وثيقة BRD.",
        "correct": true
      },
      {
        "text": "يجب أن تكون متطلبات الامتثال جزءًا من نطاق المشروع ويجب أن تُدار من قبل فريق المشروع.",
        "correct": true
      },
      {
        "text": "يمكن اعتبار متطلبات الامتثال أصولًا تنظيمية ولا تحتاج إلى تضمينها في وثيقة BRD.",
        "correct": false
      },
      {
        "text": "لا يمكن اعتبار متطلبات الامتثال أصولًا تنظيمية ويجب تضمينها في وثيقة BRD.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع في مبادرة تحول تجاري تؤثر على معظم موظفي الشركة البالغ عددهم 10,000 موظف. نطاق المشروع هو تحسين التعاون بين الفرق من خلال تنفيذ منصة سحابية جديدة تحل محل أداة الاتصال المستخدمة منذ 20 عامًا.\n\nما هو عامل النجاح الأكثر أهمية؟",
    "explanation": "في مشاريع التحول التجاري الكبيرة، لا يكفي مجرد تطوير نظام جيد أو واجهة مستخدم جيدة؛ بل يتطلب النجاح تخطيطًا وتنفيذًا فعالًا لإدارة التغيير. إدارة التغيير تساعد الموظفين على التكيف مع الأدوات والعمليات الجديدة، وتقلل مقاومة التغيير، مما يعزز نجاح تبني المنصة الجديدة وتحقيق أهداف المشروع.\n\nلذلك، عامل النجاح الأكثر أهمية هو تخطيط وتنفيذ جيد لإدارة التغيير لضمان قبول المستخدمين النهائيين للنظام الجديد.",
    "choices": [
      {
        "text": "جودة جيدة، يجب ألا تحتوي النسخة النهائية على أي أعطال حرجة.",
        "correct": false
      },
      {
        "text": "واجهة مستخدم جيدة تم تطويرها من قبل مصممين موهوبين.",
        "correct": false
      },
      {
        "text": "تخطيط وتنفيذ جيد لإدارة التغيير.",
        "correct": true
      },
      {
        "text": "عملية تحكم بالتغيير فعالة وسريعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع في مؤسسة يفكر في تنفيذ طريقة تسليم المشروع عبر النهج المرن (Agile). لدى المؤسسة مكتب إدارة مشاريع قوي (PMO) وعملية مراقبة تغييرات محددة جيدًا.\n\nما هو الجانب الرئيسي الذي يجب على مدير المشروع التأكيد عليه كأقوى حجة لتبني النهج المرن؟",
    "explanation": "النهج المرن (Agile) يتميز بالقدرة على التكيف مع التغييرات غير المتوقعة وتغير توقعات العمل بطريقة سريعة وفعالة، مما يجعله مناسبًا بشكل خاص للمشاريع التي تواجه بيئة متغيرة أو متطلبات غير ثابتة. هذا هو السبب الرئيسي لاختيار النهج المرن، إذ يسمح بالتجاوب المستمر مع المتغيرات بدلاً من الالتزام الصارم بالخطة الأصلية.\n\nالخيارات الأخرى صحيحة من حيث بعض مميزات الأجايل، لكن ليست السبب الأساسي الذي يُعزز اعتماد النهج المرن في المؤسسات التي تمتلك عمليات صارمة.",
    "choices": [
      {
        "text": "يمكن أن يحسن النهج المرن الجودة من خلال التسليم المتكرر والإصلاح الفعال للأعطال.",
        "correct": false
      },
      {
        "text": "توفر الفرق المرنة مرونة في استيعاب التغييرات المخططة مع تسريع عمليات الموافقة.",
        "correct": false
      },
      {
        "text": "يستخدم مالك المنتج قائمة تُعرف باسم قائمة المهام (backlog) لتحديد أولويات العمل.",
        "correct": false
      },
      {
        "text": "النهج المرن مناسب جدًا للتعامل مع التغييرات غير المتوقعة وتغير توقعات العمل.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "مدير مشروع في منظمة حكومية كبيرة قرر توفير التكاليف عن طريق تغيير شريك التنفيذ المحلي، ويفكر في استخدام موارد خارجية.\n\nما هي المخاطر الرئيسية المرتبطة باستخدام الموارد الخارجية؟ (اختر 3).",
    "explanation": "استخدام الموارد الخارجية يمكن أن يخلق تحديات إضافية بسبب اختلافات التوقيت والثقافة، مما يتطلب إشرافًا أكبر لضمان التنسيق الفعال. بالإضافة إلى ذلك، قد تفتقر الموارد الخارجية إلى المعرفة المتخصصة في مجال الأعمال مقارنة بالشريك السابق، مما قد يؤثر على جودة التنفيذ. كما أن الفروقات الجيوسياسية قد تؤدي إلى تأخيرات أو تعقيدات في التهيئة والتكيف مع بيئة العمل.\n\nالخيارات الأخرى قد تكون صحيحة في بعض الحالات، لكنها ليست المخاطر الأساسية أو الأكثر شيوعًا عند استخدام الموارد الخارجية.",
    "choices": [
      {
        "text": "قد تحتاج الموارد الخارجية إلى إشراف أكبر بسبب اختلافات التوقيت والثقافة.",
        "correct": true
      },
      {
        "text": "قد لا تمتلك الموارد الخارجية نفس المعرفة في مجال الأعمال مثل البائع السابق.",
        "correct": true
      },
      {
        "text": "قد تحتاج الموارد الخارجية إلى جهد أكبر في التخطيط وإدارة ميزانيات المشروع.",
        "correct": false
      },
      {
        "text": "قد تحتاج الموارد الخارجية إلى وقت أطول في التهيئة بسبب الفروقات الجيوسياسية.",
        "correct": true
      },
      {
        "text": "قد تحتاج الموارد الخارجية إلى توثيق مفصل بسبب الفروقات الزمنية والثقافية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "تم تعيين مدير مشروع لمشروع معقد للغاية ويتطلب خبرة فنية عالية. يعمل المدير حاليًا على خطة الموارد، ويعتزم أن يوصي الراعي باستخدام موارد خارجية بدلاً من الداخلية.\n\nما هي المخاطر التي يمكن التخفيف منها باستخدام موردين خارجيين لتسليم بعض مكونات المشروع؟ (اختر 3).",
    "explanation": "استخدام موردين خارجيين يمكن أن يساعد في التخفيف من مخاطر الجدول الزمني من خلال استغلال خبراتهم وقدرتهم على تسريع التسليم. كذلك، المخاطر الفنية تقل عندما يتم الاستعانة بموارد خارجية متخصصة لديها خبرة فنية عالية بالمكونات المطلوبة. بالإضافة إلى ذلك، يمكن تقليل مخاطر نطاق العمل من خلال وضوح وتحديد دقيق لما سيسلمه المورد الخارجي، مما يقلل من احتمالات الانحراف أو التأخير الناتج عن عدم وضوح النطاق.\n\nأما المخاطر المالية والسياسية فهي أقل احتمالًا أن تخفف فقط عن طريق الموردين الخارجيين، بل قد تزيد في بعض الحالات بسبب تكاليف أعلى أو قضايا تعاقدية.",
    "choices": [
      {
        "text": "المالية",
        "correct": false
      },
      {
        "text": "الجدول الزمني",
        "correct": true
      },
      {
        "text": "الفنية",
        "correct": true
      },
      {
        "text": "السياسية",
        "correct": false
      },
      {
        "text": "نطاق العمل",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ما الأداة التي يجب على مدير المشروع دمجها بشكل أفضل لتحديد ومعالجة مقاومة أصحاب المصلحة الشائعة تجاه التغيير؟",
    "explanation": "إدارة التغيير هي الأداة الرئيسية التي تساعد مدير المشروع على التعرف على مقاومة أصحاب المصلحة تجاه التغيير ومعالجتها بطريقة منظمة. من خلال تطبيق إدارة التغيير، يمكن توجيه جهود التواصل، التدريب، والدعم النفسي لأصحاب المصلحة لتخفيف المخاوف، تعزيز التقبل، وتحقيق النجاح في تطبيق التغييرات.\n\nبينما إدارة المخاطر وأصحاب المصلحة والاتصالات مهمة أيضًا، إلا أن إدارة التغيير تركز بشكل مباشر على مقاومة التغيير.",
    "choices": [
      {
        "text": "إدارة التغيير",
        "correct": true
      },
      {
        "text": "إدارة المخاطر",
        "correct": false
      },
      {
        "text": "إدارة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "إدارة الاتصالات",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد مدير المشروع أصحاب المصلحة لمشروع تطوير برمجيات: فريق المبيعات سيكون المستخدم الأساسي للتطبيق الجديد، قسم تكنولوجيا المعلومات سيكون مسؤولاً عن نشر وصيانة التطبيق، والراعي التنفيذي هو من يوافق على المشروع ويموله. مدير المشروع في مرحلة التخطيط ويجب عليه إشراك أصحاب المصلحة.\n\nما هو أهم شيء يجب على مدير المشروع فعله لبناء فهم مشترك؟",
    "explanation": "أهم خطوة لبناء فهم مشترك بين جميع أصحاب المصلحة هي تحديد احتياجاتهم وتوقعاتهم بوضوح منذ البداية. ذلك يسمح لمدير المشروع بتخطيط العمل بما يتماشى مع أهداف المستخدمين النهائيين، متطلبات قسم تكنولوجيا المعلومات، وتوقعات الراعي التنفيذي. عقد اجتماع بدء المشروع أو إعداد خطة اتصال مهمان، لكن لن يحققوا الفائدة الكاملة بدون تحديد دقيق للاحتياجات أولاً.",
    "choices": [
      {
        "text": "عقد اجتماع بدء المشروع مع جميع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إنشاء سجل أصحاب المصلحة وخطة الاتصال.",
        "correct": false
      },
      {
        "text": "تحديد احتياجات وتوقعات أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "توثيق مخاوف ومخاطر أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يرتب فريق المشروع لاختبار المستخدم ضمن المشروع، لكنه لا يمتلك خادمًا قويًا بما فيه الكفاية. قام الفريق بطلب خادم جديد وتم تأجيل الاختبار.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "explanation": "بما أن الخادم الجديد مطلوب لتنفيذ الاختبار بشكل مناسب، فإن الخيار الأنسب هو انتظار وصول الخادم الجديد مع إعادة تقييم الجدول الزمني لاختبار المستخدم. هذا يضمن جودة الاختبار ولا يعرض النتائج أو رضا العميل للخطر. محاولة استخدام خادم غير مناسب أو إلغاء الاختبار قد يؤديان إلى مشكلات لاحقة في جودة المنتج.",
    "choices": [
      {
        "text": "إلغاء اختبار المستخدم من خطة المشروع.",
        "correct": false
      },
      {
        "text": "استخدام الخادم الحالي لإجراء الاختبار.",
        "correct": false
      },
      {
        "text": "طلب تسريع توريد الخادم الجديد من المورد.",
        "correct": false
      },
      {
        "text": "الانتظار لوصول الخادم الجديد وإعادة تقييم الجداول الزمنية لاختبار المستخدم.",
        "correct": true
      }
    ]
  },
  {
  "type": "multiple-choice",
  "text": "يقوم الفريق ومالك المنتج بمراجعة قصص المستخدم في اجتماع تخطيط التكرار. أثناء المراجعة، تم تحديد أن بعض القصص ذات القيمة العالية مرتبطة بمزيد من المخاطر.\n\nماذا يجب أن يفعل مدير المشروع في بيئة أجايل؟",
  "explanation": "الإجابة الصحيحة هي: يوصي بأن يتضمن الفريق القصص ذات المخاطر في التكرارات المبكرة بدلاً من المتأخرة.\n\nالسبب: في بيئة أجايل، يُفضل دائمًا التعامل مع العناصر ذات القيمة العالية والمخاطر المرتفعة مبكرًا لتقليل أثرها على المشروع. هذا النهج يسمح للفريق باكتشاف أي مشكلات مبكرًا والتكيف مع التحديات.\n\nلماذا الخيارات الأخرى خاطئة:\n- اختيار الفريق للقصص منخفضة المخاطر فقط قد يؤدي إلى تأجيل المشاكل الأكبر، مما يعرض المشروع للخطر لاحقًا.\n- العمل مع مالك المنتج ضروري، لكن الهدف هنا هو ترتيب الأولويات بناءً على القيمة والمخاطر وليس مجرد المناقشة.\n- تحليل باريتو يُستخدم عادة لتحليل المشكلات أو العيوب، وليس لتحديد أولويات قصص المستخدم في التخطيط.",
  "choices": [
    {
      "text": "يوصي بأن يتضمن الفريق القصص ذات المخاطر في التكرارات المبكرة بدلاً من المتأخرة.",
      "correct": true
    },
    {
      "text": "يوصي بأن يختار الفريق القصص منخفضة المخاطر لإكمالها بسهولة والحفاظ على الحافز.",
      "correct": false
    },
    {
      "text": "يعمل مع مالك المنتج لتحديد القصص التي يجب تضمينها في التكرار.",
      "correct": false
    },
    {
      "text": "يستخدم تحليل باريتو لتحديد أي القصص يمكن إكمالها بشكل أسرع.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يرسل مدير المشروع طلبات لعقد اجتماعات دورية واجتماعات يومية خلال مرحلة إعداد المشروع، لكن أصحاب المصلحة من جهة الأعمال يرفضون حضور هذه الاجتماعات.\n\nماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة هي: التحقق من سبب رفض الاجتماعات.\n\nالسبب: مدير المشروع بحاجة لفهم الدافع وراء رفض حضور الاجتماعات، فقد تكون هناك أسباب مثل تكرار الاجتماعات أو توقيتها أو عدم وضوح أهميتها بالنسبة لهم. بعد معرفة السبب، يمكن تعديل خطة التواصل بما يتناسب مع ظروفهم.\n\nلماذا الخيارات الأخرى خاطئة:\n- إعادة مشاركة خطة الاتصالات بدون معرفة السبب الأساسي لن يكون فعالاً.\n- وضع قواعد سلوك دون معالجة المشكلة الأساسية قد يسبب توترًا.\n- عقد اجتماع انطلاق المشروع خطوة مهمة، لكنها ليست الحل للمشكلة المحددة هنا.",
  "choices": [
    {
      "text": "التحقق من سبب رفض الاجتماعات.",
      "correct": true
    },
    {
      "text": "إعادة مشاركة خطة الاتصالات.",
      "correct": false
    },
    {
      "text": "وضع قواعد سلوك للفريق في المشروع.",
      "correct": false
    },
    {
      "text": "عقد اجتماع انطلاق المشروع.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تخطط إدارة البحث والتطوير لتطوير منتج جديد سيدشن خط أعمال جديد للمؤسسة.\n\nما الذي يجب على مدير المشروع القيام به لزيادة فرص نجاح المشروع؟",
  "explanation": "الإجابة الصحيحة هي: تنظيم جلسة عمل تركز على النطاق والرؤية والرسالة للمبادرة.\n\nالسبب: عندما تبدأ مبادرة جديدة تمامًا مثل منتج جديد لخط أعمال جديد، من الضروري أولاً توحيد الفهم بين جميع الأطراف حول ما هو المطلوب ولماذا يتم تنفيذ هذا المشروع. التركيز على الرؤية والنطاق والرسالة يساعد في توجيه كل مراحل المشروع لاحقًا.\n\nلماذا الخيارات الأخرى خاطئة:\n- بدء خطة المشروع مباشرة باستخدام قالب سابق قد يؤدي إلى تجاهل خصوصيات هذا المشروع الجديد.\n- تحليل التأثير ودراسات الجدوى مهمة، لكنها تأتي بعد وضوح الرؤية والنطاق.\n- دراسة الجدوى ليست بديلاً عن توضيح الرؤية والنطاق، بل خطوة تكميلية لاحقة.",
  "choices": [
    {
      "text": "بدء تطوير خطة إدارة المشروع باستخدام قالب مشروع سابق من مكتب إدارة المشاريع (PMO).",
      "correct": false
    },
    {
      "text": "إجراء تحليل تأثير للمبادرة الجديدة لتحديد كيفية تنفيذ المشروع.",
      "correct": false
    },
    {
      "text": "تنظيم جلسة عمل تركز على النطاق والرؤية والرسالة للمبادرة.",
      "correct": true
    },
    {
      "text": "إجراء دراسة مقارنة لتحديد جدوى المبادرة تجاريًا.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "منذ بداية المشروع، يواصل مالك المنتج السؤال خلال الاجتماعات الرسمية عن الميزانية المنفقة لكل تكرار. يبدو أن مالك المنتج مهتم أكثر بالتكلفة من المنتج نفسه.\n\nما الذي كان يجب على مدير المشروع فعله في وقت سابق لتغيير سلوك مالك المنتج؟",
  "explanation": "الإجابة الصحيحة هي: العمل مع مالك المنتج لتوضيح دوره في مشروع أجايل ونطاق الاجتماعات الرسمية.\n\nالسبب: في بيئة أجايل، دور مالك المنتج يركز على تحديد أولويات العمل والقيمة التي يجلبها المنتج للمستخدم النهائي، وليس على إدارة الميزانية. توضيح هذا الدور مبكرًا يجنب انشغال مالك المنتج بأمور ليست من ضمن مسؤولياته.\n\nلماذا الخيارات الأخرى خاطئة:\n- استخدام أساليب تقدير مختلفة أو تقديم تقارير مالية دورية قد يغذي هذا السلوك بدلًا من تصحيحه.\n- العمل بعقد بسعر ثابت لا يحل المشكلة الأساسية وهي عدم وضوح الدور.",
  "choices": [
    {
      "text": "العمل على أساليب مختلفة في التقدير لإعطاء ثقة حول التكاليف لكل إصدار.",
      "correct": false
    },
    {
      "text": "إعداد خطة لإدارة الاتصالات تتضمن تقارير عن الميزانية المنفقة في كل تكرار مقابل المخطط.",
      "correct": false
    },
    {
      "text": "العمل مع مالك المنتج لتوضيح دوره في مشروع أجايل ونطاق الاجتماعات الرسمية.",
      "correct": true
    },
    {
      "text": "العمل بعقد بسعر ثابت لتحويل اهتمام مالك المنتج من التكلفة إلى القيمة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ما الذي يمكن لمدير المشروع فعله لإعلان المشروع رسميًا وتوصيل المعلومات ذات الصلة لأصحاب المصلحة ثم كسب التزامهم؟",
  "explanation": "الإجابة الصحيحة: تطوير خطة إدارة الاتصالات.\n\n- لماذا؟\nخطة إدارة الاتصالات تحدد كيفية تبادل المعلومات مع أصحاب المصلحة طوال المشروع، وهي أداة رسمية تساعد على كسب التزامهم من خلال توصيل ما يحتاجون لمعرفته بشكل منهجي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إنشاء ميثاق المشروع يعلن بدء المشروع لكنه لا يغطي التواصل التفصيلي.\n- اجتماع انطلاق المشروع خطوة مهمة لكنه حدث لمرة واحدة، وليس خطة مستمرة.\n- مصفوفة RACI تحدد المسؤوليات لكنها لا تركز على إدارة التواصل.",
  "choices": [
    {
      "text": "إنشاء ميثاق المشروع.",
      "correct": false
    },
    {
      "text": "عقد اجتماع انطلاق المشروع.",
      "correct": false
    },
    {
      "text": "تطوير خطة إدارة الاتصالات.",
      "correct": true
    },
    {
      "text": "إعداد وتوزيع مصفوفة المسؤوليات (RACI).",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أثناء إعداد التقرير الثالث لتقدم المشروع، يكتشف مدير المشروع أن المشروع سيواجه تأخيرات بسبب تأخر تسليم المواد. كان التقريرين السابقين يشيران إلى أن المشروع يسير حسب الخطة.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
  "explanation": "الإجابة الصحيحة: إضافة التأخير إلى سجل القضايا وتضمينه في تقرير المشروع.\n\n- لماذا؟\nعند اكتشاف قضية تؤثر على المشروع، يجب توثيقها رسميًا في سجل القضايا لضمان معالجتها وتتبعها، ثم إدراجها في تقارير الأداء.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مناقشة الأمر مع الفريق خطوة محتملة لكنها لا تعوّض التوثيق الرسمي.\n- الاتصال بمدير المشتريات خطوة تكتيكية لكنها ليست الإجراء الأول الضروري.\n- تصعيد المشكلة قرار لاحق يعتمد على تقييم مدى خطورة التأخير.",
  "choices": [
    {
      "text": "مناقشة الأمر مع فريق المشروع لتحديد أنسب طريقة للاستجابة.",
      "correct": false
    },
    {
      "text": "إضافة التأخير إلى سجل القضايا وتضمينه في تقرير المشروع.",
      "correct": true
    },
    {
      "text": "الاتصال بمدير المشتريات لتسريع تسليم المواد.",
      "correct": false
    },
    {
      "text": "تصعيد المشكلة إلى مالك المشروع وطلب تغيير الجدول الزمني.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تمر المنظمة بتحول تجاري. تم تعيين مدير المشروع لمشروع يتعلق بأحد خطوط الأعمال الجديدة.\n\nما الذي يجب على مدير المشروع والفريق فعله قبل تحديد نطاق المشروع؟",
  "explanation": "الإجابة الصحيحة: تكييف وتخصيص الأصول الحالية.\n\n- لماذا؟\nقبل تحديد نطاق المشروع، من المهم مراجعة الأصول التنظيمية الموجودة مثل قوالب WBS أو خطط سابقة أو دروس مستفادة وتكييفها لتتناسب مع متطلبات المشروع الجديد، مما يوفر الوقت ويضمن الاتساق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- قيادة اجتماع للمشتريات يتم لاحقًا بعد تحديد النطاق.\n- إنشاء WBS يأتي بعد تحديد النطاق وليس قبله.\n- الموافقة على دراسة الجدوى تحدث عادة قبل بدء المشروع وليست ضمن مهام مدير المشروع في مرحلة التخطيط.",
  "choices": [
    {
      "text": "قيادة اجتماع للمشتريات.",
      "correct": false
    },
    {
      "text": "إنشاء هيكل تجزئة العمل (WBS).",
      "correct": false
    },
    {
      "text": "تكييف وتخصيص الأصول الحالية.",
      "correct": true
    },
    {
      "text": "الموافقة على دراسة الجدوى (business case).",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تقوم شركة بتنفيذ مشروع بعقد بسعر ثابت مع أحد الموردين. أثناء التنفيذ، وافق المورد على تسليم متطلبات إضافية لم تكن مدرجة في العقد. لتلبية النطاق الموسع، أضاف الطرفان المزيد من الموارد للحفاظ على الجدول الزمني المخطط.\n\nما هي التقنية التي يتم تطبيقها في هذا المشروع؟",
  "explanation": "الإجابة الصحيحة: التسريع (Crashing).\n\n- لماذا؟\nCrashing هي تقنية جدولة تهدف إلى تقليل مدة المشروع عبر إضافة موارد إضافية دون تغيير نطاق العمل. في هذا السيناريو، تمت إضافة موارد للحفاظ على الجدول.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التنفيذ المتوازي (Fast tracking) يعني تنفيذ الأنشطة بالتوازي بدلاً من تسلسلها.\n- تسوية الموارد (Resource leveling) تُستخدم لضبط الجدول بناءً على توافر الموارد وليس لتسريعه.\n- الفترة التمهيدية والتأخير (Lead and lag) تستخدم لتعديل العلاقات الزمنية بين الأنشطة وليس لتقليل المدة بإضافة موارد.",
  "choices": [
    {
      "text": "التنفيذ المتوازي (Fast tracking)",
      "correct": false
    },
    {
      "text": "التسريع (Crashing)",
      "correct": true
    },
    {
      "text": "تسوية الموارد (Resource leveling)",
      "correct": false
    },
    {
      "text": "الفترة التمهيدية والتأخير (Lead and lag)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقوم مدير المشروع بإعداد خطة إدارة المشروع لتقديمها إلى الراعي خلال أسبوعين. ومع ذلك، يريد الراعي مراجعة التقديرات الأولية للموارد قبل الموعد النهائي.\n\nماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: مشاركة نسخة أولية من هيكل توزيع الموارد (RBS) مع الراعي.\n\n- لماذا؟\nهيكل توزيع الموارد (RBS) يعرض توزيع وتقديرات الموارد المطلوبة للمشروع، وهو مناسب لمراجعة التقديرات الأولية من قبل الراعي قبل اكتمال الخطة الكاملة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب الانتظار حتى الانتهاء من WBS قد يؤخر العملية ولا يلبّي طلب الراعي المبكر.\n- مشاركة ورقة تقدير الميزانية (BES) قد لا توضح تفاصيل الموارد بشكل كافٍ في هذه المرحلة.\n- إعادة مشاركة بيان العمل (SOW) لا تقدم تفاصيل التقديرات المطلوبة للموارد.",
  "choices": [
    {
      "text": "طلب من الراعي الانتظار حتى يتم الانتهاء من هيكل تجزئة العمل (WBS).",
      "correct": false
    },
    {
      "text": "مشاركة نسخة أولية من ورقة تقدير الميزانية (BES) مع الراعي.",
      "correct": false
    },
    {
      "text": "إعادة مشاركة بيان العمل (SOW) مع الراعي.",
      "correct": false
    },
    {
      "text": "مشاركة نسخة أولية من هيكل توزيع الموارد (RBS) مع الراعي.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "طلب العميل تغييرًا على وظيفة سيتم تسليمها في التكرار التالي. تم تعيين المختص المسؤول عن هذه الوظيفة مؤخرًا في مشروع آخر.\n\nما الذي يجب على مدير المشروع فعله أولًا؟",
  "explanation": "الإجابة الصحيحة: التفاوض بشأن توافر المورد.\n\n- لماذا؟\nمن المهم أولاً التحقق من إمكانية توفر المختص لتنفيذ التغيير المطلوب قبل اتخاذ خطوات أخرى، لضمان استمرارية العمل وعدم تأخير التسليم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب مورد جديد من قسم الموارد البشرية قد يكون غير ضروري قبل التحقق من التوفر.\n- طلب مورد جديد من الراعي قبل استكشاف الخيارات الحالية قد يكون مكلفًا وغير فعال.\n- إبلاغ العميل بعدم إمكانية التنفيذ قبل التحقق من التوافر يعد استباقيًا وغير مهني.",
  "choices": [
    {
      "text": "طلب مورد جديد من قسم الموارد البشرية.",
      "correct": false
    },
    {
      "text": "طلب مورد جديد من الراعي.",
      "correct": false
    },
    {
      "text": "التفاوض بشأن توافر المورد.",
      "correct": true
    },
    {
      "text": "إبلاغ العميل بعدم إمكانية تنفيذ التغيير الجديد.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "بدأ مدير المشروع للتو في بناء الفريق لمشروع ضخم ومعقد. يهتم مدير المشروع بشدة بإقامة تواصل فعال مع فريقه الكبير.\n\nما الذي يجب أن يفعله المدير لتحقيق ذلك؟",
  "explanation": "الإجابة الصحيحة: إنشاء عملية لمشاركة المعلومات مع جميع أعضاء الفريق.\n\n- لماذا؟\nلضمان تواصل فعال في فريق كبير، من الضروري وجود عملية واضحة ومنظمة لمشاركة المعلومات تتيح وصول الجميع للمستجدات والقرارات بشكل منتظم وموثوق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تنظيم أنشطة جماعية مفيد ولكنه لا يكفي بمفرده لضمان التواصل المنتظم.\n- التقييم الواضح والمبكر مهم لكنه لا يغطي التواصل المستمر.\n- السماح بتبادل حر للأفكار جيد لكنه يحتاج إلى إطار تنظيمي لضمان فعاليته في فرق كبيرة.",
  "choices": [
    {
      "text": "تنظيم أنشطة جماعية لمساعدة أعضاء الفريق على التعبير عن اهتماماتهم.",
      "correct": false
    },
    {
      "text": "إنشاء عملية لمشاركة المعلومات مع جميع أعضاء الفريق.",
      "correct": true
    },
    {
      "text": "استخدام تقييم واضح وفي الوقت المناسب للوضع مع أعضاء الفريق.",
      "correct": false
    },
    {
      "text": "السماح بتبادل حر للأفكار والآراء بين أعضاء الفريق.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "بعد الانتهاء من تحليل أصحاب المصلحة، أصبح مدير المشروع في مرحلة تخطيط الإجراءات. ماذا يجب أن يفعل مدير المشروع مع أصحاب المصلحة الذين ليس لديهم اهتمام أو تأثير في المشروع؟",
  "explanation": "الإجابة الصحيحة: مراقبة هؤلاء أصحاب المصلحة عن كثب.\n\n- لماذا؟\nحتى أصحاب المصلحة الذين لا يبدون اهتمامًا أو تأثيرًا كبيرًا يجب مراقبتهم بانتظام لتحديد أي تغييرات قد تطرأ على وضعهم وتجنب مفاجآت غير متوقعة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تشجيع أو التركيز بشكل كبير على أصحاب المصلحة غير المهتمين قد يستهلك موارد بلا جدوى.\n- استغلال هؤلاء أصحاب المصلحة غير مناسب لأنهم ليس لديهم تأثير أو مصلحة في المشروع.",
  "choices": [
    {
      "text": "مراقبة هؤلاء أصحاب المصلحة عن كثب.",
      "correct": true
    },
    {
      "text": "تشجيع هؤلاء أصحاب المصلحة بشكل كبير.",
      "correct": false
    },
    {
      "text": "التركيز بانتباه على هؤلاء أصحاب المصلحة.",
      "correct": false
    },
    {
      "text": "استغلال هؤلاء أصحاب المصلحة بشكل واضح.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أبلغ أحد البائعين مدير المشروع أن معدات المشروع يمكن تسليمها في وقت أبكر من المتوقع. يدرك مدير المشروع أن هذه فرصة لإنهاء المشروع قبل الموعد المحدد.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
  "explanation": "الإجابة الصحيحة: تحديد ما إذا كانت هناك مخاطر.\n\n- لماذا؟\nعلى مدير المشروع تقييم تأثير تسليم المعدات المبكر، بما في ذلك تحديد أي مخاطر محتملة مثل قبول الجودة أو التأثير على الجدول الزمني العام.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب موافقة الإدارة قد يكون ضروريًا لاحقًا لكن أول خطوة هي التقييم.\n- استخدام المعدات المقدمة مباشرة بدون تقييم قد يؤدي لمشاكل.\n- تعديل جدول المشروع يجب أن يتم بعد تحليل المخاطر والفرص.",
  "choices": [
    {
      "text": "طلب موافقة الإدارة.",
      "correct": false
    },
    {
      "text": "استخدام المعدات المقدمة.",
      "correct": false
    },
    {
      "text": "تعديل جدول المشروع.",
      "correct": false
    },
    {
      "text": "تحديد ما إذا كانت هناك مخاطر.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أبلغ أحد الموردين أن لديهم طاقة إنتاجية زائدة، مما قد يؤخر التسليم. ما الذي يجب على مدير المشروع تحديثه؟",
  "explanation": "الإجابة الصحيحة: سجل المخاطر.\n\n- لماذا؟\nطاقة الإنتاج الزائدة التي قد تؤخر التسليم تعتبر خطرًا محتملاً يجب تسجيله لتخطيط الاستجابة المناسبة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- سجل أصحاب المصلحة غير مناسب لأنه يخص الأشخاص ذوي المصلحة.\n- سجل القضايا يُستخدم للمشكلات الحالية، وليس للمخاطر المحتملة.\n- جدول المشروع قد يتغير لاحقًا بعد معالجة المخاطر وليس مباشرةً عند تلقي المعلومة.",
  "choices": [
    {
      "text": "سجل المخاطر.",
      "correct": true
    },
    {
      "text": "سجل أصحاب المصلحة.",
      "correct": false
    },
    {
      "text": "سجل القضايا.",
      "correct": false
    },
    {
      "text": "جدول المشروع.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تم تحديد خطر كبير في المشروع، وتم تنفيذ خطة إدارة المخاطر. بعد إتمام الإجراءات المعتمدة، ماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: تحديد مخاطر جديدة ومراقبة المخاطر المتبقية.\n\n- لماذا؟\nبعد تنفيذ خطة إدارة المخاطر والتعامل مع الخطر الكبير، يجب على مدير المشروع الاستمرار في مراقبة أي مخاطر متبقية بالإضافة إلى تحديد مخاطر جديدة قد تظهر. هذا يساعد في الحفاظ على السيطرة على المخاطر طوال مدة المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث خطة إدارة المخاطر قد يكون جزءًا من العمل لكنه ليس الخطوة الأساسية التالية بعد التنفيذ.\n- تعديل جدول المشروع والميزانية يعتمد على تأثير الخطر، لكنه ليس الإجراء الأول بعد الانتهاء من الإجراءات.\n- تحديث الدروس المستفادة يتم عادة في نهاية المشروع وليس مباشرة بعد معالجة خطر.",
  "choices": [
    {
      "text": "تحديث خطة إدارة المخاطر.",
      "correct": false
    },
    {
      "text": "تعديل جدول المشروع والميزانية.",
      "correct": false
    },
    {
      "text": "تحديث الدروس المستفادة.",
      "correct": false
    },
    {
      "text": "تحديد مخاطر جديدة ومراقبة المخاطر المتبقية.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "تعتمد نتائج المشروع بشكل كبير على نشاط السوق المالية. لذلك، يقدم المستشار المالي للشركة توقعات يومية لسعر الصرف. تم تخطيط ميزانية المشروع باستخدام سيناريو تحفظي بافتراض تقلبات كبيرة في سعر الصرف. الآن يرغب مدير المشروع في مراجعة هذه الميزانية لتحديث احتمال وتأثير سيناريو جديد محتمل بناءً على الظروف المالية الحالية.\n\nإلى ماذا يجب أن يرجع مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: سجل المخاطر.\n\n- لماذا؟\nسجل المخاطر يحتوي على كل المخاطر التي قد تؤثر على المشروع، بما في ذلك السيناريوهات المتعلقة بتقلبات سعر الصرف، ويجب تحديثه باستمرار لتقييم احتمال وتأثير هذه المخاطر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- سجل أصحاب المصلحة يتعلق بأشخاص ذوي تأثير وليس بالمخاطر المالية.\n- الدروس المستفادة توثق الخبرات السابقة ولا تعالج تحديثات المخاطر الحالية.\n- ظروف السوق معلومات خارجية لا تُستخدم كمرجع رسمي لإدارة المخاطر بالمشروع.",
  "choices": [
    {
      "text": "سجل أصحاب المصلحة",
      "correct": false
    },
    {
      "text": "سجل المخاطر",
      "correct": true
    },
    {
      "text": "الدروس المستفادة",
      "correct": false
    },
    {
      "text": "ظروف السوق",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ما هي العملية التي ينفذها مدير المشروع لتحديد أولويات المخاطر الفردية في المشروع لتحليلها أو اتخاذ إجراء بشأنها، من خلال تقييم احتمال حدوثها وتأثيرها وخصائص أخرى؟",
  "explanation": "الإجابة الصحيحة: تحليل المخاطر النوعي.\n\n- لماذا؟\nتحليل المخاطر النوعي هو العملية التي يقوم فيها مدير المشروع وفريقه بتقييم كل خطر بناءً على احتمالية حدوثه وتأثيره لتحديد أولويات التعامل معه، وهو يركز على تقييم المخاطر بشكل غير رقمي أو كمي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل المخاطر الكمي يستخدم بيانات رقمية لتقدير تأثير المخاطر ولكنه يأتي بعد التحليل النوعي.\n- تحديد المخاطر هو المرحلة الأولى لجمع المخاطر وليس لتحديد الأولويات.\n- تخطيط إدارة المخاطر هو إعداد الإطار العام لإدارة المخاطر، وليس تحديد أولويات المخاطر الفردية.",
  "choices": [
    {
      "text": "تحليل المخاطر الكمي",
      "correct": false
    },
    {
      "text": "تحليل المخاطر النوعي",
      "correct": true
    },
    {
      "text": "تحديد المخاطر",
      "correct": false
    },
    {
      "text": "تخطيط إدارة المخاطر",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أنهى مدير المشروع تحليل المخاطر النوعي مع فريقه. ما هي مستندات المشروع التي قد تحتاج إلى تحديث بناءً على هذه المعلومات؟",
  "explanation": "الإجابة الصحيحة: سجل المخاطر، سجل الافتراضات، سجل القضايا، تقرير المخاطر.\n\n- لماذا؟\nبعد إتمام التحليل النوعي، يجب تحديث سجل المخاطر لتعكس أولويات وتقييمات المخاطر الجديدة، كما قد تؤثر هذه النتائج على الافتراضات والقضايا المفتوحة ويجب توثيقها كذلك في تقرير المخاطر لضمان متابعة فعالة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خيار 'سجل المخاطر، تقرير المخاطر، الدروس المستفادة' غير كامل لأنه لا يشمل سجل الافتراضات وسجل القضايا.\n- خيار 'خطة إدارة المخاطر، سجل الافتراضات' لا يشمل الوثائق الأساسية التي تتغير مباشرة بسبب التحليل النوعي.\n- خيار 'سجل المخاطر، تقرير المخاطر' ناقص لأنه لا يغطي جميع المستندات المرتبطة بالمخاطر والافتراضات والقضايا.",
  "choices": [
    {
      "text": "سجل المخاطر، تقرير المخاطر، الدروس المستفادة",
      "correct": false
    },
    {
      "text": "خطة إدارة المخاطر، سجل الافتراضات",
      "correct": false
    },
    {
      "text": "سجل المخاطر، سجل الافتراضات، سجل القضايا، تقرير المخاطر",
      "correct": true
    },
    {
      "text": "سجل المخاطر، تقرير المخاطر",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أحد الموردين في مشروع تنظيمي مسؤول عن إجراء تغييرات على المكونات. من غير المرجح أن يفي المورد بالجدول الزمني للمشروع. استنادًا إلى خطة الاستجابة للمخاطر، حصل مدير المشروع على موافقة أصحاب المصلحة لاستخدام النماذج الورقية حتى يتم تنفيذ التغييرات. ومع ذلك، لا يزال من الممكن ألا تكون التغييرات على النماذج الورقية جاهزة في الوقت المناسب.\n\nما نوع الخطر الذي يواجهه مدير المشروع في هذه الحالة؟",
  "explanation": "الإجابة الصحيحة: خطر متبقٍ.\n\n- لماذا؟\nالخطر المتبقّي هو الخطر الذي يبقى بعد تطبيق خطة الاستجابة، أي أنه لا يمكن التخلص منه تمامًا ولكن يتم تقليله إلى مستوى مقبول. هنا، بالرغم من اعتماد النماذج الورقية كبديل، يبقى هناك احتمال أن لا تكون التغييرات جاهزة في الوقت المناسب.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الخطر الثانوي هو خطر جديد ينشأ نتيجة اتخاذ إجراء استجابة للخطر الأساسي، وليس هو الحالة هنا.\n- الخطر الأساسي هو الخطر الأصلي قبل تطبيق خطة الاستجابة.\n- خطر الامتثال مرتبط بعدم الالتزام بالقوانين أو اللوائح، وهذا غير مرتبط هنا.",
  "choices": [
    {
      "text": "خطر ثانوي",
      "correct": false
    },
    {
      "text": "خطر متبقٍ",
      "correct": true
    },
    {
      "text": "الخطر الأساسي",
      "correct": false
    },
    {
      "text": "خطر الامتثال",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "غالبًا ما يطرح فريق المشروع أسئلة حول سبب عملهم وكيف ينظر العميل إلى تقدمهم والنتائج المقدمة. ماذا يجب أن يفعل مدير المشروع لبناء الثقة وجعل الفريق أكثر انخراطًا؟",
  "explanation": "الإجابة الصحيحة: مشاركة الملاحظات ودعوة أعضاء الفريق إلى اجتماعات الحالة مع أصحاب المصلحة.\n\n- لماذا؟\nمشاركة الملاحظات تعزز الشفافية وتوفر للفريق رؤية مباشرة حول تقدم المشروع وتوقعات العميل، مما يزيد من شعور الفريق بالمسؤولية والانخراط.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طمأنة الفريق دون تقديم بيانات ملموسة قد لا تكون كافية لبناء الثقة.\n- عرض خطة المشروع وتقارير التقدم هو أمر مهم لكنه أقل تفاعلية مقارنة بمشاركة الفريق في اجتماعات الحالة.\n- مقارنة المهام المعلقة بالمكتملة قد تعطي إحساسًا بالإنجاز لكنها لا تعالج حاجة الفريق لفهم رؤية العميل وملاحظاته.",
  "choices": [
    {
      "text": "مشاركة الملاحظات ودعوة أعضاء الفريق إلى اجتماعات الحالة مع أصحاب المصلحة.",
      "correct": true
    },
    {
      "text": "طمأنة الفريق بأن العميل راضٍ وأنك تدير التوقعات.",
      "correct": false
    },
    {
      "text": "عرض خطة المشروع وتقرير التقدم على الفريق مع التحديثات المنتظمة عند التعديل.",
      "correct": false
    },
    {
      "text": "مقارنة المهام المعلقة بالمهام المكتملة حتى يشعر الفريق بالإنجاز.",
      "correct": false
    }
  ]
},
  {
    "type": "multiple-choice",
    "text": "يواجه مدير المشروع صعوبة في إقناع أصحاب المصلحة باعتماد التكنولوجيا الجديدة في المشروع.\nماذا كان يجب على مدير المشروع فعله لتجنب هذا النوع من المقاومة؟",
    "explanation": "الإجابة الصحيحة: إشراك أصحاب المصلحة في أقرب وقت ممكن.\n\n- لماذا؟\nإشراك أصحاب المصلحة مبكرًا يساعد في بناء قبولهم ودعمهم، ويقلل من مقاومة التغيير عبر التفاعل المباشر معهم وفهم مخاوفهم واحتياجاتهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاستثمار في التواصل الفعال مهم ولكنه يأتي بعد إشراك أصحاب المصلحة وليس بديله.\n- توفير الدعم الفني لا يعالج مقاومة التغيير على المستوى النفسي والسلوكي.\n- اقتراح اتفاق رسمي قد لا يضمن القبول الفعلي والتعاون المطلوب.",
    "choices": [
      {
        "text": "الاستثمار في تواصل فعال مع أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "توفير الدعم الفني لأصحاب المصلحة",
        "correct": false
      },
      {
        "text": "اقتراح اتفاق رسمي مع أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "إشراك أصحاب المصلحة في أقرب وقت ممكن",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مشروع هجين، يتلقى مدير المشروع إشعارًا يفيد بأنه، استجابةً لحكم قضائي حديث، يجب تضمين متطلب جديد في نطاق المشروع.\n\nماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تقديم طلب تغيير إلى مجلس التحكم في التغييرات (CCB).\n\n- لماذا؟\nأي تغيير في نطاق المشروع يجب أن يمر بعملية رسمية للموافقة، وخاصة في المشاريع الهجينة التي تجمع بين الأساليب التقليدية والرشيقة، لضمان توثيق ومراقبة التغيير وتأثيره على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- قبول المتطلب الجديد مباشرة قد يؤدي إلى تجاوز نطاق المشروع بدون تقييم تأثيره.\n- استبعاد المتطلب قد يتعارض مع الالتزامات القانونية.\n- تضمين المتطلب بعد اجتماع مع أصحاب المصلحة غير كافٍ بدون الموافقة الرسمية.",
    "choices": [
      {
        "text": "قبول المتطلب الجديد كجزء من نطاق المشروع.",
        "correct": false
      },
      {
        "text": "استبعاد المتطلب الجديد من نطاق المشروع.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى مجلس التحكم في التغييرات (CCB).",
        "correct": true
      },
      {
        "text": "تضمين المتطلب الجديد بعد الاجتماع مع أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير المشروع على مشروع حاسم لا تتوفر له بيانات تاريخية. قد يعرض ذلك المشروع للخطر.\n\nماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: وضع خطة لإدارة المخاطر وإبلاغ أصحاب المصلحة الرئيسيين بالمخاطر المحتملة.\n\n- لماذا؟\nعندما لا تتوفر بيانات تاريخية، يكون التقدير دقيقًا أكثر مع إدارة المخاطر المنهجية وإشراك أصحاب المصلحة في التعرف على المخاطر المحتملة والتعامل معها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التخطيط بناءً على شهية المخاطر فقط دون خطة واضحة غير كافٍ.\n- تطوير خطة إدارة المشروع بدون تركيز خاص على المخاطر لن يحمي المشروع بشكل كاف.\n- إبلاغ الراعي فقط بدون وضع خطة استجابة لا يضمن معالجة المخاطر بشكل فعال.",
    "choices": [
      {
        "text": "تخطيط تنفيذ المشروع بناءً على شهية المخاطر لدى أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تطوير خطة إدارة المشروع لتحديد الفرص والتهديدات وترتيبها حسب الأولوية.",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بالمخاطر المتوقعة، ثم متابعة تنفيذ المشروع.",
        "correct": false
      },
      {
        "text": "وضع خطة لإدارة المخاطر وإبلاغ أصحاب المصلحة الرئيسيين بالمخاطر المحتملة.",
        "correct": true
      }
    ]
  }
]
}
