{
  "time": 13800,
  "pass": 85,
  "test": [
    {
  "type": "multiple-choice",
  "text": "تقوم مؤسسة عقارية بمراجعة شهرية لمحفظة مشاريعها الاستراتيجية.\n\nالمشروع أالمشروع ب\nتاريخ البدء مارس 2016 ماي 2017\nتاريخ الانتهاء المتوقع أبريل 2019 جويلية 2020\nمدير المشروع PM-A PM-B\n\nخلال مراجعة في مارس 2018، تبيّن أن المشروع ب يعاني من مشاكل لم تُحدد مسبقًا في عملية إدارة المخاطر. وبما أن المشروع أ قد بدأ قبل سنة تقريبًا، ما المعلومة التي يجب طلبها من المشروع أ حتى يتمكن المشروع ب من اتخاذ إجراءات وقائية أو تصحيحية؟",
  "explanation": "الإجابة الصحيحة: مستودع الدروس المستفادة.\n\n- لماذا؟\nمستودع الدروس المستفادة يحتوي على المعرفة والخبرات التي تم جمعها من مشروع سابق (المشروع أ)، مما يساعد المشروع ب على التعرف على التحديات والمخاطر المحتملة وكيفية التعامل معها بناءً على تجارب حقيقية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقارير أداء العمل: تعكس الحالة الحالية للمشروع ولا تقدم معلومات عن كيفية التعامل مع المخاطر السابقة.\n- سجل المشكلات: يركز فقط على المشكلات المحددة وليس على كيفية إدارتها.\n- قائمة الأنشطة: لا تتعلق بالمخاطر بل بجداول العمل.",
  "choices": [
    {
      "text": "تقارير أداء العمل",
      "correct": false
    },
    {
      "text": "مستودع الدروس المستفادة",
      "correct": true
    },
    {
      "text": "سجل المشكلات",
      "correct": false
    },
    {
      "text": "قائمة الأنشطة",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "بعد الاجتماع التمهيدي لمشروع صناعي، يجب على مدير المشروع المعين قيادة الفريق في تحديد المخاطر. ونظرًا لأن أعضاء الفريق موزعون في 6 دول، ما هي أفضل طريقة لتحديد المخاطر في هذا الوضع؟",
  "explanation": "الإجابة الصحيحة: تقنية دلفي (Delphi technique).\n\n- لماذا؟\nتقنية دلفي تتيح جمع آراء الخبراء بشكل مستقل وسري، وهي مفيدة بشكل خاص عندما يكون الفريق موزعًا جغرافيًا، حيث يمكن إدارة الجلسات عبر وسائل الاتصال عن بُعد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مخطط التجميع بالتقارب: يحتاج عادة إلى جلسات وجهًا لوجه.\n- تحليل شجرة القرار: يُستخدم لتحليل الخيارات وليس لتحديد المخاطر.\n- تحليل مونتي كارلو: يُستخدم للتحليل الكمي بعد تحديد المخاطر وليس لتحديدها.",
  "choices": [
    {
      "text": "مخطط التجميع بالتقارب (Affinity diagram)",
      "correct": false
    },
    {
      "text": "تحليل شجرة القرار (Decision tree analysis)",
      "correct": false
    },
    {
      "text": "تقنية دلفي (Delphi technique)",
      "correct": true
    },
    {
      "text": "تحليل مونتي كارلو (Monte Carlo analysis)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يناقش عدة أعضاء في الفريق تقنيات إدارة مدير المشروع ولا يمكنهم الاتفاق إن كان يركز على الإدارة أو القيادة. ما هو الخيار الصحيح؟",
  "explanation": "الإجابة الصحيحة: لا شيء مما سبق.\n\n- لماذا؟\nلأن مدير المشروع يحتاج إلى الجمع بين مهارات القيادة والإدارة معًا. فهو يقود الفريق نحو الهدف (قيادة) ويتحكم في الموارد والجداول والعمليات (إدارة). التركيز على جانب واحد فقط لا يعكس دور مدير المشروع بشكل متوازن.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- يتصرف كمدير لأنه يركز على التحكم: هذا جزء فقط من مهامه.\n- يتصرف كقائد لأنه يجمع بين الأشخاص: هذا جانب واحد لكنه ليس كل شيء.\n- يتصرف كمدير لأنه يدخل في الأوامر: ليس دقيقًا كإجابة شاملة.",
  "choices": [
    {
      "text": "يتصرف كمدير لأنه يركز على التحكم والكفاءة والفعالية.",
      "correct": false
    },
    {
      "text": "يتصرف كقائد لأنه يجمع بين الأشخاص والاتجاه والسرعة.",
      "correct": false
    },
    {
      "text": "يتصرف كمدير لأنه يدخل في الأوامر وفعل الأشياء الصحيحة.",
      "correct": false
    },
    {
      "text": "لا شيء مما سبق.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يدير مدير مشروع بناء مركز بيانات بحري، وهو المسؤول أيضًا عن الأصول التي تم شراؤها ضمن المشروع. أبلغ أحد أعضاء الفريق عن فقدان أحد الأصول، وأبدى استعداده لتحمل التكلفة.\n\nكيف يجب أن يتعامل مدير المشروع مع هذا الموقف؟",
  "explanation": "الإجابة الصحيحة: إبلاغ العميل والإدارة فورًا، وفتح تحقيق، وتحديث سجل المخاطر، واتخاذ إجراء بناءً على النتيجة.\n\n- لماذا؟\nلأن فقدان الأصول يعتبر قضية خطيرة تتعلق بمسؤولية المشروع ويجب التعامل معها رسميًا وفق السياسات وليس بشكل فردي. فتح تحقيق يساعد في معرفة السبب الحقيقي ومعالجة أي ثغرات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب من عضو الفريق شراء أصل بديل: هذا تصرف غير رسمي ولا يضمن الشفافية.\n- إبلاغ العميل وشراء الأصل: فيه تجاوز لدور الإدارة وقد يخفي سبب المشكلة.\n- إبلاغ الإدارة فقط دون العميل: غير كافٍ في مشاريع معقدة مثل هذا النوع.",
  "choices": [
    {
      "text": "طلب من عضو الفريق شراء أصل بديل وتحديث سجل الأصول برمز جديد.",
      "correct": false
    },
    {
      "text": "إبلاغ العميل، وشراء الأصل الجديد، وتحديث سجل الأصول وسجل المخاطر.",
      "correct": false
    },
    {
      "text": "إبلاغ الإدارة، واستبدال الأصل عن طريق مطالبة التأمين، وتحديث سجل الأصول.",
      "correct": false
    },
    {
      "text": "إبلاغ العميل والإدارة فورًا، وفتح تحقيق، وتحديث سجل المخاطر، واتخاذ إجراء بناءً على النتيجة.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يقود مدير المشروع مبادرة معقدة تضم أصحاب مصلحة متنوعين، ويجب عليه بناء علاقات قوية معهم، بالإضافة إلى إنشاء فهم مشترك للمشروع بينهم.\n\nماذا يجب أن يفعل مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: تيسير ورش تفاعلية لمناقشة الأهداف والتوقعات.\n\n- لماذا؟\nورش العمل التفاعلية تساعد على جمع أصحاب المصلحة معًا في مكان واحد لمناقشة الأهداف والتوقعات، وتساعد على حل التعارضات وبناء فهم مشترك بسرعة وفعالية.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تمرين خريطة أصحاب المصلحة: مفيد لكنه لا يبني العلاقات بشكل مباشر.\n- تقديم عروض رسمية: وسيلة أحادية الاتجاه ولا تضمن التفاعل.\n- توزيع مستندات: ليس بالضرورة أن تتم قراءتها أو فهمها بشكل متكامل.",
  "choices": [
    {
      "text": "تيسير ورش تفاعلية لمناقشة الأهداف والتوقعات.",
      "correct": true
    },
    {
      "text": "إجراء تمرين تفصيلي لرسم خريطة أصحاب المصلحة.",
      "correct": false
    },
    {
      "text": "تقديم عروض رسمية تلخص تقدم المشروع.",
      "correct": false
    },
    {
      "text": "توزيع مستندات المشروع المفصلة للمراجعة الفردية.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "أنت تدير مشروعًا يحتوي على عناصر تنظيمية كبيرة. المورد المسؤول عن وحدة أساسية يمر بتحول تنظيمي شامل، ومن غير المرجح أن تكون النتيجة جاهزة في الوقت المحدد. خطتك لتخفيف المخاطر هي استخدام النماذج الورقية حتى يتم تنفيذ الوحدة، لكن من المرجح أن تؤدي هذه الإستراتيجية إلى إبطاء التفاعل مع المستخدمين.",
  "explanation": "الإجابة الصحيحة: خطر ثانوي.\n\n- لماذا؟\nخطر ثانوي هو خطر ينشأ نتيجة تنفيذ استجابة لمخاطرة أخرى. هنا، تم اتخاذ قرار باستخدام النماذج الورقية لتقليل أثر تأخر المورد، لكن هذا القرار نفسه جلب خطرًا جديدًا وهو بطء التفاعل مع المستخدمين.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطر متبقي: هو خطر لا يمكن إزالته بالكامل حتى بعد تنفيذ خطة الاستجابة، وليس هذا هو الوضع هنا.\n- الخطر الأساسي: يتعلق بالخطر الأصلي، وهو تأخر المورد، لكن السؤال يركز على الخطر الناتج عن خطة الاستجابة.\n- خطر الامتثال: يتعلق بالتشريعات والقوانين، وهو غير مرتبط بالموقف الحالي.",
  "choices": [
    {
      "text": "خطر ثانوي",
      "correct": true
    },
    {
      "text": "خطر متبقي",
      "correct": false
    },
    {
      "text": "الخطر الأساسي",
      "correct": false
    },
    {
      "text": "خطر الامتثال",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "خلال دورة حياة المشروع، يواجه مدير المشروع عادةً مشاكل أو ثغرات أو تناقضات أو صراعات تحدث بشكل غير متوقع. يتطلب هذا اتخاذ إجراء حتى لا يتأثر أداء المشروع.\n\nأي وثيقة من وثائق المشروع ستُستخدم لتسجيل وتتبع ذلك؟",
  "explanation": "الإجابة الصحيحة: سجل المشكلات.\n\n- لماذا؟\nسجل المشكلات (Issue Log) هو الأداة الرسمية التي يستخدمها مدير المشروع لتوثيق وتتبع المشاكل والصراعات التي تظهر أثناء تنفيذ المشروع حتى يتم حلها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- سجل المخاطر: يستخدم لتوثيق الأحداث المحتملة قبل وقوعها وليس المشاكل الفعلية.\n- الدروس المستفادة: يُحدث عادة في نهاية المشروع أو المراحل وليس أثناء التعامل مع مشكلة مباشرة.\n- خطة إدارة المشروع: تحتوي على استراتيجيات وليس تفاصيل المشاكل اليومية.",
  "choices": [
    {
      "text": "سجل المشكلات",
      "correct": true
    },
    {
      "text": "سجل المخاطر",
      "correct": false
    },
    {
      "text": "الدروس المستفادة",
      "correct": false
    },
    {
      "text": "خطة إدارة المشروع",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ما هي الصفة القيادية التي يجب أن يتحلى بها مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: الصدق.\n\n- لماذا؟\nالصدق والشفافية من أهم صفات القائد الناجح، لأنها تبني الثقة بينه وبين الفريق وأصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- العدوانية: ليست صفة قيادية إيجابية وتؤثر سلبًا على بيئة العمل.\n- القوة: إذا لم تُستخدم بحكمة تصبح تحكمًا بدلًا من قيادة.\n- القائد الخدمي: هو أسلوب قيادي وليس صفة محددة، ويشمل أكثر من جانب مثل الدعم والتوجيه.",
  "choices": [
    {
      "text": "الصدق",
      "correct": true
    },
    {
      "text": "العدوانية",
      "correct": false
    },
    {
      "text": "القوة",
      "correct": false
    },
    {
      "text": "القائد الخدمي",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "قدّم أحد أصحاب المصلحة الرئيسيين عدة طلبات لوظائف جديدة لمنتج قيد التطوير. أنهى مدير المشروع للتو تحديد نطاق النسخة التالية من المنتج وأرسل بيان النطاق إلى جميع أصحاب المصلحة.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
  "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة النطاق لتحديد كيفية التعامل مع طلبات الوظائف الجديدة.\n\n- لماذا؟\nعندما يُقدم أصحاب المصلحة طلبات جديدة بعد إرسال بيان النطاق، يجب على مدير المشروع الرجوع إلى خطة إدارة النطاق لمعرفة العملية المحددة لتقييم ومعالجة هذه التغييرات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة خطة إدارة الاتصالات: ليست هي المرجع الأساسي للتعامل مع تغييرات النطاق.\n- مراجعة معايير القبول: هذه تُستخدم للتحقق من قبول المنتج بعد إنجازه، وليس لمراجعة الطلبات الجديدة.\n- الاجتماع مع أصحاب المصلحة: يأتي لاحقًا بعد تحديد آلية التعامل مع التغييرات عبر خطة إدارة النطاق.",
  "choices": [
    {
      "text": "مراجعة خطة إدارة الاتصالات لتحديد عدد الطلبات التي يمكن تقديمها.",
      "correct": false
    },
    {
      "text": "مراجعة معايير القبول المحددة في بيان النطاق.",
      "correct": false
    },
    {
      "text": "الاجتماع مع أصحاب المصلحة لتأكيد توافقهم مع أهداف المنتج وأهداف المشروع.",
      "correct": false
    },
    {
      "text": "مراجعة خطة إدارة النطاق لتحديد كيفية التعامل مع طلبات الوظائف الجديدة.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "في نهاية دورة، أخبر أحد أعضاء الفريق مدير المشروع أن مهمة مخططة لم تُنجز بسبب مشكلة ظهرت قبل أيام ولم يتم حلها. لماذا يجب على مدير المشروع مناقشة هذه المشكلة خلال اجتماع الاستعراض (retrospective) لمنع تكرار مثل هذا الموقف في المستقبل؟",
  "explanation": "الإجابة الصحيحة: لأنه وقت مناسب لمناقشة المشكلات وأفكار التحسين وتشجيع حل المشكلات الجماعي.\n\n- لماذا؟\nالاجتماع الاستعراضي (Retrospective) مخصص لمراجعة ما حدث خلال الدورة وتحديد فرص التحسين الجماعي.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المعالجة أثناء العرض التوضيحي (demo): العرض مخصص لعرض الإنجازات وليس لحل المشكلات.\n- حل المشكلة قبل الاجتماع: إذا لم تُحل، يجب مناقشتها خلال الاجتماع وليس الاعتماد على حل فردي.\n- التأكيد على الاستفادة من الوقت: ليس الهدف الأساسي من الاستعراض، بل تحسين العمليات بشكل مستمر.",
  "choices": [
    {
      "text": "لأنه وقت مناسب لمناقشة المشكلات وأفكار التحسين وتشجيع حل المشكلات الجماعي.",
      "correct": true
    },
    {
      "text": "لأنه يسمح لمدير المشروع بمعالجة المشكلة أثناء العرض التوضيحي (demo)، مما يزيد من التفاعل.",
      "correct": false
    },
    {
      "text": "لأن عضو الفريق سيتمكن من حل المشكلة قبل اجتماع الاستعراض.",
      "correct": false
    },
    {
      "text": "لتمكين مدير المشروع من التأكيد على الاستفادة القصوى من الوقت المتاح لحل المشكلات.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "يلتقي أصحاب المصلحة وفريق المشروع العامل على مشروع أجايلي مع مدير المشروع في نهاية دورة. يكتشف مدير المشروع أن الجدول الزمني يتأخر، رغم أن العمل تم التخطيط له لتحقيق الأهداف العامة الموضحة في نطاق المشروع.\n\nما الذي كان يجب على مدير المشروع فعله للحفاظ على تقدم المشروع؟",
  "explanation": "الإجابة الصحيحة: تمكين أعضاء الفريق من تنظيم المهام بأنفسهم لتحقيق الأهداف.\n\n- لماذا؟\nفي المشاريع الأجايلية، يعتبر تمكين الفريق من تنظيم نفسه من المبادئ الأساسية، مما يساعدهم على إدارة العمل بطريقة فعالة وتحقيق الأهداف المحددة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- العمل مع الفريق لفهم توقعاتهم: هذا ضروري في البداية، لكنه لا يحل مشكلة التأخير.\n- إعطاء الأولوية للأعمال التي يمكن إنجازها مبكرًا: قد يؤدي ذلك إلى فقدان التركيز على الأولويات الحقيقية.\n- اختيار وترتيب العمل لتحقيق الأهداف العامة: هذه مسؤولية مالك المنتج وليس مدير المشروع.",
  "choices": [
    {
      "text": "العمل مع الفريق لفهم توقعاتهم من استخدام المنهجية المرنة.",
      "correct": false
    },
    {
      "text": "تمكين أعضاء الفريق من تنظيم المهام بأنفسهم لتحقيق الأهداف.",
      "correct": true
    },
    {
      "text": "إعطاء الأولوية للأعمال التي يمكن إنجازها مبكرًا للاستفادة المبكرة.",
      "correct": false
    },
    {
      "text": "اختيار وترتيب العمل لتحقيق الأهداف العامة.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير الامتثال الأمني غاضب لأن فريق الامتثال لم يتم إبلاغه بقرارات تصميم المنتج التي اتخذها أعضاء الفريق الأجايل خلال الخمسة تكرارات الماضية.\n\nما الذي يجب على مدير المشروع فعله لتصحيح الوضع؟",
  "explanation": "الإجابة الصحيحة: الاجتماع مع مدير الامتثال الأمني لتحديد استراتيجية لتلبية متطلبات الامتثال.\n\n- لماذا؟\nهذه الخطوة تساعد على فهم احتياجات الامتثال وتحديد طريقة مناسبة لإدماجها ضمن سير العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- دعوة ممثل لحضور الاجتماعات اليومية: قد لا يكون كافيًا لحل المشكلة، بل يحتاج الأمر إلى خطة واضحة.\n- طلب تعيين ممثل بدوام كامل: حل غير فعال بدون تنسيق استراتيجي أولًا.\n- طلب زيادة الميزانية: ليس الحل المباشر، والأولوية هي معالجة السبب الرئيسي أولًا.",
  "choices": [
    {
      "text": "دعوة ممثل من فريق الامتثال الأمني لحضور الاجتماعات اليومية.",
      "correct": false
    },
    {
      "text": "طلب من مدير الامتثال الأمني تعيين ممثل من فريق الامتثال للعمل بدوام كامل مع فريق الأجايل.",
      "correct": false
    },
    {
      "text": "الاجتماع مع مدير الامتثال الأمني لتحديد استراتيجية لتلبية متطلبات الامتثال.",
      "correct": true
    },
    {
      "text": "طلب من مالك المنتج زيادة الميزانية لإضافة تكرارات لإعادة العمل المطلوبة للامتثال.",
      "correct": false
    }
  ]
},
  {
    "type": "multiple-choice",
    "text": "مدير المشروع مسؤول عن مشروع أجايل جديد على نطاق عالمي. بعد الانتهاء من بعض التكرارات، أنشأ فريق ضمان الجودة - الموجود في بلد مختلف - قائمة طويلة بالأعطال. مدير المشروع متأكد من أن هذه المشاكل لا تتعلق بجودة المشروع، بل ناتجة عن سوء تفسير لغوي.\n\nما الذي يجب على مدير المشروع فعله لمعالجة هذه القضايا؟",
    "explanation": "الإجابة الصحيحة: أثناء عقد جلسات مع الفريق الكامل للمشروع، مراجعة متطلبات المشروع ووصفها.\n\n- لماذا؟\nعندما توجد اختلافات ناتجة عن سوء الفهم بين الفرق الدولية، أفضل إجراء هو مراجعة المتطلبات بشكل مشترك لضمان أن الجميع لديهم نفس الفهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب ميزانية إضافية لفريق محلي: يزيد التكلفة دون معالجة السبب.\n- دمج الفرق في النهاية: متأخر جدًا ولا يحل مشكلة التواصل.\n- الاجتماع لانتقاد فريق ضمان الجودة: غير بناء وسيؤثر على العلاقة بين الفرق.",
    "choices": [
      {
        "text": "طلب ميزانية إضافية لتوظيف فريق ضمان جودة محلي.",
        "correct": false
      },
      {
        "text": "عند اقتراب نهاية المشروع، دمج فريق التطوير مع فريق ضمان الجودة لاختبار المخرجات.",
        "correct": false
      },
      {
        "text": "الاجتماع مع فريق ضمان الجودة لانتقاد القائمة التي قدموها.",
        "correct": false
      },
      {
        "text": "أثناء عقد جلسات مع الفريق الكامل للمشروع، مراجعة متطلبات المشروع ووصفها.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع وفريقه عملوا معًا في بيئة إدارة مشاريع تقليدية لمدة خمس سنوات. قررت المؤسسة تطبيق منهجية الأجايل ودربت مدير المشروع على هذا النهج. بدأ الفريق مشروعهم التالي باستخدام الأجايل، لكن بعد خمس تكرارات لا يزال الفريق يعتمد على مدير المشروع في اتخاذ القرارات المتعلقة بالمشروع.\n\nكيف يمكن لمدير المشروع مساعدة الفريق؟",
    "explanation": "الإجابة الصحيحة: دعم الفريق وتوجيههم حول كيفية اتخاذ قراراتهم الخاصة المتعلقة بالمشروع.\n\n- لماذا؟\nالفريق يحتاج إلى تطوير ثقته وقدرته على اتخاذ القرارات بنفسه. دور مدير المشروع في الأجايل هو التوجيه وليس اتخاذ القرار عن الفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقديم ملاحظات دورية: هذا يعزز التبعية بدل الاستقلال.\n- إبلاغهم فقط: بدون تدريب أو توجيه عملي لن يفيد.\n- تعيين فريق آخر: مكلف ويهمل تطوير الفريق الحالي.",
    "choices": [
      {
        "text": "تقديم ملاحظات دورية لأعضاء الفريق حول جميع المهام.",
        "correct": false
      },
      {
        "text": "إبلاغ الفريق بأن بإمكانهم اتخاذ قراراتهم الخاصة.",
        "correct": false
      },
      {
        "text": "تعيين فريق مشروع آخر لديه خبرة في إدارة المشاريع بالأجايل.",
        "correct": false
      },
      {
        "text": "دعم الفريق وتوجيههم حول كيفية اتخاذ قراراتهم الخاصة المتعلقة بالمشروع.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بدأ مدير المشروع مشروعًا جديدًا بمدة زمنية قدرها 24 شهرًا. بعد وقت قصير من بدء المشروع، أبلغ الراعي مدير المشروع بأن المدة يجب أن تُختصر إلى 6 أشهر.\n\nما الذي يجب على مدير المشروع فعله في هذا السيناريو؟",
    "explanation": "الإجابة الصحيحة: التركيز على تطوير منتج قابل للإطلاق (MVP) من خلال الرجوع إلى قائمة المنتج وتحديد العناصر ذات الأولوية الأعلى التي يمكن إكمالها خلال المدة الزمنية الجديدة.\n\n- لماذا؟\nتقصير مدة المشروع بهذا الشكل يتطلب التركيز على الحد الأدنى القابل للإطلاق بدلاً من محاولة إكمال كل شيء.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد العناصر القابلة للإنجاز سريعًا بدون اعتبار القيمة قد يؤدي لإنتاج منتج غير مفيد.\n- زيادة الميزانية وتوظيف موردين: قد لا يكون متاحًا.\n- تطبيق المسار السريع: قد لا يناسب هذا النوع من التغيير الجذري.",
    "choices": [
      {
        "text": "التركيز على تطوير منتج قابل للإطلاق (MVP) من خلال الرجوع إلى قائمة المنتج وتحديد العناصر ذات الأولوية الأعلى التي يمكن إكمالها خلال المدة الزمنية الجديدة.",
        "correct": true
      },
      {
        "text": "الرجوع إلى قائمة المنتج لتحديد العناصر التي يمكن إنجازها في أقصر وقت وإضافتها إلى المشروع لاستكمالها في الإطار الزمني الجديد.",
        "correct": false
      },
      {
        "text": "العمل مع الراعي لزيادة الميزانية وتوظيف موردين لتطوير المخرجات في الوقت المضغوط.",
        "correct": false
      },
      {
        "text": "تطبيق المسار السريع وتسجيل هذا التغيير في الجدول الزمني في سجل المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أقام فريق المشروع تجمعًا غير رسمي بعد ساعات العمل. أحد أعضاء الفريق الجدد الذين تم توظيفهم مؤخرًا لم يتلقَ دعوة. في الاجتماعات اليومية التالية، بدا أن الموظف الجديد منزعج ولم يشارك كثيرًا في الجلسات.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الموظف الجديد لمناقشة مخاوفه.\n\n- لماذا؟\nالتواصل المباشر مع الموظف هو الطريقة الأنسب لفهم مشاعره وتقديم الدعم، مما يساعد على تحسين العلاقة والاندماج في الفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تنظيم تجمع آخر: لا يعالج السبب الحقيقي للمشكلة.\n- مطالبة الموظف بالمشاركة فورًا: قد يزيد من الضغط عليه.\n- لقاء بعد العمل: غير رسمي وقد لا يشعر الموظف بالارتياح.",
    "choices": [
      {
        "text": "تنظيم تجمع آخر بعد ساعات العمل ودعوة الموظف الجديد.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الموظف الجديد لمناقشة مخاوفه.",
        "correct": true
      },
      {
        "text": "خلال الاجتماع اليومي التالي، مطالبة الموظف الجديد بالمشاركة بشكل أكبر.",
        "correct": false
      },
      {
        "text": "دعوة الموظف الجديد للقاء بعد ساعات العمل لمناقشة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع كبير. يرغب راعي المشروع في أن يجري مدير المشروع تحليلًا لأصحاب المصلحة.\n\nما النقاط التي يجب على مدير المشروع أخذها في الاعتبار أثناء إجراء هذا التحليل؟",
    "explanation": "الإجابة الصحيحة: السلطة، التأثير، النفوذ، المتطلبات، والتوقعات.\n\n- لماذا؟\nهذه الجوانب تعطي صورة شاملة عن كيفية تأثير أصحاب المصلحة على المشروع وكيفية إدارتهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحتوي على عناصر غير ضرورية أو غير دقيقة ضمن تحليل أصحاب المصلحة، مثل الملكية أو المعرفة فقط.",
    "choices": [
      {
        "text": "الاهتمامات، الحقوق، الملكية، المعرفة، والمساهمة.",
        "correct": false
      },
      {
        "text": "الاهتمامات، المتطلبات، الحقوق، المعرفة، والتأثير.",
        "correct": false
      },
      {
        "text": "السلطة، التأثير، النفوذ، المتطلبات، والتوقعات.",
        "correct": true
      },
      {
        "text": "دور المشروع، التأثير، الحقوق، المعرفة، والاهتمامات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل أحد أعضاء الفريق على مهمة حرجة في المشروع، ويقترب من مدير المشروع مباشرة قبل بدء اجتماع لإبلاغه بأن المهمة لم تكتمل في الوقت المحدد.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة جميع المهام المفتوحة مع الفريق خلال الاجتماع واتخاذ قرار جماعي بالإجراء المناسب.\n\n- لماذا؟\nهذا الأسلوب يحفز العمل الجماعي والشفافية في إيجاد حل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طرد عضو الفريق: أسلوب غير احترافي.\n- إعادة التخصيص بشكل منفرد: قد يؤدي لقرارات غير متوازنة.\n- إرسال بريد إلكتروني: ليس فوريًا وقد لا يكون فعالًا في موقف عاجل.",
    "choices": [
      {
        "text": "طرد عضو الفريق من الاجتماع وطلب منه الاستمرار في العمل على المهمة.",
        "correct": false
      },
      {
        "text": "إعادة تخصيص المهمة إلى عضو فريق آخر والتأكيد على أهمية إنجازها في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "إرسال بريد إلكتروني إلى الفريق بأكمله وطلب الدعم لإكمال هذه المهمة المحددة.",
        "correct": false
      },
      {
        "text": "مراجعة جميع المهام المفتوحة مع الفريق خلال الاجتماع واتخاذ قرار جماعي بالإجراء المناسب.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اختبار غير مدمر في موقع بناء، تم اكتشاف أن بعض المكونات تفشل في اختبارات قابلية العمل. حدد فريق المشروع السبب الجذري لهذه الإخفاقات واقترح حلاً. ومع ذلك، فإن الموعد النهائي ضيق وسيتطلب الحل زيادة في الميزانية.\n\nما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).\n\n- لماذا؟\nعندما يظهر أن الحل المقترح سيؤثر على الميزانية والجدول الزمني، يجب اتباع الإجراءات الرسمية للمشروع بإرسال طلب تغيير. لجنة مراقبة التغيير مسؤولة عن تقييم هذه التغييرات والموافقة عليها أو رفضها، مما يحافظ على تنظيم عملية إدارة التغيير وضمان التوافق مع أهداف المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- دعوة الموردين لتقديم حلول منخفضة التكلفة لا تضمن الموافقة أو الملاءمة الزمنية.\n- طلب التمويل الإضافي مباشرة دون موافقة التغيير قد يؤدي إلى تجاوز الميزانية دون رقابة.\n- تحديث خطة إدارة المخاطر مفيد فقط بعد الموافقة على التغيير، وهو لا يحل المشكلة مباشرةً.",
    "choices": [
      {
        "text": "دعوة الموردين لتقديم عروض لحل منخفض التكلفة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB).",
        "correct": true
      },
      {
        "text": "طلب تمويل إضافي من راعي المشروع.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة المخاطر لتضمين الحل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعاني المشروع من تأخيرات بسبب الاختلافات الثقافية التي تسبب سوء تفاهم بين بعض أصحاب المصلحة.\n\nما الذي يجب أن يفعله مدير المشروع للتعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: مراجعة خطة إشراك أصحاب المصلحة لتحديد استراتيجيات تحسين التواصل معهم.\n\n- لماذا؟\nالاختلافات الثقافية تتطلب استراتيجيات تواصل مخصصة تضمن فهمًا واضحًا بين جميع الأطراف. مراجعة خطة إشراك أصحاب المصلحة تمكن مدير المشروع من تعديل طرق التواصل، وتنظيم تدريبات أو ورش عمل لتحسين الفهم والتفاعل، مما يقلل من سوء التفاهم ويساعد في تسريع سير المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة سجل أصحاب المصلحة لا تعالج الأسباب الجذرية للمشكلة.\n- طلب تغيير لاستبدال أصحاب المصلحة غير عملي وقد يؤدي إلى تعقيدات أكبر.\n- مراقبة التواصل فقط غير كافٍ دون تدخل نشط لتحسينه.",
    "choices": [
      {
        "text": "مراجعة سجل أصحاب المصلحة لتحديد بدائل محتملة لأصحاب المصلحة الذين يواجهون صعوبات.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إشراك أصحاب المصلحة لتحديد استراتيجيات تحسين التواصل معهم.",
        "correct": true
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة مراقبة التغيير (CCB) لاستبدال أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "مراقبة التواصل بين أصحاب المصلحة لتحديد أي سوء فهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تتبع شركة نهجًا تقليديًا وتتبع دائمًا مرحلة سابقة قبل تقييم جودة منتجاتها. تم تعيين مدير مشروع جديد لديه خبرة في النهج الهجينة للمساعدة في تحسين كفاءة عملية إدارة الجودة في الشركة.\n\nما الذي يجب أن يفعله مدير المشروع الجديد لمعالجة تحسينات العملية؟",
    "explanation": "الإجابة الصحيحة: فهم السياق والاعتماديات الخاصة بالعملية من أعضاء الفريق ثم تحديد التحسينات.\n\n- لماذا؟\nلكي يتمكن مدير المشروع من تحسين العملية بشكل فعّال، يجب أن يكون على دراية كاملة بالتفاصيل والاعتماديات التقنية والعملية التي تؤثر على جودة المنتج. هذا الفهم يساعد في وضع حلول مناسبة تعزز من كفاءة العملية دون تعطيل سير العمل أو تجاوز الموارد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاستمرار في العملية كما هي يعرقل فرص التحسين والتطور.\n- تحديد قاعدة عامة للامتثال قد لا يغطي الخصائص الخاصة للشركة أو المشروع.\n- مناقشة التحسين مع PMO فقط قد تغفل عن آراء الفريق الذين يعملون مباشرة على العملية.",
    "choices": [
      {
        "text": "الاستمرار في العملية كما هي، والانتظار حتى المرحلة التالية لاقتراح أي تحسينات.",
        "correct": false
      },
      {
        "text": "تحديد قاعدة عامة للامتثال للمعايير وتوجيه أعضاء الفريق لتطبيقها.",
        "correct": false
      },
      {
        "text": "مناقشة تحسين العملية مع قائد مكتب إدارة المشاريع (PMO) لتحديث إطار تسليم المشروع.",
        "correct": false
      },
      {
        "text": "فهم السياق والاعتماديات الخاصة بالعملية من أعضاء الفريق ثم تحديد التحسينات.",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "تشعر لجنة الموافقة على المشروع بالقلق بشأن خطة مشروع ستستغرق ثلاث سنوات لإكمالها. اللجنة قلقة من أن الناتج قد لا يلبي احتياجات الصناعة وقد يكون أقل قيمة مما هو متوقع.\n\nما الذي يمكن أن يفعله مدير المشروع لإثبات قيمة الناتج لأصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة: طلب من فريق المشروع إنشاء نموذج أولي لمشاركته مع أصحاب المصلحة.\n\n- لماذا؟\nالنموذج الأولي يتيح لأصحاب المصلحة رؤية المنتج المبدئي وفهم قيمته بشكل أفضل، مما يقلل من المخاوف ويعزز الثقة في المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إضافة سباق إضافي قد تؤخر المشروع ولا تضمن تحسين القيمة.\n- تسجيل المخاوف لا يعالج القلق بل يوثق فقط.\n- إضافة اللجنة لخطة الاتصالات لا يحل المشكلة مباشرة.",
    "choices": [
      {
        "text": "إضافة سباق إضافي إلى الجدول الزمني لإجراء تعديلات محتملة.",
        "correct": false
      },
      {
        "text": "طلب من فريق المشروع إنشاء نموذج أولي لمشاركته مع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تسجيل مخاوف اللجنة في سجل المشكلات.",
        "correct": false
      },
      {
        "text": "إضافة اللجنة إلى خطة إدارة الاتصالات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يعمل على مشروع هجين. يلتقي مدير المشروع مع الراعي للحصول على المعالم الرئيسية للمشروع. يطلب الراعي مزيدًا من المعلومات التفصيلية في ميثاق المشروع.\n\nكيف يجب أن يرد مدير المشروع على هذا الطلب؟",
    "explanation": "الإجابة الصحيحة: إبلاغ الراعي بأنه يجب اعتماد ميثاق المشروع أولًا قبل أن تبدأ التخطيطات التفصيلية للفريق.\n\n- لماذا؟\nالميثاق هو الوثيقة الرسمية التي تعطي المشروع الإذن بالبدء وتحدد نطاقه وأهدافه، ويجب أن يكون معتمدًا قبل التعمق في التخطيط التفصيلي لضمان وضوح التوقعات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقديم ميثاق مشابه ليس مناسبًا لأن كل مشروع فريد.\n- الموافقة على الجدول أولًا دون ميثاق قد يؤدي إلى سوء فهم.\n- دعوة الراعي لمراجعة الفريق غير فعالة بدون وثائق معتمدة.",
    "choices": [
      {
        "text": "تزويد الراعي بميثاق مشروع من مشروع مشابه كمثال مرجعي.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة للحصول على الموافقة على جدول المشروع أولًا.",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بأنه يجب اعتماد ميثاق المشروع أولًا قبل أن تبدأ التخطيطات التفصيلية للفريق.",
        "correct": true
      },
      {
        "text": "دعوة الراعي إلى اجتماع مراجعة الفريق للحصول على المعلومات المطلوبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف المشروع، يكتشف مدير المشروع أن تطبيق تخطيط إدارة المشروع يفشل في تسجيل التحديثات على المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: تحديث خطة المشروع لتمكين الفريق من التركيز على الإنجازات الأساسية.\n\n- لماذا؟\nبما أن التطبيق لا يعمل بشكل صحيح، يجب تعديل الخطة لضمان أن الفريق يركز على المهام الهامة التي تحقق أهداف المشروع، مع تقليل الاعتماد على التطبيق حتى يتم إصلاحه.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تكليف أحد الأعضاء بتحديث الخطة يدويًا قد يزيد العبء ويخلق أخطاء.\n- إبلاغ PMO وطلب حل قد يستغرق وقتًا ولا يعالج المشكلة الفورية.\n- تسجيل المشكلة والعمل على تطبيق جديد قد يطيل التأخير دون حل فوري.",
    "choices": [
      {
        "text": "تكليف أحد أعضاء الفريق بتحديث خطة المشروع يدويًا من الآن فصاعدًا.",
        "correct": false
      },
      {
        "text": "إبلاغ مكتب إدارة المشاريع (PMO) وطلب حل المشكلة.",
        "correct": false
      },
      {
        "text": "تحديث خطة المشروع لتمكين الفريق من التركيز على الإنجازات الأساسية.",
        "correct": true
      },
      {
        "text": "تسجيل هذه المشكلة في سجل المشكلات والعمل مع الراعي لتطبيق تطبيق جديد لإدارة المشروع.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يتم نقل عمليات مشروع جديد قائم على التكنولوجيا إلى فريق مشروع جديد. في بداية مرحلة التنفيذ، يكتشف مدير المشروع وجود فجوات كبيرة في التوثيق، مما سيعيق نقل المعرفة. لا يمكن تأجيل موعد إطلاق الحل، ولا يمكن زيادة الميزانية.\n\nكيف يجب أن يهيكل مدير المشروع العمل ضمن قيود المشروع لتحسين الأداء؟",
    "explanation": "الإجابة الصحيحة: استخدام سباقات أجايل وتقنية كانبان لتسريع التعلم واكتشاف الأخطاء.\n\n- لماذا؟\nسباقات الأجايل وتقنية كانبان تساعد على تنظيم العمل بطريقة مرنة تسمح بالتعلم المستمر واكتشاف المشكلات مبكرًا، مما يحسن الأداء ضمن القيود.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مضاعفة الفريق تزيد التكلفة وهي غير مسموحة.\n- فصل نقل واختبار المعرفة قد يسبب تأخيراً.\n- إلغاء الهامش وإعادة التخطيط بشكل صارم قد يؤدي لضغط زائد على الفريق.",
    "choices": [
      {
        "text": "مضاعفة حجم الفريق عن طريق تخصيص موارد خارجية أقل تكلفة.",
        "correct": false
      },
      {
        "text": "فصل نقل المعرفة واختبار المعرفة ليتم تنفيذهما بالتوازي.",
        "correct": false
      },
      {
        "text": "إلغاء أي هامش في الجدول وإعادة تخطيط المهام باستخدام نهج الموجات المتدرجة.",
        "correct": false
      },
      {
        "text": "استخدام سباقات أجايل وتقنية كانبان لتسريع التعلم واكتشاف الأخطاء.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة تنفيذ المشروع، يجب إجراء تغيير في متطلبات الأساس.\n\nبصفتك مدير المشروع، ما الذي يجب القيام به؟",
    "explanation": "الإجابة الصحيحة: تفعيل إجراء إدارة التغيير في المشروع.\n\n- لماذا؟\nإدارة التغيير تضمن تقييم وموافقة وتوثيق التغييرات لضمان تأثيرها المناسب وعدم تأثيرها سلبًا على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إعادة التقدير خطوة لاحقة بعد تفعيل الإجراء.\n- التحقق من صحة التغيير جزء من الإجراء لكنه ليس الخطوة الأولى.\n- تحليل السبب الجذري قد لا يكون ضروريًا لكل تغيير.",
    "choices": [
      {
        "text": "تفعيل إجراء إدارة التغيير في المشروع.",
        "correct": true
      },
      {
        "text": "إعادة تقدير التأثيرات على التكلفة والجدول الزمني.",
        "correct": false
      },
      {
        "text": "التحقق من صحة التغيير بين أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحليل السبب الجذري.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "ما هما أسلوبا اتخاذ القرار الأسرع واللذان يُستخدمان عندما يكون هناك وقت محدود لاتخاذ القرار؟ (اختر خيارين)",
    "explanation": "الإجابات الصحيحة: أسلوب الأمر (Command Style) + أسلوب التصويت بالأغلبية (Majority Vote Style).\n\n- لماذا؟\nهاتان الطريقتان تسمحان باتخاذ القرار بسرعة بدون الحاجة لنقاشات مطولة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الأسلوب الاستشاري يحتاج لمزيد من الوقت لجمع الآراء.\n- أسلوب الإجماع يتطلب توافقًا كاملًا، وهو أبطأ.",
    "choices": [
      {
        "text": "أسلوب الأمر (Command Style)",
        "correct": true
      },
      {
        "text": "الأسلوب الاستشاري (Consultative Style)",
        "correct": false
      },
      {
        "text": "أسلوب الإجماع (Consensus Style)",
        "correct": false
      },
      {
        "text": "أسلوب التصويت بالأغلبية (Majority Vote Style)",
        "correct": true
      }
    ]
  },
    {
    "type": "multiple-choice",
    "text": "أثناء اجتماع حالة المشروع، يكتشف مدير المشروع أن أصحاب المصلحة لديهم توقعات مختلفة وغير متوافقة. لم يتم تلبية أي من هذه التوقعات، مما تسبب في توتر خلال الاجتماع.\n\nما الذي يجب على مدير المشروع فعله لمواصلة سير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع بأصحاب المصلحة بشكل خاص وتحديث مصفوفة المسؤوليات.\n\n- لماذا؟\nالاجتماع الخاص يتيح مناقشة التوقعات المختلفة ببيئة أكثر هدوءًا، وتحديث مصفوفة المسؤوليات يوضح الأدوار والمسؤوليات ويقلل التوتر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث سجل المخاطر لا يحل التوقعات المتضاربة مباشرة.\n- طلب الإرسال عبر البريد غير فوري ولا يحل النزاعات الحالية.\n- عرض التماشي مع هيكل تقسيم العمل لا يعالج الاختلاف في التوقعات.",
    "choices": [
      {
        "text": "تحديث سجل المخاطر ليعكس اختلاف التوقعات كمخاطرة عالية.",
        "correct": false
      },
      {
        "text": "طلب من أصحاب المصلحة إرسال توقعاتهم عبر البريد الإلكتروني لضمان تضمينها في خطة المشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع بأصحاب المصلحة بشكل خاص وتحديث مصفوفة المسؤوليات.",
        "correct": true
      },
      {
        "text": "عرض لأصحاب المصلحة أن الوضع الحالي يتماشى مع هيكل تقسيم العمل (WBS).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع جديد يعيد النظر في مشروع تم تنفيذه سابقًا. لماذا يجب على مدير المشروع الرجوع أولًا إلى قاعدة بيانات الدروس المستفادة والمعلومات التاريخية؟",
    "explanation": "الإجابة الصحيحة: لفهم المشكلات التي حدثت في المشروع السابق.\n\n- لماذا؟\nمعرفة المشكلات السابقة تساعد على تجنب تكرارها وتحسين تخطيط المشروع الجديد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد الموارد ليس الهدف الأساسي من الدروس المستفادة.\n- تعريف متطلبات المشروع يتم بناءً على دراسة أوسع وليس فقط الدروس.\n- تحديد الميزانية يحتاج إلى تحليل أعمق من البيانات التاريخية فقط.",
    "choices": [
      {
        "text": "لتحديد الموارد التي عملت على المشروع السابق.",
        "correct": false
      },
      {
        "text": "لتعريف متطلبات المشروع وتحديد نطاقه النهائي.",
        "correct": false
      },
      {
        "text": "لتحديد خط أساس لميزانية المشروع.",
        "correct": false
      },
      {
        "text": "لفهم المشكلات التي حدثت في المشروع السابق.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يرغب مدير إداري في استخدام الموارد التي تم تخصيصها بالفعل لمشروع. ماذا يجب أن يفعل مدير مشروع ذلك المشروع؟",
    "explanation": "الإجابة الصحيحة: التفاوض مع المدير الإداري حول متطلبات الموارد.\n\n- لماذا؟\nالتفاوض يساعد على إيجاد حل يوازن بين احتياجات المشروع والموارد المتاحة، ويحافظ على العلاقة مع المدير الإداري.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التصعيد قد يسبب توترات غير ضرورية.\n- طلب تأجيل مشروع المدير الإداري ليس عمليًا دائمًا.\n- قبول التأخير دون تفاوض قد يؤثر سلبًا على المشروع.",
    "choices": [
      {
        "text": "تصعيد الأمر إلى راعي المشروع.",
        "correct": false
      },
      {
        "text": "طلب من المدير الإداري تأجيل مشروعه.",
        "correct": false
      },
      {
        "text": "قبول تأخير المشروع بسبب إعادة تخصيص الموارد.",
        "correct": false
      },
      {
        "text": "التفاوض مع المدير الإداري حول متطلبات الموارد.",
        "correct": true
      }
    ]
  },
    {
    "type": "multiple-choice",
    "text": "مشروع جديد على وشك البدء ويخضع لقيود صارمة في الوقت والميزانية. عند مراجعة سجل الدروس المستفادة، يعلم مدير المشروع أن التغير المستمر في النطاق تسبب في فشل مشروع مشابه.\n\nما الذي يجب أن يفعله مدير المشروع الآن لتجنب فشل المشروع؟",
    "explanation": "الإجابة الصحيحة: إنشاء عمليات رسمية للموافقة على التغييرات لتوجيه الفرق نحو تسليم الميزات الأساسية أولًا.\n\n- لماذا؟\nوجود عملية رسمية لإدارة التغييرات يساعد على التحكم في نطاق المشروع ويمنع التغيرات العشوائية التي قد تؤدي إلى فشل المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- رفض طلبات التغيير بشكل قاطع قد يقلل من مرونة المشروع ويخلق توترات مع أصحاب المصلحة.\n- إدارة توقعات أصحاب المصلحة لاستبعاد التغيير بالكامل غير واقعية، لأن التغيير جزء طبيعي من المشروع.\n- تعديل النطاق والجدول الزمني بشكل مسبق دون عملية واضحة قد يؤدي إلى نقص في التخطيط وعدم رضا أصحاب المصلحة.",
    "choices": [
      {
        "text": "رفض قبول طلبات التغيير الخارجة عن النطاق والتي قد تزيد من مدة المشروع وميزانيته.",
        "correct": false
      },
      {
        "text": "إدارة توقعات أصحاب المصلحة لاستبعاد إمكانية التغييرات بهدف تحقيق أهداف المشروع.",
        "correct": false
      },
      {
        "text": "تعديل نطاق المشروع والجدول الزمني للبقاء ضمن القيود وتجنب التغييرات المحتملة.",
        "correct": false
      },
      {
        "text": "إنشاء عمليات رسمية للموافقة على التغييرات لتوجيه الفرق نحو تسليم الميزات الأساسية أولًا.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدخل المشروع مرحلة اختبار قبول المستخدم. بعد أن أثار العديد من المستخدمين النهائيين في الأعمال أسئلة ومخاوف، اكتشف مدير المشروع أن متطلبات العمل الحرجة تم إغفالها من تحليل متطلبات العمل.\n\nما الذي يجب على مدير المشروع فعله لحل هذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع لجنة مراقبة التغيير (CCB) لمراجعة طلبات التغيير.\n\n- لماذا؟\nلجنة مراقبة التغيير هي الجهة المختصة بمراجعة الطلبات الجديدة وتقييم أثرها على المشروع قبل اتخاذ قرار.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إجراء مقابلة مع الفريق فقط لن يحل مشكلة إغفال المتطلبات.\n- تعديل خطة إدارة المتطلبات وإبلاغ أصحاب المصلحة قد يكون ضروريًا لكنه يأتي بعد موافقة CCB.\n- إبلاغ الراعي بمخاوف المستخدمين هو خطوة غير مباشرة ولا تعالج المشكلة بشكل فوري.",
    "choices": [
      {
        "text": "إجراء مقابلة مع الفريق الذي قام بالتحليل لمعرفة سبب إغفال هذه المتطلبات.",
        "correct": false
      },
      {
        "text": "تعديل خطة إدارة المتطلبات وإبلاغ أصحاب المصلحة بأن الجدول الزمني قد يتأثر.",
        "correct": false
      },
      {
        "text": "جدولة اجتماع مع راعي المشروع لإبلاغه بمخاوف المستخدمين النهائيين.",
        "correct": false
      },
      {
        "text": "الاجتماع مع لجنة مراقبة التغيير (CCB) لمراجعة طلبات التغيير.",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "أثناء تطوير خط الأساس الأولي للجدول الزمني، علم مدير المشروع أن مديرًا وظيفيًا أعاد تخصيص موردين مطلوبين لمهمة حرجة إلى مشروع استراتيجي آخر. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع المدير الوظيفي للتفاوض على تخصيص موارد بديلة.\n\n- لماذا؟\nالتفاوض المباشر مع المدير الوظيفي يساعد على إيجاد حلول توافقية دون تصعيد أو تعطيل سير العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إجراء تحليل كمي للمخاطر مفيد لكنه يأتي بعد محاولة حل المشكلة.\n- طلب مراجعة إعادة التخصيص من قبل CCB غير مناسب لأنه ليس تغييرا رسميا من قبل المشروع.\n- تصعيد المسألة إلى راعي المشروع قد يكون خطوة لاحقة إذا فشلت المفاوضات المباشرة.",
    "choices": [
      {
        "text": "إجراء تحليل كمي للمخاطر لتحديد تأثير التغيير على المشروع.",
        "correct": false
      },
      {
        "text": "طلب مراجعة إعادة التخصيص من قبل لجنة مراقبة التغيير (CCB).",
        "correct": false
      },
      {
        "text": "الاجتماع مع المدير الوظيفي للتفاوض على تخصيص موارد بديلة.",
        "correct": true
      },
      {
        "text": "تصعيد المسألة إلى راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع دولي جديد تمت الموافقة عليه مؤخرًا. يعتمد التنفيذ الناجح للمشروع على نتائج من مجموعة متنوعة من الأقسام.\n\nما هو أهم شيء يمكن أن يفعله مدير المشروع لضمان التنفيذ الناجح للمشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع المدراء الوظيفيين للأقسام ذات الصلة لضمان توافقهم مع أهداف المشروع.\n\n- لماذا؟\nتوافق المدراء الوظيفيين ضروري لتأمين دعم الموارد وضمان التعاون الفعال عبر الأقسام.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- وضع قواعد الاتصالات وتطوير خطة المشروع مهام مهمة لكنها تأتي بعد تأمين الدعم الإداري.\n- تسهيل جلسات جمع المعلومات هام لكنه لا يضمن دعم الأقسام الأساسية.\n- تطوير خطة إدارة الموارد خطوة لاحقة تعتمد على دعم المدراء الوظيفيين.",
    "choices": [
      {
        "text": "العمل مع أعضاء فريق المشروع لوضع قواعد أساسية للاتصالات وتطوير خطة المشروع.",
        "correct": false
      },
      {
        "text": "تسهيل جلسات مع أصحاب المصلحة الرئيسيين لجمع المعلومات ذات الصلة وتحديد متطلبات المنتج بالتفصيل.",
        "correct": false
      },
      {
        "text": "الاجتماع مع المدراء الوظيفيين للأقسام ذات الصلة لضمان توافقهم مع أهداف المشروع.",
        "correct": true
      },
      {
        "text": "تطوير خطة إدارة الموارد لتحديد الموارد المطلوبة من كل قسم.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "طلب أحد أصحاب المصلحة تقارير حالة مشروع أكثر تكرارًا وتفصيلًا مما تم الاتفاق عليه سابقًا. كما أبدى اهتمامًا بالمشاركة بشكل أكبر في المشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: تحديث خطة الاتصال مع أصحاب المصلحة والتأكد من توافق الفريق مع متطلبات التقارير الجديدة.\n\n- لماذا؟\nتحديث خطة الاتصال يضمن أن التوقعات الجديدة لأصحاب المصلحة واضحة ومُوثقة، ويُعزز توافق الفريق على كيفية تقديم المعلومات، مما يحسن التواصل ويقلل الالتباسات.\n\n- شرح باقي الخيارات:\n\n- تقديم تحديث وإرسال تقارير بشكل فوري:\nقد يسبب زيادة في العمل بدون توافق مع الفريق ولا يضمن استدامة التواصل.\n\n- تحديث مصفوفة تقييم مشاركة أصحاب المصلحة:\nلا يعالج طريقة تقديم المعلومات أو التوافق مع الفريق، بل يقيّم فقط مستوى المشاركة.\n\n- تطوير مصفوفة أصحاب المصلحة (Stakeholder Cube):\nأداة مفيدة لكنها لا تعالج المشكلة الحالية المتعلقة بتغيير متطلبات التقارير والتواصل.",
    "choices": [
      {
        "text": "تقديم تحديث لحالة المشروع وإرسال تقارير الحالة التفصيلية في أقرب وقت ممكن.",
        "correct": false
      },
      {
        "text": "تحديث مصفوفة تقييم مشاركة أصحاب المصلحة لإظهار أن مستوى مشاركة صاحب المصلحة داعم.",
        "correct": false
      },
      {
        "text": "تحديث خطة الاتصال مع أصحاب المصلحة والتأكد من توافق الفريق مع متطلبات التقارير الجديدة.",
        "correct": true
      },
      {
        "text": "تطوير مصفوفة أصحاب المصلحة (Stakeholder Cube) التي تحدد العلاقة بين صاحب المصلحة والمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتكوّن فريق مشروع من أفراد من خلفيات وأعمار واهتمامات مختلفة. ويواجه الفريق صعوبة في العمل معًا.\n\nكيف يمكن للاجتماع مع الفريق لتطوير قيم مشتركة ورؤية موحدة أن يساعد مدير المشروع في تسهيل العمل الجماعي بشكل أفضل؟",
    "explanation": "الإجابة الصحيحة: سيساهم الفهم الأفضل لأولويات أعضاء الفريق في إنشاء لغة مشتركة تعزز التعاون.\n\n- لماذا؟\nعندما يلتقي الفريق لتطوير قيم ورؤية مشتركة، يُمكن لكل عضو التعبير عن أولوياته، مما يخلق ثقافة احترام متبادلة، ويُسهل التواصل.\n\n- شرح باقي الخيارات:\n\n- اجتماع رسمي مع الفريق لمناقشة أهمية العمل الجماعي:\nمهم لكنه قد يكون شكليًا ولا يغير من اختلاف الخلفيات أو يحل الصراعات الحقيقية.\n\n- فهم وجهة نظر كل عضو لتحديد مجالات التدريب:\nخطوة جيدة لكنها تأتي بعد تأسيس قيم مشتركة، وإلا قد لا يكون التدريب فعالًا.\n\n- تطوير فهم المدير لأهداف المشروع:\nضروري، لكنه لا يضمن تواصل الفريق أو ثقافة مشتركة بين أعضائه، والتركيز على المدير فقط لا يحل مشاكل الفريق.",
    "choices": [
      {
        "text": "سيحفز اجتماع رسمي مع الفريق لمناقشة أهمية العمل الجماعي الفريق ويحسن أداء المشروع.",
        "correct": false
      },
      {
        "text": "سيساهم الفهم الأفضل لأولويات أعضاء الفريق في إنشاء لغة مشتركة تعزز التعاون.",
        "correct": true
      },
      {
        "text": "سيساعد فهم وجهة نظر كل عضو في تحديد المجالات التي تتطلب تعليمًا وتدريبًا.",
        "correct": false
      },
      {
        "text": "من خلال تطوير فهمه الخاص لأهداف المشروع، سيكتسب الفريق الثقة.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "علم مدير المشروع أن أحد أصحاب المصلحة يعتقد أن بعض أصحاب المصلحة فقط يحصلون على جميع تحديثات المشروع ويشعر بأنه مستبعد من دائرة المعلومات. ماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة الاتصالات للتأكد من شمول جميع أصحاب المصلحة.\n\n- لماذا؟\nمراجعة خطة إدارة الاتصالات تساعد على التحقق من أن جميع أصحاب المصلحة المحددين يستلمون المعلومات المناسبة في الوقت المناسب، مما يقلل من الشعور بالاستبعاد ويحسن الشفافية.\n\n- شرح باقي الخيارات:\n\n- إعداد تقرير حالة وإرساله إلى الجميع:\nإجراء جيد لكنه قد لا يحل المشكلة إذا كانت خطة الاتصالات نفسها غير مكتملة أو غير محدثة.\n\n- الاجتماع مع أصحاب المصلحة لمقارنة المعلومات:\nقد يؤدي إلى نزاعات ويعتمد على التعاون الطوعي، وليس حلاً منهجيًا.\n\n- تعديل استراتيجية الاتصالات لتوزيع التقارير بشكل أكثر تكرارًا:\nليس ضروريًا أن يكون التكرار هو المشكلة، بل التوزيع والشمولية في الخطة.",
    "choices": [
      {
        "text": "إعداد تقرير حالة وإرساله إلى جميع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع جميع أصحاب المصلحة وطلب منهم مقارنة المعلومات.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة الاتصالات للتأكد من شمول جميع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تعديل استراتيجية الاتصالات لضمان توزيع تقارير الحالة بشكل أكثر تكرارًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد مدير المشروع مخاطرة خلال مرحلة التنفيذ لم يتم التنبؤ بها أثناء التخطيط. كيف يمكن أن تساعد جلسة العصف الذهني في تقليل هذه المخاطرة مع الحفاظ على تقدم المشروع وفق الجدول الزمني؟",
    "explanation": "الإجابة الصحيحة: يمكن أن يحدد العصف الذهني مع فريق المشروع عدة أفكار في وقت قصير.\n\n- لماذا؟\nجلسات العصف الذهني تجمع الأفكار المتنوعة من الفريق بسرعة، مما يساعد في إيجاد حلول مبتكرة أو استراتيجيات تقليل المخاطر دون تأخير تقدم المشروع.\n\n- شرح باقي الخيارات:\n\n- تطبيق تقنيات تحليل البيانات النوعية:\nغير دقيق هنا لأن العصف الذهني يركز على توليد الأفكار وليس تحليل البيانات.\n\n- افتراضات جديدة من أصحاب المصلحة:\nقد يكون غير مرتبط بجلسة عصف ذهني فاعلة أو قد يؤخر العملية.\n\n- العصف الذهني بشأن تمويل إضافي:\nليس الهدف الأساسي من العصف الذهني، وقد لا يكون ممكنًا دائمًا في ظل قيود المشروع.",
    "choices": [
      {
        "text": "سيمكن العصف الذهني مدير المشروع من تطبيق تقنيات تحليل البيانات النوعية.",
        "correct": false
      },
      {
        "text": "يمكن أن يحدد العصف الذهني مع فريق المشروع عدة أفكار في وقت قصير.",
        "correct": true
      },
      {
        "text": "يمكن أن ينتج عن العصف الذهني مع أصحاب المصلحة افتراضات جديدة حول مدى تحمل المخاطر.",
        "correct": false
      },
      {
        "text": "يمكن أن يساعد العصف الذهني بشأن تمويل إضافي في تقليل المخاطر وضغط الجدول الزمني.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "أثناء مراجعة جودة المخرجات مع الفريق، يحدد مدير المشروع أن عدة مشاكل جودة كان يمكن تجنبها باستخدام قائمة تحقق. قام مدير المشروع بتنفيذ قائمة تحقق لضمان توافق المخرجات المستقبلية مع خطة إدارة المشروع.\n\nماذا فعل مدير المشروع في هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: استخدام إجراء تصحيحي.\n\n- لماذا؟\nالإجراء التصحيحي هو خطوة تتخذ لمنع تكرار المشاكل التي تم اكتشافها سابقًا، مثل تنفيذ قائمة تحقق لضمان جودة المخرجات في المستقبل.\n\n- شرح باقي الخيارات:\n\n- تعريف مقاييس جودة جديدة: قد يساعد مستقبلاً لكنه لا يعالج المشكلة الحالية بشكل مباشر.\n\n- تيسير اجتماع مراجعة ما بعد التنفيذ: مهم لتحسين العمليات لكنه لا يمنع تكرار المشكلة حالياً.\n\n- عقد اجتماع لاستخلاص الدروس المستفادة: ضروري لتحسين مستقبلي ولكنه خطوة لاحقة بعد معالجة المشكلة.",
    "choices": [
      {
        "text": "تعريف مقاييس جودة جديدة.",
        "correct": false
      },
      {
        "text": "استخدام إجراء تصحيحي.",
        "correct": true
      },
      {
        "text": "تيسير اجتماع مراجعة ما بعد التنفيذ.",
        "correct": false
      },
      {
        "text": "عقد اجتماع لاستخلاص الدروس المستفادة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع معقد في مرحلة التخطيط. تم تعيين مدير مشروع جديد حاصل على شهادة حديثة من قبل الراعي. عند مراجعة ميثاق المشروع، يكتشف مدير المشروع عدة عوامل قد تؤثر على المشروع بطرق غير متوقعة.\n\nما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: تطوير خطة لإدارة المخاطر تتضمن تفاصيل حول العوامل المختلفة.\n\n- لماذا؟\nوضع خطة إدارة المخاطر يتيح تحديد وتقييم ومراقبة هذه العوامل وتأثيرها المحتمل على المشروع، مما يساعد في تقليل المخاطر أو الاستجابة لها بفعالية.\n\n- شرح باقي الخيارات:\n\n- تحديث خطة المشروع بالجدول والميزانية: ضروري لكنه لا يعالج المخاطر المحتملة بشكل مباشر.\n\n- إبلاغ الراعي بالتأثيرات المحتملة: مهم لكن خطوة تكميلية بعد وضع خطة للمخاطر.\n\n- توسيع سجل المشكلات بتحليل ماذا لو: مفيد لكنه أقل شمولية من خطة إدارة المخاطر الكاملة.",
    "choices": [
      {
        "text": "تحديث خطة المشروع بتفاصيل حول الجدول الزمني وتوقعات الميزانية.",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بالتأثيرات المحتملة لهذه العوامل على المشروع.",
        "correct": false
      },
      {
        "text": "تطوير خطة لإدارة المخاطر تتضمن تفاصيل حول العوامل المختلفة.",
        "correct": true
      },
      {
        "text": "توسيع سجل المشكلات ليشمل تحليل سيناريوهات ماذا لو.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "مشروع تصنيع معقد يحتوي على العديد من أصحاب المصلحة في عدة مواقع. يدخل المشروع في مرحلة نشاط عالي ويحتاج مدير المشروع إلى التأكد من أن جميع أصحاب المصلحة يتم إعلامهم بالتحديثات في الوقت المناسب.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: تحديث خطة إدارة الاتصالات لتتضمن جدولًا زمنيًا أكثر تكرارًا للتحديثات.\n\n- لماذا؟\nتحديث خطة إدارة الاتصالات هو الخطوة الأولى لضمان وجود آلية منظمة وموثوقة لتوصيل المعلومات لجميع أصحاب المصلحة وفق جدول محدد، مما يقلل من مخاطر سوء التواصل.\n\n- شرح باقي الخيارات:\n\n- جدولة جلسات تدريب: مهم لكنه لا يضمن تحسين التواصل الفوري.\n\n- تحديد التكنولوجيا الأنسب: مهم لكن يتم بعد تحديد خطة التواصل.\n\n- جدولة تقارير حالة منتظمة: جيد لكنه جزء من خطة الاتصالات التي يجب تحديثها أولًا.",
    "choices": [
      {
        "text": "جدولة جلسات تدريب على الاتصالات الفعالة مع جميع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديد التكنولوجيا الأنسب لاستخدامها في التواصل مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "جدولة تقارير حالة منتظمة يتم إرسالها إلى جميع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة الاتصالات لتتضمن جدولًا زمنيًا أكثر تكرارًا للتحديثات.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة التخطيط لتوسيع شركة خدمات، أجرى أصحاب المصلحة دراسة جدوى لتحديد نوع الخدمة الجديدة التي يجب أن تقدمها الشركة. خلال تحليل البدائل، تم التوصل إلى أن نوعًا آخر من الخدمات سيكون أكثر فعالية. وقد وافقت لجنة مراقبة التغيير (CCB) على طلب التغيير للخدمة البديلة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تنفيذ التغيير كما تمت الموافقة عليه.\n\n- لماذا؟\nبمجرد أن توافق لجنة مراقبة التغيير على التغيير، يكون من مسؤولية مدير المشروع تنفيذ التغيير وفق الموافقة لضمان تحقيق أهداف المشروع وتحقيق القيمة المطلوبة.\n\n- شرح باقي الخيارات:\n\n- تعديل التغيير: قد يتسبب في تأخير أو تعقيد دون موافقة جديدة.\n\n- طلب تبرير من اللجنة: غير ضروري بعد الموافقة.\n\n- إجراء تحليل التكلفة والفائدة: كان يجب أن يتم قبل الموافقة على التغيير.",
    "choices": [
      {
        "text": "تنفيذ التغيير كما تمت الموافقة عليه.",
        "correct": true
      },
      {
        "text": "تعديل التغيير لتقليل التأثير على الجدول الزمني والميزانية.",
        "correct": false
      },
      {
        "text": "طلب تبرير من لجنة مراقبة التغيير للتغيير.",
        "correct": false
      },
      {
        "text": "إجراء تحليل التكلفة والفائدة للخدمة البديلة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام الرعاة لمشروع متعدد الجنسيات بوضع عملية تولد رسائل بريد إلكتروني وتقارير في نهاية كل مرحلة. الهدف هو ضمان توحيد المشروع عبر الشركة. وتخطط الشركة لاستخدام هذه العملية كنموذج لمشاريع مماثلة في المستقبل.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تحديث خطة إدارة الاتصالات لتتضمن تفاصيل حول رسائل البريد الإلكتروني والتقارير.\n\n- لماذا؟\nتحديث خطة إدارة الاتصالات يضمن توثيق وتنظيم طريقة إرسال هذه الرسائل والتقارير، مما يدعم التوحيد ويضمن اتساق التواصل بين جميع الفرق وأصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إدراج توقيع رسمي: لا يعالج مسألة توحيد التواصل.\n- عقد اجتماعات حالة: قد يكون مفيدًا لكن ليس الخطوة الأولى.\n- تحديث خطة مشاركة أصحاب المصلحة: لا يركز مباشرة على عملية الاتصالات المطلوبة.",
    "choices": [
      {
        "text": "تحديث خطة إدارة الاتصالات لتتضمن تفاصيل حول رسائل البريد الإلكتروني والتقارير.",
        "correct": true
      },
      {
        "text": "إدراج توقيع رسمي في نهاية كل مرحلة لإشراك أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "عقد اجتماعات حالة لجمع مدخلات من الرعاة لتقارير البريد الإلكتروني.",
        "correct": false
      },
      {
        "text": "تحديث خطة مشاركة أصحاب المصلحة في نهاية كل مرحلة للحفاظ على التزامهم بنجاح المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع كبير يضم مجموعات وظيفية في أربع دول يقترب من الاكتمال. يجتمع مدير المشروع مع المدراء الوظيفيين لإعداد مستندات الإغلاق.\n\nلماذا يجب على راعي المشروع التوقيع على قبول مخرجات المشروع؟",
    "explanation": "الإجابة الصحيحة: لأن راعي المشروع مسؤول عن تأمين التمويل وتخصيص الموارد للمشروع.\n\n- لماذا؟\nراعي المشروع هو صاحب القرار الأعلى ويملك السلطة المالية والإدارية لقبول مخرجات المشروع رسميًا، مما يضمن الالتزام والمساءلة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التواصل مع العميل: ليست مسؤوليته الوحيدة.\n- المدراء الوظيفيون: لا يمتلكون الصلاحيات النهائية للموافقة.\n- الموقع الجغرافي: لا يؤثر على الصلاحيات الرسمية.",
    "choices": [
      {
        "text": "لأن راعي المشروع مسؤول عن تأمين التمويل وتخصيص الموارد للمشروع.",
        "correct": true
      },
      {
        "text": "لأن راعي المشروع يتواصل مباشرة مع العميل بخصوص قبول المخرجات.",
        "correct": false
      },
      {
        "text": "لأن المدراء الوظيفيين لديهم صلاحية الموافقة على أهداف المشروع وليس على المخرجات النهائية.",
        "correct": false
      },
      {
        "text": "لأن المدراء الوظيفيين منتشرون جغرافيًا ولا يمكنهم التوقيع على المخرجات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد الانتهاء من مشروع، يجتمع الفريق لعقد جلسة لاستخلاص الدروس المستفادة. خلال الاجتماع، تبين أن جميع المخرجات قد اكتملت وفق المعايير المحددة، لكن أثناء الاختبار، تم اكتشاف عدد كبير من الأخطاء.\n\nما الذي كان يجب على مدير المشروع فعله في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: إجراء تحليل مونتي كارلو لتحديد النتائج والاستجابات المحتملة.\n\n- لماذا؟\nتحليل مونتي كارلو يساعد في تقييم تأثير الأخطاء على المشروع ومستقبله من خلال محاكاة سيناريوهات متعددة، مما يمكّن الفريق من اتخاذ قرارات مستنيرة للتخفيف من المخاطر في المشاريع القادمة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- عقد اجتماع مع فريق الاختبار: مهم لكنه لا يوفر تحليلاً كافيًا لخطورة المشكلة.\n- تقييم استراتيجية التخفيف: يسبقها فهم شامل بالمخاطر باستخدام أدوات تحليل.\n- تضمين الأخطاء في سجل المخاطر: خطوة ضرورية لكنها ليست كافية دون تحليل شامل.",
    "choices": [
      {
        "text": "عقد اجتماع مع فريق الاختبار للحصول على مزيد من المعلومات حول طرق الاختبار المستخدمة.",
        "correct": false
      },
      {
        "text": "تقييم متى سيتم تنفيذ استراتيجية التخفيف للتحضير للمشاريع المستقبلية.",
        "correct": false
      },
      {
        "text": "إجراء تحليل مونتي كارلو لتحديد النتائج والاستجابات المحتملة.",
        "correct": true
      },
      {
        "text": "تضمين هذه الأخطاء في سجل المخاطر كعنصر يجب مراقبته في المشاريع المستقبلية.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع رشيق (Agile). يحتوي المشروع على 100 قصة مستخدم موزعة على عشر دورات. كل قصة مستخدم تساوي 100 دولار أمريكي. تم إنفاق 4500 دولار فعليًا وتم تسليم 50 قصة مستخدم بعد خمس دورات.\n\nأي من العبارات التالية صحيحة؟",
    "explanation": "الإجابة الصحيحة: المشروع يسير حسب الجدول وهو أقل من الميزانية.\n\n- لماذا؟\nتم تسليم 50 قصة مستخدم من أصل 100 بعد خمس دورات، مما يعني أن التقدم وفق الجدول (50%). أما الميزانية، فقد تم إنفاق 4500 دولار مقابل 5000 دولار مخططة (50 قصة × 100 دولار)، إذن الميزانية تحت السيطرة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- المشروع متأخر أو متقدم: نسبة الإنجاز تتوافق مع الجدول.\n- تجاوز الميزانية: الإنفاق أقل من الميزانية المخصصة.",
    "choices": [
      {
        "text": "المشروع متأخر عن الجدول الزمني ويتجاوز الميزانية.",
        "correct": false
      },
      {
        "text": "المشروع يسير حسب الجدول وهو أقل من الميزانية.",
        "correct": true
      },
      {
        "text": "المشروع يسير حسب الجدول ووفق الميزانية.",
        "correct": false
      },
      {
        "text": "المشروع متأخر عن الجدول الزمني وأقل من الميزانية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع للانضمام إلى مشروع صناعي ضخم جارٍ تنفيذه. المؤشرات الحالية للأداء هي CPI=0.42 وSPI=0.20. هذا المشروع هو:",
    "explanation": "الإجابة الصحيحة: متأخر عن الجدول الزمني وفوق الميزانية.\n\n- لماذا؟\nCPI (مؤشر أداء التكلفة) أقل من 1 يعني أن التكلفة أعلى من المخطط، وSPI (مؤشر أداء الجدول الزمني) أقل من 1 يعني تأخر في الجدول.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مؤشرات الأداء تشير إلى تأخر وتجاوز التكلفة، وليس تقدم أو تحت الميزانية.",
    "choices": [
      {
        "text": "متقدم عن الجدول الزمني وتحت الميزانية",
        "correct": false
      },
      {
        "text": "متقدم عن الجدول الزمني وفوق الميزانية",
        "correct": false
      },
      {
        "text": "متأخر عن الجدول الزمني وتحت الميزانية",
        "correct": false
      },
      {
        "text": "متأخر عن الجدول الزمني وفوق الميزانية",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال إحدى الدورات، أدرك الفريق أن المشروع سيتجاوز الميزانية. ويعود ذلك إلى أن موارد الدعم شاركت لفترة أطول من المخطط لها. تقتضي سياسة الشركة الإبلاغ الفوري عند حدوث أي تغيير في الميزانية.\n\nماذا يجب على مدير المشروع أن يفعل لإدارة ميزانية المشروع؟",
    "explanation": "الإجابة الصحيحة: مناقشة الأمر مع فريق المشروع لتقليل استخدام موارد الدعم من قبل المشروع.\n\n- لماذا؟\nإشراك الفريق في تقليل استخدام الموارد يساعد في السيطرة على التكلفة دون الحاجة لتغييرات رسمية أو تقليل جودة العمل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقدير الميزانية الجديدة: خطوة لاحقة بعد محاولة السيطرة على التكاليف.\n- تقليل الموارد فجأة: قد يؤثر سلبًا على جودة العمل.\n- قبول المخاطر: قد يؤدي إلى مشاكل مالية إذا تجاوزت التكاليف الحدود بشكل كبير.",
    "choices": [
      {
        "text": "تقدير التكلفة الإضافية للمشروع والتخطيط لاقتراح الميزانية الجديدة على لجنة مراجعة التغييرات.",
        "correct": false
      },
      {
        "text": "تقليل الموارد وطلب من الفريق إدارة المهام ضمن التكلفة المخططة.",
        "correct": false
      },
      {
        "text": "مناقشة الأمر مع فريق المشروع لتقليل استخدام موارد الدعم من قبل المشروع.",
        "correct": true
      },
      {
        "text": "قبول مخاطر تجاوز التكلفة اعتمادًا على مبلغ الطوارئ في المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع لعميل له تاريخ من كونه متطلبًا وغير واضح بشأن المتطلبات. وقد رفض العميل قبول التسليمات السابقة دون تقديم ملاحظات واضحة.\n\nكيف يجب على مدير المشروع المضي قدمًا في هذا المشروع؟",
    "explanation": "الإجابة الصحيحة: العمل مع العميل ومالك المنتج لتحديد الحد الأدنى القابل للتسليم (MVP) بشكل واضح.\n\n- لماذا؟\nتحديد MVP يضمن وضوح المتطلبات من البداية، ويقلل من المخاطر الناتجة عن عدم وضوح توقعات العميل، ويساعد على التركيز على القيم الأساسية التي ينتظرها العميل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاجتماع مع الراعي فقط دون إشراك العميل لن يحل مشكلة غموض المتطلبات.\n- تنفيذ نهج تكراري وحده بدون اتفاق على MVP قد يؤدي إلى تكرار الرفض.\n- إيقاف المشروع يتسبب بخسائر ولا يعكس منهجية إدارة فعالة.",
    "choices": [
      {
        "text": "الاجتماع مع الراعي لوضع جدول زمني مفصل يؤدي إلى إكمال المشروع في الوقت المحدد.",
        "correct": false
      },
      {
        "text": "العمل مع العميل ومالك المنتج لتحديد الحد الأدنى القابل للتسليم (MVP) بشكل واضح.",
        "correct": true
      },
      {
        "text": "تنفيذ نهج تكراري من أجل الحصول على قبول رسمي لكل تسليمة.",
        "correct": false
      },
      {
        "text": "طلب إيقاف المشروع حتى يتمكن العميل من تقديم توقعات ملموسة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدير مدير مشروع مشروعًا باستخدام النهج الرشيق (Agile) وقد أُنجز نصفه. خلال جلسة الاستعراض الأخيرة للدورة، لاحظ أعضاء الفريق أنهم عملوا لساعات أكثر من المخطط لها.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: العمل مع فريق المشروع لتحديد سبب ذلك وما يمكن فعله لمنعه في الدورات القادمة.\n\n- لماذا؟\nإدارة Agile تعتمد على التحسين المستمر من خلال اجتماعات الاستعراض والتخطيط التالي. تحديد السبب هو خطوة أساسية لتحسين الأداء وتقليل الاستنزاف.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تسجيل الساعات الإضافية لا يحل السبب الجذري.\n- طلب أعضاء إضافيين قد يكون مكلفًا وغير ضروري إذا كان السبب في التخطيط.\n- تمكين الفريق وحده دون تدخل القائد قد يؤدي إلى تجاهل المشكلة.",
    "choices": [
      {
        "text": "تسجيل الساعات الإضافية في الميزانية والاستفادة من الاحتياطيات المالية.",
        "correct": false
      },
      {
        "text": "التواصل مع الراعي لطلب أعضاء إضافيين في الفريق لزيادة سرعة التنفيذ.",
        "correct": false
      },
      {
        "text": "العمل مع فريق المشروع لتحديد سبب ذلك وما يمكن فعله لمنعه في الدورات القادمة.",
        "correct": true
      },
      {
        "text": "تمكين الفريق من معالجة هذه المسألة وتقديم الحل المقترح للراعي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ما هو العامل الأقل احتمالًا أن يتغير أثناء تنفيذ المشروع الرشيق؟",
    "explanation": "الإجابة الصحيحة: رؤية المشروع.\n\n- لماذا؟\nرؤية المشروع تعبر عن الهدف الاستراتيجي الأساسي الذي يسعى المشروع لتحقيقه. حتى في بيئات Agile التي تتسم بالتغيير والتكيف، تبقى الرؤية ثابتة كمرجع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تعريف الإنجاز قد يتغير حسب الأولويات.\n- مالك المنتج يمكن تغييره حسب ظروف العمل.\n- سجل المنتج (Backlog) يتغير باستمرار حسب الأولويات ومراجعة الاحتياجات.",
    "choices": [
      {
        "text": "رؤية المشروع",
        "correct": true
      },
      {
        "text": "تعريف الإنجاز",
        "correct": false
      },
      {
        "text": "مالك المنتج",
        "correct": false
      },
      {
        "text": "سجل المنتج (Backlog)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجد فريق رشيق صعوبة في إكمال قائمة التحقق لأن لديهم تفسيرات مختلفة لما يهدف إليه المشروع. كيف يمكن لمدير المشروع مساعدتهم في الوصول إلى فهم مشترك للغرض العام من المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة رؤية المشروع.\n\n- لماذا؟\nرؤية المشروع توضح الهدف العام والغاية الاستراتيجية للمشروع. في بيئات Agile، إذا كان الفريق لا يفهم الغرض بوضوح، فإن العودة إلى رؤية المشروع تساعدهم على التركيز على ما هو مهم فعلًا.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة القائمة الكاملة لقصص المستخدم تساعد على التفاصيل، لكنها لا توضح الغاية العامة.\n- البيان الرشيق (Agile Manifesto) يحدد مبادئ عامة لكن لا يعطي رؤية خاصة بالمشروع.\n- مراجعة Sprint Retrospective تهدف للتحسين الداخلي وليس لتوضيح رؤية المشروع.",
    "choices": [
      {
        "text": "مراجعة رؤية المشروع.",
        "correct": true
      },
      {
        "text": "مراجعة القائمة الكاملة لقصص المستخدم.",
        "correct": false
      },
      {
        "text": "مراجعة البيان الرشيق (Agile Manifesto).",
        "correct": false
      },
      {
        "text": "إجراء أول مراجعة بعد الدورة (sprint retrospective).",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أبلغ أحد أعضاء الفريق مدير المشروع أثناء اجتماع المشروع أن المهمة المستحقة لم تُنجز في الوقت المحدد بسبب أزمة عمل مفاجئة.\n\nماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة تقدم المهمة مع الفريق واتخاذ القرار المناسب بشأن الإجراء القادم.\n\n- لماذا؟\nالتصرف المهني يتطلب تقييم الوضع بشكل موضوعي مع الفريق، سواء بإعادة جدولة أو إعادة توزيع العمل. هذا يحافظ على الشفافية والمرونة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التحقق من تبعية المهمة مهم، لكنه لا يكفي وحده لتقرير الخطوة القادمة.\n- طلب العمل لساعات إضافية بدون مناقشة قد يضر الفريق.\n- تدخل أعضاء الفريق دون خطة واضحة قد يسبب إرباكًا إضافيًا.",
    "choices": [
      {
        "text": "التحقق من تبعية المهمة، وأولويتها، وتأثير التأخير على المشروع بالكامل.",
        "correct": false
      },
      {
        "text": "التحدث إلى عضو الفريق بشكل خاص وطلب منه العمل لساعات إضافية لإكمال المهمة.",
        "correct": false
      },
      {
        "text": "طلب من أعضاء الفريق الآخرين التدخل والمساعدة في إنجاز المهمة.",
        "correct": false
      },
      {
        "text": "مراجعة تقدم المهمة مع الفريق واتخاذ القرار المناسب بشأن الإجراء القادم.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-answer",
    "text": "في إطار رشيق موسّع (Scaled Agile Framework) ، ما هي المسؤوليات التي يمكن لمدير المشروع تنفيذها ضمن دور مهندس قطار الإصدارات (Release Train Engineer)؟ (اختر 3)",
    "explanation": "الإجابات الصحيحة: إدارة المخاطر، تصعيد العوائق، التوجيه بشأن التحسين المستمر على مستوى الفريق.\n\n- لماذا؟\nمهندس قطار الإصدارات (RTE) هو المسؤول عن تسهيل عمل الفرق ضمن القطار وضمان تقدم العمل بسلاسة، ويشمل ذلك:\n1. إدارة المخاطر لضمان تقليل التأثيرات السلبية.\n2. تصعيد العوائق التي لا يمكن حلها على مستوى الفرق.\n3. دعم التحسين المستمر على مستوى الفريق لزيادة الكفاءة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- التوجيه بشأن التميز التقني العالمي ليس جزءًا مباشرًا من دور RTE، بل هو دور معماري أو تقني.\n- التوجيه بشأن التحسين المستمر العالمي يخص المستويات العليا في المؤسسة، وليس مسؤولية مباشرة للـ RTE.",
    "choices": [
      {
        "text": "إدارة المخاطر",
        "correct": true
      },
      {
        "text": "التوجيه بشأن التميز التقني العالمي",
        "correct": false
      },
      {
        "text": "تصعيد العوائق",
        "correct": true
      },
      {
        "text": "التوجيه بشأن التحسين المستمر العالمي",
        "correct": false
      },
      {
        "text": "التوجيه بشأن التحسين المستمر على مستوى الفريق",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يحتاج مطور برمجيات يعمل على مكون حرج إلى أخذ إجازة طارئة من المشروع. نظرًا للقيود الزمنية، لا يستطيع مدير المشروع توظيف مطور بديل جديد للفريق.\n\nما الذي يجب على مدير المشروع فعله لإدارة هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: طلب من أعضاء الفريق إيجاد طريقة لإنجاز عمل المطور الغائب ضمن هذه الدورة.\n\n- لماذا؟\nفي البيئات الرشيقة (Agile)، تعتمد الفرق على التعاون وتوزيع العمل بناءً على القدرات المتاحة. عندما يغيب فرد، يجب على الفريق ككل إعادة تنظيم نفسه لتوزيع المهام بدلًا من الاعتماد على شخص واحد.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- نقل المكون الحرج إلى الدورة النهائية قد يؤدي إلى تأخير المشروع وتعريضه للمخاطر.\n- طلب تمديد المشروع يتعارض مع مبادئ المرونة والتكيف في Agile.\n- تمديد الدورة الزمنية يقلل الكفاءة ويؤثر على الإيقاع (cadence) الخاص بالفريق، وهو ضد مبادئ Agile.",
    "choices": [
      {
        "text": "نقل المكون الحرج إلى الدورة النهائية ليتم العمل عليه بعد عودة المطور من الإجازة.",
        "correct": false
      },
      {
        "text": "طلب تمديد المشروع من الراعي حتى يعود المطور ويكمل العمل.",
        "correct": false
      },
      {
        "text": "تمديد الدورة الزمنية لإتاحة الوقت لعودة المطور وإكمال المكون.",
        "correct": false
      },
      {
        "text": "طلب من أعضاء الفريق إيجاد طريقة لإنجاز عمل المطور الغائب ضمن هذه الدورة.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتاج مدير مشروع إلى التعاقد مع موردين لمشروع دولي يمتد على عدة سنوات. يحتاج مدير المشروع إلى أخذ تغيّرات مثل معدلات التضخم بعين الاعتبار.\n\nما نوع العقد الذي يجب أن يستخدمه مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: عقد سعر ثابت مع تعديل اقتصادي للسعر (FPEPA).\n\n- لماذا؟\nهذا النوع من العقود (Fixed Price with Economic Price Adjustment) يسمح بإدخال تعديلات في السعر مرتبطة بتغيرات خارجية مثل التضخم، تغيّر سعر المواد الخام، أو الضرائب الجديدة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- عقد زمني ومواد (T&M) يضع المخاطرة على المشتري لأنه يدفع حسب الوقت والمواد بدون حماية من تجاوزات الميزانية.\n- CPFF (Cost Plus Fixed Fee) مناسب عندما لا يمكن تقدير التكاليف بدقة، لكنه لا يوفر تعديل بسبب التضخم.\n- FPIF (Fixed Price Incentive Fee) يربط المكافآت بتحقيق أداء معين لكنه لا يعالج موضوع التضخم مباشرة.",
    "choices": [
      {
        "text": "عقد زمني ومواد (T&M)",
        "correct": false
      },
      {
        "text": "عقد تكلفة زائد رسوم ثابتة (CPFF)",
        "correct": false
      },
      {
        "text": "عقد تكلفة زائد رسوم تحفيزية (FPIF)",
        "correct": false
      },
      {
        "text": "عقد سعر ثابت مع تعديل اقتصادي للسعر (FPEPA)",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء بدء المشروع، علم مدير المشروع أن أحد أصحاب المصلحة الرئيسيين سيغادر المشروع لمدة شهر للتشاور في مشروع استراتيجي آخر.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
    "explanation": "الإجابة الصحيحة: تحديث سجل القضايا وإخطار أصحاب المصلحة الآخرين.\n\n- لماذا؟\nسجل القضايا (Issue Log) هو الأداة المناسبة لتوثيق هذا النوع من الغياب لأنه قد يؤثر على القرارات أو اعتماد بعض المخرجات. بعد التوثيق، يجب إبلاغ الجميع للتأكد من أن الفريق مستعد لهذا الغياب.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب بديل مباشرة قد يكون سابقًا لأوانه قبل التقييم.\n- إجراء مقابلة لجمع المعلومات أمر جيد، لكن الأولوية هي التوثيق والإبلاغ.\n- تحديث خطة إدارة المخاطر لا يُعتبر الإجراء الأول بل لاحقًا بعد توثيق القضية.",
    "choices": [
      {
        "text": "تحديث سجل القضايا وإخطار أصحاب المصلحة الآخرين.",
        "correct": true
      },
      {
        "text": "طلب من المدير الوظيفي توفير بديل أثناء غياب صاحب المصلحة.",
        "correct": false
      },
      {
        "text": "إجراء مقابلة مع صاحب المصلحة لجمع المعلومات والحكم الخبير.",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة المخاطر لتشمل تأثير غياب صاحب المصلحة.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يتطلب بيان العمل (SOW) الخاص بالمشروع تسليمه خلال تسعة أشهر. يعتقد مدير المشروع أن الجدول الزمني غير واقعي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الخبراء المتخصصين (SMEs) وراعي المشروع لتحديد التوقعات.\n\n- لماذا؟\nمدير المشروع يجب أن يتحقق أولًا من صحة اعتقاده من خلال التشاور مع الخبراء المتخصصين (SMEs) الذين يمتلكون المعرفة الفنية اللازمة، بالإضافة إلى مناقشة ذلك مع راعي المشروع للتأكد من أن التوقعات مبنية على واقع وليس على افتراضات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إشراك لجنة مراقبة التغيير (CCB) خطوة متقدمة تتم لاحقًا عند الحاجة لتنفيذ تغييرات رسمية.\n- تقديم طلب موارد وميزانية إضافية مباشرة دون تقييم مسبق قد لا يكون مقبولًا.\n- التفاوض مع الراعي حول الجدول الزمني يجب أن يستند أولًا على مشورة الخبراء وتقييم دقيق.",
    "choices": [
      {
        "text": "إشراك لجنة مراقبة التغيير (CCB) في تنفيذ عملية التحكم المتكامل في التغيير.",
        "correct": false
      },
      {
        "text": "تقديم طلب كتابي إلى راعي المشروع للحصول على موارد وميزانية إضافية.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الخبراء المتخصصين (SMEs) وراعي المشروع لتحديد التوقعات.",
        "correct": true
      },
      {
        "text": "التفاوض على جدول زمني جديد مع راعي المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال تنفيذ المشروع، وجد الفريق أن هناك حاجة لإجراء تغييرات على أحد المكونات التي تم الحصول عليها من مورد خارجي، ويتم استخدام هذا المكون في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة شروط العقد وخطة إدارة المشتريات.\n\n- لماذا؟\nفي حالات تتعلق بالمكونات التي تم شراؤها من موردين خارجيين، يجب دائمًا الرجوع أولًا إلى الشروط التعاقدية وخطة إدارة المشتريات للتأكد من الحقوق والالتزامات المتعلقة بالتغييرات.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاجتماع مع المورد ليس الخطوة الأولى بل يأتي بعد التأكد من الشروط.\n- إدراج المخاطر خطوة لاحقة، لكنها ليست الأولوية.\n- معالجة طلب تغيير داخليًا قبل التأكد من العقد قد يؤدي لمشاكل قانونية أو مالية.",
    "choices": [
      {
        "text": "الاجتماع مع المورد لمناقشة ضمان المنتج.",
        "correct": false
      },
      {
        "text": "مراجعة شروط العقد وخطة إدارة المشتريات.",
        "correct": true
      },
      {
        "text": "إدراج المخاطر المحتملة الناتجة عن التغيير.",
        "correct": false
      },
      {
        "text": "معالجة طلب تغيير لتعديل خطة إدارة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "المشروع في مرحلة التنفيذ ويحتاج مدير المشروع إلى تعيين موارد جديدة إلى الفريق القائم حاليًا.\n\nما الذي يجب أن يفعله مدير المشروع لضمان عمل الفريق بفعالية وتحقيق متطلبات المشروع في الوقت المحدد؟",
    "explanation": "الإجابة الصحيحة: دمج أنشطة تطوير المهارات.\n\n- لماذا؟\nعند إدخال أعضاء جدد على فريق قائم، من المهم دمج أنشطة تطوير المهارات لخلق انسجام وتحسين الأداء الجماعي. هذا يشمل تدريب الأعضاء الجدد ودمجهم مع باقي الفريق.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إنشاء مكتبة خدمات ليس مرتبطًا مباشرة بدمج الموارد الجديدة.\n- جلسات العصف الذهني قد تكون مفيدة للأفكار، لكنها لا تعالج مسألة دمج الفريق.\n- مراقبة تماسك الفريق مهم لكنه خطوة متابعة، ويجب أن تسبقها أنشطة تطوير مهارات أولًا.",
    "choices": [
      {
        "text": "إنشاء خدمات مكتبة يسهل الوصول إليها.",
        "correct": false
      },
      {
        "text": "إجراء جلسة عصف ذهني.",
        "correct": false
      },
      {
        "text": "دمج أنشطة تطوير المهارات.",
        "correct": true
      },
      {
        "text": "مراقبة تماسك فريق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع في مشروع جديد متعدد الجنسيات، وهذه هي المرة الأولى التي يعمل فيها مع أعضاء فريق من دول مختلفة.\n\nما الذي يجب أن يفعله مدير المشروع للتحضير للمشروع؟",
    "explanation": "الإجابة الصحيحة: حضور تدريب على الحساسية الثقافية لفهم واحترام الاختلافات الثقافية.\n\n- لماذا؟\nفي المشاريع الدولية، خاصة عند التعامل مع فرق متعددة الجنسيات، يُعتبر الوعي الثقافي جزءًا أساسيًا لضمان التعاون والاحترام بين جميع الأطراف. تدريب الحساسية الثقافية يساعد مدير المشروع على فهم العادات والتوقعات المختلفة والتواصل بشكل أفضل مع الجميع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مراجعة مهارات اللغة قد تكون مفيدة لكنها ليست كافية دون وعي بالثقافة.\n- تمارين بناء الفريق خطوة لاحقة بعد فهم الخلفيات الثقافية.\n- تطوير وعي بالعادات المحلية فكرة عامة ولكنها لا تحل محل التدريب المتخصص.",
    "choices": [
      {
        "text": "حضور تدريب على الحساسية الثقافية لفهم واحترام الاختلافات الثقافية.",
        "correct": true
      },
      {
        "text": "مراجعة مهارات اللغة إذا لزم الأمر لتسهيل التواصل الفعّال.",
        "correct": false
      },
      {
        "text": "إجراء تمارين بناء الفريق لتعزيز التعاون والثقة بين الأعضاء.",
        "correct": false
      },
      {
        "text": "تطوير وعي بالعادات المحلية مع فهم أن الثقافة مكتسبة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "قام مالك شركة استشارية بإطلاق مشروع لتوسيع عدد الخدمات التي تقدمها الشركة. تمتلك الشركة ميزة تنافسية وخبرة متميزة وسمعة ممتازة. ترغب الإدارة التنفيذية في تقييم وترتيب معايير مثل عدم اليقين والتقييم فيما يتعلق بإضافة هذه الخدمات الجديدة.\n\nما هي التقنية التي يجب أن يستخدمها مدير المشروع لمساعدة الشركة في إجراء هذا التقييم؟",
    "explanation": "الإجابة الصحيحة: تحليل القرار متعدد المعايير.\n\n- لماذا؟\nتحليل القرار متعدد المعايير (Multi-Criteria Decision Analysis - MCDA) يستخدم لترتيب أو تقييم خيارات متعددة بناءً على معايير مختلفة مثل التكلفة، المخاطر، الجدوى، عدم اليقين، وغيرها. هذا مفيد جدًا عند تقييم خدمات جديدة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مخطط السبب والتأثير أداة تحليلية للمشاكل وليس للتقييم والترتيب.\n- التنبؤ يتعلق بتقدير المستقبل لكنه لا يقارن بين بدائل متعددة وفق معايير.\n- مصفوفة تقييم المخاطر تركز على المخاطر فقط دون النظر لبقية المعايير.",
    "choices": [
      {
        "text": "مخطط السبب والتأثير",
        "correct": false
      },
      {
        "text": "التنبؤ",
        "correct": false
      },
      {
        "text": "تحليل القرار متعدد المعايير",
        "correct": true
      },
      {
        "text": "مصفوفة تقييم المخاطر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع جديد. وذكر العميل أن نشأة المشروع تعتمد على أفكار وافتراضات قدمها شركاؤهم التجاريون.\n\nما الذي يجب على مدير المشروع فعله لضمان فهم واضح لأهداف المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع أصحاب المصلحة، بما في ذلك شركاء العميل، لجمع المدخلات وتحديد أهداف المشروع.\n\n- لماذا؟\nمن المهم جمع وجهات النظر من جميع أصحاب المصلحة للتأكد من أن الأهداف والافتراضات مفهومة ومُتفق عليها بشكل شامل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- إجراء مقابلات معمقة مع الشركاء فقط يترك أطرافًا أخرى مهمة خارج النقاش.\n- بدء المشروع مباشرة دون التأكد من الأهداف قد يؤدي لمشاكل لاحقة.\n- الاجتماع مع العميل وحده لا يكفي طالما أن هناك شركاء آخرين مؤثرين.",
    "choices": [
      {
        "text": "إجراء مقابلات معمقة مع شركاء العميل التجاريين للكشف عن توقعاتهم وأهدافهم.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة، بما في ذلك شركاء العميل، لجمع المدخلات وتحديد أهداف المشروع.",
        "correct": true
      },
      {
        "text": "بدء المشروع وتطوير خطة مشروع شاملة بناءً على المعلومات والافتراضات المتاحة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع العميل لمناقشة الأفكار والافتراضات الأولية للمشروع وطلب توضيح لرؤيته.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعبر أعضاء الفريق عن إحباطهم لأن مديرهم الوظيفي لا يستمع إلى آرائهم. ويبدو أنهم مترددون في الالتزام بما تبقى من المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: إظهار الدعم للفريق من خلال مناقشة أهدافهم ومعتقداتهم.\n\n- لماذا؟\nعندما يشعر أعضاء الفريق بأن صوتهم غير مسموع، يصبح دور مدير المشروع دعم الفريق وتعزيز روح الانتماء والتقدير. إظهار الدعم والمشاركة في نقاشاتهم يساعد على تحسين معنوياتهم وزيادة التزامهم.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تقسيم العمل لن يحل المشكلة الأساسية المتعلقة بالإحباط وعدم الاستماع.\n- طلب تحديد الأولويات خطوة لاحقة ولا تعالج جذور المشكلة.\n- مناقشة الأمر مع المدير الوظيفي قد يكون ضروريًا لاحقًا، لكنه ليس الخطوة الأولى التي تعيد الفريق لمساره.",
    "choices": [
      {
        "text": "إظهار الدعم للفريق من خلال مناقشة أهدافهم ومعتقداتهم.",
        "correct": true
      },
      {
        "text": "تقسيم العمل المتبقي إلى مهام أصغر وتوزيعها على الفريق.",
        "correct": false
      },
      {
        "text": "طلب من الفريق تحديد أولويات المهام المتبقية في المشروع.",
        "correct": false
      },
      {
        "text": "مناقشة مخاوف الفريق مع المدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في منتصف المشروع، حدد مدير المشروع أصحاب مصلحة جدد. كل واحد من هؤلاء أصحاب المصلحة الجدد يلعب دورًا مختلفًا في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: تحديث خطة إدارة أصحاب المصلحة.\n\n- لماذا؟\nخطة إدارة أصحاب المصلحة تحدد كيفية التعامل مع جميع أصحاب المصلحة من حيث الاتصالات والتوقعات وإشراكهم في القرارات. بمجرد ظهور أصحاب مصلحة جدد، يجب إدراجهم فورًا في هذه الخطة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- الاجتماع مع الراعي قد لا يكون ضروريًا إذا كان مدير المشروع مخولًا بإدارة هذه التحديثات.\n- مراجعة سجل أصحاب المصلحة خطوة ثانوية، لكن الأولوية تكون لتحديث الخطة.\n- تقديم طلب تغيير ليس ضروريًا لمجرد إضافة أصحاب مصلحة جدد.",
    "choices": [
      {
        "text": "الاجتماع مع راعي المشروع لمعرفة ما إذا تم إنشاء أدوار جديدة.",
        "correct": false
      },
      {
        "text": "مراجعة سجل أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
        "correct": false
      },
      {
        "text": "تحديث خطة إدارة أصحاب المصلحة.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال مرحلة تنفيذ المشروع، اشتكى اثنان من أصحاب المصلحة من أنهم لا يتلقون معلومات كافية عن حالة المشروع. لقد تم تضمينهم في الاجتماعات الدورية، ويتم مشاركة تقارير الحالة معهم.\n\nلماذا يجب على مدير المشروع الاجتماع مع هؤلاء أصحاب المصلحة؟",
    "explanation": "الإجابة الصحيحة: لتحديد المعلومات التي يفتقدونها وفهم احتياجاتهم من التواصل.\n\n- لماذا؟\nحتى لو كان مدير المشروع يظن أنه يقدم المعلومات الكافية، من الضروري التأكد من أن أصحاب المصلحة يتلقون النوع والشكل الذي يناسبهم. قد يحتاجون إلى تفاصيل أكثر، أو تقارير بصيغة مختلفة، أو معلومات عن موضوعات محددة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- جمع البيانات لتحديث سجل القضايا ليس الهدف الأول.\n- إرسال الرسائل القديمة قد يزيد من إحباطهم.\n- تطوير علاقة عمل أفضل خطوة مطلوبة لكن لا تعالج المشكلة بشكل مباشر.",
    "choices": [
      {
        "text": "لجمع بيانات حول المشكلة لتحديث سجل القضايا.",
        "correct": false
      },
      {
        "text": "لتحديد المعلومات التي يفتقدونها وفهم احتياجاتهم من التواصل.",
        "correct": true
      },
      {
        "text": "إرسال نسخ من الرسائل الإلكترونية السابقة لأصحاب المصلحة لإثبات شمولهم في خطة الاتصالات.",
        "correct": false
      },
      {
        "text": "تطوير علاقة عمل أفضل مع أصحاب المصلحة لتحديد أولويات متطلباتهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم مؤسسة بإعادة تصميم وإطلاق منتج رئيسي من جديد. جميع أصحاب المصلحة من التنفيذيين ويرغبون في ضمان نجاح إطلاق المنتج.\n\nما الذي يجب على مدير المشروع فعله لضمان نجاح المشروع؟",
    "explanation": "الإجابة الصحيحة: العمل على تحديد مؤشرات الأداء ومواءمتها مع المخرجات.\n\n- لماذا؟\nلضمان أن المنتج يلبي توقعات أصحاب المصلحة، من المهم الاتفاق على مؤشرات أداء رئيسية (KPIs) تعكس النجاح بالنسبة لهم. المؤشرات تضمن وجود معايير واضحة يتم قياس الأداء بناءً عليها.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- خطة الاتصالات مهمة لكن بدون مؤشرات أداء واضحة تبقى الاتصالات عامة وغير موجهة.\n- إبلاغ الفريق وتصعيد المشكلات خطوة تشغيلية، لكنها لا تضمن توافق أصحاب المصلحة على معايير النجاح.\n- إشراك التنفيذيين في الاجتماعات اليومية غير عملي وقد يعيق العمل بدلًا من دعمه.",
    "choices": [
      {
        "text": "تنفيذ خطة إدارة اتصالات مفصلة لإبقاء أصحاب المصلحة على اطلاع بحالة المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ الفريق بأهمية هذا المشروع وتصعيد أي مشكلات إلى الراعي.",
        "correct": false
      },
      {
        "text": "ضمان حضور جميع أصحاب المصلحة للاجتماعات اليومية حتى يتمكنوا من تعديل المشروع حسب الحاجة.",
        "correct": false
      },
      {
        "text": "العمل على تحديد مؤشرات الأداء ومواءمتها مع المخرجات.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير المشروع بوضع الجدول الزمني لمشروع تطوير برمجيات جديد. يُظهر مخطط شبكة المشروع مسارين منفصلين:\n\nالمسار A: المهام 1-2-3-4 (كل منها مدته 5 أيام)\nالمسار B: المهام 5-6-7 (بمدد 3، 7، و2 أيام على التوالي)\n\nلا توجد تبعيات خارجية بين هذين المسارين.\n\nما هو المسار الحرج لهذا المشروع؟",
    "explanation": "الإجابة الصحيحة: 1-2-3-4.\n\n- لماذا؟\nالمسار الحرج هو الأطول زمنياً لأنه يحدد المدة الإجمالية للمشروع. مجموع مدة المسار A هو 20 يوم (5+5+5+5)، بينما المسار B هو 12 يوم (3+7+2). إذًا، المسار A هو الذي يتحكم في نهاية المشروع.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- 5/6/2007 رقم خاطئ.\n- 1-2-3-4-5-6-7 غير منطقي لأنه يجمع المسارين في مسار واحد.\n- 1-2-6-7 لا يتبع الترتيب المنطقي للمخطط ولا يعكس المسار الحرج.",
    "choices": [
      {
        "text": "1-2-3-4",
        "correct": true
      },
      {
        "text": "5/6/2007",
        "correct": false
      },
      {
        "text": "1-2-3-4-5-6-7",
        "correct": false
      },
      {
        "text": "1-2-6-7",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء اجتماع مراجعة الحالة، تبيّن أن المنتج لن يفي بمتطلبات نطاق المشروع في سيناريو معين.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: بدء عملية التحكم المتكامل بالتغيير.\n\n- لماذا؟\nإذا ظهر أن أحد مخرجات المشروع لا يلبي متطلبات النطاق المتفق عليه، فهذا يستوجب تقييم رسمي وتغيير معتمد عبر عملية التحكم المتكامل بالتغيير لتحديث النطاق والخطط.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحليل المخاطر خطوة مساعدة وليست الحل الرئيسي.\n- مراجعة الخطوط الأساسية مفيدة لكن بدون المرور عبر التحكم بالتغيير تظل المراجعة غير رسمية.\n- إبلاغ العميل مباشرة وتفاوض دون المرور بإجراءات التغيير الرسمية يعتبر تجاوزًا غير منهجي.",
    "choices": [
      {
        "text": "إجراء تحليل للمخاطر وتحديث نطاق المشروع.",
        "correct": false
      },
      {
        "text": "بدء عملية التحكم المتكامل بالتغيير.",
        "correct": true
      },
      {
        "text": "مراجعة الخطوط الأساسية لتحديد المسار الحرج.",
        "correct": false
      },
      {
        "text": "إبلاغ العميل والتفاوض على تمديد الموعد النهائي.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "بعد الانتهاء من جميع التسليمات، يحتاج مدير المشروع إلى إغلاق المشروع رسميًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الحصول على قبول أصحاب المصلحة وبدء إغلاق المشروع.\n\n- لماذا؟\nلا يمكن اعتبار المشروع مغلقًا بشكل رسمي إلا بعد التأكد من قبول أصحاب المصلحة (مثل العميل أو الراعي) للتسليمات النهائية. هذا جزء أساسي من عملية إغلاق المشروع وفقًا لدليل PMBOK.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديث مستندات المشروع خطوة لاحقة ضمن إغلاق المشروع لكنها ليست الخطوة الأولى.\n- إطلاق الفريق لا يتم إلا بعد التأكيد الرسمي على الإغلاق.\n- دمج سجل القضايا جزء من الدروس المستفادة وليس الإجراء الرئيسي للإغلاق.",
    "choices": [
      {
        "text": "تحديث مستندات المشروع بقياسات مراقبة الجودة لإثبات أن التسليمات قد تم تحقيقها.",
        "correct": false
      },
      {
        "text": "الحصول على قبول أصحاب المصلحة وبدء إغلاق المشروع.",
        "correct": true
      },
      {
        "text": "إطلاق فريق المشروع وتقدير أي أموال غير مستخدمة.",
        "correct": false
      },
      {
        "text": "دمج سجل القضايا في سجل الدروس المستفادة لإعداد التقرير النهائي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع في مشروع أتم مرحلة التخطيط. يثق راعي المشروع أن خطة إدارة المشروع تضمنت ميزانية وجدولاً زمنياً كافيين، لكن يعتقد مدير المشروع أن أحداثًا غير متوقعة قد تؤثر على القدرة على إكمال المشروع بنجاح.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تحديد وتقييم المخاطر المحتملة ووضع خطة استجابة للمخاطر.\n\n- لماذا؟\nحتى مع وجود خطة محكمة، من الضروري دائمًا إدارة المخاطر بشكل استباقي، وهذا يشمل تحديدها، تقييمها، ووضع خطة استجابة مناسبة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- طلب تمويل إضافي بدون تحليل للمخاطر خطوة غير مبررة.\n- مناقشة الأمر مع المدير الوظيفي لا يُعد بديلاً عن خطة شاملة لإدارة المخاطر.\n- توثيق القيود مهم لكنه لا يغني عن وضع خطة استجابة فعلية للمخاطر.",
    "choices": [
      {
        "text": "تحديد وتقييم المخاطر المحتملة ووضع خطة استجابة للمخاطر.",
        "correct": true
      },
      {
        "text": "الاجتماع مع راعي المشروع لطلب تمويل إضافي للتخفيف من المخاطر المحتملة.",
        "correct": false
      },
      {
        "text": "مناقشة احتمالية المخاطر مع المدير الوظيفي وتحديد الموارد لضمان نجاح المشروع.",
        "correct": false
      },
      {
        "text": "توثيق القيود والحدود المحتملة في خطة إدارة المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "حدد مدير المشروع والفريق المخاطر، وأجروا تحليلًا نوعيًا، وأعدوا خطة استجابة. ومع ذلك، فإن التأخير في الاستجابة لأحداث المخاطر يؤثر على الجدول الزمني.\n\nكيف يمكن أن يساعد تعيين مالكي المخاطر في تجنب هذه التأخيرات؟",
    "explanation": "الإجابة الصحيحة: يتحمل مالكو المخاطر مسؤولية تنفيذ استراتيجية الاستجابة المناسبة.\n\n- لماذا؟\nوجود شخص مسؤول مباشرة عن كل خطر يضمن اتخاذ الإجراء اللازم في الوقت المناسب دون الاعتماد على قرارات جماعية قد تتأخر.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- مالكو المخاطر لا يعملون مع الراعي بشكل دائم بل مع الفريق.\n- تحديد القيود والافتراضات جزء من التخطيط، وليس دور مالك الخطر بعد وقوعه.\n- تقرير المخاطر ليس بديلاً عن تعيين مالك خطر مسؤول عن اتخاذ الإجراء المناسب.",
    "choices": [
      {
        "text": "يعمل مالكو المخاطر مع راعي المشروع لضمان فعالية خطة الاستجابة.",
        "correct": false
      },
      {
        "text": "يقوم مالكو المخاطر بتحديد القيود والافتراضات قبل وقوع المخاطر.",
        "correct": false
      },
      {
        "text": "يتحمل مالكو المخاطر مسؤولية تنفيذ استراتيجية الاستجابة المناسبة.",
        "correct": true
      },
      {
        "text": "يُسند تقرير المخاطر إدارة التأخيرات في الجدول الزمني لصاحب الخطر المناسب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مراجعة الجدول الزمني المعتمد للمشروع، أدرك مدير المشروع أن المراحل الرئيسية غير واقعية بسبب فترات التوريد الأطول من المتوقع لبعض مكونات المشروع الرئيسية. يحتاج مدير المشروع إلى تحديث خط الأساس للجدول الزمني ليعكس فترات التوريد الطويلة.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
    "explanation": "الإجابة الصحيحة: تقديم طلب تغيير.\n\n- لماذا؟\nبما أن خط الأساس للجدول الزمني جزء من خطة إدارة المشروع الرسمية، فإن أي تعديل عليه يتطلب المرور بإجراء التحكم المتكامل بالتغيير (Integrated Change Control) وفقًا لممارسات PMI.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تعديل WBS لا يغير الجدول الزمني مباشرة ولا يعكس مسارات التوريد.\n- تحديث سجل الافتراضات خطوة داعمة لكنها ليست الإجراء الرسمي الأول.\n- تعديل خطة إدارة المشتريات يتبع بعد موافقة لجنة التغيير، وليس قبلها.",
    "choices": [
      {
        "text": "تعديل هيكل تقسيم العمل (WBS).",
        "correct": false
      },
      {
        "text": "تحديث سجل الافتراضات.",
        "correct": false
      },
      {
        "text": "تعديل خطة إدارة المشتريات.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "انضم مدير مشروع جديد إلى مشروع يشرف عليه مدير مشروع كبير. طلب الراعي من مدير المشروع الجديد تطوير خطة إدارة الجودة.\n\nلماذا يجب على مدير المشروع في البداية استشارة مدير المشروع الكبير؟",
    "explanation": "الإجابة الصحيحة: لتعلّم العمليات والخطط المعتمدة للجودة وكيف تم اختيار المعايير المناسبة.\n\n- لماذا؟\nالتأكد من توافق خطة إدارة الجودة مع استراتيجيات وأهداف المشروع الكلية يتطلب الرجوع للخطط الموجودة مسبقًا والمعايير المعتمدة التي يعرفها مدير المشروع الكبير.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- تحديد المتطلبات مسؤولية إدارة المتطلبات، ليست مرتبطة مباشرة بوضع خطة إدارة الجودة.\n- تطوير تحليلات التكلفة والمنفعة ليس جزءًا مباشرًا من خطة إدارة الجودة.\n- صياغة طلب تغيير ليس الخطوة الأولى هنا لأن إعداد خطة إدارة الجودة يتم ضمن عملية التخطيط وليس التغيير.",
    "choices": [
      {
        "text": "لتعلّم العمليات والخطط المعتمدة للجودة وكيف تم اختيار المعايير المناسبة.",
        "correct": true
      },
      {
        "text": "لتحديد المتطلبات التي تم جمعها بالفعل وجمع المزيد منها عند الحاجة.",
        "correct": false
      },
      {
        "text": "لتطوير تحليلات التكلفة والمنفعة وعينات المقارنة لاستخدامها في إدارة المخاطر.",
        "correct": false
      },
      {
        "text": "لصياغة طلب تغيير لمراجعة مقاييس الجودة وقوائم التحقق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال تنفيذ المشروع، طلب أصحاب المصلحة الرئيسيون إجراء تغيير لضمان أن المنتج النهائي سيفي بمتطلباتهم. لماذا يجب على مدير المشروع تقديم طلب تغيير؟",
    "explanation": "الإجابة الصحيحة: لضمان توثيق الطلب رسميًا ودمجه وفقًا لعملية التحكم المتكامل بالتغيير.\n\n- لماذا؟\nهذه هي الطريقة المعتمدة لضبط التغييرات وإدارتها رسميًا في أي مشروع لضمان مراجعة التأثيرات على الجدول، الميزانية، النطاق والجودة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n- توثيق المتطلبات والحصول على التوقيع يكون لاحقًا بعد موافقة لجنة التغيير.\n- تقديم مبررات للتأثير خطوة ضمن نموذج طلب التغيير وليس السبب الرئيسي لتقديم الطلب.\n- مسؤولية أصحاب المصلحة ليست جزءًا رسميًا من عملية إدارة التغيير بهذا المعنى.",
    "choices": [
      {
        "text": "لتوثيق المتطلبات اللازمة للحصول على توقيع أصحاب المصلحة من أجل تحديث سجل القضايا.",
        "correct": false
      },
      {
        "text": "لضمان توثيق الطلب رسميًا ودمجه وفقًا لعملية التحكم المتكامل بالتغيير.",
        "correct": true
      },
      {
        "text": "لتقديم مبرر لأي تأثير قد يحدثه التغيير على ميزانية المشروع أو جدوله الزمني.",
        "correct": false
      },
      {
        "text": "لضمان مسؤولية أصحاب المصلحة عن التأثير المحتمل للتغيير على ميزانية المشروع وجدوله.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يدير مدير مشروع مشروعًا باستخدام النهج الرشيق (Agile)، حيث يفوّت الفريق مواعيد تسليم القصص المتكررة (user stories) بانتظام. ما الذي يجب أن يفعله مدير المشروع لحل هذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق لتحديد ما إذا كان هناك حاجة إلى تدريب إضافي على منهجيات Agile.\n\n- السبب: التكرار المستمر لفشل الفريق في الالتزام بالمواعيد قد يشير إلى ضعف في الفهم أو تطبيق المبادئ الرشيقة، لذا يجب أولاً التأكد من وجود الكفاءة المطلوبة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تأجيل تاريخ التسليم لا يعالج السبب الجذري.\n- تعديل مدة التكرارات بدون فهم السبب قد يزيد المشكلة.\n- برنامج المكافآت ليس حلًا مستدامًا إذا كان الخلل مهارياً أو منهجياً.",
    "choices": [
      {
        "text": "العمل مع الراعي لتأجيل تاريخ تسليم المنتج.",
        "correct": false
      },
      {
        "text": "مراجعة الوقت المخصص للتكرارات وتعديله حسب الحاجة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق لتحديد ما إذا كان هناك حاجة إلى تدريب إضافي على منهجيات Agile.",
        "correct": true
      },
      {
        "text": "تطبيق برنامج مكافآت للفريق لتشجيعهم على إكمال القصص في مواعيدها.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد في مؤسسة جديدة في أول مشروع له. حذره أحد الزملاء من الإفراط في إشراك أصحاب المصلحة، مما قد يضيف تعقيدًا إضافيًا للمشروع.\n\nأي سلوك من التالي لن يضيف تعقيدًا أو عدم يقين أثناء عملية تحديد نطاق المشروع؟",
    "explanation": "الإجابة الصحيحة: فهم أصحاب المصلحة المؤثرين واتفاقهم.\n\n- السبب: هذا السلوك يعزز وضوح نطاق المشروع ويقلل التعقيد، لأنه يضمن وجود توافق وتفاهم بين المؤثرين.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديد أهداف قابلة للتحقيق قد يبدو إيجابيًا لكنه إذا تم بمعزل عن خطة واضحة يمكن أن يؤدي لتضارب.\n- الخلاف بين أصحاب المصلحة يزيد من التعقيد.\n- التحيزات المتفائلة تخلق مخاطر ومشاكل لاحقًا.",
    "choices": [
      {
        "text": "فهم أصحاب المصلحة المؤثرين واتفاقهم.",
        "correct": true
      },
      {
        "text": "تحديد أصحاب المصلحة لأهداف قابلة للتحقيق.",
        "correct": false
      },
      {
        "text": "الخلاف بين أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "التحيزات المتفائلة بشأن نطاق المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "توفر حكومة محلية إعانات مالية للأنشطة الصحية. تخطط منظمة للاستفادة من هذه الإعانة لتنفيذ مشروع يقدم خدمات فحص صحي للسكان المعرضين للخطر. بعد بدء المشروع، أعلنت الحكومة أن هذه الخدمة قد لا تكون مؤهلة للحصول على الإعانة.\n\nماذا يجب على مدير المشروع أن يفعل؟",
    "explanation": "الإجابة الصحيحة: تصعيد خطر المشروع إلى مستوى أعلى.\n\n- السبب: هذا خطر استراتيجي يتعلق بالتمويل ويؤثر مباشرة على جدوى المشروع، ويتطلب قرارًا على مستوى الإدارة العليا.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاجتماع مع الراعي جزء من الخطوات لاحقًا لكن أولًا يجب تصعيد الخطر.\n- تطوير خطة طوارئ قد يحدث لاحقًا بعد اتخاذ قرار على المستوى الأعلى.\n- تقديم طلب تغيير غير مناسب قبل تقييم أثر الخطر الاستراتيجي.",
    "choices": [
      {
        "text": "تصعيد خطر المشروع إلى مستوى أعلى.",
        "correct": true
      },
      {
        "text": "الاجتماع مع راعي المشروع لإعادة تعريف فوائد المشروع.",
        "correct": false
      },
      {
        "text": "إبلاغ أصحاب المصلحة بالحاجة إلى تطوير خطة طوارئ.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB).",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "بسبب تغييرات تنظيمية، أصبحت وكالة حكومية الآن من أصحاب المصلحة الرئيسيين في مشروع معقد. طلب ممثل الوكالة من مدير المشروع شرح مدى توافق فوائد المشروع مع استراتيجيات الوكالة التجارية.\n\nماذا يجب أن يفعل مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الرجوع إلى خطة إدارة الفوائد.\n\n- السبب: خطة إدارة الفوائد توضح كيف تتوافق فوائد المشروع مع استراتيجيات الجهة المعنية، وهي الأداة الرسمية لعرض هذا التوافق لأصحاب المصلحة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاجتماع مع أصحاب المصلحة الآخرين لا يوفر المعلومات المحددة المطلوبة.\n- مراجعة سجل الافتراضات لا يغطي تفسير الفوائد وربطها بالاستراتيجيات.\n- تحديث خطة إشراك أصحاب المصلحة مهم لكن ليس أداة لشرح التوافق.",
    "choices": [
      {
        "text": "الاجتماع مع أصحاب المصلحة الآخرين لمناقشة أهداف المشروع.",
        "correct": false
      },
      {
        "text": "مراجعة سجل الافتراضات.",
        "correct": false
      },
      {
        "text": "تحديث خطة إشراك أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "الرجوع إلى خطة إدارة الفوائد.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في بيئة تقليدية وقد أنهى مؤخرًا تدريبًا على المنهجية الرشيقة (Agile)، ويبدأ الآن في إدارة المشاريع باستخدام الأسلوب الرشيق. المنظمة جديدة على المنهجية ولم يفهم الجميع مبادئها.\n\nكيف يمكن لمدير المشروع الحصول على الدعم للمضي قدمًا؟",
    "explanation": "الإجابة الصحيحة: عقد جلسة مع أصحاب المصلحة لشرح القيمة التجارية لتحديد الأولويات، والعقلية، والمساءلة، وتحسين الجودة.\n\n- السبب: التوعية المباشرة لأصحاب المصلحة حول فوائد النهج الرشيق تساعد على بناء الدعم والمشاركة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحليل التكلفة والمنفعة لا يضمن قبول وتفهم أصحاب المصلحة للمنهجية.\n- دعوة أصحاب المصلحة لجلسة صقل قائمة الأعمال مفيدة لكنها لا تضمن الفهم العام.\n- إرسال روابط فيديو قد يكون غير فعال إذا لم يصاحبها تواصل مباشر.",
    "choices": [
      {
        "text": "عقد جلسة مع أصحاب المصلحة لشرح القيمة التجارية لتحديد الأولويات، والعقلية، والمساءلة، وتحسين الجودة.",
        "correct": true
      },
      {
        "text": "إجراء تحليل للتكلفة والمنفعة للمشروع الجديد ومقارنة النهج التقليدي بالرشيق وتقديمه لأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دعوة أصحاب المصلحة لحضور جلسة صقل قائمة الأعمال (backlog) لفهم نطاق العمل ونهج التطوير.",
        "correct": false
      },
      {
        "text": "إرسال روابط فيديو لأصحاب المصلحة تشرح النهج الرشيقة ودراسات حالة داعمة من الصناعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع جديد لمشروع جديد. أثناء المراجعة الأولية لوثيقة ميثاق المشروع، تواصل مدير المشروع مع راعي المشروع لمناقشة معلومات مهمة مفقودة من الوثيقة.\n\nما المعلومة المناسبة التي يجب أن يطلبها مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: أهداف قابلة للقياس لعوامل النجاح الحرجيّة.\n\n- السبب: وجود أهداف قابلة للقياس يتيح تقييم نجاح المشروع بدقة، وهو أمر أساسي في ميثاق المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- وصف مفصل للمنتج النهائي قد يأتي في نطاق المشروع لكنه ليس جزءًا أساسيًا من ميثاق المشروع في هذه المرحلة.\n- هيكل تقسيم العمل (WBS) يتم تطويره لاحقًا وليس ضمن ميثاق المشروع.\n- خط الأساس لقياس الأداء يتم تطويره خلال التخطيط وليس ضمن الميثاق.",
    "choices": [
      {
        "text": "أهداف قابلة للقياس لعوامل النجاح الحرجة.",
        "correct": true
      },
      {
        "text": "وصف مفصل ومتطلبات المنتج النهائي.",
        "correct": false
      },
      {
        "text": "هيكل تقسيم العمل (WBS).",
        "correct": false
      },
      {
        "text": "خط الأساس لقياس الأداء.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع في مؤسسة تستخدم المنهجية التقليدية لإدارة المشاريع. أكمل مدير المشروع تدريبًا على الإدارة الرشيقة وبدأ في إدارة المشاريع باستخدام النهج الرشيق. لا يفهم أصحاب المصلحة المنهجية الجديدة ويجدون صعوبة في استيعابها.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: عقد جلسة مع أصحاب المصلحة لتعريفهم بالمنهجية الرشيقة وشرح القيمة التجارية لتحديد الأولويات والمساءلة وتحسين الجودة من خلال المراجعات المتكررة.\n\nالسبب: أصحاب المصلحة يحتاجون إلى توجيه مباشر وواضح حول كيفية عمل Agile وقيمته بدلاً من الاكتفاء بالمقارنات النظرية أو المواد المكتوبة فقط.\n\nلماذا الخيارات الأخرى خاطئة:\n- تحليل التكلفة والمنفعة لا يُعلّم أصحاب المصلحة كيفية العمل فعليًا في بيئة Agile.\n- دعوة أصحاب المصلحة لجلسة صقل قائمة الأعمال يساعد في جزء محدود فقط.\n- إرسال روابط فيديو قد يكون مفيدًا كمكمل، لكنه غير كافٍ لتغيير عقلية فريق عمل بأكمله.",
    "choices": [
      {
        "text": "عقد جلسة مع أصحاب المصلحة لتعريفهم بالمنهجية الرشيقة وشرح القيمة التجارية لتحديد الأولويات والمساءلة وتحسين الجودة من خلال المراجعات المتكررة.",
        "correct": true
      },
      {
        "text": "إجراء تحليل للتكلفة والمنفعة للمشروع الجديد ومقارنة النهج التقليدي بالرشيق وتقديمه لأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دعوة أصحاب المصلحة لحضور جلسة صقل قائمة الأعمال لفهم نطاق العمل ونهج التطوير.",
        "correct": false
      },
      {
        "text": "إرسال روابط فيديو لأصحاب المصلحة تشرح النهج الرشيقة بالإضافة إلى دراسات حالة داعمة من الصناعة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "عادةً ما يدير مكتب إدارة المشاريع (PMO) المشاريع باستخدام نهج الشلال (Waterfall). يتأثر مشروع حالي قيد التطوير بلوائح محلية يتم تحديثها بانتظام. يشعر فريق المشروع أن تطبيق تقنيات أجايل (Agile) سيفيد المشروع نظرًا لتغير اللوائح باستمرار.\n\nماذا يجب على مدير المشروع أن يفعل في هذا السيناريو؟",
    "explanation": "الإجابة الصحيحة: إجراء تحليل لكيفية تأثير دمج منهجيات أجايل على المشروع.\n\nالسبب: دمج أجايل في بيئة معتادة على الشلال يتطلب دراسة رسمية لضمان ملاءمة هذه الخطوة مع طبيعة المشروع وثقافة المؤسسة.\n\nلماذا الخيارات الأخرى خاطئة:\n- الاستفادة من الاحتياطي المالي لا يعالج المشكلة الأساسية وهي طريقة العمل.\n- عرض الطلب مباشرة دون تحليل قد يؤدي إلى رفض غير مدروس.\n- تنفيذ الطلب مباشرة بدون تقييم للمخاطر والتحليل مخالف لأسس إدارة التغيير المنظمة.",
    "choices": [
      {
        "text": "الاستفادة من احتياطي الميزانية لإضافة موردين على دراية باللوائح إلى فريق المشروع.",
        "correct": false
      },
      {
        "text": "إجراء تحليل لكيفية تأثير دمج منهجيات أجايل على المشروع.",
        "correct": true
      },
      {
        "text": "عرض هذا الطلب على مكتب إدارة المشاريع وراعي المشروع.",
        "correct": false
      },
      {
        "text": "تنفيذ الطلب وتدريب فريق المشروع على منهجيات أجايل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم فريق المشروع بعصف ذهني لاختيار أفضل منهجية لإدارة المشاريع لتوصي بها للإدارة العليا. فكرة الفريق تتسم بتغيرات متكررة في المتطلبات، تغييرات تدريجية ومتكررة، تركيز على العميل، ومراحل محددة مع مستندات خاصة لتلبية معايير تنظيمية للصناعة.\n\nما هي المنهجية المفضلة لإدارة المشروع في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: هجينة (Hybrid).\n\nالسبب: المنهجية الهجينة تجمع بين Agile وWaterfall بحيث يتم استغلال المرونة في تطوير المتطلبات المتغيرة مع الحفاظ على مراحل وإجراءات توثيقية لازمة للامتثال التنظيمي.\n\nلماذا الخيارات الأخرى خاطئة:\n- أجايل وحدها قد لا توفر المستوى الكافي من التوثيق والضبط الذي تتطلبه المعايير الصناعية.\n- تنبؤية (Predictive) وشلال لا تتناسب مع طبيعة التغيرات المستمرة المذكورة في وصف المشروع.",
    "choices": [
      {
        "text": "أجايل (Agile)",
        "correct": false
      },
      {
        "text": "هجينة (Hybrid)",
        "correct": true
      },
      {
        "text": "تنبؤية (Predictive)",
        "correct": false
      },
      {
        "text": "شلال (Waterfall)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "اعتمد فريق المشروع منهجية جديدة لإدارة المشاريع تتضمن عقد اجتماعات مراجعة واسترجاع منتظمة كل أسبوعين. بالإضافة إلى ذلك، هناك اجتماعات يومية، وتُستخدم الألواح البيضاء كأداة أساسية لتوثيق القرارات ونقاط العمل.\n\nما هي منهجية إدارة المشروع التي اعتمدها الفريق؟",
    "explanation": "الإجابة الصحيحة: أجايل (Agile).\n\n- لماذا؟ لأن أجايل تعتمد على دورات متكررة قصيرة (Sprints)، وفيها اجتماعات ثابتة مثل:\n  - اجتماعات الاسترجاع (Retrospective) كل أسبوعين لتقييم العمل وتحسين الأداء.\n  - الاجتماعات اليومية (Daily Standup) التي تهدف إلى متابعة تقدم الفريق يوميًا.\n  - استخدام أدوات بصرية مثل الألواح البيضاء هو جزء من ثقافة الشفافية في أجايل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - المنهجية التقليدية تعتمد على تخطيط شامل منذ البداية ولا تستخدم مراجعات دورية قصيرة بهذا الشكل.\n  - الشلال (Waterfall) يعتمد على تسلسل مراحل محددة من البداية للنهاية بدون تكرارات أو اجتماعات يومية.\n  - التكرارية (Iterative) تقترب من أجايل لكن لا تفرض بالضرورة نفس عدد الاجتماعات ودرجة التفاعل اليومية الموجودة في أجايل.",
    "choices": [
        {
            "text": "تقليدية",
            "correct": false
        },
        {
            "text": "أجايل",
            "correct": true
        },
        {
            "text": "شلال",
            "correct": false
        },
        {
            "text": "تكرارية (Iterative)",
            "correct": false
        }
    ]
},
{
    "type": "multiple-choice",
    "text": "خلال اجتماع تقييم أداء المشروع، توصل الفريق إلى أن الأداء حتى تاريخ الحالة كان كما يلي: مؤشر أداء الجدول الزمني (SPI) = 0.5؛ مؤشر أداء التكلفة (CPI) = 1.5. حدد العميل أن الأداء في الجدول الزمني والتكلفة هو الأهم من حيث القيمة.\n\nاستنادًا إلى هذه الأرقام، أي من التالي يصف القيمة المقدمة للعميل حتى تاريخ الحالة؟",
    "explanation": "الإجابة الصحيحة: قيمة تكلفة جيدة وقيمة جدول زمنية ضعيفة.\n\n- لماذا؟\n  - مؤشر أداء الجدول الزمني (SPI) = 0.5 يعني أن المشروع يعمل بسرعة أقل من المخطط. أي أننا أنجزنا فقط 50% من العمل المخطط له خلال نفس الفترة الزمنية.\n  - مؤشر أداء التكلفة (CPI) = 1.5 يعني أننا ننفق أقل مما كان متوقعًا، فكل دولار يُصرف ينتج عنه قيمة أعلى مما كان مخططًا.\n  - إذن لدينا وضعية: المشروع متأخر لكنه يستخدم الميزانية بكفاءة.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - قيمة تكلفة ضعيفة تعني CPI أقل من 1، وهذا غير موجود هنا.\n  - قيمة جدول زمنية جيدة تعني SPI قريب من 1، وهذا غير موجود هنا.\n  - كلا القيمتين جيدة أو كلاهما ضعيف غير صحيحة حسب الأرقام المذكورة.",
    "choices": [
        {
            "text": "قيمة تكلفة جيدة وقيمة جدول زمنية ضعيفة",
            "correct": true
        },
        {
            "text": "قيمة تكلفة ضعيفة وقيمة جدول زمنية جيدة",
            "correct": false
        },
        {
            "text": "قيمة تكلفة جيدة وقيمة جدول زمنية جيدة",
            "correct": false
        },
        {
            "text": "قيمة تكلفة ضعيفة وقيمة جدول زمنية ضعيفة",
            "correct": false
        }
    ]
},
{
    "type": "multiple-choice",
    "text": "يحدد فريق أجايل الأنشطة التي سيتم تنفيذها أولاً خلال التكرار القادم لتطوير منتج جديد. ما العامل الذي يجب أن يستخدموه لترتيب الأنشطة حسب الأولوية؟",
    "explanation": "الإجابة الصحيحة: قيمة النشاط لأصحاب المصلحة.\n\n- لماذا؟\n  - في أجايل، الهدف هو تقديم أعلى قيمة ممكنة بسرعة.\n  - لذلك يتم ترتيب العمل حسب ما يُسمى Value-Based Prioritization أي ترتيب حسب القيمة.\n  - هذا يجعل أصحاب المصلحة يحصلون على أهم الوظائف أولًا حتى لو لم يُكمل المنتج بالكامل.\n\n- لماذا الخيارات الأخرى خاطئة؟\n  - حجم النشاط يؤثر على تقسيم العمل لكنه لا يحدد أولويته.\n  - تكلفة النشاط مهمة ماليًا لكنها ليست العامل الأول في ترتيب الأولويات في أجايل.\n  - سهولة التنفيذ تُراعى أحيانًا، لكنها لا تأتي قبل القيمة التجارية لأصحاب المصلحة.",
    "choices": [
        {
            "text": "حجم النشاط",
            "correct": false
        },
        {
            "text": "قيمة النشاط لأصحاب المصلحة",
            "correct": true
        },
        {
            "text": "تكلفة النشاط",
            "correct": false
        },
        {
            "text": "سهولة تنفيذ النشاط",
            "correct": false
        }
    ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع في منتصف تنفيذ المشروع. يقرر عقد اجتماع إشراك أصحاب المصلحة مع الإدارة العليا والعملاء لفحص ما إذا كانت نتائج المشروع تحقق القيمة المرجوة للأعمال.\n\nأي من الوثائق تحتوي على معلومات أساسية لمساعدة مدير المشروع في ذلك؟",
  "explanation": "الإجابة الصحيحة: دراسة الجدوى (Business Case).\n\n- السبب: دراسة الجدوى تحدد منذ البداية سبب تنفيذ المشروع وكيف سيضيف قيمة للأعمال. تحتوي على تحليل الفوائد مقابل التكاليف، وأهداف المشروع الاستراتيجية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- هيكل تقسيم العمل (WBS) يوضح توزيع العمل وليس القيمة التجارية.\n- خطة إدارة المشروع توضح كيفية إدارة المشروع وليس لماذا.\n- بيان نطاق المشروع يحدد ما الذي سيتم إنجازه، لكنه لا يتطرق دائمًا إلى ربط النتائج بالقيمة التجارية.",
  "choices": [
    {
      "text": "هيكل تقسيم العمل",
      "correct": false
    },
    {
      "text": "خطة إدارة المشروع",
      "correct": false
    },
    {
      "text": "بيان نطاق المشروع",
      "correct": false
    },
    {
      "text": "دراسة الجدوى (Business Case)",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع هو جزء من مجموعة تركيز استراتيجية لإدارة المشاريع تقوم بعصف ذهني حول الطرق التي ستُستخدم بها المشاريع لإضافة قيمة تجارية للمؤسسة في الربع القادم. أي من العبارات التالية تصف بشكل عام كيف تستخدم المؤسسات المشاريع لإضافة قيمة تجارية؟",
  "explanation": "الإجابة الصحيحة: تُستخدم المشاريع لتطوير وتعديل المنتجات أو العمليات أو الخدمات.\n\n- السبب: المشاريع ليست فقط لتطوير جديد، بل قد تكون لتعديل أو تحسين ما هو موجود. هذا ما يميز المشاريع عن العمليات التشغيلية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تطوير فقط أو تعديل فقط لا يشمل الصورة الكاملة.\n- تسليم الأنشطة اليومية يدخل ضمن العمليات التشغيلية وليس ضمن المشاريع حسب تعريف PMI.",
  "choices": [
    {
      "text": "تُستخدم المشاريع لتطوير منتجات أو عمليات أو خدمات جديدة.",
      "correct": false
    },
    {
      "text": "تُستخدم المشاريع لتعديل المنتجات أو العمليات أو الخدمات الحالية.",
      "correct": false
    },
    {
      "text": "تُستخدم المشاريع لتسليم الأنشطة أو العمليات أو الخدمات اليومية.",
      "correct": false
    },
    {
      "text": "تُستخدم المشاريع لتطوير وتعديل المنتجات أو العمليات أو الخدمات.",
      "correct": true
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "ما هي المنهجية التي تستخدم أساليب جديدة لتنفيذ حلول للمشاكل التي تُواجه يوميًا؟",
  "explanation": "الإجابة الصحيحة: Ideation 2.0.\n\n- السبب: Ideation 2.0 هو أسلوب حديث يُستخدم في بيئات الابتكار لتحفيز التفكير الإبداعي وإيجاد حلول جديدة للمشاكل اليومية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- سكرم (Scrum) منهجية أجايل تستخدم لإدارة المشاريع البرمجية بشكل خاص.\n- كانبان (Kanban) تركز على تحسين التدفق وإدارة العمل المستمر وليس توليد أفكار جديدة.\n- هجينة (Hybrid) تمزج بين أكثر من منهجية لكنها لا تركز بشكل مباشر على إيجاد حلول مبتكرة مثل Ideation 2.0.",
  "choices": [
    {
      "text": "Ideation 2.0",
      "correct": true
    },
    {
      "text": "سكرم (Scrum)",
      "correct": false
    },
    {
      "text": "كانبان (Kanban)",
      "correct": false
    },
    {
      "text": "هجينة (Hybrid)",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع في منتصف تنفيذ مشروع يستخدم منهجية تنبؤية، وتُعلن المؤسسة عن الانتقال إلى نهج هجين. يطلب راعي المشروع من الفريق الانتقال فورًا إلى النهج الجديد رغم عدم وجود خبرة سابقة لديهم.\n\nما هو أفضل إجراء يجب أن يتخذه مدير المشروع؟",
  "explanation": "الإجابة الصحيحة: إعادة تقييم نطاق المشروع وأولوية المهام الحرجة.\n\n- السبب: عند الانتقال من نهج تنبؤي إلى نهج هجين، يجب تقييم الأنشطة التي يمكن التعامل معها بأسلوب أجايل، وتحديد ما إذا كان الانتقال سيؤثر على المهام الأساسية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إكمال المشروع بالمنهجية القديمة يخالف توجيه الإدارة.\n- تمديد الجدول الزمني خيار ثانوي بعد إعادة التقييم.\n- إعادة تصميم كاملة قد تؤدي إلى تأخير غير ضروري أو فقدان القيمة الحالية.",
  "choices": [
    {
      "text": "إكمال تسليم المشروع باستخدام المنهجية التنبؤية.",
      "correct": false
    },
    {
      "text": "تمديد الجدول الزمني للمشروع لاستيعاب التغيير.",
      "correct": false
    },
    {
      "text": "إعادة تقييم نطاق المشروع وأولوية المهام الحرجة.",
      "correct": true
    },
    {
      "text": "طلب إعادة تصميم كاملة لخطة المشروع.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "منظمة عالمية لطالما استخدمت إدارة المشاريع التنبؤية تتحول الآن إلى إدارة المشاريع بأسلوب أجايل. في أول مشروع أجايل في المنظمة، يفشل أعضاء الفريق عن بُعد في حضور الاجتماعات اليومية.\n\nكيف يمكن لمدير المشروع حل هذه المشكلة؟",
  "explanation": "الإجابة الصحيحة: استخدام منصات الاجتماعات عبر الإنترنت للاجتماعات اليومية، وأخذ ساعات العمل لأعضاء الفريق عن بُعد في الاعتبار.\n\n- السبب: الفرق الموزعة جغرافيًا تحتاج إلى أدوات اتصال مناسبة وجدولة مرنة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استبدال أعضاء الفريق يتعارض مع مبادئ أجايل التي تركز على تمكين الفرق.\n- تخصيص مهام أقل أولوية قد يقلل من اندماج الفريق.\n- التدريب مهم لكن لا يحل مشكلة الحضور المباشر للاجتماعات اليومية.",
  "choices": [
    {
      "text": "استبدال أعضاء الفريق عن بُعد بأعضاء فريق موجودين في نفس الموقع.",
      "correct": false
    },
    {
      "text": "تخصيص مهام أقل أولوية لأعضاء الفريق عن بُعد.",
      "correct": false
    },
    {
      "text": "استخدام منصات الاجتماعات عبر الإنترنت للاجتماعات اليومية، وأخذ ساعات العمل لأعضاء الفريق عن بُعد في الاعتبار.",
      "correct": true
    },
    {
      "text": "استخدام جزء من ميزانية المشروع لتوفير تدريب على منهجيات أجايل لجميع أعضاء الفريق عن بُعد.",
      "correct": false
    }
  ]
},
{
  "type": "multiple-choice",
  "text": "مدير مشروع جزء من مشروع يستخدم إطار عمل سكرم (Scrum). يحتاج المدير إلى مراقبة سجل العوائق وتسهيل حل العوائق التي يثيرها الفريق.\n\nما هو الترتيب الصحيح للخطوات الخمس المستخدمة لإدارة سجل العوائق؟",
  "explanation": "الإجابة الصحيحة: التسجيل، تحديد الأولويات، النشر، المعالجة، التواصل.\n\n- السبب: هذا التسلسل يعكس أفضل ممارسة في Scrum:\n1. تسجيل العائق أولًا.\n2. تحديد أولويته مقارنة بعوائق أخرى.\n3. نشره ليطلع عليه المعنيون.\n4. معالجته حسب الأولوية.\n5. إبلاغ الجميع بما تم إنجازه.\n\n- لماذا الخيارات الأخرى خاطئة:\n- أي ترتيب آخر قد يؤدي إلى تأخير المعالجة أو ضعف التواصل.",
  "choices": [
    {
      "text": "تحديد الأولويات، التسجيل، النشر، التواصل، المعالجة",
      "correct": false
    },
    {
      "text": "التسجيل، النشر، التواصل، تحديد الأولويات، المعالجة",
      "correct": false
    },
    {
      "text": "التسجيل، تحديد الأولويات، النشر، المعالجة، التواصل",
      "correct": true
    },
    {
      "text": "تحديد الأولويات، التسجيل، النشر، المعالجة، التواصل",
      "correct": false
    }
  ]
},
 {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع على مشروع يحتوي على العديد من الأطراف المعنية وأولويات متنافسة. ما هو الهدف الرئيسي لبدء وإجراء المفاوضات؟",
    "explanation": "الإجابة الصحيحة: لحل النزاع.\n\n- السبب: المفاوضات تركز على حل النزاعات بين أصحاب المصلحة المختلفين لتقليل التعارض وتحقيق توافق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديد نطاق العمل هو عملية إدارية مستقلة وليست الهدف الأساسي للمفاوضات.\n- تقليل التكلفة قد يكون هدفًا ثانويًا لكنه ليس الهدف الرئيسي هنا.\n- تقليل وقت التسليم يركز على الجدول الزمني وليس حل النزاعات.",
    "choices": [
      {
        "text": "لتحديد نطاق العمل",
        "correct": false
      },
      {
        "text": "لحل النزاع",
        "correct": true
      },
      {
        "text": "لتقليل التكلفة",
        "correct": false
      },
      {
        "text": "لتقليل وقت التسليم",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يخطط مدير مشروع لإطلاق منتج عالمي مع قيود زمنية صارمة في التصنيع وشكوك في لوائح وضع العلامات الإقليمية المتغيرة. كيف يمكن دمج التخطيط لمتطلبات العلامات غير المعروفة؟",
    "explanation": "الإجابة الصحيحة: استخدام نهج هجين، يدمج تدفق عمل العلامات بأسلوب أجايل في جدول زمني تنبؤي.\n\n- السبب: النهج الهجين يسمح باستخدام أسلوب تنبؤي للأجزاء الثابتة وأجايل للأجزاء المتغيرة، مما يحقق مرونة في التعامل مع التغيرات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- دمج تدفقات العمل التنبؤية في جدول أجايل عكس المنطق ولا يضمن المرونة.\n- تطبيق أجايل بالكامل على التصنيع قد يكون غير عملي.\n- التخطيط التنبؤي فقط لا يتعامل بمرونة مع التغيرات المتوقعة.",
    "choices": [
      {
        "text": "استخدام نهج هجين، يدمج تدفقات عمل العلامات التنبؤية في جدول زمني مرن (أجايل).",
        "correct": false
      },
      {
        "text": "استخدام نهج هجين، يدمج تدفق عمل العلامات بأسلوب أجايل في جدول زمني تنبؤي.",
        "correct": true
      },
      {
        "text": "تطبيق التخطيط بأسلوب أجايل على كل من التصنيع وتدفقات عمل العلامات لمواءمة العمل.",
        "correct": false
      },
      {
        "text": "تطبيق التخطيط التنبؤي على تدفق عمل العلامات وتبسيط عملية التحكم في التغييرات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "فازت شركة مدير المشروع بمناقصة مشروع تحول رقمي بمواصفات واضحة من حيث النطاق والوقت والتكلفة. ويريد العميل متابعة التقدم بانتظام. ما النهج الأنسب لمدير المشروع؟",
    "explanation": "الإجابة الصحيحة: استخدام نهج هجين وعرض كل وحدة مكتملة بنجاح.\n\n- السبب: الجمع بين دقة النهج التنبؤي ومرونة عرض التقدم على طريقة أجايل يحقق متابعة أفضل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- النهج التنبؤي فقط مع تقارير يومية لا يضمن تفاعلًا مستمرًا.\n- النهج الأجايل فقط غير مناسب لمشاريع بسعر ثابت ومواصفات صارمة.\n- النهج التنبؤي وعرض كل وحدة فقط لا يوفر المرونة الكافية.",
    "choices": [
      {
        "text": "استخدام نهج تنبؤي وإرسال تقارير الحالة اليومية للعميل.",
        "correct": false
      },
      {
        "text": "استخدام نهج أجايل وعرض كل قصة مكتملة بنجاح.",
        "correct": false
      },
      {
        "text": "استخدام نهج هجين وعرض كل وحدة مكتملة بنجاح.",
        "correct": true
      },
      {
        "text": "استخدام نهج تنبؤي وعرض كل وحدة مكتملة بنجاح.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم تعيين مدير مشروع لمشروع بيئي جديد. وعند مراجعة عرض مقدم من بائع، حدد مدير المشروع مخاطرة فنية ستؤثر على التكلفة التشغيلية لشركته.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: تحديث سجل المخاطر الخاص بالمشروع.\n\n- السبب: تسجيل المخاطرة بشكل رسمي في سجل المخاطر هو الخطوة الأولى لتوثيقها وإدارتها.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التشاور مع المدير الوظيفي قد يكون مفيدًا لاحقًا، لكنه ليس الخطوة الأولى.\n- قبول المخاطرة والمضي قدماً دون تقييم غير مسؤول.\n- تقييم المخاطرة في ورشة عمل يتم بعد تسجيل المخاطرة.",
    "choices": [
      {
        "text": "التشاور مع المدير الوظيفي الخاص به.",
        "correct": false
      },
      {
        "text": "قبول المخاطرة والمضي قدمًا.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر الخاص بالمشروع.",
        "correct": true
      },
      {
        "text": "تقييم المخاطرة في ورشة عمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أبلغ العميل مدير المشروع بعدم قبوله لمخرجات المشروع. ماذا يجب أن يفعل مدير المشروع للحصول على الموافقة؟",
    "explanation": "الإجابة الصحيحة: مراجعة معايير القبول مع العميل لمعالجة متطلبات المخرجات.\n\n- السبب: التأكد من أن المخرجات تفي بمعايير القبول المطلوبة هو مفتاح الحصول على الموافقة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مراجعة ميثاق المشروع وخطة مشاركة الأطراف لا تعالج مباشرة أسباب رفض العميل.\n- فحص خطة إدارة الجودة مهم لكنه لا يركز بشكل مباشر على متطلبات القبول.\n- تحديد الاعتراضات وتحليل المخاطر مفيد لاحقًا لكنه ليس الخطوة الأولى.",
    "choices": [
      {
        "text": "مراجعة معايير القبول مع العميل لمعالجة متطلبات المخرجات.",
        "correct": true
      },
      {
        "text": "مراجعة ميثاق المشروع وخطة مشاركة الأطراف المعنية مع العميل.",
        "correct": false
      },
      {
        "text": "فحص خطة إدارة الجودة مع العميل.",
        "correct": false
      },
      {
        "text": "تحديد اعتراضات العميل وإجراء تحليل للمخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد استلام ميثاق المشروع، يبدأ مدير المشروع في إعداد خطة إدارة المشروع. على الرغم من وجود كمية محدودة من المعلومات التفصيلية حول الأنشطة في مكتب إدارة المشاريع (PMO)، يحتاج مدير المشروع إلى حساب المدة المتوقعة للمشروع.\n\nما الذي يجب أن يستخدمه مدير المشروع لتحديد ذلك؟",
    "explanation": "الإجابة الصحيحة: التقدير التشبيهي (Analogous estimating).\n\n- السبب: هذا النوع من التقدير يعتمد على الخبرات والمشاريع السابقة المشابهة، وهو مناسب عند نقص التفاصيل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التقدير من الأسفل إلى الأعلى يحتاج إلى تفاصيل كبيرة عن الأنشطة.\n- ملاحظات اجتماع الإطلاق غير كافية لحساب مدة دقيقة.\n- مدخلات راعي المشروع مهمة لكنها غير كافية وحدها لتقدير المدة.",
    "choices": [
      {
        "text": "التقدير التشبيهي (Analogous estimating)",
        "correct": true
      },
      {
        "text": "التقدير من الأسفل إلى الأعلى (Bottom-up estimating)",
        "correct": false
      },
      {
        "text": "ملاحظات اجتماع الإطلاق (Kick-off meeting feedback)",
        "correct": false
      },
      {
        "text": "مدخلات من راعي المشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء تطوير المشروع، يغادر مدير وظيفي الشركة ولم يعد يشارك في المشروع.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: تحديث سجل أصحاب المصلحة.\n\n- السبب: رحيل مدير وظيفي يؤثر مباشرة على أصحاب المصلحة، لذا يجب تحديث سجلهم لتعكس التغيير ومتابعة تأثير ذلك على المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديث سجل التغييرات ليس الخطوة الأولى هنا لأنه لا يشير إلى تغيير رسمي في المشروع بل تغيّر في الموارد البشرية.\n- تحديث سجل المخاطر مهم لكنه يأتي بعد تقييم التأثير، وليس أول إجراء.\n- تحديث سجل الافتراضات غير مرتبط بشكل مباشر برحيل شخص من الفريق.",
    "choices": [
      {
        "text": "تحديث سجل التغييرات.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": false
      },
      {
        "text": "تحديث سجل أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تحديث سجل الافتراضات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة التنفيذ في مشروع إنشاءات، يتم تعيين عدة أعضاء جدد في الفريق من دول مختلفة.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها أولاً؟",
    "explanation": "الإجابة الصحيحة: خطة إدارة الاتصالات.\n\n- السبب: إضافة أعضاء جدد من دول مختلفة تتطلب تعديل خطة الاتصالات لضمان تواصل فعال عبر اختلافات الوقت والثقافة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خطة إدارة المشتريات لا علاقة لها مباشرة بتعيين الأفراد الجدد.\n- خطة إدارة المخاطر قد تحتاج تحديث لاحقًا لكن التواصل هو الأولوية الآن.\n- ميثاق المشروع عادة لا يُعدل خلال التنفيذ لتغيير الأفراد.",
    "choices": [
      {
        "text": "خطة إدارة المشتريات",
        "correct": false
      },
      {
        "text": "خطة إدارة المخاطر",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": false
      },
      {
        "text": "خطة إدارة الاتصالات",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير المشروع ملتزم بنجاح مشروع متعدد الجنسيات بمهل زمنية ضيقة. عضو جديد في الفريق يتأخر باستمرار أو يغيب عن اجتماعات الحالة. في لقاء فردي، يوضح عضو الفريق أنه يعتقد أن العمل على التسليمات أهم من حضور الاجتماعات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق للتأكيد على أن حضور اجتماعات الحالة أمر إلزامي.\n\n- السبب: حضور اجتماعات الحالة مهم لضمان التنسيق بين أعضاء الفريق والتأكد من تقدم العمل، ويجب أن يكون هذا السلوك واضحًا وموحدًا لجميع الأعضاء.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إعادة تعيين العضو لمشروع آخر لا يحل المشكلة الجذرية.\n- توثيق السلوك فقط لا يعالج سبب المشكلة أو يحسن الأداء.\n- التشجيع على الحضور مع التكيف قد يؤدي إلى ضعف في التواصل ومخاطر على جودة المشروع.",
    "choices": [
      {
        "text": "إعادة تعيين عضو الفريق إلى مشروع آخر بمهل زمنية أكثر مرونة.",
        "correct": false
      },
      {
        "text": "توثيق هذا السلوك في ملف الموظف.",
        "correct": false
      },
      {
        "text": "تشجيع حضور عضو الفريق للاجتماعات، ولكن التكيف إذا لم تتأثر الأعمال الحرجة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق للتأكيد على أن حضور اجتماعات الحالة أمر إلزامي.",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يعين راعي المشروع مدير مشروع لمشروع جديد وحرج. يتمتع هذا المشروع بقيود صارمة على الميزانية والوقت.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع راعي المشروع لفهم هدف المشروع والمتطلبات العامة.\n\n- السبب: في البداية، يحتاج مدير المشروع إلى فهم رؤية وهدف المشروع بوضوح من الراعي لضمان توافق التخطيط والتنفيذ مع توقعاته، خاصة في المشاريع الحرجة ذات القيود الصارمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاجتماع مع المديرين الوظيفيين يركز على التفاصيل التشغيلية وليس على الأهداف العامة.\n- الاجتماع مع أصحاب المصلحة مهم لكنه ليس الأولوية قبل فهم الهدف من الراعي.\n- تحديث خطة إدارة المتطلبات لا يتم إلا بعد جمع وفهم المتطلبات أولاً.",
    "choices": [
      {
        "text": "الاجتماع مع المديرين الوظيفيين لتحديد جدول الموارد.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة للحصول على دعمهم وموافقتهم.",
        "correct": false
      },
      {
        "text": "الاجتماع مع راعي المشروع لفهم هدف المشروع والمتطلبات العامة.",
        "correct": true
      },
      {
        "text": "تحديث خطة إدارة المتطلبات لتعكس قيود الميزانية والوقت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع تصنيع في مرحلة التنفيذ. خلال اجتماع الحالة، أخبر أحد أعضاء الفريق مدير المشروع بأنه تم العثور على حل لفشل مستمر في أحد المعدات المستخدمة في التنفيذ؛ ومع ذلك، فإن هذا الحل مؤقت وقد يفشل الجهاز مرة أخرى في المستقبل.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها؟",
    "explanation": "الإجابة الصحيحة: سجل القضايا.\n\n- السبب: المشكلة التي تم إيجاد حل مؤقت لها تعتبر قضية مستمرة ويجب تسجيلها في سجل القضايا لضمان المتابعة والتوثيق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خطة إدارة المخاطر تُحدث عند توقع مشاكل، وليس عند حدوثها فعلاً.\n- سجل الافتراضات خاص بالافتراضات التي قد تؤثر على المشروع وليس بالمشاكل المؤكدة.\n- سجل أصحاب المصلحة غير مرتبط بالمشاكل التقنية في التنفيذ.",
    "choices": [
      {
        "text": "سجل القضايا",
        "correct": true
      },
      {
        "text": "خطة إدارة المخاطر",
        "correct": false
      },
      {
        "text": "سجل الافتراضات",
        "correct": false
      },
      {
        "text": "سجل أصحاب المصلحة",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يظهر المشروع انحرافًا سلبيًا في الجدول الزمني. يرى مدير المشروع أن أحد الفرق هو السبب في التأخيرات.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق لتحديد استراتيجيات لحل التأخيرات.\n\n- السبب: في إدارة المشاريع، يُفضل دائمًا معالجة المشكلات مباشرة مع الفريق المسؤول أولاً لإيجاد حلول مشتركة وتحفيزهم على الالتزام.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاجتماع مع راعي المشروع قد يكون لاحقًا إذا لم تُحل المشكلة على مستوى الفريق.\n- إجراء تحليل للمخاطر مفيد لكنه لا يحل المشكلة فورًا.\n- الاجتماع مع قسم الموارد البشرية يتعلق عادةً بالمسائل الإدارية وليس بتأخيرات الجدول.",
    "choices": [
      {
        "text": "الاجتماع مع الفريق لتحديد استراتيجيات لحل التأخيرات.",
        "correct": true
      },
      {
        "text": "الاجتماع مع راعي المشروع لتحديد نهج للعودة إلى الجدول الزمني.",
        "correct": false
      },
      {
        "text": "إجراء تحليل للمخاطر لتحديد تأثير التأخيرات على نجاح المشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع قسم الموارد البشرية لمناقشة الإجراءات الممكنة لإعادة المشروع إلى الجدول الزمني.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "مدير مشروع في منظمة عالمية مسؤول عن مشروع يشمل ست شركات مختلفة. في منتصف المشروع، ينتقل أحد أصحاب المصلحة من شركة إلى أخرى.\n\nما الوثيقة التي يجب على مدير المشروع تحديثها؟",
    "explanation": "الإجابة الصحيحة: سجل أصحاب المصلحة.\n\n- السبب: سجل أصحاب المصلحة يحتوي على تفاصيل كل صاحب مصلحة، مثل موقعه، وشركته، ودوره، وتأثيره على المشروع. وعندما يتغير وضع أحدهم، يجب تحديث هذا السجل للحفاظ على دقة المعلومات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خطة إشراك أصحاب المصلحة تحدد كيفية التعامل معهم، لكنها تعتمد على سجل أصحاب المصلحة الذي يجب تحديثه أولاً.\n- ميثاق المشروع لا يُعدل عند تغير صاحب مصلحة.\n- خطة إدارة المشروع تشمل نظرة عامة ولا تُستخدم لتحديث تفاصيل الأفراد.",
    "choices": [
      {
        "text": "خطة إشراك أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": false
      },
      {
        "text": "سجل أصحاب المصلحة",
        "correct": true
      },
      {
        "text": "خطة إدارة المشروع",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "بعد مقارنة النتائج الفعلية مع خط الأساس لقياس الأداء، يكتشف مدير المشروع أن مقاييس العمل والتكلفة في المشروع أفضل من المتوقع. يشك مدير المشروع في أن هذه الانحرافات الإيجابية يمكن أن تستمر حتى نهاية المشروع.\n\nما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: تحديث سجل المخاطر.\n\n- السبب: حتى الانحرافات الإيجابية تُعتبر مخاطرة إيجابية (فرصة)، ويجب تسجيلها وتحليلها في سجل المخاطر لضمان الاستفادة منها.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مراجعات الأداء مهمة لكنها خطوة لاحقة بعد تقييم المخاطر.\n- إبلاغ أصحاب المصلحة يحدث بعد التأكد من المعلومات.\n- مراجعة خطة إدارة المشروع ليست الإجراء الأول في هذا السياق.",
    "choices": [
      {
        "text": "إجراء مراجعات الأداء مع أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تحديث سجل المخاطر.",
        "correct": true
      },
      {
        "text": "إبلاغ أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع معقد في مرحلة التخطيط عندما حدد الراعي الحاجة إلى متخصص من دولة أجنبية. يعلم مدير المشروع أن الميزانية لا تسمح بتكاليف سفر هذا المتخصص.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تعيين المتخصص في فريق افتراضي.\n\n- السبب: تشكيل فريق افتراضي يسمح بالحصول على خبرة هذا الشخص دون تحمل تكاليف السفر، وهو حل مناسب في المشاريع ذات القيود المالية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تدريب أعضاء الفريق قد يستغرق وقتًا لا يتناسب مع متطلبات المشروع.\n- تقديم طلب تغيير يزيد الميزانية ويتطلب وقتًا للموافقة.\n- العثور على بديل محلي قد لا يوفر نفس الخبرة المطلوبة.",
    "choices": [
      {
        "text": "تدريب أحد أعضاء الفريق الحالي على المهارات الخاصة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير للحصول على ميزانية إضافية.",
        "correct": false
      },
      {
        "text": "العثور على بديل محلي.",
        "correct": false
      },
      {
        "text": "تعيين المتخصص في فريق افتراضي.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مشروع رئيسي يجب إكماله في الوقت المحدد وتجاوز جميع مستويات الجودة المحددة. طوال المشروع، يأخذ مدير المشروع استراحات قهوة مع الفريق ويسألهم إن كانت لديهم أفكار لتحسين طريقة عملهم.\n\nنهج مدير المشروع يتماشى مع أي نظرية؟",
    "explanation": "الإجابة الصحيحة: النظرية Y.\n\n- السبب: النظرية Y، بحسب دوغلاس ماكغريغور، تفترض أن الأفراد بطبعهم يتحملون المسؤولية، ويبحثون عن تحسين وتطوير عملهم، ويحتاجون إلى بيئة تحفيزية وإشراك في اتخاذ القرار.\n\n- لماذا الخيارات الأخرى خاطئة:\n- النظرية X تفترض أن الموظفين يحتاجون رقابة صارمة ودوافع خارجية.\n- النظرية Q والنظرية T غير معترف بهما في علم إدارة المشاريع كمفاهيم رسمية.",
    "choices": [
      {
        "text": "النظرية X",
        "correct": false
      },
      {
        "text": "النظرية Q",
        "correct": false
      },
      {
        "text": "النظرية Y",
        "correct": true
      },
      {
        "text": "النظرية T",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يواجه مدير المشروع صعوبة في إدارة أصحاب المصلحة لأن سجل أصحاب المصلحة لا يوضح مدى وعيهم بالمشروع ليكون ناجحًا.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تطوير مصفوفة تقييم مشاركة أصحاب المصلحة.\n\n- السبب: هذه الأداة تُستخدم لتحديد موقف كل صاحب مصلحة من حيث الوعي، المشاركة، التأييد، المقاومة، مما يساعد مدير المشروع على تصميم خطة تواصل فعالة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- لجنة التحكم بالتغيير ليست مسؤولة عن إدارة أصحاب المصلحة.\n- خطة التواصل يتم تحديثها لاحقًا بعد تحليل المصفوفة.\n- تحديد مستوى تحمل المخاطر يخص تحليل المخاطر وليس أصحاب المصلحة.",
    "choices": [
      {
        "text": "الاجتماع مع لجنة التحكم بالتغيير (CCB) لتقييم تأثير تحديد أصحاب مصلحة جدد.",
        "correct": false
      },
      {
        "text": "تحديث خطة التواصل مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديد مستوى تحمل المخاطر لكل صاحب مصلحة.",
        "correct": false
      },
      {
        "text": "تطوير مصفوفة تقييم مشاركة أصحاب المصلحة.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نتيجة لتقليص كبير في الميزانية، تم استبدال لجنة توجيه المشروع براعٍ واحد للمشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تعديل خطة إدارة الاتصالات لتعكس التغيير في مجتمع أصحاب المصلحة.\n\n- السبب: عند تغيير في عدد أو نوع أصحاب المصلحة المؤثرين، يجب تحديث خطة الاتصالات لتناسب الاحتياجات الجديدة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- صياغة تحديث مشروع إجراء ثانوي بعد تعديل الخطة.\n- تقديم طلب تغيير غير مطلوب هنا لأن التغيير تم إقراره.\n- جدولة اجتماع مع الراعي غير كافٍ ما لم يتم توثيق وتعديل خطة الاتصالات.",
    "choices": [
      {
        "text": "صياغة تحديث جديد للمشروع ومشاركته مع راعي المشروع.",
        "correct": false
      },
      {
        "text": "تعديل خطة إدارة الاتصالات لتعكس التغيير في مجتمع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة التحكم بالتغيير (CCB) لتوثيق التغيير في هيكل أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "جدولة اجتماع مع الراعي لمناقشة التغيير في الميزانية.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يحدد مدير المشروع مخاطر جديدة قد تؤثر على إنجاز المهام الحرجة. يحتاج مدير المشروع إلى عرض هذه المخاطر الجديدة على أصحاب المصلحة في التقرير الشهري للحالة.\n\nبالإضافة إلى تقرير المخاطر، ما الوثيقة التي يجب على مدير المشروع الرجوع إليها عند إعداد تقرير الحالة؟",
    "explanation": "الإجابة الصحيحة: سجل المخاطر.\n\n- السبب: سجل المخاطر يحتوي على تفاصيل كل المخاطر التي تم تحديدها سابقًا بالإضافة إلى المخاطر الجديدة، ويشمل تقييمات الاحتمالية والتأثير وخطط الاستجابة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- سجل الافتراضات يحتوي على الافتراضات والقيود ولا يشمل المخاطر المفصلة.\n- خطة إدارة المخاطر تحدد كيفية التعامل مع المخاطر بشكل عام ولا تحتوي على تفاصيل حالة المشروع.\n- مصفوفة الاحتمالية والتأثير تُستخدم لتقييم المخاطر لكن لا تحتوي على جميع التفاصيل اللازمة للتقرير الشهري.",
    "choices": [
      {
        "text": "سجل المخاطر",
        "correct": true
      },
      {
        "text": "سجل الافتراضات",
        "correct": false
      },
      {
        "text": "خطة إدارة المخاطر",
        "correct": false
      },
      {
        "text": "مصفوفة الاحتمالية والتأثير",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتعرف مدير المشروع على أن بعض المكونات يجب استيرادها لتلبية متطلبات المشروع. ومع ذلك، وبسبب تأثير محتمل لسعر صرف غير ملائم، يقرر مدير المشروع أن تحمل الخسارة غير مبرر ويختار عدم اتخاذ أي إجراء للتخفيف.\n\nما استراتيجية الاستجابة للمخاطر التي استخدمها مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: القبول.\n\n- السبب: استراتيجية القبول تعني أن الفريق يختار عدم اتخاذ أي إجراء استباقي تجاه المخاطرة، إما لأنها منخفضة التأثير أو لأن تكلفة المعالجة لا تبررها.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التحويل يعني نقل المسؤولية لطرف آخر (مثل التأمين).\n- التجنب تعني إلغاء أو تعديل الخطة لتجنب المخاطرة.\n- التقليل تعني محاولة تقليل احتمال حدوث المخاطرة أو تأثيرها.",
    "choices": [
      {
        "text": "التحويل",
        "correct": false
      },
      {
        "text": "التجنب",
        "correct": false
      },
      {
        "text": "التقليل",
        "correct": false
      },
      {
        "text": "القبول",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقترب مشروع من الاكتمال عندما يعلم مدير المشروع أن تغييرًا في اللوائح السوقية قد يؤثر على المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة خطة إدارة المخاطر.\n\n- السبب: خطة إدارة المخاطر تحتوي على الإجراءات والسياسات اللازمة للتعامل مع أي مخاطر جديدة أو متغيرة. عند ظهور تغيير مثل لوائح جديدة، يجب تحديث هذه الخطة أولاً.\n\n- لماذا الخيارات الأخرى خاطئة:\n- سجل أصحاب المصلحة لا يتعلق مباشرة بالمخاطر التنظيمية.\n- خط الأساس للتكلفة يتم تعديله فقط بعد تقييم التأثير وإدخال التغيير رسميًا.\n- تحليل التكلفة والعائد يمكن أن يتم لاحقًا بعد مراجعة خطة إدارة المخاطر، لكنه ليس الخطوة الأولى.",
    "choices": [
      {
        "text": "التحقق من سجل أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديث خط الأساس للتكلفة.",
        "correct": false
      },
      {
        "text": "مراجعة خطة إدارة المخاطر.",
        "correct": true
      },
      {
        "text": "إجراء تحليل التكلفة والعائد.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "تريد شركة متعددة الجنسيات ذات مشروع عابر للحدود تنفيذ برنامج جديد سيؤثر على عدة أقسام. يحتاج مدير المشروع إلى ضمان توافق توقعات أصحاب المصلحة مع المنتج النهائي.\n\nما الذي يجب أن يطوره فريق المشروع؟",
    "explanation": "الإجابة الصحيحة: خطة إشراك أصحاب المصلحة.\n\n- السبب: خطة إشراك أصحاب المصلحة توضح كيفية تحديد أصحاب المصلحة، وتحليل احتياجاتهم وتوقعاتهم، ووضع استراتيجيات للتواصل وإدارة مشاركتهم خلال المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- بيان عمل المشروع (SOW) يركز على وصف العمل المطلوب وليس على إدارة توقعات أصحاب المصلحة.\n- مصفوفة تقييم مشاركة أصحاب المصلحة تستخدم كأداة تحليل، لكنها ليست خطة شاملة.\n- هيكل تقسيم المخاطر (RBS) متعلق بإدارة المخاطر وليس بالتواصل مع أصحاب المصلحة.",
    "choices": [
      {
        "text": "بيان عمل المشروع (SOW)",
        "correct": false
      },
      {
        "text": "خطة إشراك أصحاب المصلحة",
        "correct": true
      },
      {
        "text": "مصفوفة تقييم مشاركة أصحاب المصلحة",
        "correct": false
      },
      {
        "text": "هيكل تقسيم المخاطر (RBS)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل فريق مشروع على خادم قديم لتطوير تطبيق برمجي. وقد طلب الفريق خادمًا جديدًا لاختبار المستخدم النهائي لأن الخادم القديم لا يمكنه تنفيذ هذا الاختبار. لم يصل الخادم الجديد في الوقت المحدد مما أدى إلى تأخير الاختبار.\n\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: مراجعة وتعديل الجدول الزمني للمشروع أثناء انتظار وصول الخادم الجديد.\n\n- السبب: تعديل الجدول الزمني هو الإجراء الأكثر منطقية لأن الخادم الجديد يمثل ضرورة تقنية لتنفيذ الاختبار، ولا يمكن الاستغناء عنه.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إجراء الاختبار على الخادم القديم غير عملي لأن الخادم لا يدعم متطلبات الاختبار.\n- تخطي اختبار المستخدم غير مقبول لأن هذا قد يؤثر على جودة المنتج.\n- مطالبة المورد بتسريع التسليم قد يتم لاحقًا، لكن الإجراء المباشر هو التعامل مع التأثير الحالي على الجدول.",
    "choices": [
      {
        "text": "مراجعة وتعديل الجدول الزمني للمشروع أثناء انتظار وصول الخادم الجديد.",
        "correct": true
      },
      {
        "text": "إجراء اختبار المستخدم على الخادم الحالي.",
        "correct": false
      },
      {
        "text": "تخطي اختبار المستخدم والانتقال إلى المهمة التالية.",
        "correct": false
      },
      {
        "text": "مطالبة المورد بتسريع تسليم الخادم الجديد.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحاول مدير مشروع إشراك أصحاب المصلحة في مشروع جديد وقد دعاهم إلى اجتماعات الوقوف اليومية. ومع ذلك، لم يحضر أي من أصحاب المصلحة أي اجتماع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: التواصل مع كل صاحب مصلحة بشكل فردي لفهم أسباب عدم الحضور.\n\n- السبب: فهم الأسباب يمكن أن يساعد في تكييف خطة التواصل وجعل الاجتماعات أو طرق التواصل مناسبة أكثر لهم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاستمرار في الاجتماعات بدون تقييم الوضع غير فعّال.\n- إلغاء الاجتماعات قرار متسرع قبل محاولة التفاهم مع أصحاب المصلحة.\n- التصعيد للإدارة يجب أن يكون آخر خطوة بعد استنفاد كل محاولات التواصل المباشر.",
    "choices": [
      {
        "text": "التواصل مع كل صاحب مصلحة بشكل فردي لفهم أسباب عدم الحضور.",
        "correct": true
      },
      {
        "text": "الاستمرار في عقد الاجتماعات كما هو مخطط وانتظار انضمام أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "إلغاء الاجتماعات واستكشاف وسائل تواصل بديلة.",
        "correct": false
      },
      {
        "text": "تصعيد الأمر للإدارة العليا وطلب تدخلهم.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يتعلم فريق المشروع كيفية استخدام الأساليب الرشيقة (Agile) في مشاريعهم. على الرغم من تحقيق أهداف الأداء، بدأ الفريق يفقد الحافز ويظهر عليه الملل أثناء الاجتماعات اليومية مما أصبح يمثل مصدر إزعاج.\n\nما الذي يمكن فعله في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: العمل مع الفريق على تحديد أهداف أكثر تحديًا لرفع مستوى الأداء.\n\n- السبب: في بيئات أجايل، من المهم الحفاظ على روح الفريق ودافعيته عبر تحديات جديدة وتحسين مستمر (Continuous Improvement). عندما يشعر الفريق بالملل أو فقدان الدافع رغم تحقيق الأهداف، فإن رفع سقف التحدي ينعش الفريق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تمارين بناء الفريق مفيدة لكن لا تعالج السبب الجذري.\n- دعوة الراعي قد تسبب ضغطًا إضافيًا بدلًا من تحفيز الفريق.\n- ميزانية تحفيز لا تحل مشكلة الملل الناتج عن غياب التحديات.",
    "choices": [
      {
        "text": "جدولة تمارين لبناء الفريق تركز على زيادة التفاعل.",
        "correct": false
      },
      {
        "text": "العمل مع الفريق على تحديد أهداف أكثر تحديًا لرفع مستوى الأداء.",
        "correct": true
      },
      {
        "text": "دعوة الراعي لحضور الاجتماع للتعامل مع السلوك المشتت.",
        "correct": false
      },
      {
        "text": "العمل مع الراعي لتحديد ميزانية يمكن استخدامها لتحفيز الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يفشل فريق المشروع بانتظام في تحقيق المعالم المحددة. يشعر أصحاب المصلحة بالقلق من أن المشروع سيفشل في تسليم النتائج في الموعد المحدد. كان مدير المشروع على علم بوجود صراعات داخل الفريق وتعلّم أن أحد أعضاء الفريق يفتقر إلى بعض المهارات اللازمة لإكمال المشروع.\n\nما الذي يجب أن يفعله مدير المشروع في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق لمناقشة المشكلات ووضع خطة لمعالجتها.\n\n- السبب: التواصل هو الخطوة الأولى في حل المشاكل المتعلقة بالأداء أو الصراعات. بهذه الطريقة يمكن جمع معلومات كاملة قبل اتخاذ قرار فردي حول الأفراد.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إعادة تعيين عضو الفريق قرار متسرع قبل محاولة دعمه أو تدريبه.\n- إبلاغ أصحاب المصلحة بالتأخير دون اتخاذ أي إجراء يعكس سوء إدارة.\n- فصل عضو الفريق يجب أن يكون آخر حل بعد استنفاد وسائل التدريب والدعم.",
    "choices": [
      {
        "text": "إعادة تعيين عضو الفريق الذي يفتقر إلى المهارات إلى مهمة أخرى.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق لمناقشة المشكلات ووضع خطة لمعالجتها.",
        "correct": true
      },
      {
        "text": "إبلاغ أصحاب المصلحة أن المشروع سيتأخر ولا يمكن فعل شيء.",
        "correct": false
      },
      {
        "text": "فصل عضو الفريق الذي يفتقر إلى المهارات وتوظيف شخص آخر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع مشروع تطوير لعميل خارجي في دولة أخرى. يجب على شركة مدير المشروع الامتثال للوائح معينة، وقد تم اختيار مشروع مدير المشروع للتدقيق. لا يعتقد العميل أن التدقيق ضروري وطلب من مدير المشروع عدم إزعاج فريق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع العميل لشرح ضرورة الامتثال للمتطلبات والمضي قدمًا في التدقيق.\n\n- السبب: الامتثال للقوانين واللوائح أمر غير قابل للتفاوض، لكن التواصل مع العميل لتوضيح السبب يساهم في تجنب سوء الفهم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استبعاد الفريق يعرض المشروع والشركة لمخاطر قانونية.\n- بدء التدقيق بدون إبلاغ العميل يؤثر سلبًا على علاقة العمل.\n- اجتماع موسع مع اللجنة التوجيهية وأصحاب المصلحة يعتبر مبالغًا فيه لهذا النوع من القضايا.",
    "choices": [
      {
        "text": "استبعاد فريق التطوير من التدقيق حسب طلب العميل.",
        "correct": false
      },
      {
        "text": "بدء التدقيق دون إبلاغ العميل لأن الشركة ملزمة بالامتثال.",
        "correct": false
      },
      {
        "text": "جدولة اجتماع مع اللجنة التوجيهية وجميع أصحاب المصلحة لمناقشة الأمر والتوصل إلى تفاهم مشترك.",
        "correct": false
      },
      {
        "text": "الاجتماع مع العميل لشرح ضرورة الامتثال للمتطلبات والمضي قدمًا في التدقيق.",
        "correct": true
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "من يمتلك السلطة ليكون طرفًا أساسيًا في المشروع وصاحب قرار رئيسي طوال دورة حياة المشروع لضمان توافقه مع الأهداف التجارية؟",
    "explanation": "الإجابة الصحيحة: مكتب إدارة المشاريع (PMO).\n\n- السبب: PMO مسؤول عن ضمان توافق المشاريع مع الاستراتيجية والأهداف المؤسسية. في العديد من المؤسسات، يحتفظ PMO بسلطة الإشراف واتخاذ قرارات رئيسية بما يتجاوز صلاحيات مدير المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مدير المشروع يركز على تنفيذ المشروع وفق الخطط.\n- راعي المشروع يدعم المشروع لكنه لا يمتلك كل السلطات الإدارية والتنظيمية مثل PMO.\n- العميل هو المستفيد النهائي لكنه لا يمتلك سلطة تنفيذية داخل المؤسسة.",
    "choices": [
      {
        "text": "مكتب إدارة المشاريع (PMO)",
        "correct": true
      },
      {
        "text": "مدير المشروع",
        "correct": false
      },
      {
        "text": "راعي المشروع",
        "correct": false
      },
      {
        "text": "العميل",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع يومي، يقترح أحد أعضاء فريق المشروع تعديل بعض الميزات للاستفادة من فرصة جديدة. بينما يعبر عضو آخر عن قلقه بشأن تجربة المستخدم الناتجة عن الميزة المقترحة.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع مالك المنتج لمناقشة كل من الفرصة والقلق المتعلق بالتعديل المقترح.\n\n- السبب: في بيئة أجايل، مالك المنتج هو المسؤول عن إدارة قائمة المنتج وتحديد الأولويات. القرارات المتعلقة بإضافة أو تعديل الميزات تتطلب تقييم القيمة وتأثيرها على تجربة المستخدم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التصويت لا يضمن قرارًا متوازنًا يعكس القيمة والأثر.\n- تأجيل النقاش يفوّت على الفريق فرصة استغلال الفرصة في الوقت المناسب.\n- الاجتماع مع أصحاب المصلحة والفريق قد يكون مبكرًا جدًا في هذه المرحلة قبل تقييم الأمر مع مالك المنتج.",
    "choices": [
      {
        "text": "الاجتماع مع مالك المنتج لمناقشة كل من الفرصة والقلق المتعلق بالتعديل المقترح.",
        "correct": true
      },
      {
        "text": "إجراء تصويت بين الفريق لتحديد ما إذا كان سيتم تضمين التعديل.",
        "correct": false
      },
      {
        "text": "تسجيل الفرصة في السجل الاحتياطي وتأجيل النقاش وطلب من الفريق مناقشة الأمر في الاجتماع التالي.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة والفريق لمناقشة كيفية المضي قدمًا بشأن التعديلات المقترحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "نفذت مؤسسة طريقة أجايل (Agile) في مشاريعها الأخيرة، ولكن جميع تلك المشاريع فشلت في تحقيق مواعيد التسليم. وكان الرعاة يضيفون طلبات جديدة باستمرار. تم تعيين مدير مشروع جديد في مشروع أجايل جديد ووجد أن الهدف غير واضح ولا يوجد تعريف واضح للانتهاء (DoD).\n\nما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: العمل عن كثب مع الفريق لوضع وتحديد رؤية واضحة للمشروع.\n\n- السبب: وجود رؤية واضحة ومتفق عليها بين الفريق وأصحاب المصلحة يحدد ما الذي سيتم تسليمه وما هو معيار الانتهاء (Definition of Done). غياب الرؤية هو سبب رئيسي للفشل في بيئة أجايل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التركيز على خطة التواصل لا يعالج غياب الرؤية.\n- السماح للفريق باختيار الموارد التقنية خطوة لاحقة بعد تحديد الرؤية.\n- تحديد ميثاق المشروع ضروري في منهجيات تقليدية أكثر منه في أجايل، ولكن التركيز هنا يجب أن يكون على رؤية وقائمة المنتج.",
    "choices": [
      {
        "text": "تنظيم اجتماع مع أصحاب المصلحة لضمان تعريف خطة التواصل بشكل واضح.",
        "correct": false
      },
      {
        "text": "ضمان السماح للفريق باختيار أفضل الموارد التقنية لضمان نجاح المشروع.",
        "correct": false
      },
      {
        "text": "العمل عن كثب مع الفريق لوضع وتحديد رؤية واضحة للمشروع.",
        "correct": true
      },
      {
        "text": "العمل مع أصحاب المصلحة لضمان تحديد ميثاق المشروع والمخرجات بشكل واضح.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يدير مدير المشروع مشروع أجايل مهم. خلال اجتماع الإطلاق، يحدد مدير المشروع السياسات والإجراءات التي يجب اتباعها طوال مدة المشروع. في منتصف المشروع، يكتشف مدير المشروع أن بعض أعضاء الفريق لا يتبعون الإجراءات المحددة.\n\nما الذي يجب على مدير المشروع فعله في هذه الحالة؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق لمراجعة السياسات والإجراءات مجددًا والتأكيد على أهميتها.\n\n- السبب: في بيئة أجايل، التوعية المستمرة والتواصل مع الفريق أمر أساسي لضمان الالتزام بالقواعد المتفق عليها. العقوبات أو استبدال الأعضاء ليست حلولًا مناسبة مباشرة قبل التحقق من وجود سوء فهم أو نقص في التوضيح.\n\n- لماذا الخيارات الأخرى خاطئة:\n- توثيق قانوني وجعل الفريق يوقع هو إجراء بيروقراطي غير متناسب مع ثقافة أجايل.\n- استبدال الأعضاء قبل المحاولة معهم يعد قرارًا متسرعًا.\n- برنامج حوافز قد لا يعالج السبب الجذري للمشكلة.",
    "choices": [
      {
        "text": "العمل مع القسم القانوني لتوثيق السياسات والإجراءات وجعل أعضاء الفريق يوقعون على هذا المستند.",
        "correct": false
      },
      {
        "text": "العمل مع راعي المشروع لاستبدال الأعضاء الذين لا يتبعون الإجراءات المحددة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق لمراجعة السياسات والإجراءات مجددًا والتأكيد على أهميتها.",
        "correct": true
      },
      {
        "text": "تطوير برنامج حوافز لأولئك الذين يتبعون القواعد بشكل صحيح.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "طلب أحد أصحاب المصلحة في مشروع أجايل من مدير المشروع تقديم الوقت المتبقي المخطط له للمشروع.\n\nما الأداة التي يجب على مدير المشروع استخدامها لتقديم هذه المعلومة؟",
    "explanation": "الإجابة الصحيحة: مخطط الانحدار للإصدار (Release Burndown Chart).\n\n- السبب: هذه الأداة تُستخدم في أجايل لمتابعة التقدم مقابل خطة الإصدار وتوضيح العمل المتبقي حتى الاكتمال.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تخطيط البوكر (Planning Poker) يُستخدم لتقدير المهام، وليس لمتابعة التقدم.\n- عدد نقاط القصص يعبر عن الحجم المتبقي لكنه لا يعطي تصورًا بصريًا شاملًا مثل مخطط الانحدار.\n- WBS أداة تخطيط تقليدية وليست من أدوات أجايل.",
    "choices": [
      {
        "text": "تحليل تخطيط البوكر (Planning Poker)",
        "correct": false
      },
      {
        "text": "مخطط الانحدار للإصدار (Release Burndown Chart)",
        "correct": true
      },
      {
        "text": "عدد نقاط القصص للمستخدمين المتبقين",
        "correct": false
      },
      {
        "text": "هيكل تقسيم العمل (WBS)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "عادةً ما يعقد مدير المشروع جلسات تقييم بأثر رجعي في نهاية المشروع. ومع ذلك، يعتقد الراعي أن هذه الجلسات مضيعة للوقت والميزانية، ويأمر بتقليلها أو إلغائها بشكل كبير في المشاريع المستقبلية.\n\nما النتيجة المحتملة لهذا التوجيه؟",
    "explanation": "الإجابة الصحيحة: التركيز يتحول إلى مناقشة المشكلات بدلاً من تحديد طرق التحسين للمشاريع المستقبلية.\n\n- السبب: جلسات التقييم بأثر رجعي (Retrospectives) تساعد الفريق على تحسين الأداء عبر تحليل ما حدث وليس فقط حل المشكلات. تقليلها يفقد الفريق هذه الفرصة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- فقدان فرصة التحسين نتيجة فرعية لكن الإجابة الأقرب للمفهوم في أجايل هي التركيز على المشكلات.\n- التركيز على ملاحظات أصحاب المصلحة جزء من مراجعة خارجية وليس هدف جلسة تقييم بأثر رجعي.\n- خطة إدارة الوقت ليست العنصر المتأثر مباشرة.",
    "choices": [
      {
        "text": "التركيز يتحول إلى مناقشة المشكلات بدلاً من تحديد طرق التحسين للمشاريع المستقبلية.",
        "correct": true
      },
      {
        "text": "يتم فقدان فرصة تحسين عمليات الفريق استنادًا إلى ملاحظات المشروع المحددة.",
        "correct": false
      },
      {
        "text": "يتم التركيز على ملاحظات أصحاب المصلحة حول أداء المشروع.",
        "correct": false
      },
      {
        "text": "لا يتم تحديث خطة إدارة الوقت بشكل صحيح.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "ينتقل مكتب إدارة المشاريع (PMO) من استخدام النهج التقليدي إلى إدارة المشاريع بأسلوب أجايل. تم تدريب الفريق على أجايل لكنه يواجه مشكلات في التعامل مع المدراء التنفيذيين في الشركة باستخدام العمليات الجديدة.\n\nكيف يجب على مدير المشروع معالجة هذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع المدراء التنفيذيين لتدريبهم على فوائد ممارسات أجايل.\n\n- السبب: تدريب المدراء التنفيذيين على منهجيات أجايل يساعد في بناء فهم مشترك وتقبل العمليات الجديدة، مما يسهل التعاون والدعم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- دعوة المدراء التنفيذيين إلى الاجتماعات اليومية غير فعالة ولا تتناسب مع أدوارهم ومسؤولياتهم.\n- إبلاغ المكتب بأن النهج التقليدي هو الحل يعكس مقاومة للتغيير وقد يعرقل التحول.\n- استبدال أصحاب المصلحة غير ممكن عملياً وغير حكيم بدون تقييم شامل.",
    "choices": [
      {
        "text": "دعوة المدراء التنفيذيين إلى الاجتماعات اليومية ليتعلموا أهمية المشروع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع المدراء التنفيذيين لتدريبهم على فوائد ممارسات أجايل.",
        "correct": true
      },
      {
        "text": "إبلاغ مكتب إدارة المشاريع بأن المشروع يجب أن يستخدم النهج التقليدي لأنه لن ينجح دون قبول المدراء التنفيذيين.",
        "correct": false
      },
      {
        "text": "استبدال أصحاب المصلحة الحاليين بالمدراء التنفيذيين.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتعاون فريقان يعملان بأسلوب أجايل في مشروع مشترك. مخرجات الفريق A غير مكتملة بالشكل الكافي ليقوم الفريق B بدمجها ضمن مهامه.\n\nوفقًا لمبادئ القيادة الخدمية (Servant Leadership) وأجايل، كيف يجب على مدير المشروع حل هذه المشكلة؟",
    "explanation": "الإجابة الصحيحة: يساعد مدير المشروع الفريق A في حل المشكلة، ويقوم الفريق A بتحديد كيفية تنفيذ الحل.\n\n- السبب: القيادة الخدمية تشجع على تمكين الفرق ودعمهم لحل المشكلات بأنفسهم، مما يعزز المسؤولية والالتزام.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تقديم طلب تغيير من الفريق B إلى الفريق A قد يعرقل التعاون.\n- تحديد الفريق B لكيفية تنفيذ التغيير يعارض مبادئ التمكين الذاتية.\n- قرار مدير المشروع بشكل مباشر يتنافى مع فلسفة الأجايل والقيادة الخدمية.",
    "choices": [
      {
        "text": "يساعد مدير المشروع الفريق A في حل المشكلة، ويقوم الفريق A بتحديد كيفية تنفيذ الحل.",
        "correct": true
      },
      {
        "text": "يقدم الفريق B طلب تغيير للفريق A، ويتولى الفريق A اعتماد التغيير.",
        "correct": false
      },
      {
        "text": "يحدد الفريق B كيف يقوم الفريق A بتنفيذ التغيير، ويشرف مدير المشروع.",
        "correct": false
      },
      {
        "text": "يقرر مدير المشروع كيف يقوم الفريق A بتنفيذ التغيير، ويحدد معايير القبول.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ما هو العامل الرئيسي الذي تهدف القيادة الخدمية إلى ترسيخه لتحسين أداء الفريق؟",
    "explanation": "الإجابة الصحيحة: الثقة.\n\n- السبب: القيادة الخدمية تبني ثقافة تعتمد على الثقة المتبادلة بين القائد والفريق، مما يعزز الأداء والتعاون.\n\n- لماذا الخيارات الأخرى خاطئة:\n- التركيز، السرعة، والدقة هي أهداف عملية لكنها تعتمد على وجود ثقة أساسية لتحقيقها.",
    "choices": [
      {
        "text": "الثقة",
        "correct": true
      },
      {
        "text": "التركيز",
        "correct": false
      },
      {
        "text": "السرعة",
        "correct": false
      },
      {
        "text": "الدقة",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "خلال اجتماع الفريق، ناقش الأعضاء التبعيات الخارجية للمشروع وطلبوا نصيحة مدير المشروع.\n\nما الذي يجب أن يطلبه مدير المشروع من الفريق؟",
    "explanation": "الإجابة الصحيحة: يجب على الفريق سرد جميع التبعيات الخارجية وتقييم تأثيرها على تسليمات المشروع.\n\n- السبب: فهم التبعيات الخارجية يساعد في التعرف على المخاطر والتحديات المحتملة التي قد تؤثر على الجدول الزمني وجودة التسليمات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- حصر منتجات المنافسين وتقليد أسلوبهم أمر مرتبط بالتحليل التسويقي وليس بإدارة التبعيات.\n- سرد تأثير دخول منافس جديد جزء من دراسة السوق ولا يعالج التبعيات بشكل مباشر.\n- تجاهل التبعيات قد يؤدي إلى مشاكل في التنسيق والتأخير في الإنجاز.",
    "choices": [
      {
        "text": "يجب على الفريق حصر المنتجات التي أطلقها المنافسون ومحاولة تقليد أسلوبهم.",
        "correct": false
      },
      {
        "text": "يجب على الفريق سرد جميع التبعيات الخارجية وتقييم تأثيرها على تسليمات المشروع.",
        "correct": true
      },
      {
        "text": "يجب على الفريق سرد تأثير دخول منافس جديد للسوق.",
        "correct": false
      },
      {
        "text": "يجب على الفريق التركيز على المهام المخصصة لهم ونسيان التبعيات الخارجية لأنها لن تؤثر على عملهم.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "في مشروع أجايل جديد، يستخدم الفريق طريقة كانبان. يعمل لوح كانبان كأداة عرض معلومات لأي شخص يراه، حيث يعرض حالة العمل الحالية للفريق.\n\nكيف يتم اعتبار تقنية لوحة كانبان؟",
    "explanation": "الإجابة الصحيحة: تقنية منخفضة ولكن عالية التفاعل (Low-tech, high-touch).\n\n- السبب: لوحة كانبان غالبًا ما تكون بسيطة ماديًا لكنها تتيح شفافية وتفاعل مستمر بين أعضاء الفريق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- ليست أداة مباشرة في دورة PDCA.\n- لا تقتصر على إظهار الأعمال المنجزة بل تعرض سير العمل الحالي.\n- ليست أداة لتقدير نقاط القصص، بل لإدارة تدفق العمل والمهام.",
    "choices": [
      {
        "text": "تقنية منخفضة ولكن عالية التفاعل (Low-tech, high-touch)",
        "correct": true
      },
      {
        "text": "أداة مستخدمة في دورة PDCA",
        "correct": false
      },
      {
        "text": "تستخدم لإظهار الأعمال المنجزة",
        "correct": false
      },
      {
        "text": "لوحة لتقدير نقاط القصص",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "عند إتمام عقد طويل الأمد، يؤكد مدير المشروع مع مدير الإصدار أن جميع الميزات المخططة تعمل بشكل صحيح كما تم التحقق منها من قبل فريق ضمان الجودة. ثم يبلغ مدير المشروع العملاء وأصحاب المصلحة بذلك ويحصل على الموافقة لإغلاق المشروع. تم الآن إغلاق المشروع.\n\nما الذي يجب أن يفعله مدير المشروع لضمان توفر المعرفة المكتسبة من هذا المشروع للمراجع المستقبلية؟",
    "explanation": "الإجابة الصحيحة: تحديث قاعدة المعرفة للدروس المستفادة.\n\n- السبب: توثيق الدروس المستفادة يمكّن الفرق المستقبلية من الاستفادة من الخبرات المكتسبة وتحسين أداء المشاريع القادمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديث سجل المخاطر لا يغطي كل جوانب الخبرات المكتسبة.\n- تحديث وأرشفة ملف المشتريات جزء من الإغلاق الإداري وليس نقل المعرفة.\n- إغلاق وثائق تقييم أداء البائع يخص العقود ولا يتعلق بالمعرفة المكتسبة.",
    "choices": [
      {
        "text": "تحديث قاعدة المعرفة للدروس المستفادة.",
        "correct": true
      },
      {
        "text": "تحديث سجل المخاطر قبل إبلاغ أعضاء الفريق.",
        "correct": false
      },
      {
        "text": "تحديث وأرشفة ملف المشتريات النهائي.",
        "correct": false
      },
      {
        "text": "إغلاق وثائق تقييم أداء البائع.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يقود مدير المشروع مشروعًا لتقديم منتج جديد إلى السوق. طلب راعي المشروع توسيع نطاق العمل وتسليم \"نسخة موسعة\" من المنتج النهائي.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: بدء عملية التحكم المتكاملة في التغيير.\n\n- السبب: أي طلب لتوسيع النطاق يجب أن يخضع لإجراءات التحكم بالتغيير الرسمية لضمان تقييم التأثير واتخاذ القرار المناسب.\n\n- لماذا الخيارات الأخرى خاطئة:\n- طلب تأكيد رسمي على التغيير بدون بدء العملية المتكاملة غير كافٍ.\n- الحصول على موافقة تعديل الميزانية يأتي ضمن عملية التحكم في التغيير، وليس خطوة منفصلة أولى.\n- تحديث خطة إدارة المشروع يجب أن يتم بعد الموافقة على التغيير، وليس قبلها.",
    "choices": [
      {
        "text": "طلب تأكيد رسمي على التغيير.",
        "correct": false
      },
      {
        "text": "الحصول على موافقة أصحاب المصلحة لتعديل الميزانية.",
        "correct": false
      },
      {
        "text": "بدء عملية التحكم المتكاملة في التغيير.",
        "correct": true
      },
      {
        "text": "تحديث خطة إدارة المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير المشروع مشروع بنية تحتية معقد وحيوي لنمو الشركة. في المراحل الأولية للمشروع، يحدد مدير المشروع صاحب مصلحة ذو تأثير كبير لكنه يعارض المشروع. دعم هذا الشخص ضروري لنجاح المشروع، لكنه أعرب عن مخاوف وتحفظات.\n\nكيف يجب على مدير المشروع التعامل مع هذا الموقف؟",
    "explanation": "الإجابة الصحيحة: تطوير خطة لإشراك أصحاب المصلحة تتضمن استراتيجيات لمعالجة مخاوف هذا الطرف المقاوم.\n\n- السبب: إشراك أصحاب المصلحة المعارضين ومعالجة مخاوفهم يساعد في تحويل المعارضة إلى دعم ويقلل المخاطر.\n\n- لماذا الخيارات الأخرى خاطئة:\n- استبعاد صاحب المصلحة قد يزيد من المقاومة ويضر بالمشروع.\n- تعيين عضو فريق لإدارة هذا الشخص دون خطة واضحة قد يكون غير فعال.\n- طلب تدخل الإدارة العليا قد يكون خطوة لاحقة وليست أولى في التعامل مع الموقف.",
    "choices": [
      {
        "text": "تطوير خطة لإشراك أصحاب المصلحة تتضمن استراتيجيات لمعالجة مخاوف هذا الطرف المقاوم.",
        "correct": true
      },
      {
        "text": "استبعاد صاحب المصلحة المقاوم من المشروع لتجنب الاضطرابات والتركيز على المشروع.",
        "correct": false
      },
      {
        "text": "تعيين أحد أعضاء الفريق لإدارة صاحب المصلحة المقاوم والتركيز على إشراك الآخرين.",
        "correct": false
      },
      {
        "text": "طلب تدخل الإدارة العليا لإقناع صاحب المصلحة بأهمية المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مراجعة دورية مع أصحاب المصلحة، يسأل راعي المشروع كيف سيتم قياس الإنجاز المرضي للتسليمات وكيف سيتم تطبيق تلك القياسات.\n\nأين يمكن لمدير المشروع أن يجد هذه المعلومات؟",
    "explanation": "الإجابة الصحيحة: خطة إدارة المتطلبات.\n\n- السبب: خطة إدارة المتطلبات توضح معايير القبول وكيفية قياس تحقيق المتطلبات والتسليمات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خطة إدارة النطاق تحدد نطاق العمل فقط ولا تركز على معايير القبول التفصيلية.\n- خطة إدارة الجودة تهتم بالجودة بشكل عام وليست تحديد معايير قياس الإنجاز بالتحديد.\n- تقارير أداء العمل تعرض الأداء الفعلي وليست مصدرًا لتعريف المعايير.",
    "choices": [
      {
        "text": "خطة إدارة النطاق.",
        "correct": false
      },
      {
        "text": "خطة إدارة المتطلبات.",
        "correct": true
      },
      {
        "text": "خطة إدارة الجودة.",
        "correct": false
      },
      {
        "text": "تقارير أداء العمل.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشكك مدير وظيفي فيما إذا كانت بعض جوانب المشروع تتماشى مع أهداف المشروع.\n\nما الوثيقة التي يجب على مدير المشروع مراجعتها لمعالجة قلق المدير الوظيفي؟",
    "explanation": "الإجابة الصحيحة: ميثاق المشروع.\n\n- السبب: ميثاق المشروع يحتوي على تعريف واضح لأهداف المشروع ويساعد في توضيح مدى توافق جوانب المشروع مع تلك الأهداف.\n\n- لماذا الخيارات الأخرى خاطئة:\n- بيان العمل (SOW) يصف نطاق العمل ولا يركز على أهداف المشروع بشكل شامل.\n- خطة إدارة المشروع تشمل تفاصيل التنفيذ وليست وثيقة تعريفية للأهداف.\n- نظام معلومات إدارة المشروع (PMIS) أداة لدعم الإدارة وليس وثيقة مرجعية للأهداف.",
    "choices": [
      {
        "text": "بيان العمل (SOW)",
        "correct": false
      },
      {
        "text": "ميثاق المشروع",
        "correct": true
      },
      {
        "text": "خطة إدارة المشروع",
        "correct": false
      },
      {
        "text": "نظام معلومات إدارة المشروع (PMIS)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يطلب أحد أصحاب المصلحة الرئيسيين إجراء تغيير من شأنه حل مشكلة حرجة قد تؤثر على استمرارية العمليات. ومع ذلك، فإن المشروع يقترب من الانتهاء، وسيؤدي التغيير إلى زيادة التكلفة الإجمالية وتأخير تاريخ الانتهاء.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تقديم طلب تغيير إلى لجنة التحكم في التغيير (CCB).\n\n- السبب: التغيير الذي يؤثر على التكلفة والجدول الزمني يحتاج إلى مراجعة واعتماد من لجنة التحكم في التغيير لضمان إدارة التأثيرات بشكل مناسب.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تفويض القرار لصاحب مصلحة آخر قد يؤدي إلى قرارات غير مدروسة.\n- تعديل هيكل تقسيم العمل وبيان النطاق يجب أن يتم بعد الموافقة الرسمية على التغيير.\n- إبلاغ راعي المشروع فقط غير كافٍ بدون عملية رسمية للتحكم في التغيير.",
    "choices": [
      {
        "text": "تفويض قرار أهمية التغيير إلى صاحب مصلحة أكثر خبرة.",
        "correct": false
      },
      {
        "text": "تقديم طلب تغيير إلى لجنة التحكم في التغيير (CCB).",
        "correct": true
      },
      {
        "text": "تعديل هيكل تقسيم العمل (WBS) وبيان نطاق المشروع لتضمين التغيير.",
        "correct": false
      },
      {
        "text": "إبلاغ راعي المشروع بالتأثير على الميزانية والجدول الزمني.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أثناء مرحلة تنفيذ المشروع، يكتشف مدير المشروع أن المعلومات لم تُرسل إلى أصحاب المصلحة بالمستوى المتوقع من التفاصيل.\n\nما هو الأثر الأكثر احتمالاً للتواصل الضعيف مع أصحاب المصلحة في مرحلة التنفيذ؟",
    "explanation": "الإجابة الصحيحة: انخفاض ثقة المشروع.\n\n- السبب: التواصل الضعيف يؤدي إلى نقص في المعلومات والثقة بين أصحاب المصلحة وفريق المشروع، مما يضعف الدعم والتعاون.\n\n- لماذا الخيارات الأخرى خاطئة:\n- زيادة التكاليف أو تأخير الجدول قد تكون نتيجة ثانوية، لكنها ليست الأثر الأكثر مباشرة.\n- انخفاض جودة المشروع مرتبط بأسباب أخرى أكثر من ضعف التواصل فقط.",
    "choices": [
      {
        "text": "انخفاض ثقة المشروع.",
        "correct": true
      },
      {
        "text": "زيادة تكاليف المشروع.",
        "correct": false
      },
      {
        "text": "انخفاض جودة المشروع.",
        "correct": false
      },
      {
        "text": "تأخر في الجدول الزمني للمشروع.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يلاحظ مدير المشروع مشكلات في أداء الجدول الزمني بسبب مستويات خبرة موارد المشروع. بعض الموارد المتمرسة تتحقق من تفاصيل غير ضرورية، وبعض الموارد الأقل خبرة تستغرق وقتًا طويلاً لإكمال المهام.\n\nما الذي يجب أن يفعله مدير المشروع لمساعدة الفريق على تحسين أدائه؟",
    "explanation": "الإجابة الصحيحة: تحديد الفجوات المعرفية لكل فرد ومعالجتها من خلال التدريب.\n\n- السبب: تدريب الفريق على المهارات اللازمة يرفع مستوى الكفاءة ويقلل من الوقت الضائع في التفاصيل غير الضرورية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تسجيل المشكلة في سجل المخاطر مفيد لكنه لا يحل المشكلة بشكل مباشر.\n- إبلاغ الراعي لا يوفر خطة لتحسين أداء الفريق.\n- الاجتماع مع الموارد البشرية قد يكون خطوة لاحقة لكن التدريب هو الحل الأولي الأفضل.",
    "choices": [
      {
        "text": "تحديد الفجوات المعرفية لكل فرد ومعالجتها من خلال التدريب.",
        "correct": true
      },
      {
        "text": "تسجيل ذلك في سجل المخاطر ومعالجة ذلك مع الفريق أثناء جلسة الاستعراض.",
        "correct": false
      },
      {
        "text": "إبلاغ الراعي بأن التسليم لن يكون متاحًا في الوقت المحدد بسبب نقص الخبرة.",
        "correct": false
      },
      {
        "text": "الاجتماع مع قسم الموارد البشرية لمعالجة الأفراد الذين يفتقرون إلى المهارات.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يجتمع قائد فريق المشروع مع مدير المشروع قبل اجتماع الإطلاق المجدول. يشعر القائد بالقلق من أن التوقعات المتعلقة بتسليمات المشروع قد لا تكون واقعية.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مراجعة الحالة التجارية للمشروع ونتائج دراسة الجدوى.\n\n- السبب: التأكد من أن التوقعات مدعومة بوثائق واضحة يساعد في معالجة المخاوف بشكل موضوعي.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تيسير اجتماع مع راعي المشروع قد يكون مفيدًا لكنه يأتي بعد مراجعة الوثائق الأساسية.\n- اجتماع مع أصحاب المصلحة وتعديل سجل المخاطر خطوات لاحقة بعد التحقق من المعلومات الأساسية.",
    "choices": [
      {
        "text": "مراجعة الحالة التجارية للمشروع ونتائج دراسة الجدوى.",
        "correct": true
      },
      {
        "text": "تيسير اجتماع بين راعي المشروع وقائد الفريق لمناقشة المخاوف.",
        "correct": false
      },
      {
        "text": "الاجتماع مع أصحاب المصلحة لمناقشة المخاوف وتسجيل استنتاجاتهم في خطة إشراك أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تحديد المخاطر والاستجابات المتفق عليها وتعديل سجل المخاطر وفقًا لذلك.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشعر مدير المشروع بالقلق من أن أعضاء الفريق يقضون وقتًا طويلاً في مساعدة موظفي العمليات والصيانة في أحد مكونات المشروع المكتملة والمسلّمة مؤخرًا. وقد راجع مدير المشروع وثائق الأصول التنظيمية للتحقق من أن المكون تم توقيعه وتم نقل الملكية.\n\nإلى أي وثائق إضافية يجب أن يشير مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: التقرير النهائي وتحديثات وثائق المشروع.\n\n- السبب: هذه الوثائق تحتوي على ملخصات الأداء والتسليمات النهائية، ما يساعد في تحديد حالة التسليم ومرحلة الدعم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- بيان عمل المشتريات وتقارير أداء العمل تتعلق بمرحلة التنفيذ وليس الإغلاق والدعم.\n- خطة إدارة المتطلبات والتغيير تركز على التغييرات وليس تسليمات المشروع النهائية.\n- خطة إدارة المشتريات وميثاق المشروع وثائق تخطيطية وليس لها علاقة مباشرة بمرحلة الدعم بعد التسليم.",
    "choices": [
      {
        "text": "بيان عمل المشتريات وتقارير أداء العمل",
        "correct": false
      },
      {
        "text": "خطة إدارة المتطلبات وخطة إدارة التغيير",
        "correct": false
      },
      {
        "text": "خطة إدارة المشتريات وميثاق المشروع",
        "correct": false
      },
      {
        "text": "التقرير النهائي وتحديثات وثائق المشروع",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "ينفذ فريق المشروع تغييرًا تمت الموافقة عليه من قبل لجنة التحكم في التغيير (CCB). كان الهدف من التغيير تقليل المخاطر، لكنه أدى إلى نتيجة عكسية.\n\nما الذي كان يجب على مدير المشروع فعله لتجنب هذه النتيجة؟",
    "explanation": "الإجابة الصحيحة: التأكد من فعالية استجابة المخاطر ومتابعة التقدم.\n\n- السبب: متابعة تنفيذ استراتيجيات إدارة المخاطر وتقييم مدى فعاليتها ضرورية لتجنب نتائج غير مرغوبة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تحديث سجل الافتراضات مهم لكنه لا يكفي لضمان نجاح الاستجابة.\n- إجراء تحليل المخاطر يجب أن يتم قبل اتخاذ الإجراءات وليس فقط بعد تنفيذها.\n- تطوير مصفوفة الاحتمالية والأثر هو خطوة في التقييم الأولي وليس في المتابعة.",
    "choices": [
      {
        "text": "التأكد من فعالية استجابة المخاطر ومتابعة التقدم.",
        "correct": true
      },
      {
        "text": "تحديث سجل الافتراضات بتفاصيل حول المخاطر.",
        "correct": false
      },
      {
        "text": "إجراء تحليل للمخاطر لتحديد مدى التعرض لمخاطر المشروع.",
        "correct": false
      },
      {
        "text": "تطوير مصفوفة الاحتمالية والأثر لتحديد أولوية المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يبلغ مورد أداة لمشروع تصنيع مدير المشروع بأن تسليم الأداة سيتأخر. يطلب مدير المشروع الأداة من مورد آخر. بعد وصول الأداة من المورد الثاني، يقوم المورد الأصلي بتسليم الأداة وتقديم فاتورة وفقًا لاتفاقية الشراء.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "الإجابة الصحيحة: مراجعة اتفاقية الشراء مع المورد الأصلي لتطبيق شروط التأخير، وإبلاغ المستشار القانوني بالمشكلة.\n\n- السبب: يجب التحقق من الالتزامات التعاقدية واتخاذ الإجراءات القانونية المناسبة لضمان حقوق المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- رفض الدفع أو إرجاع الأداة قد يؤدي إلى مشاكل قانونية إذا لم يتم الاتفاق مسبقًا.\n- الاحتفاظ بالأداة ودفع الفاتورة دون مراجعة العقود قد يسبب التزامات غير ضرورية.\n- مقارنة الجودة وإرجاع الأداة غير فعالة دون النظر في الشروط التعاقدية.",
    "choices": [
      {
        "text": "إرجاع الأداة إلى المورد الأصلي ورفض دفع الفاتورة لأن التسليم كان متأخرًا.",
        "correct": false
      },
      {
        "text": "الاحتفاظ بالأداة الإضافية كاحتياطي، ودفع الفاتورة من الاحتياطي المالي، وتحديث سجل الدروس المستفادة.",
        "correct": false
      },
      {
        "text": "مراجعة اتفاقية الشراء مع المورد الأصلي لتطبيق شروط التأخير، وإبلاغ المستشار القانوني بالمشكلة.",
        "correct": true
      },
      {
        "text": "مقارنة جودة الأداتين، واختيار الأداة ذات القيمة الأفضل، وإرجاع الأخرى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتجنب أحد الخبراء في الفريق أداء المهام التي تتطلب العمل مع مقاول أجنبي. كيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: مناقشة الخبير على انفراد حول تحفظاته أو تحيزاته والإصرار على تبني سلوك شامل للجميع.\n\n- السبب: التواصل المفتوح والاحترام يعزز بيئة عمل صحية ويعالج المشكلات الشخصية دون تصعيد.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إصدار تحذير تأديبي قد يؤدي إلى توتر وعدم تعاون في الفريق.\n- توظيف مستشار بديل قد يحل المشكلة مؤقتًا لكنه لا يعالج السبب الجذري.\n- تأنيب الخبير علنًا يمكن أن يسبب إحراج ويضر بثقافة الفريق.",
    "choices": [
      {
        "text": "مناقشة الخبير على انفراد حول تحفظاته أو تحيزاته والإصرار على تبني سلوك شامل للجميع.",
        "correct": true
      },
      {
        "text": "إصدار تحذير تأديبي للخبير وإبلاغ مديره الوظيفي لإرساله إلى تدريب على التنوع.",
        "correct": false
      },
      {
        "text": "تجنّب التأخير والنزاعات من خلال توظيف مستشار يوافق الخبير على العمل معه.",
        "correct": false
      },
      {
        "text": "تأنيب الخبير على سلوكه التمييزي خلال اجتماع الفريق لتقديم مثال يُحتذى به.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يستخدم مشروع نهجًا هجينًا وكان أداء الفريق ممتازًا باستمرار خلال المراحل التنبؤية. خلال المراحل التزايدية، بدأ الفريق يُظهر علامات تدني المعنويات، وضعف الالتزام، ووجود صراعات، وارتباك. ومع ذلك، يواصل أحد أعضاء الفريق إظهار الثقة والتفوق في الأداء خلال هذه المرحلة.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع الفريق لمناقشة المشكلات وتطوير خطة لمعالجتها.\n\n- السبب: ظهور تدني المعنويات والصراعات داخل الفريق يشير إلى وجود مشاكل تحتاج إلى معالجة فورية من خلال التواصل المفتوح. اجتماع الفريق يسمح بتحديد أسباب المشاكل ويعزز التعاون لإيجاد حلول فعالة تعيد الفريق إلى المسار الصحيح.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاعتراف بعضو الفريق عالي الأداء قد يحفز هذا العضو لكنه لا يعالج مشاكل الفريق ككل.\n- التدريب الإضافي على أجايل قد يكون مفيدًا لاحقًا لكن المشكلة الحالية هي الصراعات والالتزام، والتي تحتاج إلى معالجة مباشرة.\n- العودة إلى النهج التنبؤي فقط قد تؤدي إلى فقدان المرونة ولن تحل المشاكل الحالية داخل الفريق.",
    "choices": [
      {
        "text": "الاعتراف بعضو الفريق عالي الأداء كنموذج يجب أن يحتذي به الآخرون.",
        "correct": false
      },
      {
        "text": "توفير تدريب إضافي للفريق حول العمليات الرشيقة (Agile).",
        "correct": false
      },
      {
        "text": "مناقشة المشكلة مع راعي المشروع والعودة إلى استخدام النهج التنبؤي فقط.",
        "correct": false
      },
      {
        "text": "الاجتماع مع الفريق لمناقشة المشكلات وتطوير خطة لمعالجتها.",
        "correct": true
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع تقني. خلال اجتماع مراجعة تكرار، يدخل عدد من أصحاب المصلحة الرئيسيين في نقاش محتدم حول قدرات النموذج الأولي.\n\nما الذي يجب على مدير المشروع فعله بعد ذلك؟",
    "explanation": "الإجابة الصحيحة: تحديد مصدر الصراع بين أصحاب المصلحة ومعالجة القضية.\n\n- السبب: الصراع بين أصحاب المصلحة يمكن أن يعرقل تقدم المشروع. من المهم لمدير المشروع فهم جذور المشكلة والتعامل معها مباشرة لتجنب تأثير سلبي على سير العمل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- جلسة العصف الذهني مع الفريق ليست الخطوة الأولى، بل تأتي بعد فهم المشكلة.\n- إعداد قائمة إيجابيات وسلبيات قد يكون مفيدًا لاحقًا لكنه لا يعالج النزاع مباشرة.\n- دعوة راعي المشروع للتدخل هي خطوة لاحقة إذا فشل مدير المشروع في حل النزاع بنفسه.",
    "choices": [
      {
        "text": "تخطيط جلسة عصف ذهني مع فريق المشروع لإيجاد حل للمشكلة.",
        "correct": false
      },
      {
        "text": "تحديد مصدر الصراع بين أصحاب المصلحة ومعالجة القضية.",
        "correct": true
      },
      {
        "text": "إعداد قائمة بالإيجابيات والسلبيات لتحديد تأثير هذا الصراع.",
        "correct": false
      },
      {
        "text": "دعوة راعي المشروع للتدخل والعمل كوسيط بين أصحاب المصلحة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يمتلك مشروع الخصائص التالية:\n\n- طُلب من مدير المشروع تقديم نتيجة أعمال ضمن جدول زمني مضغوط؛ حيث كان الجدول الأصلي شهرًا، وأصبح المطلوب أسبوعين.\n- خلال نشاط تخطيط الموارد، علم مدير المشروع من عضو فريق آخر بعدم توفر أي موارد تقنية، ولكنه يعرف مدير الموارد التقنية من مشروع سابق.\n\nما هو أول إجراء يجب أن يتخذه مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: ضمان أن مالك المنتج على علم بوجود مشكلة في الحصول على مورد تقني.\n\n- السبب: مالك المنتج هو صاحب القرار الأساسي فيما يخص أولويات المشروع والنطاق، لذا يجب إشراكه مبكرًا لاتخاذ قرارات مدروسة بشأن الموارد والجدول الزمني.\n\n- لماذا الخيارات الأخرى خاطئة:\n- ذكر الجدول الزمني والموارد التقنية ليست إجراءات بل معلومات.\n- تصعيد المشكلة أو الاتصال بمورد خارجي قد يكونان خطوات لاحقة بعد اطلاع مالك المنتج.\n- الاجتماع مع مدير الموارد التقنية قد يساعد لكنه ليس الخطوة الأولى، التي هي إشراك مالك المنتج.",
    "choices": [
      {
        "text": "طُلب من مدير المشروع تقديم نتيجة أعمال ضمن جدول زمني مضغوط؛ حيث كان الجدول الأصلي شهرًا، وأصبح المطلوب أسبوعين.",
        "correct": false
      },
      {
        "text": "علم مدير المشروع من عضو فريق آخر بعدم توفر أي موارد تقنية، ولكنه يعرف مدير الموارد التقنية من مشروع سابق.",
        "correct": false
      },
      {
        "text": "ضمان أن مالك المنتج على علم بوجود مشكلة في الحصول على مورد تقني.",
        "correct": true
      },
      {
        "text": "تصعيد مشكلة الموارد التقنية للإدارة العليا.",
        "correct": false
      },
      {
        "text": "التحقق من توفر الموارد من خلال الاجتماع مع مدير الموارد التقنية المعروف سابقًا.",
        "correct": false
      },
      {
        "text": "الاتصال بمورد خارجي للحصول على مورد تقني.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "يمتلك مشروع هجين الخصائص التالية:\n\n- في مراحله المبكرة.\n- لديه فريق جديد تمامًا.\n- سيكون مدير المشروع مشغولًا جدًا في تنفيذ مشاريع أخرى خلال الأسبوعين الأولين من المشروع.\n\nكيف يجب على مدير المشروع تطوير الفريق الجديد خلال هذه المرحلة المبكرة؟",
    "explanation": "الإجابة الصحيحة: في مراحله المبكرة.\n\n- السبب: في المرحلة المبكرة من المشروع، من الأهمية بمكان أن يركز مدير المشروع على تطوير الفريق، خاصة إذا كان الفريق جديدًا تمامًا. هذه المرحلة هي الأفضل لبناء الروح الجماعية وتعزيز التعاون والهيكلة الذاتية للفريق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- ذكر الفريق الجديد فقط لا يحدد متى يجب تطويره.\n- انشغال مدير المشروع لا يمنعه من التركيز على تطوير الفريق بطرق مناسبة أو تفويض.\n- الخيارات المتعلقة بضمان فهم التنظيم الذاتي، التخطيط لفعاليات بناء الفريق، التحديثات اليومية، أو المحادثات الفردية هي خطوات مهمة لكنها تتبع الفهم بأن المرحلة المناسبة هي المبكرة.",
    "choices": [
      {
        "text": "في مراحله المبكرة.",
        "correct": true
      },
      {
        "text": "لديه فريق جديد تمامًا.",
        "correct": false
      },
      {
        "text": "سيكون مدير المشروع مشغولًا جدًا في تنفيذ مشاريع أخرى خلال الأسبوعين الأولين.",
        "correct": false
      },
      {
        "text": "ضمان فهم الفريق لمبادئ التنظيم الذاتي.",
        "correct": false
      },
      {
        "text": "تخطيط واستضافة عدة فعاليات لبناء الفريق لتعزيز التعاون.",
        "correct": false
      },
      {
        "text": "توفير تحديثات يومية لحالة المشروع لإبقاء الفريق على اطلاع.",
        "correct": false
      },
      {
        "text": "التعرف على كل عضو من أعضاء الفريق من خلال محادثات فردية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يشعر جميع أصحاب المصلحة الأربعة الرئيسيين في المشروع بالقلق من أن خطة الإصدار الحالية لن تفي بالاحتياجات العاجلة للأعمال. يحتاج مدير المشروع إلى ضمان أن الفريق سيوفر القيمة المطلوبة ضمن الجداول الزمنية المحددة.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: إشراك أصحاب المصلحة وأعضاء الفريق لتحديد الحد الأدنى من المنتج القابل للتسليم (MVP) اللازم للإطلاق.\n\n- السبب: تحديد الحد الأدنى من المنتج القابل للتسليم يساعد الفريق على التركيز على تقديم القيمة الأهم في الوقت المحدد، مما يلبي احتياجات أصحاب المصلحة العاجلة ويضمن استخدام الموارد بشكل فعّال.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تقييم هيكل تقسيم العمل وإعادة التفاوض قد تؤخر المشروع ولا تضمن القيمة المطلوبة.\n- حساب مؤشر أداء الجدول الزمني وتصعيده لا يحل مشكلة تحديد الأولويات.\n- تعديل خط الأساس للجدول الزمني دون تحديد MVP قد يؤدي إلى فشل في تلبية احتياجات الأعمال الحقيقية.",
    "choices": [
      {
        "text": "تقييم هيكل تقسيم العمل (WBS) وإعادة التفاوض على النطاق مع راعي المشروع.",
        "correct": false
      },
      {
        "text": "إشراك أصحاب المصلحة وأعضاء الفريق لتحديد الحد الأدنى من المنتج القابل للتسليم (MVP) اللازم للإطلاق.",
        "correct": true
      },
      {
        "text": "حساب مؤشر أداء الجدول الزمني (SPI) وتصعيد خطر الجدول الزمني إلى راعي المشروع.",
        "correct": false
      },
      {
        "text": "تعديل خط الأساس للجدول الزمني لتلبية احتياجات أصحاب المصلحة ومتابعة التقدم باستخدام مخطط الحرق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتوي المشروع على الخصائص التالية:\n\n- تم إعداد مراجعات دورية للمشروع.\n- خلال المراجعة الرابعة، طلب العميل تغيير النهج التقني للمنتج قيد التطوير.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: خلال المراجعة الرابعة، طلب العميل تغيير النهج التقني للمنتج قيد التطوير.\n\n- السبب: طلب تغيير جوهري مثل تغيير النهج التقني يحتاج إلى تقييم دقيق من خلال مناقشة مع الفريق وأصحاب المصلحة لضمان توافق التغيير مع أهداف المشروع وجدوله وميزانيته.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إعداد المراجعات الدورية هو أمر مسبق وليس إجراءً على الطلب.\n- إبلاغ الفريق بتنفيذ النهج فورًا قد يؤدي إلى مشاكل دون دراسة التغيير.\n- السماح للفريق باختيار النهج والتحقق لاحقًا بدون إشراك أصحاب المصلحة قد يسبب تعارضات.\n- دراسة النهج مع أصحاب المصلحة أو إجراء مقارنة معيارية يمكن أن تكون خطوات لاحقة بعد الاتفاق على التغيير الأساسي.",
    "choices": [
      {
        "text": "تم إعداد مراجعات دورية للمشروع.",
        "correct": false
      },
      {
        "text": "خلال المراجعة الرابعة، طلب العميل تغيير النهج التقني للمنتج قيد التطوير.",
        "correct": true
      },
      {
        "text": "إبلاغ أعضاء الفريق بتنفيذ النهج الجديد فورًا.",
        "correct": false
      },
      {
        "text": "السماح للفريق باختيار النهج الأنسب والتحقق من النتائج مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دراسة النهج المقترح مع أصحاب المصلحة واختيار ما هو الأنسب للفريق.",
        "correct": false
      },
      {
        "text": "طلب من الفريق إجراء مقارنة معيارية للنهج للحصول على دعم الراعي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال التكرار الرابع لتطوير المنتج، أدرك مدير المشروع أن البرنامج المستخدم لخطة إدارة المشروع لا يسمح بإجراء التحديثات المخطط لها.\n\nما الإجراء الذي يجب أن يتخذه مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: حل المشكلة بشكل مستقل حتى لا يتشتت أعضاء الفريق.\n\n- السبب: مدير المشروع يجب أن يتعامل مع المشكلات التي تؤثر على سير العمل بسرعة وفعالية، خصوصًا إذا كانت المشكلة تقنية أو إدارية داخلية مثل صعوبة تحديث الخطة.\n- هذا يسمح لبقية الفريق بالتركيز على مهامهم دون تشتيت أو تعطيل الإنتاج.\n\n- لماذا الخيارات الأخرى خاطئة:\n- اختيار عضو لتحديث القالب قد لا يحل المشكلة التقنية أو النظامية المتعلقة بالأداة.\n- اختيار أولوية للأنشطة بناءً على القيمة التجارية لا يعالج المشكلة الفنية المحددة.\n- إضافة المشكلة كسجل مخاطر وإجراءات تصحيحية أمر هام لكنه لا يحل المشكلة بشكل فوري.",
    "choices": [
      {
        "text": "اختيار أحد أعضاء الفريق لتحديث قالب خطة إدارة المشروع.",
        "correct": false
      },
      {
        "text": "استنادًا إلى القيمة التجارية للتكرارات القادمة، اختيار أولوية للأنشطة.",
        "correct": false
      },
      {
        "text": "حل المشكلة بشكل مستقل حتى لا يتشتت أعضاء الفريق.",
        "correct": true
      },
      {
        "text": "إضافة المشكلة كمخاطر جديدة في سجل المخاطر واقتراح إجراءات تصحيحية.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة تركز بشكل كبير على استخدام النهج التنبئي في تنفيذ المشاريع بتوظيف مدير مشروع جديد يستخدم النهج الهجين. يحتوي نطاق المشروع على عدد من المتطلبات غير الواضحة.\n\nكيف يجب أن يخطط مدير المشروع لتسليم المشروع؟",
    "explanation": "الإجابة الصحيحة: تفصيل المتطلبات وتحديد أولوياتها إلى حزم عمل تكرارية.\n\n- السبب: في النهج الهجين، يتم التعامل مع المتطلبات غير الواضحة بشكل تدريجي عبر تقسيم العمل إلى أجزاء قابلة للتكرار تُمكن من التكيف مع التغيرات، مما يسمح بالمرونة في التسليم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تصعيد المسألة والانتظار قد يسبب تأخيرات دون ضمان حل.\n- تجاهل المتطلبات غير الواضحة قد يؤدي إلى فشل المشروع في تلبية الاحتياجات.\n- الانتظار حتى تصبح المتطلبات أكثر وضوحًا يعطل بدء العمل ويضر الجدول الزمني.",
    "choices": [
      {
        "text": "تصعيد مسألة المتطلبات غير الواضحة إلى الإدارة والانتظار للحصول على التفويض النهائي.",
        "correct": false
      },
      {
        "text": "تفصيل المتطلبات وتحديد أولوياتها إلى حزم عمل تكرارية.",
        "correct": true
      },
      {
        "text": "تجاهل المتطلبات غير الواضحة والتركيز على خطة تسليم المشروع.",
        "correct": false
      },
      {
        "text": "الانتظار حتى تصبح المتطلبات أكثر وضوحًا قبل اتخاذ أي إجراء إضافي في المشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقود مدير مشروع مبادرة استراتيجية رئيسية تهدف إلى التكيف مع السوق والاستجابة السريعة لاتجاهاته.\n\nما النشاط الذي يجب على مدير المشروع إعطاؤه الأولوية أولاً لضمان النجاح؟",
    "explanation": "الإجابة الصحيحة: مراجعة أهداف المشروع بشكل تعاوني مع الراعي للاتفاق على خطط وتسليمات قابلة للتحقيق.\n\n- السبب: الاتفاق المبكر والواضح مع الراعي على الأهداف والخطط يضمن أن جميع الأطراف على نفس الصفحة، ويساعد على توجيه الفريق والتركيز على الأولويات الحقيقية بما يتوافق مع استراتيجيات السوق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إجراء مراجعات دورية مهمة لكن ليست الأولوية الأولى.\n- طلب تمويل إضافي دون خطة واضحة قد يؤدي إلى استهلاك موارد غير مبرر.\n- إنشاء حالة عمل بعد مراجعة السوق خطوة مهمة ولكنها تلي الاتفاق على الأهداف والخطط الأساسية.",
    "choices": [
      {
        "text": "إجراء مراجعات دورية لخطط المشروع وأهدافه وتسليماته لضمان تسجيل جميع البيانات.",
        "correct": false
      },
      {
        "text": "طلب تمويل إضافي من الراعي لتوظيف موارد ماهرة وتحسين الجودة.",
        "correct": false
      },
      {
        "text": "مراجعة أهداف المشروع بشكل تعاوني مع الراعي للاتفاق على خطط وتسليمات قابلة للتحقيق.",
        "correct": true
      },
      {
        "text": "إنشاء حالة عمل بعد مراجعة السوق لتعديل التسليمات بناءً على الأهداف الجديدة.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تمت الموافقة على طلب تغيير يضيف حافزًا إلى عقد مبلغ إجمالي إذا تمكن المقاول من الحفاظ على الجدول الزمني الحالي لخط الأساس. ما الذي يجب تحديثه الآن؟",
    "explanation": "الإجابة الصحيحة: خط الأساس للتكلفة.\n\n- السبب: إضافة حافز مالي يتعلق بالأداء على الجدول الزمني يؤثر بشكل مباشر على الميزانية والتكلفة الإجمالية، لذا يجب تحديث خط الأساس للتكلفة ليعكس هذا التغيير.\n\n- لماذا الخيارات الأخرى خاطئة:\n- خط الأساس للنطاق لا يتغير فقط بسبب تعديل الحوافز المالية.\n- خطة إدارة المشروع تشمل عناصر أوسع، لكنها لا تمثل خط الأساس المحدد.\n- خط الأساس للجدول الزمني لم يتغير، لأن الحافز مرتبط بالحفاظ على الجدول الحالي وليس بتغييره.",
    "choices": [
      {
        "text": "خط الأساس للنطاق",
        "correct": false
      },
      {
        "text": "خطة إدارة المشروع",
        "correct": false
      },
      {
        "text": "خط الأساس للتكلفة",
        "correct": true
      },
      {
        "text": "خط الأساس للجدول الزمني",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم مؤسسة بتطوير منتج جديد. ما الذي يجب على مدير المشروع الخاص بهذا التطوير فعله أولاً لتحسين نجاح المشروع؟",
    "explanation": "الإجابة الصحيحة: العمل مع راعي المشروع لتحديد رؤية المشروع والمبادرة العامة.\n\n- السبب: تحديد الرؤية والمبادرة هو الأساس لنجاح المشروع، حيث يوجه كافة الخطط والأنشطة المستقبلية ويضمن توافق جميع الأطراف.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تطوير جدول زمني مفصل قبل تحديد الرؤية قد يؤدي إلى خطط غير واقعية أو غير مناسبة.\n- تحليل السوق مهم لكن يأتي بعد تحديد رؤية واضحة للمشروع.\n- اختيار أعضاء الفريق مهم لكنه يتم بعد تحديد الأهداف والرؤية.",
    "choices": [
      {
        "text": "العمل مع مكتب إدارة المشاريع (PMO) لتطوير جدول زمني مفصل للمشروع.",
        "correct": false
      },
      {
        "text": "العمل مع فريق التسويق لإجراء تحليل تأثير لتحديد السوق المستهدف.",
        "correct": false
      },
      {
        "text": "العمل مع راعي المشروع لتحديد رؤية المشروع والمبادرة العامة.",
        "correct": true
      },
      {
        "text": "العمل مع أصحاب المصلحة لتحديد أعضاء الفريق المناسبين للمشروع.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعمل مدير مشروع على مشروع معقد يتضمن العديد من أصحاب المصلحة وأولويات متضاربة. كل صاحب مصلحة يرغب في الحصول على أكبر قدر ممكن من الموارد المتاحة للوظائف المطلوبة.\n\nعلى ماذا يجب أن يركز مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تلبية المصالح المشتركة لجميع أصحاب المصلحة.\n\n- السبب: التركيز على المصالح المشتركة يساعد في تحقيق التوازن بين الأطراف المختلفة وتحقيق أهداف المشروع بشكل عام دون الانحياز لطرف معين.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تلبية المصالح الشخصية قد يؤدي إلى صراعات وتعطيل المشروع.\n- الحفاظ على العلاقات مهم لكنه لا يكون على حساب تحقيق التوازن في توزيع الموارد.\n- دفع أصحاب المصلحة لقبول وجهة نظر المدير بدون مشاركة قد يسبب مقاومة وفشل في التنفيذ.",
    "choices": [
      {
        "text": "تلبية المصالح الشخصية لأصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "تلبية المصالح المشتركة لجميع أصحاب المصلحة.",
        "correct": true
      },
      {
        "text": "الحفاظ على العلاقات والانسجام مع أصحاب المصلحة.",
        "correct": false
      },
      {
        "text": "دفع أصحاب المصلحة لقبول وجهة نظر مدير المشروع.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "بصفتك مدير مشروع في شركة تكنولوجيا، هناك حاجة إلى تغيير في النطاق لتنفيذ تعديل في المشروع. ما الأدوات التي يمكن استخدامها لفهم تأثير التغيير بشكل أفضل؟",
    "explanation": "الإجابة الصحيحة: دورة ديمنغ (PDCA).\n\n- السبب: دورة ديمنغ (Plan-Do-Check-Act) هي أداة لإدارة التغيير والتحسين المستمر تساعد في تقييم تأثير التغييرات وتنفيذها بطريقة منظمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مخطط باريتو يستخدم لتحديد الأسباب الأكثر تأثيرًا، لكنه لا يغطي تنفيذ التغيير بشكل كامل.\n- مخطط هيكل السمكة يستخدم لتحليل أسباب المشاكل ولكنه لا يدير التغيير بحد ذاته.\n- مخطط السبب والأثر هو جزء من التحليل لكنه لا يشمل دورة التنفيذ والمراجعة والتصحيح.",
    "choices": [
      {
        "text": "مخطط باريتو",
        "correct": false
      },
      {
        "text": "مخطط هيكل السمكة",
        "correct": false
      },
      {
        "text": "دورة ديمنغ (PDCA)",
        "correct": true
      },
      {
        "text": "مخطط السبب والأثر",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يتم إنشاء منتج جديد من قبل فريق رشيق (agile)، ولكن لدى الفريق وقت محدود لإكماله. بسبب هذه الظروف، من المهم أن يحافظ الفريق على التعاون طوال مدة المشروع.\n\nلبناء التضامن بين أعضاء الفريق، ما الذي يجب أن يفعله قائد المشروع؟",
    "explanation": "الإجابة الصحيحة: تيسير الاجتماعات مع كل عضو في الفريق لفهم أهداف المشروع.\n\n- السبب: فهم الأهداف الفردية والجماعية يعزز التواصل والالتزام ويقوي التضامن والتعاون بين أعضاء الفريق.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إنشاء بروتوكولات للسبرينت مهم لكنه لا يضمن بناء التضامن الحقيقي.\n- مناقشة تقدم المنتج باستخدام مخطط الحرق أداة مراقبة وليست لبناء التضامن.\n- تحليل خريطة المشروع هو أداة تخطيط وليست موجهة لتعزيز التضامن بين الأعضاء.",
    "choices": [
      {
        "text": "إنشاء بروتوكولات للتعامل مع السبرينت (sprints) خلال اجتماع الفريق.",
        "correct": false
      },
      {
        "text": "تيسير الاجتماعات مع كل عضو في الفريق لفهم أهداف المشروع.",
        "correct": true
      },
      {
        "text": "مناقشة تقدم المنتج مع أعضاء الفريق باستخدام مخطط الحرق (burndown chart).",
        "correct": false
      },
      {
        "text": "تحليل خريطة المشروع لإصدار المنتج مع أعضاء الفريق.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "أعضاء من فريق أجايل يتأخرون باستمرار عن حضور الاجتماعات اليومية ولا يحققون تواريخ الأهداف المحددة للمشروع. يفترض قائد المشروع أن السبب قد يكون صعوبة في إدارة المهام ذاتيًا داخل الفريق.\n\nما الإجراء الذي يجب أن يتخذه قائد المشروع؟",
    "explanation": "الإجابة الصحيحة: مساعدة الفريق على صياغة اتفاقية فيما بينهم تتضمن المعايير السلوكية المرغوبة.\n\n- السبب: الاتفاقيات بين أعضاء الفريق تعزز المسؤولية الذاتية وتحسن إدارة الوقت والسلوك الجماعي، وهو أمر جوهري في بيئة أجايل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- عقد اجتماع لمراجعة المشكلات مهم لكن لا يعالج المشكلة الأساسية في السلوك الذاتي.\n- تولي دور قيادي أعلى قد يقلل من استقلالية الفريق.\n- تنظيم تدريب مفيد لكنه لا يضمن التزام الفريق بالمعايير السلوكية.",
    "choices": [
      {
        "text": "مساعدة الفريق على صياغة اتفاقية فيما بينهم تتضمن المعايير السلوكية المرغوبة.",
        "correct": true
      },
      {
        "text": "عقد اجتماع مع الفريق لمراجعة المشكلات وتفصيل الإجراءات لحلها.",
        "correct": false
      },
      {
        "text": "تولي دور قيادي أعلى وتقديم مثال للسلوك المطلوب.",
        "correct": false
      },
      {
        "text": "تنظيم تدريب للفريق حول أجايل وإدارة الوقت.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يدير مدير مشروع أجايل مشروع تطوير نظام برمجي جديد، وهو الآن في مرحلة اختبار قبول المستخدم. تلقى مدير المشروع ملاحظات إيجابية من معظم أصحاب المصلحة في العمل، لكن مدير تكنولوجيا المعلومات غير راضٍ.\n\nما الذي يجب أن يفعله مدير المشروع أولاً؟",
    "explanation": "الإجابة الصحيحة: جمع ملاحظات مباشرة وصريحة من مدير تكنولوجيا المعلومات.\n\n- السبب: يجب على مدير المشروع فهم قلق مدير تكنولوجيا المعلومات بشكل مباشر لتحديد المشاكل الحقيقية والتعامل معها بفعالية، بدلاً من الافتراض أو البحث في إجراءات سابقة.\n- المناقشة المباشرة تتيح كشف النقاط الحرجة وحلها قبل تفاقم المشكلة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مراجعة حضور مدير تكنولوجيا المعلومات في الاجتماعات السابقة قد لا تكشف أسباب عدم الرضا.\n- تحليل المتطلبات مع مدير تكنولوجيا المعلومات يفترض أن المشكلة تتعلق بالمتطلبات، وهو قد يكون سابق لأوانه.\n- مناقشة مخاوف مدير تكنولوجيا المعلومات مع الفريق دون فهم دقيق قد يسبب سوء تواصل أو نشر قلق غير مبرر.",
    "choices": [
        {
          "text": "مراجعة حضور مدير تكنولوجيا المعلومات في الاجتماعات السابقة للمشروع.",
          "correct": false
        },
        {
          "text": "تحليل المتطلبات التي تم الموافقة عليها للمشروع مع مدير تكنولوجيا المعلومات.",
          "correct": false
        },
        {
          "text": "مناقشة مخاوف مدير تكنولوجيا المعلومات مع فريق المشروع.",
          "correct": false
        },
        {
          "text": "جمع ملاحظات مباشرة وصريحة من مدير تكنولوجيا المعلومات.",
          "correct": true
        }
      ]
    },
    {
    "type": "multiple-choice",
    "text": "خلال مشروع أجايل جديد، ظهرت عوائق تتعلق بالميزانية وإدارة الوقت. قدم فريق ضمان الجودة عن بُعد قائمة طويلة من العيوب بعد إكمال بضع سباقات (sprints). استنتج مدير المشروع أن المشكلات ناتجة عن سوء تفسير لغوي وليس عن جودة المشروع.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: إعداد وتنفيذ جلسات مع الفريق الكامل لمراجعة قائمة المهام المطلوبة ووصفها.\n\n- السبب: سوء الفهم اللغوي يحتاج إلى توضيح وتحسين التواصل بين فرق التطوير وضمان الجودة، لذلك يجب عقد جلسات توضيحية تشرح المهام والمتطلبات بشكل مشترك، مما يقلل من العيوب الناتجة عن سوء الفهم.\n\n- لماذا الخيارات الأخرى خاطئة:\n- عقد اجتماع مع فريق ضمان الجودة للتعبير عن القلق قد يثير التوتر ولا يحل المشكلة.\n- طلب زيادة مالية لتوظيف فريق محلي لا يعالج السبب الحقيقي وهو سوء التواصل.\n- دمج فريق ضمان الجودة في النهاية وليس خلال التكرارات لن يحسن جودة العيوب في الوقت الحقيقي.",
     "choices": [
        {
          "text": "إعداد وتنفيذ جلسات مع الفريق الكامل لمراجعة قائمة المهام المطلوبة ووصفها.",
          "correct": true
        },
        {
          "text": "عقد اجتماع مع فريق ضمان الجودة والتعبير عن القلق بشأن ملاحظاتهم.",
          "correct": false
        },
        {
          "text": "طلب زيادة مالية من مجلس التحكم في التغيير (CCB) لتوظيف فريق ضمان جودة محلي بدلاً من الفريق عن بُعد.",
          "correct": false
        },
        {
          "text": "دمج فريق ضمان الجودة مع فريق التطوير لإجراء الاختبارات في نهاية المشروع.",
          "correct": false
        }
      ]
    },
     {
    "type": "multiple-choice",
    "text": "خلال تنفيذ المشروع، اكتشف فريق المالية أنهم لم يشاركوا في إعداد دراسة الجدوى للمشروع، ورفضوا الموافقة على العائد المتوقع على الاستثمار (ROI). ما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: تحديد اجتماع مع مالك المنتج وفريق المالية للاتفاق على تصحيحات المسار.\n\n- السبب: إشراك فريق المالية ومالك المنتج في مناقشة وتعديل دراسة الجدوى والعائد المتوقع يساعد على معالجة المخاوف بشكل تعاوني ويضمن دعمهم واستمرارية المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الاستمرار في التطوير بدون معالجة المشكلة قد يؤدي إلى فشل المشروع.\n- مراجعة خطة النطاق وتسجيلها كمخاطرة لا تحل المشكلة الجوهرية.\n- مراجعة خطة التواصل فقط قد لا تعالج موضوع مشاركة فريق المالية في القرارات المالية.",
     "choices": [
        {
          "text": "مواصلة التطوير بناءً على خطة إدارة المشروع ومعالجة المشكلة بعد التسليم.",
          "correct": false
        },
        {
          "text": "مراجعة خطة إدارة النطاق وتسجيل ذلك كمخاطرة تؤثر على المشروع بأكمله.",
          "correct": false
        },
        {
          "text": "تحديد اجتماع مع مالك المنتج وفريق المالية للاتفاق على تصحيحات المسار.",
          "correct": true
        },
        {
          "text": "مراجعة خطة إدارة التواصل وإجراء التعديلات اللازمة.",
          "correct": false
        }
      ]
    },
     {
    "type": "multiple-choice",
    "text": "قدّم مالك المنتج قائمة الأعمال للفريق، وأثار الفريق مخاوف بشأن تنفيذ بعض الميزات بسبب العديد من العوائق. ما الذي يجب أن يقترحه مدير المشروع على مالك المنتج؟",
    "explanation": "الإجابة الصحيحة: التأكد من تسجيل العوائق وترتيب أولوياتها بناءً على الميزات ذات القيمة الأعلى.\n\n- السبب: في بيئة أجايل، من المهم تسجيل العوائق بشكل واضح والعمل على ترتيبها حسب الأولوية المرتبطة بالقيمة التي تقدمها الميزة للفريق والعملاء. هذا يساعد في اتخاذ قرارات مدروسة بشأن تسلسل العمل والتعامل مع العوائق الأكثر تأثيراً على القيمة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تقدير التأثير المالي وطلب تمويل إضافي قد يكون ضرورياً لاحقاً، لكنه ليس أول خطوة.\n- تسجيل العوائق وإبلاغ الإدارة فقط بدون ترتيب أولويات يقلل من فاعلية التعامل مع المشكلات.\n- البدء بإزالة العوائق السهلة قد يعزز شعور الإنجاز لكنه قد لا يعالج أولويات القيمة الحيوية.",
     "choices": [
        {
          "text": "تقدير التأثير المالي للعوائق وطلب تمويل إضافي.",
          "correct": false
        },
        {
          "text": "تسجيل العوائق وإبلاغ الإدارة بالحاجة إلى مساعدتهم في حل هذه العوائق.",
          "correct": false
        },
        {
          "text": "التأكد من تسجيل العوائق وترتيب أولوياتها بناءً على الميزات ذات القيمة الأعلى.",
          "correct": true
        },
        {
          "text": "البدء في إزالة العوائق بدءًا من الأسهل لتعزيز شعور الإنجاز لدى الفريق.",
          "correct": false
        }
      ]
    },
    {
    "type": "multiple-choice",
    "text": "قرر مالك المنتج إطلاق المنتج بعد بضع نسخ، مع العلم أن الحد الأدنى القابل للتسويق (MVP) يفتقر إلى بعض الميزات. أحد أصحاب المصلحة الرئيسيين، نائب رئيس التسويق، غير راضٍ عن النتائج وتساءل عن قرار الإطلاق.\n\nما الذي يجب أن يفعله مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: دعم قرار مالك المنتج والعمل على تحسين التوافق مع هذا صاحب المصلحة لتجنب مثل هذه القضايا مستقبلاً.\n\n- السبب: مدير المشروع لا يتخذ قرارات إطلاق المنتج، بل يدعم مالك المنتج الذي هو المسؤول عن قائمة الأعمال وقرارات MVP. تحسين التوافق مع أصحاب المصلحة يعزز التواصل ويقلل النزاعات المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تدريب الفريق على اتخاذ القرار ليس دور مدير المشروع المباشر في هذه الحالة.\n- تحمل المسؤولية عن قرارات الإطلاق يتجاوز صلاحيات مدير المشروع.\n- تصعيد المسألة للراعي بسبب صلاحيات صاحب المصلحة قد يخلق توتراً غير ضروري.",
     "choices": [
        {
          "text": "تدريب الفريق على عملية اتخاذ القرار مع افتراض استراتيجية متحفظة تجاه إطلاق المنتجات.",
          "correct": false
        },
        {
          "text": "دعم قرار مالك المنتج والعمل على تحسين التوافق مع هذا صاحب المصلحة لتجنب مثل هذه القضايا مستقبلاً.",
          "correct": true
        },
        {
          "text": "تحمل المسؤولية عن قرارات الإطلاق واتخاذ القرار النهائي بشأن موعد الإطلاق للعملاء.",
          "correct": false
        },
        {
          "text": "تصعيد المسألة إلى الراعي وطرح تساؤلات حول صلاحيات صاحب المصلحة في اتخاذ قرارات الإطلاق.",
          "correct": false
        }
      ]
    },
     {
    "type": "multiple-choice",
    "text": "تقوم شركة منتجات بتحويل طريقة تطويرها وإطلاقها للمنتجات في السوق. يرى التنفيذيون أن هذه مبادرة عالية المخاطر ويجب أن تنجح.\n\nما الذي يجب أن يفعله مدير المشروع في هذا السيناريو؟",
    "explanation": "الإجابة الصحيحة: اعتماد نهج تدريجي في التنفيذ يقدم أعلى قيمة تجارية في وقت مبكر.\n\n- السبب: في بيئة محفوفة بالمخاطر، من الحكمة استخدام نهج تدريجي (مثل النماذج الرشيقة) لتسليم القيمة بشكل مستمر وتقليل المخاطر بدلاً من المخاطرة بتسليم كبير ومتأخر.\n\n- لماذا الخيارات الأخرى خاطئة:\n- وضع خطة اتصالات مهمة لكن ليست الأولوية الرئيسية لإدارة المخاطر.\n- تطوير خطة سباقات تفصيلية قد يكون جزءاً من التنفيذ لكنه لا يعالج المخاطر بشكل مباشر.\n- إعداد دراسة جدوى ضروري لكنه عادة يكون قبل بدء التنفيذ.",
     "choices": [
        {
          "text": "وضع خطة لإدارة الاتصالات لإبلاغ الموظفين بنموذج العمل الجديد.",
          "correct": false
        },
        {
          "text": "تطوير خطة سباقات تفصيلية بأهداف واضحة.",
          "correct": false
        },
        {
          "text": "اعتماد نهج تدريجي في التنفيذ يقدم أعلى قيمة تجارية في وقت مبكر.",
          "correct": true
        },
        {
          "text": "إعداد دراسة جدوى مع افتراضات للنموذج الجديد.",
          "correct": false
        }
      ]
    },
     {
    "type": "multiple-choice",
    "text": "الفريق جاهز لبدء العمل على مشروع مع عميل كان من الصعب التعامل معه في الماضي لأنه لم يكن قادرًا على وصف ما يريده بدقة. ما النهج الذي يجب أن يتبعه مدير المشروع لإزالة هذا العائق؟",
    "explanation": "الإجابة الصحيحة: العمل مع مالك المنتج لتعريف الحد الأدنى من المنتج القابل للتسويق (MVP).\n\n- السبب: MVP يحدد الحد الأدنى من الوظائف المطلوبة التي تلبي احتياجات العميل الأساسية، مما يقلل من الغموض ويتيح تركيز الجهود على تسليم القيمة بسرعة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تطوير خطة مع مواعيد نهائية مفيد لكنه لا يعالج غموض متطلبات العميل.\n- اتباع نهج توقعي قد يؤدي إلى تأخيرات بسبب الحاجة لقبول رسمي لكل ميزة.\n- تعزيز مهارات التفاوض مهم لكنه لا يحل المشكلة الجوهرية المتعلقة بعدم وضوح المتطلبات.",
    "choices": [
      {
        "text": "تطوير خطة مع مواعيد نهائية ومراقبتها لتقليل وقت إكمال المنتج.",
        "correct": false
      },
      {
        "text": "العمل مع مالك المنتج لتعريف الحد الأدنى من المنتج القابل للتسويق (MVP).",
        "correct": true
      },
      {
        "text": "اتباع نهج توقعي للحصول على قبول رسمي لكل منتج.",
        "correct": false
      },
      {
        "text": "تعزيز مهارات التفاوض والمهارات الشخصية لدى الفريق من خلال التدريب.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تم نقل مدير مشروع إلى قسم جديد وأصبح مسؤولًا عن مشروع قائم في مجال غير مألوف. عند محاولة فهم المخاطر في هذا المشروع الذي يستخدم المنهجية الرشيقة (Agile)، ما الأداة الأساسية التي يجب أن يستخدمها مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: مناقشات تعاونية.\n\n- السبب: في منهجية أجايل، يتم استخدام المناقشات التعاونية بين الفريق وأصحاب المصلحة لاكتشاف المخاطر مبكرًا وفهمها بشكل مشترك.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مقابلة مع راعي المشروع مفيدة لكنها قد لا تغطي جميع المخاطر المحتملة.\n- تقييمات الاحتمالات عادة ما تتم بعد التعرف على المخاطر.\n- ورش عمل لتفادي المخاطر مهمة لكنها تعتمد على وجود فهم مبدئي للمخاطر.",
    "choices": [
      {
        "text": "مقابلة مع راعي المشروع.",
        "correct": false
      },
      {
        "text": "مناقشات تعاونية.",
        "correct": true
      },
      {
        "text": "تقييمات الاحتمالات.",
        "correct": false
      },
      {
        "text": "ورش عمل لتفادي المخاطر.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقترب مواعيد تسليم نتائج المشروع، ولكن أداء أحد أعضاء الفريق يؤثر سلبًا على الجدول الزمني. ما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: توجيه عضو الفريق ومساعدته.\n\n- السبب: دعم أعضاء الفريق وتحسين أدائهم من خلال التوجيه يُعد الحل الأنسب للحفاظ على الجدول الزمني وتحسين الإنتاجية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- تعيين مورد أكثر مهارة قد لا يكون متاحًا بسرعة أو قد يؤثر على الديناميكية الحالية للفريق.\n- إزالة عضو الفريق قد تؤدي إلى تراجع في المعنويات ومشاكل أخرى.\n- طلب تدريب من مدير الموظف قد يكون بطيئًا ولا يعالج المشكلة بشكل فوري.",
    "choices": [
      {
        "text": "تعيين مورد أكثر مهارة.",
        "correct": false
      },
      {
        "text": "إزالة عضو الفريق من المشروع.",
        "correct": false
      },
      {
        "text": "توجيه عضو الفريق ومساعدته.",
        "correct": true
      },
      {
        "text": "طلب من مدير الموظف تقديم تدريب له.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "مدير مشروع يدير مشروعًا لا تزال المتطلبات فيه غير معروفة تمامًا ويوجد مستوى عالٍ من عدم اليقين. ما هي المنهجية التي يجب استخدامها لهذا المشروع؟",
    "explanation": "الإجابة الصحيحة: المنهجية الرشيقة (Agile).\n\n- السبب: المنهجية الرشيقة مناسبة للمشاريع التي تحتوي على متطلبات غير واضحة أو متغيرة، حيث تتيح تكرار العمل وتعديل النتائج بشكل مستمر مع تقليل المخاطر.\n\n- لماذا الخيارات الأخرى خاطئة:\n- المنهجية الهجينة تجمع بين التنبؤية والرشيقة لكنها أقل مرونة في حالات عدم اليقين العالي.\n- المنهجية التنبؤية تعتمد على متطلبات ثابتة وواضحة، غير مناسبة للحالات ذات عدم اليقين.\n- منهجية الشلال تعتمد على مراحل متتالية صارمة وتناسب المشاريع ذات المتطلبات الثابتة.",
    "choices": [
      {
        "text": "المنهجية الرشيقة (Agile)",
        "correct": true
      },
      {
        "text": "المنهجية الهجينة (Hybrid)",
        "correct": false
      },
      {
        "text": "المنهجية التنبؤية (Predictive)",
        "correct": false
      },
      {
        "text": "منهجية الشلال (Waterfall)",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "تقوم شركة بدخول سوق جديد ولكن ليس لديها خبرة سابقة في هذا المجال. مدير المشروع يواجه صعوبة في تصور متطلبات المشروع.\n\nما الذي يجب أن يفعله مدير المشروع بعد ذلك؟",
    "explanation": "الإجابة الصحيحة: البحث عن مدخلات محتملة من العملاء.\n\n- السبب: الحصول على مدخلات العملاء يساعد في فهم متطلبات السوق والمنتج بشكل أفضل، خاصة عندما تكون الخبرة داخل الشركة محدودة.\n\n- لماذا الخيارات الأخرى خاطئة:\n- الرجوع إلى ميثاق المشروع مهم لكنه لا يعالج غموض المتطلبات بشكل مباشر.\n- إعادة تقييم أهداف المشروع التجاري قد تكون مفيدة لكن بدون معلومات السوق تكون غير كافية.\n- إجراء دراسة جدوى قد يتم لاحقًا بعد الحصول على مدخلات العملاء.",
    "choices": [
      {
        "text": "الرجوع إلى ميثاق المشروع.",
        "correct": false
      },
      {
        "text": "إعادة تقييم أهداف المشروع التجاري.",
        "correct": false
      },
      {
        "text": "البحث عن مدخلات محتملة من العملاء.",
        "correct": true
      },
      {
        "text": "إجراء دراسة جدوى.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يعتمد المشروع على موثوقية أحد المكونات. يقترح مدير المشروع تصميم التكرار في النظام لتقليل تأثير فشل هذا المكون على نجاح المشروع.\n\nما نوع استراتيجية الاستجابة للمخاطر التي يُظهرها مدير المشروع؟",
    "explanation": "الإجابة الصحيحة: التخفيف.\n\n- السبب: التخفيف تعني اتخاذ إجراءات تقلل من احتمال حدوث المخاطر أو تأثيرها، وفي هذا السياق، تكرار المكون يقلل من أثر الفشل.\n\n- لماذا الخيارات الأخرى خاطئة:\n- النقل يعني نقل المخاطر لطرف آخر، وهذا ليس الحال هنا.\n- القبول يعني قبول المخاطر كما هي بدون تغيير.\n- التجنب يعني تغيير خطة المشروع لتجنب المخاطر، وليس تقليل أثرها.",
    "choices": [
      {
        "text": "النقل.",
        "correct": false
      },
      {
        "text": "التخفيف.",
        "correct": true
      },
      {
        "text": "القبول.",
        "correct": false
      },
      {
        "text": "التجنب.",
        "correct": false
      }
    ]
  },
   {
    "type": "multiple-choice",
    "text": "شركة تقوم بتصنيع معدات قياسية للبلديات وتحتاج إلى ضمان الاتساق في المهام التي يتم تنفيذها بانتظام أثناء تجميع المنتج.\n\nما الذي يجب على مدير المشروع تطويره لتحقيق ذلك؟",
    "explanation": "الإجابة الصحيحة: قوائم فحص الجودة.\n\n- السبب: قوائم الفحص تساعد في ضمان أن كل خطوة من خطوات العمل تُنجز بشكل متسق ومتوافق مع المعايير المطلوبة، مما يقلل من الأخطاء ويوحد الإجراءات.\n\n- لماذا الخيارات الأخرى خاطئة:\n- عملية تقدير موارد النشاط تركز على تحديد الموارد المطلوبة وليس ضمان الاتساق في التنفيذ.\n- إرشادات التصميم من أجل الجودة (DfX) تتعلق بتصميم المنتج نفسه وليس إجراءات التجميع.\n- مقابلات مع خبراء المجال مفيدة للحصول على معلومات لكنها لا تضمن تنفيذ المهام بشكل متسق.",
    "choices": [
      {
        "text": "عملية تقدير موارد النشاط.",
        "correct": false
      },
      {
        "text": "إرشادات التصميم من أجل الجودة (DfX).",
        "correct": false
      },
      {
        "text": "قوائم فحص الجودة.",
        "correct": true
      },
      {
        "text": "مقابلات مع خبراء المجال.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يقوم مدير مشروع بإعداد ميثاق مشروع لتطوير برنامج، والذي سيتم فيه الاستعانة بمصادر خارجية لتقييم 33٪ من واجهة المستخدم (UI). يحتاج مدير المشروع إلى مطوري البرامج لتحديد الأجزاء من واجهة المستخدم التي يمكن لطرف ثالث تقييمها. ومع ذلك، يعتقد مدير قسم البرمجيات أن المشروع سيؤدي إلى تقليص الموظفين في قسم تطوير البرمجيات ويرفض التعاون.\n\nما الذي يجب على مدير المشروع فعله أولاً؟",
    "explanation": "الإجابة الصحيحة: الاجتماع مع المدير الوظيفي لمراجعة بيان العمل (SOW).\n\n- السبب: الاجتماع مع المدير الوظيفي لفهم مخاوفه ومراجعة نطاق العمل يساعد في توضيح التوقعات ويهيئ بيئة تعاونية، مما يسهل التعاون لاحقًا.\n\n- لماذا الخيارات الأخرى خاطئة:\n- طلب شرح المبررات من راعي المشروع قد يكون مفيدًا لاحقًا لكنه لا يعالج المقاومة بشكل مباشر.\n- تقديم تحليل التكلفة/الفائدة مهم لكنه ليس الخطوة الأولى في حل الرفض.\n- شرح هدف التقييم للمدير الوظيفي قد يكون غير كافٍ إذا لم يتم التعامل مع مخاوفه الأساسية أولاً.",
    "choices": [
      {
        "text": "الاجتماع مع المدير الوظيفي لمراجعة بيان العمل (SOW).",
        "correct": true
      },
      {
        "text": "طلب من راعي المشروع شرح مبررات التقييم من طرف ثالث للمدير الوظيفي.",
        "correct": false
      },
      {
        "text": "تقديم تحليل التكلفة/الفائدة لتقييم الطرف الثالث للمدير الوظيفي.",
        "correct": false
      },
      {
        "text": "شرح هدف تقييم واجهة المستخدم للمدير الوظيفي.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "خلال اجتماع انطلاق لمشروع حيوي، دخل ثلاثة أصحاب مصلحة لديهم وجهات نظر واهتمامات مختلفة في جدال حاد حول أهداف المشروع.\n\nكيف يجب على مدير المشروع التعامل مع هذا الوضع؟",
    "explanation": "الإجابة الصحيحة: تيسير مناقشة منظمة لفهم وجهة نظر كل صاحب مصلحة وإيجاد أرضية مشتركة.\n\n- السبب: في مواجهة خلافات بين أصحاب المصلحة، من المهم أن يقوم مدير المشروع بدور الوسيط الذي يساعد في توضيح وجهات النظر المختلفة، مما يتيح إيجاد توافق وموافقة مشتركة تعزز نجاح المشروع.\n\n- لماذا الخيارات الأخرى خاطئة:\n- مقاطعة الجدال بالقوة قد تزيد التوتر وتؤدي إلى مزيد من المقاومة.\n- إنهاء الاجتماع مبكرًا بدون معالجة المشكلة قد يؤدي إلى تفاقم النزاع لاحقًا.\n- تجاهل الجدال والمضي قدماً قد يترك المشاكل قائمة ويؤثر سلباً على تماسك الفريق.",
    "choices": [
      {
        "text": "مقاطعة الجدال والتأكيد بقوة على سلطته للحفاظ على النظام والتحكم في الاجتماع.",
        "correct": false
      },
      {
        "text": "تيسير مناقشة منظمة لفهم وجهة نظر كل صاحب مصلحة وإيجاد أرضية مشتركة.",
        "correct": true
      },
      {
        "text": "إنهاء الاجتماع مبكرًا للسماح لأصحاب المصلحة بتهدئة أعصابهم وإعادة جدولته لاحقًا.",
        "correct": false
      },
      {
        "text": "تجاهل الجدال والمضي قدمًا في جدول أعمال الاجتماع كما هو مخطط له، ومعالجة النزاع لاحقًا.",
        "correct": false
      }
    ]
  },
  {
    "type": "multiple-choice",
    "text": "يحتاج مدير المشروع إلى إغلاق مشروع رسميًا، لكن أحد الموردين يقول إن فاتورة تم دفعها مرتين. يعرف مدير المشروع أن الفاتورة تمت الموافقة عليها، لكنه لا يستطيع العثور على دليل على الدفع المزدوج. يحتاج مدير المشروع إلى إغلاق هذا المشروع من أجل بدء مشروع جديد.\n\nما الذي يجب على مدير المشروع فعله؟",
    "explanation": "الإجابة الصحيحة: تأجيل إغلاق المشروع حتى تتمكن إدارة الحسابات الدائنة من توثيق أن الفاتورة تم دفعها بشكل صحيح.\n\n- السبب: من الضروري التأكد من حل قضايا الفواتير المالية بدقة قبل إغلاق المشروع، لتجنب المشكلات القانونية والمالية التي قد تؤثر على الشركة والمشاريع المستقبلية.\n\n- لماذا الخيارات الأخرى خاطئة:\n- إبلاغ المورد بالدفع مرة واحدة والبدء بإغلاق المشروع دون إثبات قد يؤدي إلى نزاع مالي لاحق.\n- إكمال الوثائق وتأجيل العمل على المشروع الجديد غير عملي وقد يؤخر المشاريع المستقبلية بدون حل المشكلة.\n- بدء مشروع جديد قبل إغلاق الحالي بدون حل المشاكل المالية قد يسبب تعقيدات إدارية.",
    "choices": [
      {
        "text": "إبلاغ المورد بأنه تم الدفع مرة واحدة فقط، والبدء في عملية إغلاق المشروع، والبدء في العمل على المشروع الجديد.",
        "correct": false
      },
      {
        "text": "تأجيل إغلاق المشروع حتى تتمكن إدارة الحسابات الدائنة من توثيق أن الفاتورة تم دفعها بشكل صحيح.",
        "correct": true
      },
      {
        "text": "إكمال جميع وثائق المشروع النهائية، وتأجيل العمل على المشروع الجديد، وتحديث الوثائق بعد التحقق من الدفع.",
        "correct": false
      },
      {
        "text": "الاجتماع مع راعي المشروع الحالي للحصول على الموافقة لبدء المشروع الجديد قبل إغلاق المشروع الحالي.",
        "correct": false
      }
    ]
  }
]
}
